; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/stmmac_platform.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/stmmac_platform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dev_pm_ops = type { i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)* }
%struct.device = type { %struct.kobject, %struct.device*, %struct.device_private*, i8*, %struct.device_type*, %struct.bus_type*, %struct.device_driver*, i8*, i8*, %struct.mutex, %struct.dev_links_info, %struct.dev_pm_info, %struct.dev_pm_domain*, %struct.irq_domain*, %struct.list_head, %struct.dma_map_ops*, i64*, i64, i64, %struct.bus_dma_region*, %struct.device_dma_parameters*, %struct.list_head, %struct.dev_archdata, %struct.device_node*, %struct.fwnode_handle*, i32, i32, %struct.spinlock, %struct.list_head, %struct.class*, %struct.attribute_group**, void (%struct.device*)*, %struct.iommu_group*, %struct.dev_iommu*, i8 }

!247 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!248 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!249 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!250 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !239, line: 602, baseType: !7, size: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258}
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!257 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!258 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !239, line: 615, baseType: !7, size: 32, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !239, line: 626, baseType: !7, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270, !271}
!267 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!270 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!271 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !239, line: 638, baseType: !7, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !239, line: 647, baseType: !7, size: 32, elements: !277)
!277 = !{!278, !279}
!278 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !281, line: 54, baseType: !7, size: 32, elements: !282)
!281 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!282 = !{!283, !284, !285, !286}
!283 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !61, line: 423, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292}
!289 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !294, file: !61, line: 2085, baseType: !7, size: 32, elements: !7416)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !61, line: 1858, size: 15808, elements: !295)
!295 = !{!296, !301, !324, !341, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !358, !366, !367, !368, !369, !370, !371, !372, !373, !374, !400, !410, !411, !412, !417, !418, !422, !425, !5835, !6351, !6355, !6395, !6396, !6397, !6398, !6399, !6400, !6401, !6402, !6403, !6404, !6405, !6406, !6407, !6408, !6409, !6410, !6411, !6412, !6413, !6414, !6415, !6416, !6417, !6418, !6419, !6420, !6421, !6426, !6427, !6428, !6429, !6430, !6431, !6432, !6435, !6438, !6441, !6444, !6447, !6448, !6461, !6462, !6463, !6464, !6465, !6466, !6473, !6474, !6508, !6509, !6510, !6511, !6512, !6513, !6514, !6515, !6516, !6519, !6520, !6521, !6522, !6523, !6524, !6525, !6526, !6527, !6532, !6533, !6534, !6539, !6576, !7059, !7061, !7062, !7066, !7067, !7068, !7069, !7075, !7077, !7394, !7395, !7397, !7398, !7399, !7400, !7401, !7405, !7408}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !61, line: 1859, baseType: !297, size: 128)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 128, elements: !299)
!298 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!299 = !{!300}
!300 = !DISubrange(count: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !294, file: !61, line: 1860, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !61, line: 938, size: 384, elements: !304)
!304 = !{!305, !313, !319, !321}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !303, file: !61, line: 939, baseType: !306, size: 128)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !307, line: 186, size: 128, elements: !308)
!307 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!308 = !{!309, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !307, line: 187, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !306, file: !307, line: 187, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !61, line: 940, baseType: !314, size: 128, offset: 128)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !307, line: 178, size: 128, elements: !315)
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !307, line: 179, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !314, file: !307, line: 179, baseType: !317, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !303, file: !61, line: 941, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !61, line: 942, baseType: !322, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !294, file: !61, line: 1861, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !61, line: 930, size: 128, elements: !327)
!327 = !{!328, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !326, file: !61, line: 931, baseType: !329, size: 128, align: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !307, line: 216, size: 128, align: 64, elements: !330)
!330 = !{!331, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !307, line: 217, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !329, file: !307, line: 218, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !332}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !326, file: !61, line: 932, baseType: !338, offset: 128)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: -1)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !294, file: !61, line: 1866, baseType: !342, size: 64, offset: 256)
!342 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !294, file: !61, line: 1867, baseType: !342, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !294, file: !61, line: 1868, baseType: !342, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !294, file: !61, line: 1869, baseType: !62, size: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !294, file: !61, line: 1877, baseType: !342, size: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !294, file: !61, line: 1879, baseType: !314, size: 128, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !294, file: !61, line: 1880, baseType: !314, size: 128, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !294, file: !61, line: 1881, baseType: !314, size: 128, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !294, file: !61, line: 1882, baseType: !314, size: 128, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !294, file: !61, line: 1883, baseType: !314, size: 128, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !294, file: !61, line: 1884, baseType: !314, size: 128, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !294, file: !61, line: 1889, baseType: !354, size: 256, offset: 1344)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !294, file: !61, line: 1886, size: 256, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !354, file: !61, line: 1887, baseType: !314, size: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !354, file: !61, line: 1888, baseType: !314, size: 128, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !294, file: !61, line: 1891, baseType: !359, size: 64, offset: 1600)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !360, line: 12, baseType: !361)
!360 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !362, line: 23, baseType: !363)
!362 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !364, line: 31, baseType: !365)
!364 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!365 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !294, file: !61, line: 1892, baseType: !359, size: 64, offset: 1664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !294, file: !61, line: 1893, baseType: !359, size: 64, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !294, file: !61, line: 1894, baseType: !359, size: 64, offset: 1792)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !294, file: !61, line: 1895, baseType: !359, size: 64, offset: 1856)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !294, file: !61, line: 1896, baseType: !359, size: 64, offset: 1920)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !294, file: !61, line: 1897, baseType: !359, size: 64, offset: 1984)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !294, file: !61, line: 1899, baseType: !62, size: 32, offset: 2048)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !294, file: !61, line: 1900, baseType: !62, size: 32, offset: 2080)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !294, file: !61, line: 1902, baseType: !375, size: 1472, offset: 2112)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !61, line: 169, size: 1472, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !375, file: !61, line: 170, baseType: !342, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !375, file: !61, line: 171, baseType: !342, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !375, file: !61, line: 172, baseType: !342, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !375, file: !61, line: 173, baseType: !342, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !375, file: !61, line: 174, baseType: !342, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !375, file: !61, line: 175, baseType: !342, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !375, file: !61, line: 176, baseType: !342, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !375, file: !61, line: 177, baseType: !342, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !375, file: !61, line: 178, baseType: !342, size: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !375, file: !61, line: 179, baseType: !342, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !375, file: !61, line: 180, baseType: !342, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !375, file: !61, line: 181, baseType: !342, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !375, file: !61, line: 182, baseType: !342, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !375, file: !61, line: 183, baseType: !342, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !375, file: !61, line: 184, baseType: !342, size: 64, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !375, file: !61, line: 185, baseType: !342, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !375, file: !61, line: 186, baseType: !342, size: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !375, file: !61, line: 187, baseType: !342, size: 64, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !375, file: !61, line: 188, baseType: !342, size: 64, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !375, file: !61, line: 189, baseType: !342, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !375, file: !61, line: 190, baseType: !342, size: 64, offset: 1280)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !375, file: !61, line: 191, baseType: !342, size: 64, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !375, file: !61, line: 192, baseType: !342, size: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !294, file: !61, line: 1904, baseType: !401, size: 64, offset: 3584)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !402, line: 13, baseType: !403)
!402 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !307, line: 175, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 173, size: 64, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !404, file: !307, line: 174, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !362, line: 22, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !364, line: 30, baseType: !409)
!409 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !294, file: !61, line: 1905, baseType: !401, size: 64, offset: 3648)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !294, file: !61, line: 1906, baseType: !401, size: 64, offset: 3712)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !294, file: !61, line: 1909, baseType: !413, size: 32, offset: 3776)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !307, line: 168, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 166, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !414, file: !307, line: 167, baseType: !62, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !294, file: !61, line: 1910, baseType: !413, size: 32, offset: 3808)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !294, file: !61, line: 1913, baseType: !419, size: 64, offset: 3840)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !61, line: 1913, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !294, file: !61, line: 1914, baseType: !423, size: 64, offset: 3904)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !61, line: 1914, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !294, file: !61, line: 1916, baseType: !426, size: 64, offset: 3968)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !61, line: 1283, size: 4416, elements: !429)
!429 = !{!430, !434, !438, !439, !440, !603, !607, !612, !616, !617, !622, !623, !746, !751, !755, !761, !765, !797, !805, !809, !814, !818, !819, !825, !829, !833, !837, !838, !860, !864, !879, !890, !894, !903, !907, !908, !912, !933, !937, !941, !945, !949, !956, !960, !978, !982, !1032, !1036, !1041, !1045, !1049, !1053, !1063, !1064, !1073, !1079, !1080, !1084, !1088, !1092, !1096, !1097, !1101, !1102, !5795, !5815, !5819, !5825, !5831}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !428, file: !61, line: 1284, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!62, !320}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !428, file: !61, line: 1285, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !320}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !428, file: !61, line: 1286, baseType: !431, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !428, file: !61, line: 1287, baseType: !431, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !428, file: !61, line: 1288, baseType: !441, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !445, !320}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !61, line: 120, baseType: !60)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !447, line: 713, size: 1600, elements: !448)
!447 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!448 = !{!449, !471, !479, !486, !490, !502, !503, !504, !507, !508, !509, !515, !516, !517, !518, !519, !520, !521, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !561, !562, !563, !564, !566, !567, !572, !577, !582, !583, !584, !585, !586, !587, !588, !589, !590, !592, !593, !595, !596, !597}
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 714, baseType: !450, size: 192)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 714, size: 192, elements: !451)
!451 = !{!452, !462, !470}
!452 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !447, line: 715, baseType: !453, size: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !447, line: 715, size: 192, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !447, line: 717, baseType: !445, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !447, line: 718, baseType: !445, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !447, line: 720, baseType: !458, size: 64, offset: 128)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !447, line: 720, size: 64, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !458, file: !447, line: 721, baseType: !320, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !458, file: !447, line: 726, baseType: !342, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !450, file: !447, line: 729, baseType: !463, size: 192, align: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !464, line: 24, size: 192, align: 64, elements: !465)
!464 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!465 = !{!466, !467, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !463, file: !464, line: 25, baseType: !342, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !463, file: !464, line: 26, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !463, file: !464, line: 27, baseType: !468, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !450, file: !447, line: 730, baseType: !314, size: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 733, baseType: !472, size: 64, offset: 192)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 733, size: 64, elements: !473)
!473 = !{!474, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !472, file: !447, line: 734, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !477, line: 19, flags: DIFlagFwdDecl)
!477 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !472, file: !447, line: 735, baseType: !62, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 738, baseType: !480, size: 64, offset: 256)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 738, size: 64, elements: !481)
!481 = !{!482, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !480, file: !447, line: 739, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !484, line: 29, baseType: !407)
!484 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!485 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !480, file: !447, line: 740, baseType: !361, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !446, file: !447, line: 748, baseType: !487, size: 384, align: 64, offset: 320)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 384, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 48)
!490 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 750, baseType: !491, size: 128, offset: 704)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 750, size: 128, elements: !492)
!492 = !{!493, !501}
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !491, file: !447, line: 751, baseType: !494, size: 128)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !491, file: !447, line: 751, size: 128, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !494, file: !447, line: 752, baseType: !342, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !494, file: !447, line: 753, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !445}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !491, file: !447, line: 755, baseType: !314, size: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !446, file: !447, line: 761, baseType: !7, size: 32, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !446, file: !447, line: 762, baseType: !7, size: 32, offset: 864)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !446, file: !447, line: 763, baseType: !505, size: 16, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !364, line: 24, baseType: !506)
!506 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !446, file: !447, line: 764, baseType: !505, size: 16, offset: 912)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !446, file: !447, line: 769, baseType: !505, size: 16, offset: 928)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !446, file: !447, line: 780, baseType: !510, offset: 944)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, elements: !513)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !364, line: 21, baseType: !512)
!512 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!513 = !{!514}
!514 = !DISubrange(count: 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !446, file: !447, line: 782, baseType: !511, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !446, file: !447, line: 783, baseType: !511, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !446, file: !447, line: 784, baseType: !511, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !446, file: !447, line: 785, baseType: !511, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !446, file: !447, line: 786, baseType: !511, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !446, file: !447, line: 787, baseType: !511, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !446, file: !447, line: 795, baseType: !522, offset: 960)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, elements: !513)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !364, line: 27, baseType: !7)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !446, file: !447, line: 807, baseType: !510, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !446, file: !447, line: 809, baseType: !511, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !446, file: !447, line: 810, baseType: !511, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !446, file: !447, line: 811, baseType: !511, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !446, file: !447, line: 812, baseType: !511, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !446, file: !447, line: 813, baseType: !511, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !446, file: !447, line: 815, baseType: !511, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !446, file: !447, line: 816, baseType: !511, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !446, file: !447, line: 817, baseType: !511, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !446, file: !447, line: 818, baseType: !511, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !446, file: !447, line: 819, baseType: !511, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !446, file: !447, line: 821, baseType: !511, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !446, file: !447, line: 822, baseType: !511, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !446, file: !447, line: 823, baseType: !511, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !446, file: !447, line: 832, baseType: !510, offset: 976)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !446, file: !447, line: 834, baseType: !511, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !446, file: !447, line: 835, baseType: !511, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !446, file: !447, line: 836, baseType: !511, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !446, file: !447, line: 837, baseType: !511, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !446, file: !447, line: 838, baseType: !511, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !446, file: !447, line: 840, baseType: !511, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !446, file: !447, line: 843, baseType: !511, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !446, file: !447, line: 844, baseType: !511, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !446, file: !447, line: 845, baseType: !511, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !446, file: !447, line: 847, baseType: !511, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !446, file: !447, line: 848, baseType: !511, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 866, baseType: !551, size: 32, offset: 992)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 866, size: 32, elements: !552)
!552 = !{!553, !556}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !551, file: !447, line: 867, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !555, line: 37, baseType: !523)
!555 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!556 = !DIDerivedType(tag: DW_TAG_member, scope: !551, file: !447, line: 868, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !447, line: 868, size: 32, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !557, file: !447, line: 869, baseType: !505, size: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !557, file: !447, line: 870, baseType: !505, size: 16, offset: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !446, file: !447, line: 873, baseType: !523, size: 32, offset: 1024)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !446, file: !447, line: 874, baseType: !62, size: 32, offset: 1056)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !446, file: !447, line: 875, baseType: !523, size: 32, offset: 1088)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !446, file: !447, line: 876, baseType: !565, size: 16, offset: 1120)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !555, line: 30, baseType: !505)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !446, file: !447, line: 877, baseType: !505, size: 16, offset: 1136)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 879, baseType: !568, size: 32, offset: 1152)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 879, size: 32, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !568, file: !447, line: 880, baseType: !7, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !568, file: !447, line: 881, baseType: !7, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 888, baseType: !573, size: 32, offset: 1184)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 888, size: 32, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !573, file: !447, line: 889, baseType: !523, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !573, file: !447, line: 890, baseType: !523, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !447, line: 893, baseType: !578, size: 16, offset: 1216)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !447, line: 893, size: 16, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !578, file: !447, line: 894, baseType: !565, size: 16)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !578, file: !447, line: 895, baseType: !511, size: 8)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !446, file: !447, line: 898, baseType: !505, size: 16, offset: 1232)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !446, file: !447, line: 899, baseType: !505, size: 16, offset: 1248)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !446, file: !447, line: 900, baseType: !505, size: 16, offset: 1264)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !446, file: !447, line: 902, baseType: !565, size: 16, offset: 1280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !446, file: !447, line: 903, baseType: !505, size: 16, offset: 1296)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !446, file: !447, line: 904, baseType: !505, size: 16, offset: 1312)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !446, file: !447, line: 905, baseType: !505, size: 16, offset: 1328)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !446, file: !447, line: 908, baseType: !522, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !446, file: !447, line: 912, baseType: !591, size: 32, offset: 1344)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !447, line: 606, baseType: !7)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !446, file: !447, line: 913, baseType: !591, size: 32, offset: 1376)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !446, file: !447, line: 914, baseType: !594, size: 64, offset: 1408)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !446, file: !447, line: 915, baseType: !594, size: 64, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !446, file: !447, line: 916, baseType: !7, size: 32, offset: 1536)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !446, file: !447, line: 917, baseType: !598, size: 32, offset: 1568)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !599, line: 113, baseType: !600)
!599 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !599, line: 111, size: 32, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !600, file: !599, line: 112, baseType: !413, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !428, file: !61, line: 1290, baseType: !604, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!359, !445, !320, !359}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !428, file: !61, line: 1293, baseType: !608, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!611, !320, !445, !320}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !362, line: 19, baseType: !505)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !428, file: !61, line: 1296, baseType: !613, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !320, !62}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !428, file: !61, line: 1298, baseType: !435, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !428, file: !61, line: 1299, baseType: !618, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!62, !320, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !428, file: !61, line: 1301, baseType: !431, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !428, file: !61, line: 1302, baseType: !624, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!62, !320, !627, !62}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !629, line: 234, size: 320, elements: !630)
!629 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!630 = !{!631, !635}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !628, file: !629, line: 239, baseType: !632, size: 128)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !629, line: 236, size: 128, elements: !633)
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !632, file: !629, line: 238, baseType: !297, size: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !628, file: !629, line: 255, baseType: !636, size: 192, offset: 128)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !629, line: 241, size: 192, elements: !637)
!637 = !{!638, !650, !651, !652, !653, !654, !656, !657, !658, !667, !668, !669, !670}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !636, file: !629, line: 242, baseType: !639, size: 128)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !640, line: 32, size: 128, elements: !641)
!640 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!641 = !{!642, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !639, file: !640, line: 33, baseType: !643, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !640, line: 26, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !645, line: 10, baseType: !506)
!645 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !639, file: !640, line: 34, baseType: !647, size: 112, offset: 16)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 112, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 14)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !636, file: !629, line: 243, baseType: !639, size: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !636, file: !629, line: 244, baseType: !639, size: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !636, file: !629, line: 245, baseType: !639, size: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !636, file: !629, line: 246, baseType: !639, size: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !636, file: !629, line: 247, baseType: !655, size: 16)
!655 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !636, file: !629, line: 248, baseType: !62, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !636, file: !629, line: 249, baseType: !62, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !636, file: !629, line: 250, baseType: !659, size: 192)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !629, line: 196, size: 192, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !659, file: !629, line: 197, baseType: !342, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !659, file: !629, line: 198, baseType: !342, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !659, file: !629, line: 199, baseType: !506, size: 16, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !659, file: !629, line: 200, baseType: !512, size: 8, offset: 144)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !659, file: !629, line: 201, baseType: !512, size: 8, offset: 152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !659, file: !629, line: 202, baseType: !512, size: 8, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !636, file: !629, line: 251, baseType: !297, size: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !636, file: !629, line: 252, baseType: !297, size: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !636, file: !629, line: 253, baseType: !621, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !636, file: !629, line: 254, baseType: !671, size: 128)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !629, line: 207, size: 128, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !629, line: 208, baseType: !7, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !671, file: !629, line: 209, baseType: !7, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !671, file: !629, line: 222, baseType: !676, size: 64, offset: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !671, file: !629, line: 210, size: 64, elements: !677)
!677 = !{!678, !686, !693, !705, !711, !718, !729, !737}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !676, file: !629, line: 212, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !681, line: 56, baseType: !682)
!681 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 53, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !682, file: !681, line: 54, baseType: !506, size: 16)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !682, file: !681, line: 55, baseType: !506, size: 16, offset: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !676, file: !629, line: 213, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !681, line: 80, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 77, size: 64, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !689, file: !681, line: 78, baseType: !7, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !689, file: !681, line: 79, baseType: !7, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !676, file: !629, line: 214, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !681, line: 66, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 58, size: 192, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !696, file: !681, line: 59, baseType: !7, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !696, file: !681, line: 60, baseType: !7, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !696, file: !681, line: 61, baseType: !7, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !696, file: !681, line: 62, baseType: !7, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !696, file: !681, line: 63, baseType: !7, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !696, file: !681, line: 64, baseType: !506, size: 16, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !696, file: !681, line: 65, baseType: !506, size: 16, offset: 176)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !676, file: !629, line: 215, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !681, line: 70, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 68, size: 32, elements: !709)
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !708, file: !681, line: 69, baseType: !7, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !676, file: !629, line: 216, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !681, line: 75, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 72, size: 160, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !714, file: !681, line: 73, baseType: !7, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !714, file: !681, line: 74, baseType: !297, size: 128, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !676, file: !629, line: 217, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !681, line: 89, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 82, size: 192, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !721, file: !681, line: 83, baseType: !506, size: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !721, file: !681, line: 84, baseType: !7, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !721, file: !681, line: 85, baseType: !7, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !721, file: !681, line: 86, baseType: !7, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !721, file: !681, line: 87, baseType: !7, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !721, file: !681, line: 88, baseType: !7, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !676, file: !629, line: 220, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !681, line: 44, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 40, size: 96, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !732, file: !681, line: 41, baseType: !7, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !732, file: !681, line: 42, baseType: !7, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !732, file: !681, line: 43, baseType: !506, size: 16, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !676, file: !629, line: 221, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !681, line: 51, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !681, line: 46, size: 128, elements: !741)
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !740, file: !681, line: 47, baseType: !7, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !740, file: !681, line: 48, baseType: !7, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !740, file: !681, line: 49, baseType: !506, size: 16, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !740, file: !681, line: 50, baseType: !7, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !428, file: !61, line: 1304, baseType: !747, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!62, !320, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !428, file: !61, line: 1306, baseType: !752, size: 64, offset: 832)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!62, !320, !62}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !428, file: !61, line: 1308, baseType: !756, size: 64, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!62, !320, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !61, line: 206, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !428, file: !61, line: 1310, baseType: !762, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !320, !7}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !428, file: !61, line: 1313, baseType: !766, size: 64, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !320, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !771, line: 214, size: 1536, elements: !772)
!771 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !770, file: !771, line: 215, baseType: !363, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !770, file: !771, line: 216, baseType: !363, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !770, file: !771, line: 217, baseType: !363, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !770, file: !771, line: 218, baseType: !363, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !770, file: !771, line: 219, baseType: !363, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !770, file: !771, line: 220, baseType: !363, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !770, file: !771, line: 221, baseType: !363, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !770, file: !771, line: 222, baseType: !363, size: 64, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !770, file: !771, line: 223, baseType: !363, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !770, file: !771, line: 224, baseType: !363, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !770, file: !771, line: 227, baseType: !363, size: 64, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !770, file: !771, line: 228, baseType: !363, size: 64, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !770, file: !771, line: 229, baseType: !363, size: 64, offset: 768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !770, file: !771, line: 230, baseType: !363, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !770, file: !771, line: 231, baseType: !363, size: 64, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !770, file: !771, line: 232, baseType: !363, size: 64, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !770, file: !771, line: 235, baseType: !363, size: 64, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !770, file: !771, line: 236, baseType: !363, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !770, file: !771, line: 237, baseType: !363, size: 64, offset: 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !770, file: !771, line: 238, baseType: !363, size: 64, offset: 1216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !770, file: !771, line: 239, baseType: !363, size: 64, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !770, file: !771, line: 242, baseType: !363, size: 64, offset: 1344)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !770, file: !771, line: 243, baseType: !363, size: 64, offset: 1408)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !770, file: !771, line: 244, baseType: !363, size: 64, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !428, file: !61, line: 1315, baseType: !798, size: 64, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!801, !803, !62}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !307, line: 30, baseType: !802)
!802 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !428, file: !61, line: 1316, baseType: !806, size: 64, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!62, !62, !803, !621}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !428, file: !61, line: 1319, baseType: !810, size: 64, offset: 1216)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!813, !320}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !428, file: !61, line: 1321, baseType: !815, size: 64, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!62, !320, !565, !611}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !428, file: !61, line: 1323, baseType: !815, size: 64, offset: 1344)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !428, file: !61, line: 1331, baseType: !820, size: 64, offset: 1408)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!62, !320, !62, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !362, line: 17, baseType: !511)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !428, file: !61, line: 1333, baseType: !826, size: 64, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!62, !320, !62, !611, !824, !565}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !428, file: !61, line: 1336, baseType: !830, size: 64, offset: 1536)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!62, !320, !62, !62, !62}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !428, file: !61, line: 1339, baseType: !834, size: 64, offset: 1600)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!62, !320, !62, !801}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !428, file: !61, line: 1341, baseType: !834, size: 64, offset: 1664)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !428, file: !61, line: 1343, baseType: !839, size: 64, offset: 1728)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!62, !320, !62, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !844, line: 20, size: 576, elements: !845)
!844 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!845 = !{!846, !847, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !843, file: !844, line: 21, baseType: !523, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !843, file: !844, line: 22, baseType: !848, size: 256, offset: 32)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 256, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !843, file: !844, line: 23, baseType: !523, size: 32, offset: 288)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !843, file: !844, line: 24, baseType: !523, size: 32, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !843, file: !844, line: 25, baseType: !523, size: 32, offset: 352)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !843, file: !844, line: 26, baseType: !523, size: 32, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !843, file: !844, line: 27, baseType: !523, size: 32, offset: 416)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !843, file: !844, line: 28, baseType: !523, size: 32, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !843, file: !844, line: 29, baseType: !523, size: 32, offset: 480)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !843, file: !844, line: 30, baseType: !523, size: 32, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !843, file: !844, line: 31, baseType: !565, size: 16, offset: 544)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !428, file: !61, line: 1346, baseType: !861, size: 64, offset: 1792)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!62, !320, !62, !62}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !428, file: !61, line: 1348, baseType: !865, size: 64, offset: 1856)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!62, !320, !62, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !844, line: 9, size: 512, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !869, file: !844, line: 10, baseType: !363, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !869, file: !844, line: 11, baseType: !363, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !869, file: !844, line: 12, baseType: !363, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !869, file: !844, line: 13, baseType: !363, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !869, file: !844, line: 14, baseType: !363, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !869, file: !844, line: 15, baseType: !363, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !869, file: !844, line: 16, baseType: !363, size: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !869, file: !844, line: 17, baseType: !363, size: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !428, file: !61, line: 1352, baseType: !880, size: 64, offset: 1920)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!62, !320, !62, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !886, line: 213, size: 32, elements: !887)
!886 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !885, file: !886, line: 214, baseType: !505, size: 16)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !885, file: !886, line: 215, baseType: !505, size: 16, offset: 16)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !428, file: !61, line: 1355, baseType: !891, size: 64, offset: 1984)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!62, !320, !62, !445}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !428, file: !61, line: 1357, baseType: !895, size: 64, offset: 2048)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!62, !320, !62, !898, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !771, line: 956, size: 128, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !899, file: !771, line: 957, baseType: !523, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !899, file: !771, line: 958, baseType: !363, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !428, file: !61, line: 1361, baseType: !904, size: 64, offset: 2112)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!62, !320, !62, !361, !62}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !428, file: !61, line: 1364, baseType: !834, size: 64, offset: 2176)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !428, file: !61, line: 1367, baseType: !909, size: 64, offset: 2240)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!62, !320, !67, !621}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !428, file: !61, line: 1400, baseType: !913, size: 64, offset: 2304)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!62, !320, !320, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !918, line: 75, size: 384, elements: !919)
!918 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!919 = !{!920, !921, !924, !928, !932}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !917, file: !918, line: 76, baseType: !322, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !917, file: !918, line: 77, baseType: !922, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !917, file: !918, line: 78, baseType: !925, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !918, line: 78, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !917, file: !918, line: 79, baseType: !929, size: 160, offset: 192)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 160, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 20)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !917, file: !918, line: 80, baseType: !824, size: 8, offset: 352)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !428, file: !61, line: 1403, baseType: !934, size: 64, offset: 2368)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!62, !320, !320}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !428, file: !61, line: 1405, baseType: !938, size: 64, offset: 2432)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!320, !320, !445, !801}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !428, file: !61, line: 1408, baseType: !942, size: 64, offset: 2496)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!359, !320, !359}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !428, file: !61, line: 1410, baseType: !946, size: 64, offset: 2560)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!62, !320, !359}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !428, file: !61, line: 1412, baseType: !950, size: 64, offset: 2624)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!62, !320, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !955, line: 35, flags: DIFlagFwdDecl)
!955 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !428, file: !61, line: 1414, baseType: !957, size: 64, offset: 2688)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !320, !953}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !428, file: !61, line: 1417, baseType: !961, size: 64, offset: 2752)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!62, !964, !883, !320, !976, !611, !611, !916}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !966, line: 8, size: 96, elements: !967)
!966 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!967 = !{!968, !969, !970, !971, !973, !974, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !965, file: !966, line: 9, baseType: !511, size: 8)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !965, file: !966, line: 10, baseType: !511, size: 8, offset: 8)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !965, file: !966, line: 11, baseType: !505, size: 16, offset: 16)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !965, file: !966, line: 12, baseType: !972, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !364, line: 26, baseType: !62)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !965, file: !966, line: 13, baseType: !505, size: 16, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !965, file: !966, line: 14, baseType: !511, size: 8, offset: 80)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !965, file: !966, line: 15, baseType: !511, size: 8, offset: 88)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !428, file: !61, line: 1424, baseType: !979, size: 64, offset: 2816)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!62, !964, !883, !320, !976, !611}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !428, file: !61, line: 1429, baseType: !983, size: 64, offset: 2880)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!62, !445, !986, !320, !320, !1031}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !918, line: 203, size: 1024, elements: !988)
!988 = !{!989, !990, !1000, !1004, !1008, !1009, !1013, !1014, !1015, !1016, !1018, !1019, !1020, !1021}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !987, file: !918, line: 204, baseType: !445, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !987, file: !918, line: 205, baseType: !991, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !886, line: 44, size: 128, elements: !994)
!994 = !{!995, !996, !997, !998, !999}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !993, file: !886, line: 45, baseType: !523, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !993, file: !886, line: 46, baseType: !505, size: 16, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !993, file: !886, line: 47, baseType: !505, size: 16, offset: 48)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !993, file: !886, line: 48, baseType: !523, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !993, file: !886, line: 49, baseType: !523, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !987, file: !918, line: 206, baseType: !1001, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!62, !445, !986}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !987, file: !918, line: 208, baseType: !1005, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!62, !986}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !987, file: !918, line: 209, baseType: !621, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !987, file: !918, line: 211, baseType: !1010, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1012, line: 76, flags: DIFlagFwdDecl)
!1012 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !987, file: !918, line: 212, baseType: !916, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !987, file: !918, line: 213, baseType: !611, size: 16, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !987, file: !918, line: 214, baseType: !611, size: 16, offset: 464)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !987, file: !918, line: 215, baseType: !1017, size: 32, offset: 480)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !362, line: 21, baseType: !523)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !987, file: !918, line: 216, baseType: !7, size: 32, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !987, file: !918, line: 216, baseType: !7, size: 32, offset: 544)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !987, file: !918, line: 217, baseType: !801, size: 8, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_member, scope: !987, file: !918, line: 218, baseType: !1022, size: 384, offset: 640)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !987, file: !918, line: 218, size: 384, elements: !1023)
!1023 = !{!1024, !1026}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1022, file: !918, line: 219, baseType: !1025, size: 384)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 384, elements: !488)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1022, file: !918, line: 224, baseType: !1027, size: 384)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 384, elements: !1029)
!1028 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1029 = !{!1030}
!1030 = !DISubrange(count: 6)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !428, file: !61, line: 1434, baseType: !1033, size: 64, offset: 2944)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!62, !445, !883, !320, !976, !611, !1017, !1017, !916}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !428, file: !61, line: 1440, baseType: !1037, size: 64, offset: 3008)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!62, !320, !1040, !611, !916}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !428, file: !61, line: 1444, baseType: !1042, size: 64, offset: 3072)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!62, !445, !1017, !1017, !320, !1017, !62}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !428, file: !61, line: 1449, baseType: !1046, size: 64, offset: 3136)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!62, !320, !1040, !611}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !428, file: !61, line: 1452, baseType: !1050, size: 64, offset: 3200)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!62, !320, !801}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !428, file: !61, line: 1454, baseType: !1054, size: 64, offset: 3264)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!62, !320, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !61, line: 820, size: 264, elements: !1059)
!1059 = !{!1060, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1058, file: !61, line: 821, baseType: !1061, size: 256)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 256, elements: !849)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1058, file: !61, line: 822, baseType: !512, size: 8, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !428, file: !61, line: 1456, baseType: !1054, size: 64, offset: 3328)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !428, file: !61, line: 1458, baseType: !1065, size: 64, offset: 3392)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!62, !320, !1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !307, line: 55, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1071, line: 72, baseType: !1072)
!1071 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1071, line: 16, baseType: !342)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !428, file: !61, line: 1460, baseType: !1074, size: 64, offset: 3456)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !320, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !61, line: 67, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !428, file: !61, line: 1462, baseType: !1074, size: 64, offset: 3520)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !428, file: !61, line: 1464, baseType: !1081, size: 64, offset: 3584)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!621, !320, !320}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !428, file: !61, line: 1466, baseType: !1085, size: 64, offset: 3648)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !320, !621}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !428, file: !61, line: 1469, baseType: !1089, size: 64, offset: 3712)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!62, !320, !62, !1017}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !428, file: !61, line: 1472, baseType: !1093, size: 64, offset: 3776)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!62, !803}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !428, file: !61, line: 1473, baseType: !1050, size: 64, offset: 3840)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !428, file: !61, line: 1475, baseType: !1098, size: 64, offset: 3904)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!62, !320, !445}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !428, file: !61, line: 1477, baseType: !613, size: 64, offset: 3968)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !428, file: !61, line: 1479, baseType: !1103, size: 64, offset: 4032)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!62, !320, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !61, line: 894, size: 256, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1107, file: !61, line: 895, baseType: !87, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, scope: !1107, file: !61, line: 896, baseType: !1111, size: 192, offset: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1107, file: !61, line: 896, size: 192, elements: !1112)
!1112 = !{!1113, !1122, !5788}
!1113 = !DIDerivedType(tag: DW_TAG_member, scope: !1111, file: !61, line: 898, baseType: !1114, size: 192)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1111, file: !61, line: 898, size: 192, elements: !1115)
!1115 = !{!1116, !1117, !1121}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1114, file: !61, line: 899, baseType: !1017, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1114, file: !61, line: 900, baseType: !1118, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1120, line: 11, flags: DIFlagFwdDecl)
!1120 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1114, file: !61, line: 901, baseType: !916, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, scope: !1111, file: !61, line: 904, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1111, file: !61, line: 904, size: 64, elements: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1123, file: !61, line: 905, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !95, line: 222, size: 2560, elements: !1128)
!1128 = !{!1129, !5767, !5768, !5786, !5787}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1127, file: !95, line: 223, baseType: !1130, size: 2048)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !95, line: 141, size: 2048, elements: !1131)
!1131 = !{!1132, !5741, !5742, !5743, !5744, !5745, !5746, !5747, !5748, !5749, !5750, !5751, !5752, !5753, !5758, !5759, !5760, !5761, !5762, !5763, !5764, !5765, !5766}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1130, file: !95, line: 145, baseType: !1133, size: 64, align: 512)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !95, line: 54, size: 2368, elements: !1136)
!1136 = !{!1137, !1336, !1341, !5413, !5417, !5421, !5422, !5426, !5432, !5433, !5434, !5435, !5436, !5440, !5444, !5448, !5449, !5450, !5454, !5455, !5467, !5471, !5475, !5487, !5676, !5680, !5684, !5689, !5693, !5697, !5701, !5707, !5711, !5718, !5722, !5724, !5725}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1135, file: !95, line: 56, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!62, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !126, line: 483, size: 960, align: 64, elements: !1143)
!1143 = !{!1144, !1160, !1171, !1182, !1206, !1212, !1220, !1237, !1250, !1256, !1265, !1270, !1278, !1290, !1310, !1317, !1321, !1325, !1330}
!1144 = !DIDerivedType(tag: DW_TAG_member, scope: !1142, file: !126, line: 484, baseType: !1145, size: 512)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1142, file: !126, line: 484, size: 512, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1145, file: !126, line: 485, baseType: !523, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1145, file: !126, line: 486, baseType: !523, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1145, file: !126, line: 487, baseType: !523, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1145, file: !126, line: 488, baseType: !523, size: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1145, file: !126, line: 489, baseType: !523, size: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1145, file: !126, line: 492, baseType: !523, size: 32, offset: 160)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1145, file: !126, line: 493, baseType: !523, size: 32, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1145, file: !126, line: 496, baseType: !297, size: 128, offset: 224)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1145, file: !126, line: 497, baseType: !523, size: 32, offset: 352)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1145, file: !126, line: 498, baseType: !523, size: 32, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1145, file: !126, line: 499, baseType: !523, size: 32, offset: 416)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1145, file: !126, line: 500, baseType: !523, size: 32, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1145, file: !126, line: 501, baseType: !523, size: 32, offset: 480)
!1160 = !DIDerivedType(tag: DW_TAG_member, scope: !1142, file: !126, line: 507, baseType: !1161, size: 256)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1142, file: !126, line: 507, size: 256, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1170}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1161, file: !126, line: 508, baseType: !523, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1161, file: !126, line: 509, baseType: !363, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, scope: !1161, file: !126, line: 510, baseType: !1166, size: 64, offset: 128)
!1166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1161, file: !126, line: 510, size: 64, elements: !1167)
!1167 = !{!1168, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1166, file: !126, line: 511, baseType: !363, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1166, file: !126, line: 512, baseType: !363, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !126, line: 514, baseType: !363, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1142, file: !126, line: 532, baseType: !1172, size: 448)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1142, file: !126, line: 517, size: 448, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1172, file: !126, line: 518, baseType: !363, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1172, file: !126, line: 521, baseType: !363, size: 64, align: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1172, file: !126, line: 522, baseType: !363, size: 64, align: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1172, file: !126, line: 523, baseType: !363, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1172, file: !126, line: 524, baseType: !523, size: 32, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1172, file: !126, line: 529, baseType: !523, size: 32, offset: 288)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1172, file: !126, line: 530, baseType: !363, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1172, file: !126, line: 531, baseType: !363, size: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, scope: !1142, file: !126, line: 534, baseType: !1183, size: 960)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1142, file: !126, line: 534, size: 960, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1183, file: !126, line: 535, baseType: !523, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1183, file: !126, line: 536, baseType: !523, size: 32, offset: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1183, file: !126, line: 537, baseType: !363, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1183, file: !126, line: 538, baseType: !363, size: 64, align: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1183, file: !126, line: 539, baseType: !523, size: 32, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1183, file: !126, line: 540, baseType: !523, size: 32, offset: 224)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1183, file: !126, line: 541, baseType: !363, size: 64, align: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1183, file: !126, line: 542, baseType: !523, size: 32, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1183, file: !126, line: 543, baseType: !523, size: 32, offset: 352)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1183, file: !126, line: 544, baseType: !297, size: 128, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1183, file: !126, line: 545, baseType: !523, size: 32, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1183, file: !126, line: 550, baseType: !523, size: 32, offset: 544)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1183, file: !126, line: 551, baseType: !523, size: 32, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1183, file: !126, line: 552, baseType: !523, size: 32, offset: 608)
