; ModuleID = '../bcout/drivers/edac/mce_amd.llvm.bc'
source_filename = "drivers/edac/mce_amd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcallearly.init\22, \22a\22\09"
module asm "__initcall_mce_amd_initearly:\09\09\09"
module asm ".long\09mce_amd_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.mce = type { i64, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i32, i8, i8, i8, i8, i32, i32, i32, i64, i64, i64, i64, i32, i64 }
%struct.cpuinfo_x86 = type { i8, i8, i8, i8, i32, [3 x i32], i8, i8, i8, i8, i32, i32, %union.anon, [16 x i8], [64 x i8], i32, i32, i32, i32, i32, i32, i64, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i32, i8, i8 }
%union.anon = type { i64, [72 x i8] }
%struct.amd_decoder_ops = type { i1 (i16, i8)*, i1 (i16, i8)*, i1 (i16, i8)* }
%struct.notifier_block = type { i32 (%struct.notifier_block*, i64, i8*)*, %struct.notifier_block*, i32 }
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!1 = distinct !DIGlobalVariable(name: "decode_dram_ecc", scope: !2, file: !3, line: 13, type: !271, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !66, globals: !108, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/edac/mce_amd.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !23, !29, !35, !41}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rrrr_ids", file: !12, line: 58, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "drivers/edac/mce_amd.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22}
!14 = !DIEnumerator(name: "R4_GEN", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "R4_RD", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "R4_WR", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "R4_DRD", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "R4_DWR", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "R4_IRD", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "R4_PREF", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "R4_EVICT", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "R4_SNOOP", value: 8, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ll_ids", file: !12, line: 44, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "LL_RESV", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "LL_L1", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "LL_L2", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "LL_LG", value: 3, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tt_ids", file: !12, line: 37, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "TT_INSTR", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "TT_DATA", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "TT_GEN", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "TT_RESV", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ii_ids", file: !12, line: 51, baseType: !7, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "II_MEM", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "II_RESV", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "II_IO", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "II_GEN", value: 3, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "smca_bank_types", file: !42, line: 321, baseType: !7, size: 32, elements: !43)
!42 = !DIFile(filename: "./arch/x86/include/asm/mce.h", directory: "/home/lizy2001/genbc/linux")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!44 = !DIEnumerator(name: "SMCA_LS", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "SMCA_LS_V2", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "SMCA_IF", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "SMCA_L2_CACHE", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "SMCA_DE", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "SMCA_RESERVED", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "SMCA_EX", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "SMCA_FP", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "SMCA_L3_CACHE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "SMCA_CS", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "SMCA_CS_V2", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "SMCA_PIE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "SMCA_UMC", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "SMCA_PB", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "SMCA_PSP", value: 14, isUnsigned: true)
!59 = !DIEnumerator(name: "SMCA_PSP_V2", value: 15, isUnsigned: true)
!60 = !DIEnumerator(name: "SMCA_SMU", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "SMCA_SMU_V2", value: 17, isUnsigned: true)
!62 = !DIEnumerator(name: "SMCA_MP5", value: 18, isUnsigned: true)
!63 = !DIEnumerator(name: "SMCA_NBIO", value: 19, isUnsigned: true)
!64 = !DIEnumerator(name: "SMCA_PCIE", value: 20, isUnsigned: true)
!65 = !DIEnumerator(name: "N_SMCA_BANK_TYPES", value: 21, isUnsigned: true)
!66 = !{!67, !68, !70, !105, !69, !107}
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mce", file: !72, line: 13, size: 1024, elements: !73)
!72 = !DIFile(filename: "./arch/x86/include/uapi/asm/mce.h", directory: "/home/lizy2001/genbc/linux")
!73 = !{!74, !78, !79, !80, !81, !82, !83, !84, !87, !88, !89, !90, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !71, file: !72, line: 14, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !76, line: 31, baseType: !77)
!76 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!77 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !71, file: !72, line: 15, baseType: !75, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !71, file: !72, line: 16, baseType: !75, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "mcgstatus", scope: !71, file: !72, line: 17, baseType: !75, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !71, file: !72, line: 18, baseType: !75, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !71, file: !72, line: 19, baseType: !75, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !71, file: !72, line: 20, baseType: !75, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cpuvendor", scope: !71, file: !72, line: 21, baseType: !85, size: 8, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !76, line: 21, baseType: !86)
!86 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "inject_flags", scope: !71, file: !72, line: 22, baseType: !85, size: 8, offset: 456)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !71, file: !72, line: 23, baseType: !85, size: 8, offset: 464)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !71, file: !72, line: 24, baseType: !85, size: 8, offset: 472)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid", scope: !71, file: !72, line: 25, baseType: !91, size: 32, offset: 480)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !76, line: 27, baseType: !7)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !71, file: !72, line: 26, baseType: !85, size: 8, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bank", scope: !71, file: !72, line: 27, baseType: !85, size: 8, offset: 520)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !71, file: !72, line: 28, baseType: !85, size: 8, offset: 528)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "finished", scope: !71, file: !72, line: 29, baseType: !85, size: 8, offset: 536)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "extcpu", scope: !71, file: !72, line: 30, baseType: !91, size: 32, offset: 544)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "socketid", scope: !71, file: !72, line: 31, baseType: !91, size: 32, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "apicid", scope: !71, file: !72, line: 32, baseType: !91, size: 32, offset: 608)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mcgcap", scope: !71, file: !72, line: 33, baseType: !75, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "synd", scope: !71, file: !72, line: 34, baseType: !75, size: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ipid", scope: !71, file: !72, line: 35, baseType: !75, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ppin", scope: !71, file: !72, line: 36, baseType: !75, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "microcode", scope: !71, file: !72, line: 37, baseType: !91, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "kflags", scope: !71, file: !72, line: 38, baseType: !75, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !106, line: 21, baseType: !91)
!106 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !106, line: 23, baseType: !75)
!108 = !{!109, !118, !0, !121, !130, !133, !146, !151, !153, !158, !163, !176, !186, !189, !194, !199, !201, !206, !208, !213, !218, !220, !222, !227, !229, !234, !236, !238, !240, !245, !247, !249, !251, !253, !255, !257, !262, !264, !266}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "pp_msgs", scope: !2, file: !3, line: 48, type: !111, isLocal: false, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, elements: !116)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !{!117}
!117 = !DISubrange(count: 4)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_mce_amd_init162", scope: !2, file: !3, line: 1247, type: !120, isLocal: true, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "__print_once", scope: !123, file: !3, line: 1232, type: !127, isLocal: true, isDefinition: true)
!123 = distinct !DISubprogram(name: "mce_amd_init", scope: !3, file: !3, line: 1171, type: !124, scopeLine: 1172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!67}
!126 = !{}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !128, line: 30, baseType: !129)
!128 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!129 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "xec_mask", scope: !2, file: !3, line: 11, type: !132, isLocal: true, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !106, line: 17, baseType: !85)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "fam_ops", scope: !2, file: !3, line: 9, type: !135, isLocal: true, isDefinition: true)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "amd_decoder_ops", file: !12, line: 73, size: 192, elements: !136)
!136 = !{!137, !144, !145}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mc0_mce", scope: !135, file: !12, line: 74, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!127, !141, !132}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !106, line: 19, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !76, line: 24, baseType: !143)
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mc1_mce", scope: !135, file: !12, line: 75, baseType: !138, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mc2_mce", scope: !135, file: !12, line: 76, baseType: !138, size: 64, offset: 128)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "rrrr_msgs", scope: !2, file: !3, line: 43, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 576, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 9)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "tt_msgs", scope: !2, file: !3, line: 37, type: !111, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "f15h_mc1_mce_desc", scope: !2, file: !3, line: 60, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 1152, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 18)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "f15h_mc2_mce_desc", scope: !2, file: !3, line: 81, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 896, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 14)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "amd_mce_dec_nb", scope: !2, file: !3, line: 1166, type: !165, isLocal: true, isDefinition: true)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !166, line: 54, size: 192, elements: !167)
!166 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!167 = !{!168, !174, !175}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !165, file: !166, line: 55, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !166, line: 51, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!67, !173, !69, !120}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !166, line: 56, baseType: !173, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !165, file: !166, line: 57, baseType: !67, size: 32, offset: 128)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "smca_mce_descs", scope: !2, file: !3, line: 408, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2688, elements: !184)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smca_mce_desc", file: !3, line: 403, size: 128, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "descs", scope: !179, file: !3, line: 404, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "num_descs", scope: !179, file: !3, line: 405, baseType: !7, size: 32, offset: 64)
!184 = !{!185}
!185 = !DISubrange(count: 21)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "smca_ls_mce_desc", scope: !2, file: !3, line: 147, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 1344, elements: !184)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "smca_ls2_mce_desc", scope: !2, file: !3, line: 171, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 1536, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 24)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "smca_if_mce_desc", scope: !2, file: !3, line: 198, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 1216, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 19)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "smca_l2_mce_desc", scope: !2, file: !3, line: 220, type: !111, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "smca_de_mce_desc", scope: !2, file: !3, line: 227, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 640, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 10)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "smca_ex_mce_desc", scope: !2, file: !3, line: 240, type: !160, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "smca_fp_mce_desc", scope: !2, file: !3, line: 257, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 448, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 7)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "smca_l3_mce_desc", scope: !2, file: !3, line: 267, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 512, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 8)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "smca_cs_mce_desc", scope: !2, file: !3, line: 278, type: !148, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "smca_cs2_mce_desc", scope: !2, file: !3, line: 290, type: !160, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "smca_pie_mce_desc", scope: !2, file: !3, line: 307, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 320, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 5)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "smca_umc_mce_desc", scope: !2, file: !3, line: 315, type: !215, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "smca_pb_mce_desc", scope: !2, file: !3, line: 326, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 1)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "smca_psp_mce_desc", scope: !2, file: !3, line: 330, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "smca_psp2_mce_desc", scope: !2, file: !3, line: 334, type: !155, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "smca_smu_mce_desc", scope: !2, file: !3, line: 355, type: !231, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "smca_smu2_mce_desc", scope: !2, file: !3, line: 359, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 768, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 12)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "smca_mp5_mce_desc", scope: !2, file: !3, line: 374, type: !203, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "smca_nbio_mce_desc", scope: !2, file: !3, line: 387, type: !224, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "smca_pcie_mce_desc", scope: !2, file: !3, line: 395, type: !224, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "ll_msgs", scope: !2, file: !3, line: 40, type: !111, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "mc4_mce_desc", scope: !2, file: !3, line: 98, type: !196, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "mc5_mce_desc", scope: !2, file: !3, line: 120, type: !160, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "mc6_mce_desc", scope: !2, file: !3, line: 137, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 384, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 6)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "uu_msgs", scope: !2, file: !3, line: 58, type: !111, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "ii_msgs", scope: !2, file: !3, line: 55, type: !111, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "to_msgs", scope: !2, file: !3, line: 52, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 2)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !67, !70}
!274 = !{!"rsp"}
!275 = !{i32 7, !"Dwarf Version", i32 4}
!276 = !{i32 2, !"Debug Info Version", i32 3}
!277 = !{i32 1, !"wchar_size", i32 2}
!278 = !{i32 1, !"Code Model", i32 2}
!279 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!280 = distinct !DISubprogram(name: "amd_register_ecc_decoder", scope: !3, file: !3, line: 15, type: !281, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !126)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !271}
!283 = !DILocalVariable(name: "f", arg: 1, scope: !280, file: !3, line: 15, type: !271)
!284 = !DILocation(line: 15, column: 38, scope: !280)
!285 = !DILocation(line: 17, column: 20, scope: !280)
!286 = !DILocation(line: 17, column: 18, scope: !280)
!287 = !DILocation(line: 18, column: 1, scope: !280)
!288 = distinct !DISubprogram(name: "amd_unregister_ecc_decoder", scope: !3, file: !3, line: 21, type: !281, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !126)
!289 = !DILocalVariable(name: "f", arg: 1, scope: !288, file: !3, line: 21, type: !271)
!290 = !DILocation(line: 21, column: 40, scope: !288)
!291 = !DILocation(line: 23, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !288, file: !3, line: 23, column: 6)
!293 = !DILocation(line: 23, column: 6, scope: !288)
!294 = !DILocalVariable(name: "__ret_warn_on", scope: !295, file: !3, line: 24, type: !67)
!295 = distinct !DILexicalBlock(scope: !296, file: !3, line: 24, column: 3)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 23, column: 23)
!297 = !DILocation(line: 24, column: 3, scope: !295)
!298 = !DILocation(line: 24, column: 3, scope: !299)
!299 = distinct !DILexicalBlock(scope: !295, file: !3, line: 24, column: 3)
!300 = !DILocation(line: 24, column: 3, scope: !301)
!301 = distinct !DILexicalBlock(scope: !299, file: !3, line: 24, column: 3)
!302 = !DILocation(line: 24, column: 3, scope: !303)
!303 = distinct !DILexicalBlock(scope: !301, file: !3, line: 24, column: 3)
!304 = !DILocation(line: 24, column: 3, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !3, line: 24, column: 3)
!306 = !{i32 -2143479836, i32 -2143479807, i32 -2143479761, i32 -2143479703, i32 -2143479649, i32 -2143479595, i32 -2143479540, i32 -2143479509}
!307 = !DILocation(line: 24, column: 3, scope: !308)
!308 = distinct !DILexicalBlock(scope: !301, file: !3, line: 24, column: 3)
!309 = !{i32 -2143479106, i32 -2143479099, i32 -2143479047, i32 -2143479016, i32 -2143478986}
!310 = !DILocation(line: 24, column: 3, scope: !311)
!311 = distinct !DILexicalBlock(scope: !301, file: !3, line: 24, column: 3)
!312 = !DILocation(line: 26, column: 19, scope: !296)
!313 = !DILocation(line: 27, column: 2, scope: !296)
!314 = !DILocation(line: 28, column: 1, scope: !288)
!315 = !DILocalVariable(name: "c", scope: !123, file: !3, line: 1173, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuinfo_x86", file: !318, line: 81, size: 2048, elements: !319)
!318 = !DIFile(filename: "./arch/x86/include/asm/processor.h", directory: "/home/lizy2001/genbc/linux")
!319 = !{!320, !321, !322, !323, !324, !325, !329, !330, !331, !332, !333, !334, !335, !343, !347, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "x86", scope: !317, file: !318, line: 82, baseType: !85, size: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vendor", scope: !317, file: !318, line: 83, baseType: !85, size: 8, offset: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "x86_model", scope: !317, file: !318, line: 84, baseType: !85, size: 8, offset: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x86_stepping", scope: !317, file: !318, line: 85, baseType: !85, size: 8, offset: 24)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "x86_tlbsize", scope: !317, file: !318, line: 88, baseType: !67, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vmx_capability", scope: !317, file: !318, line: 91, baseType: !326, size: 96, offset: 64)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 96, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 3)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "x86_virt_bits", scope: !317, file: !318, line: 93, baseType: !85, size: 8, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "x86_phys_bits", scope: !317, file: !318, line: 94, baseType: !85, size: 8, offset: 168)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "x86_coreid_bits", scope: !317, file: !318, line: 96, baseType: !85, size: 8, offset: 176)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cu_id", scope: !317, file: !318, line: 97, baseType: !85, size: 8, offset: 184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "extended_cpuid_level", scope: !317, file: !318, line: 99, baseType: !91, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid_level", scope: !317, file: !318, line: 101, baseType: !67, size: 32, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_member, scope: !317, file: !318, line: 107, baseType: !336, size: 640, offset: 256)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !318, line: 107, size: 640, elements: !337)
!337 = !{!338, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "x86_capability", scope: !336, file: !318, line: 108, baseType: !339, size: 640)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 640, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 20)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "x86_capability_alignment", scope: !336, file: !318, line: 109, baseType: !69, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vendor_id", scope: !317, file: !318, line: 111, baseType: !344, size: 128, offset: 896)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "x86_model_id", scope: !317, file: !318, line: 112, baseType: !348, size: 512, offset: 1024)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_size", scope: !317, file: !318, line: 114, baseType: !7, size: 32, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_alignment", scope: !317, file: !318, line: 115, baseType: !67, size: 32, offset: 1568)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_max_rmid", scope: !317, file: !318, line: 117, baseType: !67, size: 32, offset: 1600)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_occ_scale", scope: !317, file: !318, line: 118, baseType: !67, size: 32, offset: 1632)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_mbm_width_offset", scope: !317, file: !318, line: 119, baseType: !67, size: 32, offset: 1664)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "x86_power", scope: !317, file: !318, line: 120, baseType: !67, size: 32, offset: 1696)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "loops_per_jiffy", scope: !317, file: !318, line: 121, baseType: !69, size: 64, offset: 1728)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "x86_max_cores", scope: !317, file: !318, line: 123, baseType: !141, size: 16, offset: 1792)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "apicid", scope: !317, file: !318, line: 124, baseType: !141, size: 16, offset: 1808)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "initial_apicid", scope: !317, file: !318, line: 125, baseType: !141, size: 16, offset: 1824)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "x86_clflush_size", scope: !317, file: !318, line: 126, baseType: !141, size: 16, offset: 1840)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "booted_cores", scope: !317, file: !318, line: 128, baseType: !141, size: 16, offset: 1856)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "phys_proc_id", scope: !317, file: !318, line: 130, baseType: !141, size: 16, offset: 1872)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "logical_proc_id", scope: !317, file: !318, line: 132, baseType: !141, size: 16, offset: 1888)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_core_id", scope: !317, file: !318, line: 134, baseType: !141, size: 16, offset: 1904)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_die_id", scope: !317, file: !318, line: 135, baseType: !141, size: 16, offset: 1920)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "logical_die_id", scope: !317, file: !318, line: 136, baseType: !141, size: 16, offset: 1936)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_index", scope: !317, file: !318, line: 138, baseType: !141, size: 16, offset: 1952)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "microcode", scope: !317, file: !318, line: 139, baseType: !105, size: 32, offset: 1984)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_bits", scope: !317, file: !318, line: 141, baseType: !132, size: 8, offset: 2016)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !317, file: !318, line: 142, baseType: !7, size: 1, offset: 2024, flags: DIFlagBitField, extraData: i64 2024)
!372 = !DILocation(line: 1173, column: 22, scope: !123)
!373 = !DILocation(line: 1175, column: 6, scope: !374)
!374 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1175, column: 6)
!375 = !DILocation(line: 1175, column: 9, scope: !374)
!376 = !DILocation(line: 1175, column: 20, scope: !374)
!377 = !DILocation(line: 1175, column: 38, scope: !374)
!378 = !DILocation(line: 1176, column: 6, scope: !374)
!379 = !DILocation(line: 1176, column: 9, scope: !374)
!380 = !DILocation(line: 1176, column: 20, scope: !374)
!381 = !DILocation(line: 1175, column: 6, scope: !123)
!382 = !DILocation(line: 1177, column: 3, scope: !374)
!383 = !DILocation(line: 1179, column: 6, scope: !123)
!384 = !DILocation(line: 1179, column: 6, scope: !385)
!385 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1179, column: 6)
!386 = !DILocation(line: 1180, column: 12, scope: !387)
!387 = distinct !DILexicalBlock(scope: !385, file: !3, line: 1179, column: 38)
!388 = !DILocation(line: 1181, column: 3, scope: !387)
!389 = !DILocation(line: 1184, column: 10, scope: !123)
!390 = !DILocation(line: 1184, column: 13, scope: !123)
!391 = !DILocation(line: 1184, column: 2, scope: !123)
!392 = !DILocation(line: 1186, column: 19, scope: !393)
!393 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1184, column: 18)
!394 = !DILocation(line: 1187, column: 19, scope: !393)
!395 = !DILocation(line: 1188, column: 19, scope: !393)
!396 = !DILocation(line: 1189, column: 3, scope: !393)
!397 = !DILocation(line: 1192, column: 19, scope: !393)
!398 = !DILocation(line: 1193, column: 19, scope: !393)
!399 = !DILocation(line: 1194, column: 19, scope: !393)
!400 = !DILocation(line: 1195, column: 3, scope: !393)
!401 = !DILocation(line: 1198, column: 19, scope: !393)
!402 = !DILocation(line: 1199, column: 19, scope: !393)
!403 = !DILocation(line: 1200, column: 19, scope: !393)
!404 = !DILocation(line: 1201, column: 3, scope: !393)
!405 = !DILocation(line: 1204, column: 19, scope: !393)
!406 = !DILocation(line: 1205, column: 19, scope: !393)
!407 = !DILocation(line: 1206, column: 19, scope: !393)
!408 = !DILocation(line: 1207, column: 3, scope: !393)
!409 = !DILocation(line: 1210, column: 19, scope: !393)
!410 = !DILocation(line: 1211, column: 19, scope: !393)
!411 = !DILocation(line: 1212, column: 19, scope: !393)
!412 = !DILocation(line: 1213, column: 3, scope: !393)
!413 = !DILocation(line: 1216, column: 14, scope: !393)
!414 = !DILocation(line: 1216, column: 17, scope: !393)
!415 = !DILocation(line: 1216, column: 27, scope: !393)
!416 = !DILocation(line: 1216, column: 12, scope: !393)
!417 = !DILocation(line: 1218, column: 19, scope: !393)
!418 = !DILocation(line: 1219, column: 19, scope: !393)
!419 = !DILocation(line: 1220, column: 19, scope: !393)
!420 = !DILocation(line: 1221, column: 3, scope: !393)
!421 = !DILocation(line: 1224, column: 12, scope: !393)
!422 = !DILocation(line: 1225, column: 19, scope: !393)
!423 = !DILocation(line: 1226, column: 19, scope: !393)
!424 = !DILocation(line: 1227, column: 19, scope: !393)
!425 = !DILocation(line: 1228, column: 3, scope: !393)
!426 = !DILocalVariable(name: "__ret_print_once", scope: !427, file: !3, line: 1232, type: !127)
!427 = distinct !DILexicalBlock(scope: !393, file: !3, line: 1232, column: 3)
!428 = !DILocation(line: 1232, column: 3, scope: !427)
!429 = !DILocation(line: 1232, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !427, file: !3, line: 1232, column: 3)
!431 = !DILocation(line: 1232, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !430, file: !3, line: 1232, column: 3)
!433 = !DILocation(line: 1233, column: 3, scope: !393)
!434 = !DILocation(line: 1236, column: 59, scope: !393)
!435 = !DILocation(line: 1236, column: 62, scope: !393)
!436 = !DILocation(line: 1236, column: 3, scope: !393)
!437 = !DILocation(line: 1237, column: 3, scope: !393)
!438 = !DILocation(line: 1238, column: 2, scope: !393)
!439 = !DILabel(scope: !123, name: "out", file: !3, line: 1240)
!440 = !DILocation(line: 1240, column: 1, scope: !123)
!441 = !DILocation(line: 1241, column: 2, scope: !123)
!442 = !DILocation(line: 1243, column: 2, scope: !123)
!443 = !DILocation(line: 1245, column: 2, scope: !123)
!444 = !DILocation(line: 1246, column: 1, scope: !123)
!445 = distinct !DISubprogram(name: "test_bit", scope: !446, file: !446, line: 132, type: !447, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!446 = !DIFile(filename: "./include/asm-generic/bitops/instrumented-non-atomic.h", directory: "/home/lizy2001/genbc/linux")
!447 = !DISubroutineType(types: !448)
!448 = !{!127, !449, !450}
!449 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!453 = !DILocalVariable(name: "nr", arg: 1, scope: !454, file: !455, line: 210, type: !449)
!454 = distinct !DISubprogram(name: "variable_test_bit", scope: !455, file: !455, line: 210, type: !447, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!455 = !DIFile(filename: "./arch/x86/include/asm/bitops.h", directory: "/home/lizy2001/genbc/linux")
!456 = !DILocation(line: 210, column: 52, scope: !454, inlinedAt: !457)
!457 = distinct !DILocation(line: 135, column: 9, scope: !445)
!458 = !DILocalVariable(name: "addr", arg: 2, scope: !454, file: !455, line: 210, type: !450)
!459 = !DILocation(line: 210, column: 86, scope: !454, inlinedAt: !457)
!460 = !DILocalVariable(name: "oldbit", scope: !454, file: !455, line: 212, type: !127)
!461 = !DILocation(line: 212, column: 7, scope: !454, inlinedAt: !457)
!462 = !DILocalVariable(name: "nr", arg: 1, scope: !463, file: !455, line: 204, type: !449)
!463 = distinct !DISubprogram(name: "constant_test_bit", scope: !455, file: !455, line: 204, type: !447, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!464 = !DILocation(line: 204, column: 52, scope: !463, inlinedAt: !465)
!465 = distinct !DILocation(line: 135, column: 9, scope: !445)
!466 = !DILocalVariable(name: "addr", arg: 2, scope: !463, file: !455, line: 204, type: !450)
!467 = !DILocation(line: 204, column: 86, scope: !463, inlinedAt: !465)
!468 = !DILocalVariable(name: "v", arg: 1, scope: !469, file: !470, line: 69, type: !473)
!469 = distinct !DISubprogram(name: "instrument_atomic_read", scope: !470, file: !470, line: 69, type: !471, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!470 = !DIFile(filename: "./include/linux/instrumented.h", directory: "/home/lizy2001/genbc/linux")
!471 = !DISubroutineType(types: !472)
!472 = !{null, !473, !476}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !128, line: 55, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !478, line: 72, baseType: !479)
!478 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !478, line: 16, baseType: !69)
!480 = !DILocation(line: 69, column: 73, scope: !469, inlinedAt: !481)
!481 = distinct !DILocation(line: 134, column: 2, scope: !445)
!482 = !DILocalVariable(name: "size", arg: 2, scope: !469, file: !470, line: 69, type: !476)
!483 = !DILocation(line: 69, column: 83, scope: !469, inlinedAt: !481)
!484 = !DILocalVariable(name: "nr", arg: 1, scope: !445, file: !446, line: 132, type: !449)
!485 = !DILocation(line: 132, column: 34, scope: !445)
!486 = !DILocalVariable(name: "addr", arg: 2, scope: !445, file: !446, line: 132, type: !450)
!487 = !DILocation(line: 132, column: 68, scope: !445)
!488 = !DILocation(line: 134, column: 25, scope: !445)
!489 = !DILocation(line: 134, column: 32, scope: !445)
!490 = !DILocation(line: 134, column: 30, scope: !445)
!491 = !DILocation(line: 71, column: 19, scope: !469, inlinedAt: !481)
!492 = !DILocation(line: 71, column: 22, scope: !469, inlinedAt: !481)
!493 = !DILocation(line: 71, column: 2, scope: !469, inlinedAt: !481)
!494 = !DILocation(line: 72, column: 2, scope: !469, inlinedAt: !481)
!495 = !DILocation(line: 135, column: 9, scope: !445)
!496 = !DILocation(line: 206, column: 19, scope: !463, inlinedAt: !465)
!497 = !DILocation(line: 206, column: 22, scope: !463, inlinedAt: !465)
!498 = !DILocation(line: 206, column: 15, scope: !463, inlinedAt: !465)
!499 = !DILocation(line: 207, column: 4, scope: !463, inlinedAt: !465)
!500 = !DILocation(line: 207, column: 9, scope: !463, inlinedAt: !465)
!501 = !DILocation(line: 207, column: 12, scope: !463, inlinedAt: !465)
!502 = !DILocation(line: 206, column: 44, scope: !463, inlinedAt: !465)
!503 = !DILocation(line: 207, column: 37, scope: !463, inlinedAt: !465)
!504 = !DILocation(line: 217, column: 33, scope: !454, inlinedAt: !457)
!505 = !DILocation(line: 217, column: 46, scope: !454, inlinedAt: !457)
!506 = !DILocation(line: 214, column: 2, scope: !454, inlinedAt: !457)
!507 = !{i32 -2147116087, i32 -2147116027}
!508 = !DILocation(line: 219, column: 9, scope: !454, inlinedAt: !457)
!509 = !DILocation(line: 135, column: 2, scope: !445)
!510 = distinct !DISubprogram(name: "k8_mc0_mce", scope: !3, file: !3, line: 458, type: !139, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!511 = !DILocalVariable(name: "ec", arg: 1, scope: !510, file: !3, line: 458, type: !141)
!512 = !DILocation(line: 458, column: 28, scope: !510)
!513 = !DILocalVariable(name: "xec", arg: 2, scope: !510, file: !3, line: 458, type: !132)
!514 = !DILocation(line: 458, column: 35, scope: !510)
!515 = !DILocation(line: 460, column: 6, scope: !516)
!516 = distinct !DILexicalBlock(scope: !510, file: !3, line: 460, column: 6)
!517 = !DILocation(line: 460, column: 6, scope: !510)
!518 = !DILocation(line: 461, column: 3, scope: !519)
!519 = distinct !DILexicalBlock(scope: !516, file: !3, line: 460, column: 21)
!520 = !DILocation(line: 462, column: 3, scope: !519)
!521 = !DILocation(line: 465, column: 22, scope: !510)
!522 = !DILocation(line: 465, column: 26, scope: !510)
!523 = !DILocation(line: 465, column: 9, scope: !510)
!524 = !DILocation(line: 465, column: 2, scope: !510)
!525 = !DILocation(line: 466, column: 1, scope: !510)
!526 = distinct !DISubprogram(name: "k8_mc1_mce", scope: !3, file: !3, line: 594, type: !139, scopeLine: 595, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!527 = !DILocalVariable(name: "ec", arg: 1, scope: !526, file: !3, line: 594, type: !141)
!528 = !DILocation(line: 594, column: 28, scope: !526)
!529 = !DILocalVariable(name: "xec", arg: 2, scope: !526, file: !3, line: 594, type: !132)
!530 = !DILocation(line: 594, column: 35, scope: !526)
!531 = !DILocalVariable(name: "ll", scope: !526, file: !3, line: 596, type: !132)
!532 = !DILocation(line: 596, column: 5, scope: !526)
!533 = !DILocation(line: 596, column: 11, scope: !526)
!534 = !DILocalVariable(name: "ret", scope: !526, file: !3, line: 597, type: !127)
!535 = !DILocation(line: 597, column: 7, scope: !526)
!536 = !DILocation(line: 599, column: 7, scope: !537)
!537 = distinct !DILexicalBlock(scope: !526, file: !3, line: 599, column: 6)
!538 = !DILocation(line: 599, column: 6, scope: !526)
!539 = !DILocation(line: 600, column: 3, scope: !537)
!540 = !DILocation(line: 602, column: 6, scope: !541)
!541 = distinct !DILexicalBlock(scope: !526, file: !3, line: 602, column: 6)
!542 = !DILocation(line: 602, column: 9, scope: !541)
!543 = !DILocation(line: 602, column: 6, scope: !526)
!544 = !DILocation(line: 603, column: 3, scope: !541)
!545 = !DILocation(line: 604, column: 11, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !3, line: 604, column: 11)
!547 = !DILocation(line: 604, column: 14, scope: !546)
!548 = !DILocation(line: 604, column: 11, scope: !541)
!549 = !DILocation(line: 605, column: 11, scope: !550)
!550 = distinct !DILexicalBlock(scope: !546, file: !3, line: 604, column: 22)
!551 = !DILocation(line: 605, column: 3, scope: !550)
!552 = !DILocation(line: 607, column: 4, scope: !553)
!553 = distinct !DILexicalBlock(scope: !550, file: !3, line: 605, column: 19)
!554 = !DILocation(line: 608, column: 4, scope: !553)
!555 = !DILocation(line: 611, column: 4, scope: !553)
!556 = !DILocation(line: 612, column: 4, scope: !553)
!557 = !DILocation(line: 615, column: 4, scope: !553)
!558 = !DILocation(line: 616, column: 4, scope: !553)
!559 = !DILocation(line: 619, column: 8, scope: !553)
!560 = !DILocation(line: 620, column: 4, scope: !553)
!561 = !DILocation(line: 622, column: 2, scope: !550)
!562 = !DILocation(line: 623, column: 7, scope: !546)
!563 = !DILocation(line: 625, column: 9, scope: !526)
!564 = !DILocation(line: 625, column: 2, scope: !526)
!565 = !DILocation(line: 626, column: 1, scope: !526)
!566 = distinct !DISubprogram(name: "k8_mc2_mce", scope: !3, file: !3, line: 713, type: !139, scopeLine: 714, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!567 = !DILocalVariable(name: "ec", arg: 1, scope: !566, file: !3, line: 713, type: !141)
!568 = !DILocation(line: 713, column: 28, scope: !566)
!569 = !DILocalVariable(name: "xec", arg: 2, scope: !566, file: !3, line: 713, type: !132)
!570 = !DILocation(line: 713, column: 35, scope: !566)
!571 = !DILocalVariable(name: "ret", scope: !566, file: !3, line: 715, type: !127)
!572 = !DILocation(line: 715, column: 7, scope: !566)
!573 = !DILocation(line: 717, column: 6, scope: !574)
!574 = distinct !DILexicalBlock(scope: !566, file: !3, line: 717, column: 6)
!575 = !DILocation(line: 717, column: 10, scope: !574)
!576 = !DILocation(line: 717, column: 6, scope: !566)
!577 = !DILocation(line: 718, column: 3, scope: !574)
!578 = !DILocation(line: 719, column: 11, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !3, line: 719, column: 11)
!580 = !DILocation(line: 719, column: 15, scope: !579)
!581 = !DILocation(line: 719, column: 11, scope: !574)
!582 = !DILocation(line: 720, column: 3, scope: !579)
!583 = !DILocation(line: 721, column: 11, scope: !584)
!584 = distinct !DILexicalBlock(scope: !579, file: !3, line: 721, column: 11)
!585 = !DILocation(line: 721, column: 15, scope: !584)
!586 = !DILocation(line: 721, column: 22, scope: !584)
!587 = !DILocation(line: 721, column: 25, scope: !584)
!588 = !DILocation(line: 721, column: 11, scope: !579)
!589 = !DILocation(line: 722, column: 3, scope: !584)
!590 = !DILocation(line: 723, column: 11, scope: !591)
!591 = distinct !DILexicalBlock(scope: !584, file: !3, line: 723, column: 11)
!592 = !DILocation(line: 723, column: 15, scope: !591)
!593 = !DILocation(line: 723, column: 11, scope: !584)
!594 = !DILocation(line: 724, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !3, line: 724, column: 7)
!596 = distinct !DILexicalBlock(scope: !591, file: !3, line: 723, column: 23)
!597 = !DILocation(line: 724, column: 7, scope: !596)
!598 = !DILocation(line: 725, column: 4, scope: !595)
!599 = !DILocation(line: 727, column: 12, scope: !600)
!600 = distinct !DILexicalBlock(scope: !595, file: !3, line: 727, column: 12)
!601 = !DILocation(line: 727, column: 12, scope: !595)
!602 = !DILocation(line: 728, column: 4, scope: !600)
!603 = !DILocation(line: 730, column: 12, scope: !604)
!604 = distinct !DILexicalBlock(scope: !600, file: !3, line: 730, column: 12)
!605 = !DILocation(line: 730, column: 12, scope: !600)
!606 = !DILocalVariable(name: "r4", scope: !607, file: !3, line: 731, type: !132)
!607 = distinct !DILexicalBlock(scope: !604, file: !3, line: 730, column: 27)
!608 = !DILocation(line: 731, column: 7, scope: !607)
!609 = !DILocation(line: 731, column: 12, scope: !607)
!610 = !DILocation(line: 733, column: 8, scope: !611)
!611 = distinct !DILexicalBlock(scope: !607, file: !3, line: 733, column: 8)
!612 = !DILocation(line: 733, column: 11, scope: !611)
!613 = !DILocation(line: 733, column: 8, scope: !607)
!614 = !DILocation(line: 734, column: 5, scope: !611)
!615 = !DILocation(line: 736, column: 13, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !3, line: 736, column: 13)
!617 = !DILocation(line: 736, column: 16, scope: !616)
!618 = !DILocation(line: 736, column: 13, scope: !611)
!619 = !DILocation(line: 737, column: 5, scope: !616)
!620 = !DILocation(line: 740, column: 9, scope: !616)
!621 = !DILocation(line: 741, column: 3, scope: !607)
!622 = !DILocation(line: 742, column: 8, scope: !604)
!623 = !DILocation(line: 743, column: 2, scope: !596)
!624 = !DILocation(line: 744, column: 7, scope: !591)
!625 = !DILocation(line: 746, column: 9, scope: !566)
!626 = !DILocation(line: 746, column: 2, scope: !566)
!627 = distinct !DISubprogram(name: "f10h_mc0_mce", scope: !3, file: !3, line: 449, type: !139, scopeLine: 450, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!628 = !DILocalVariable(name: "ec", arg: 1, scope: !627, file: !3, line: 449, type: !141)
!629 = !DILocation(line: 449, column: 30, scope: !627)
!630 = !DILocalVariable(name: "xec", arg: 2, scope: !627, file: !3, line: 449, type: !132)
!631 = !DILocation(line: 449, column: 37, scope: !627)
!632 = !DILocation(line: 451, column: 6, scope: !633)
!633 = distinct !DILexicalBlock(scope: !627, file: !3, line: 451, column: 6)
!634 = !DILocation(line: 451, column: 13, scope: !633)
!635 = !DILocation(line: 451, column: 23, scope: !633)
!636 = !DILocation(line: 451, column: 26, scope: !633)
!637 = !DILocation(line: 451, column: 33, scope: !633)
!638 = !DILocation(line: 451, column: 6, scope: !627)
!639 = !DILocation(line: 452, column: 3, scope: !640)
!640 = distinct !DILexicalBlock(scope: !633, file: !3, line: 451, column: 43)
!641 = !DILocation(line: 453, column: 3, scope: !640)
!642 = !DILocation(line: 455, column: 22, scope: !627)
!643 = !DILocation(line: 455, column: 26, scope: !627)
!644 = !DILocation(line: 455, column: 9, scope: !627)
!645 = !DILocation(line: 455, column: 2, scope: !627)
!646 = !DILocation(line: 456, column: 1, scope: !627)
!647 = distinct !DISubprogram(name: "f12h_mc0_mce", scope: !3, file: !3, line: 431, type: !139, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!648 = !DILocalVariable(name: "ec", arg: 1, scope: !647, file: !3, line: 431, type: !141)
!649 = !DILocation(line: 431, column: 30, scope: !647)
!650 = !DILocalVariable(name: "xec", arg: 2, scope: !647, file: !3, line: 431, type: !132)
!651 = !DILocation(line: 431, column: 37, scope: !647)
!652 = !DILocalVariable(name: "ret", scope: !647, file: !3, line: 433, type: !127)
!653 = !DILocation(line: 433, column: 7, scope: !647)
!654 = !DILocation(line: 435, column: 6, scope: !655)
!655 = distinct !DILexicalBlock(scope: !647, file: !3, line: 435, column: 6)
!656 = !DILocation(line: 435, column: 6, scope: !647)
!657 = !DILocalVariable(name: "ll", scope: !658, file: !3, line: 436, type: !132)
!658 = distinct !DILexicalBlock(scope: !655, file: !3, line: 435, column: 21)
!659 = !DILocation(line: 436, column: 6, scope: !658)
!660 = !DILocation(line: 436, column: 11, scope: !658)
!661 = !DILocation(line: 437, column: 7, scope: !658)
!662 = !DILocation(line: 439, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !658, file: !3, line: 439, column: 7)
!664 = !DILocation(line: 439, column: 10, scope: !663)
!665 = !DILocation(line: 439, column: 7, scope: !658)
!666 = !DILocation(line: 440, column: 4, scope: !663)
!667 = !DILocation(line: 441, column: 12, scope: !668)
!668 = distinct !DILexicalBlock(scope: !663, file: !3, line: 441, column: 12)
!669 = !DILocation(line: 441, column: 15, scope: !668)
!670 = !DILocation(line: 441, column: 12, scope: !663)
!671 = !DILocation(line: 442, column: 4, scope: !668)
!672 = !DILocation(line: 444, column: 8, scope: !668)
!673 = !DILocation(line: 445, column: 2, scope: !658)
!674 = !DILocation(line: 446, column: 9, scope: !647)
!675 = !DILocation(line: 446, column: 2, scope: !647)
!676 = distinct !DISubprogram(name: "cat_mc0_mce", scope: !3, file: !3, line: 468, type: !139, scopeLine: 469, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!677 = !DILocalVariable(name: "ec", arg: 1, scope: !676, file: !3, line: 468, type: !141)
!678 = !DILocation(line: 468, column: 29, scope: !676)
!679 = !DILocalVariable(name: "xec", arg: 2, scope: !676, file: !3, line: 468, type: !132)
!680 = !DILocation(line: 468, column: 36, scope: !676)
!681 = !DILocalVariable(name: "r4", scope: !676, file: !3, line: 470, type: !132)
!682 = !DILocation(line: 470, column: 5, scope: !676)
!683 = !DILocation(line: 470, column: 11, scope: !676)
!684 = !DILocalVariable(name: "ret", scope: !676, file: !3, line: 471, type: !127)
!685 = !DILocation(line: 471, column: 7, scope: !676)
!686 = !DILocation(line: 473, column: 6, scope: !687)
!687 = distinct !DILexicalBlock(scope: !676, file: !3, line: 473, column: 6)
!688 = !DILocation(line: 473, column: 6, scope: !676)
!689 = !DILocation(line: 475, column: 7, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !3, line: 475, column: 7)
!691 = distinct !DILexicalBlock(scope: !687, file: !3, line: 473, column: 21)
!692 = !DILocation(line: 475, column: 14, scope: !690)
!693 = !DILocation(line: 475, column: 25, scope: !690)
!694 = !DILocation(line: 475, column: 28, scope: !690)
!695 = !DILocation(line: 475, column: 35, scope: !690)
!696 = !DILocation(line: 475, column: 7, scope: !691)
!697 = !DILocation(line: 476, column: 4, scope: !690)
!698 = !DILocation(line: 478, column: 11, scope: !691)
!699 = !DILocation(line: 478, column: 3, scope: !691)
!700 = !DILocation(line: 481, column: 4, scope: !701)
!701 = distinct !DILexicalBlock(scope: !691, file: !3, line: 478, column: 15)
!702 = !DILocation(line: 483, column: 4, scope: !701)
!703 = !DILocation(line: 485, column: 4, scope: !701)
!704 = !DILocation(line: 486, column: 4, scope: !701)
!705 = !DILocation(line: 488, column: 4, scope: !701)
!706 = !DILocation(line: 489, column: 4, scope: !701)
!707 = !DILocation(line: 491, column: 8, scope: !701)
!708 = !DILocation(line: 492, column: 3, scope: !701)
!709 = !DILocation(line: 493, column: 2, scope: !691)
!710 = !DILocation(line: 493, column: 13, scope: !711)
!711 = distinct !DILexicalBlock(scope: !687, file: !3, line: 493, column: 13)
!712 = !DILocation(line: 493, column: 13, scope: !687)
!713 = !DILocation(line: 495, column: 8, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !3, line: 495, column: 7)
!715 = distinct !DILexicalBlock(scope: !711, file: !3, line: 493, column: 28)
!716 = !DILocation(line: 495, column: 15, scope: !714)
!717 = !DILocation(line: 495, column: 25, scope: !714)
!718 = !DILocation(line: 495, column: 28, scope: !714)
!719 = !DILocation(line: 495, column: 35, scope: !714)
!720 = !DILocation(line: 495, column: 45, scope: !714)
!721 = !DILocation(line: 495, column: 48, scope: !714)
!722 = !DILocation(line: 495, column: 55, scope: !714)
!723 = !DILocation(line: 495, column: 7, scope: !715)
!724 = !DILocation(line: 496, column: 4, scope: !714)
!725 = !DILocation(line: 498, column: 3, scope: !715)
!726 = !DILocation(line: 500, column: 11, scope: !715)
!727 = !DILocation(line: 500, column: 3, scope: !715)
!728 = !DILocation(line: 502, column: 4, scope: !729)
!729 = distinct !DILexicalBlock(scope: !715, file: !3, line: 500, column: 15)
!730 = !DILocation(line: 503, column: 4, scope: !729)
!731 = !DILocation(line: 505, column: 4, scope: !729)
!732 = !DILocation(line: 506, column: 4, scope: !729)
!733 = !DILocation(line: 508, column: 4, scope: !729)
!734 = !DILocation(line: 509, column: 4, scope: !729)
!735 = !DILocation(line: 511, column: 8, scope: !729)
!736 = !DILocation(line: 512, column: 3, scope: !729)
!737 = !DILocation(line: 513, column: 2, scope: !715)
!738 = !DILocation(line: 514, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !711, file: !3, line: 513, column: 9)
!740 = !DILocation(line: 517, column: 9, scope: !676)
!741 = !DILocation(line: 517, column: 2, scope: !676)
!742 = !DILocation(line: 518, column: 1, scope: !676)
!743 = distinct !DISubprogram(name: "cat_mc1_mce", scope: !3, file: !3, line: 628, type: !139, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!744 = !DILocalVariable(name: "ec", arg: 1, scope: !743, file: !3, line: 628, type: !141)
!745 = !DILocation(line: 628, column: 29, scope: !743)
!746 = !DILocalVariable(name: "xec", arg: 2, scope: !743, file: !3, line: 628, type: !132)
!747 = !DILocation(line: 628, column: 36, scope: !743)
!748 = !DILocalVariable(name: "r4", scope: !743, file: !3, line: 630, type: !132)
!749 = !DILocation(line: 630, column: 5, scope: !743)
!750 = !DILocation(line: 630, column: 13, scope: !743)
!751 = !DILocalVariable(name: "ret", scope: !743, file: !3, line: 631, type: !127)
!752 = !DILocation(line: 631, column: 7, scope: !743)
!753 = !DILocation(line: 633, column: 7, scope: !754)
!754 = distinct !DILexicalBlock(scope: !743, file: !3, line: 633, column: 6)
!755 = !DILocation(line: 633, column: 6, scope: !743)
!756 = !DILocation(line: 634, column: 3, scope: !754)
!757 = !DILocation(line: 636, column: 6, scope: !758)
!758 = distinct !DILexicalBlock(scope: !743, file: !3, line: 636, column: 6)
!759 = !DILocation(line: 636, column: 13, scope: !758)
!760 = !DILocation(line: 636, column: 6, scope: !743)
!761 = !DILocation(line: 637, column: 3, scope: !758)
!762 = !DILocation(line: 639, column: 6, scope: !763)
!763 = distinct !DILexicalBlock(scope: !743, file: !3, line: 639, column: 6)
!764 = !DILocation(line: 639, column: 9, scope: !763)
!765 = !DILocation(line: 639, column: 6, scope: !743)
!766 = !DILocation(line: 640, column: 3, scope: !763)
!767 = !DILocation(line: 641, column: 11, scope: !768)
!768 = distinct !DILexicalBlock(scope: !763, file: !3, line: 641, column: 11)
!769 = !DILocation(line: 641, column: 14, scope: !768)
!770 = !DILocation(line: 641, column: 11, scope: !763)
!771 = !DILocation(line: 642, column: 3, scope: !768)
!772 = !DILocation(line: 643, column: 11, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !3, line: 643, column: 11)
!774 = !DILocation(line: 643, column: 15, scope: !773)
!775 = !DILocation(line: 643, column: 11, scope: !768)
!776 = !DILocation(line: 644, column: 3, scope: !773)
!777 = !DILocation(line: 645, column: 11, scope: !778)
!778 = distinct !DILexicalBlock(scope: !773, file: !3, line: 645, column: 11)
!779 = !DILocation(line: 645, column: 15, scope: !778)
!780 = !DILocation(line: 645, column: 11, scope: !773)
!781 = !DILocation(line: 646, column: 3, scope: !778)
!782 = !DILocation(line: 648, column: 7, scope: !778)
!783 = !DILocation(line: 650, column: 9, scope: !743)
!784 = !DILocation(line: 650, column: 2, scope: !743)
!785 = !DILocation(line: 651, column: 1, scope: !743)
!786 = distinct !DISubprogram(name: "f15h_mc0_mce", scope: !3, file: !3, line: 520, type: !139, scopeLine: 521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!787 = !DILocalVariable(name: "ec", arg: 1, scope: !786, file: !3, line: 520, type: !141)
!788 = !DILocation(line: 520, column: 30, scope: !786)
!789 = !DILocalVariable(name: "xec", arg: 2, scope: !786, file: !3, line: 520, type: !132)
!790 = !DILocation(line: 520, column: 37, scope: !786)
!791 = !DILocalVariable(name: "ret", scope: !786, file: !3, line: 522, type: !127)
!792 = !DILocation(line: 522, column: 7, scope: !786)
!793 = !DILocation(line: 524, column: 6, scope: !794)
!794 = distinct !DILexicalBlock(scope: !786, file: !3, line: 524, column: 6)
!795 = !DILocation(line: 524, column: 6, scope: !786)
!796 = !DILocation(line: 526, column: 11, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !3, line: 524, column: 21)
!798 = !DILocation(line: 526, column: 3, scope: !797)
!799 = !DILocation(line: 528, column: 4, scope: !800)
!800 = distinct !DILexicalBlock(scope: !797, file: !3, line: 526, column: 16)
!801 = !DILocation(line: 529, column: 4, scope: !800)
!802 = !DILocation(line: 532, column: 4, scope: !800)
!803 = !DILocation(line: 533, column: 4, scope: !800)
!804 = !DILocation(line: 537, column: 4, scope: !800)
!805 = !DILocation(line: 538, column: 4, scope: !800)
!806 = !DILocation(line: 541, column: 4, scope: !800)
!807 = !DILocation(line: 542, column: 4, scope: !800)
!808 = !DILocation(line: 545, column: 4, scope: !800)
!809 = !DILocation(line: 546, column: 4, scope: !800)
!810 = !DILocation(line: 549, column: 4, scope: !800)
!811 = !DILocation(line: 550, column: 4, scope: !800)
!812 = !DILocation(line: 553, column: 8, scope: !800)
!813 = !DILocation(line: 554, column: 3, scope: !800)
!814 = !DILocation(line: 555, column: 2, scope: !797)
!815 = !DILocation(line: 555, column: 13, scope: !816)
!816 = distinct !DILexicalBlock(scope: !794, file: !3, line: 555, column: 13)
!817 = !DILocation(line: 555, column: 13, scope: !794)
!818 = !DILocation(line: 557, column: 8, scope: !819)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 557, column: 7)
!820 = distinct !DILexicalBlock(scope: !816, file: !3, line: 555, column: 28)
!821 = !DILocation(line: 557, column: 7, scope: !820)
!822 = !DILocation(line: 558, column: 4, scope: !819)
!823 = !DILocation(line: 560, column: 4, scope: !819)
!824 = !DILocation(line: 561, column: 2, scope: !820)
!825 = !DILocation(line: 561, column: 13, scope: !826)
!826 = distinct !DILexicalBlock(scope: !816, file: !3, line: 561, column: 13)
!827 = !DILocation(line: 561, column: 13, scope: !816)
!828 = !DILocation(line: 562, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !3, line: 562, column: 7)
!830 = distinct !DILexicalBlock(scope: !826, file: !3, line: 561, column: 28)
!831 = !DILocation(line: 562, column: 11, scope: !829)
!832 = !DILocation(line: 562, column: 7, scope: !830)
!833 = !DILocation(line: 563, column: 4, scope: !829)
!834 = !DILocation(line: 565, column: 8, scope: !829)
!835 = !DILocation(line: 567, column: 2, scope: !830)
!836 = !DILocation(line: 568, column: 7, scope: !826)
!837 = !DILocation(line: 570, column: 9, scope: !786)
!838 = !DILocation(line: 570, column: 2, scope: !786)
!839 = distinct !DISubprogram(name: "f15h_mc1_mce", scope: !3, file: !3, line: 653, type: !139, scopeLine: 654, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!840 = !DILocalVariable(name: "ec", arg: 1, scope: !839, file: !3, line: 653, type: !141)
!841 = !DILocation(line: 653, column: 30, scope: !839)
!842 = !DILocalVariable(name: "xec", arg: 2, scope: !839, file: !3, line: 653, type: !132)
!843 = !DILocation(line: 653, column: 37, scope: !839)
!844 = !DILocalVariable(name: "ret", scope: !839, file: !3, line: 655, type: !127)
!845 = !DILocation(line: 655, column: 7, scope: !839)
!846 = !DILocation(line: 657, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !839, file: !3, line: 657, column: 6)
!848 = !DILocation(line: 657, column: 6, scope: !839)
!849 = !DILocation(line: 658, column: 3, scope: !847)
!850 = !DILocation(line: 660, column: 10, scope: !839)
!851 = !DILocation(line: 660, column: 2, scope: !839)
!852 = !DILocation(line: 662, column: 3, scope: !853)
!853 = distinct !DILexicalBlock(scope: !839, file: !3, line: 660, column: 15)
!854 = !DILocation(line: 663, column: 3, scope: !853)
!855 = !DILocation(line: 666, column: 3, scope: !853)
!856 = !DILocation(line: 667, column: 3, scope: !853)
!857 = !DILocation(line: 670, column: 3, scope: !853)
!858 = !DILocation(line: 671, column: 3, scope: !853)
!859 = !DILocation(line: 674, column: 3, scope: !853)
!860 = !DILocation(line: 675, column: 3, scope: !853)
!861 = !DILocation(line: 678, column: 7, scope: !853)
!862 = !DILocation(line: 679, column: 2, scope: !853)
!863 = !DILocation(line: 680, column: 9, scope: !839)
!864 = !DILocation(line: 680, column: 2, scope: !839)
!865 = !DILocation(line: 681, column: 1, scope: !839)
!866 = distinct !DISubprogram(name: "f15h_mc2_mce", scope: !3, file: !3, line: 749, type: !139, scopeLine: 750, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!867 = !DILocalVariable(name: "ec", arg: 1, scope: !866, file: !3, line: 749, type: !141)
!868 = !DILocation(line: 749, column: 30, scope: !866)
!869 = !DILocalVariable(name: "xec", arg: 2, scope: !866, file: !3, line: 749, type: !132)
!870 = !DILocation(line: 749, column: 37, scope: !866)
!871 = !DILocalVariable(name: "ret", scope: !866, file: !3, line: 751, type: !127)
!872 = !DILocation(line: 751, column: 7, scope: !866)
!873 = !DILocation(line: 753, column: 6, scope: !874)
!874 = distinct !DILexicalBlock(scope: !866, file: !3, line: 753, column: 6)
!875 = !DILocation(line: 753, column: 6, scope: !866)
!876 = !DILocation(line: 754, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !3, line: 754, column: 7)
!878 = distinct !DILexicalBlock(scope: !874, file: !3, line: 753, column: 21)
!879 = !DILocation(line: 754, column: 11, scope: !877)
!880 = !DILocation(line: 754, column: 7, scope: !878)
!881 = !DILocation(line: 755, column: 4, scope: !877)
!882 = !DILocation(line: 756, column: 12, scope: !883)
!883 = distinct !DILexicalBlock(scope: !877, file: !3, line: 756, column: 12)
!884 = !DILocation(line: 756, column: 16, scope: !883)
!885 = !DILocation(line: 756, column: 12, scope: !877)
!886 = !DILocation(line: 757, column: 4, scope: !883)
!887 = !DILocation(line: 759, column: 8, scope: !883)
!888 = !DILocation(line: 760, column: 2, scope: !878)
!889 = !DILocation(line: 760, column: 13, scope: !890)
!890 = distinct !DILexicalBlock(scope: !874, file: !3, line: 760, column: 13)
!891 = !DILocation(line: 760, column: 13, scope: !874)
!892 = !DILocation(line: 761, column: 7, scope: !893)
!893 = distinct !DILexicalBlock(scope: !894, file: !3, line: 761, column: 7)
!894 = distinct !DILexicalBlock(scope: !890, file: !3, line: 760, column: 28)
!895 = !DILocation(line: 761, column: 11, scope: !893)
!896 = !DILocation(line: 761, column: 7, scope: !894)
!897 = !DILocation(line: 762, column: 8, scope: !893)
!898 = !DILocation(line: 762, column: 4, scope: !893)
!899 = !DILocation(line: 764, column: 3, scope: !894)
!900 = !DILocation(line: 765, column: 2, scope: !894)
!901 = !DILocation(line: 765, column: 13, scope: !902)
!902 = distinct !DILexicalBlock(scope: !890, file: !3, line: 765, column: 13)
!903 = !DILocation(line: 765, column: 13, scope: !890)
!904 = !DILocation(line: 766, column: 11, scope: !905)
!905 = distinct !DILexicalBlock(scope: !902, file: !3, line: 765, column: 28)
!906 = !DILocation(line: 766, column: 3, scope: !905)
!907 = !DILocation(line: 768, column: 4, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !3, line: 766, column: 16)
!909 = !DILocation(line: 769, column: 4, scope: !908)
!910 = !DILocation(line: 772, column: 4, scope: !908)
!911 = !DILocation(line: 773, column: 4, scope: !908)
!912 = !DILocation(line: 776, column: 8, scope: !908)
!913 = !DILocation(line: 777, column: 3, scope: !908)
!914 = !DILocation(line: 778, column: 2, scope: !905)
!915 = !DILocation(line: 778, column: 13, scope: !916)
!916 = distinct !DILexicalBlock(scope: !902, file: !3, line: 778, column: 13)
!917 = !DILocation(line: 778, column: 13, scope: !902)
!918 = !DILocation(line: 779, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 779, column: 7)
!920 = distinct !DILexicalBlock(scope: !916, file: !3, line: 778, column: 28)
!921 = !DILocation(line: 779, column: 11, scope: !919)
!922 = !DILocation(line: 779, column: 7, scope: !920)
!923 = !DILocation(line: 780, column: 4, scope: !919)
!924 = !DILocation(line: 782, column: 8, scope: !919)
!925 = !DILocation(line: 783, column: 2, scope: !920)
!926 = !DILocation(line: 785, column: 9, scope: !866)
!927 = !DILocation(line: 785, column: 2, scope: !866)
!928 = distinct !DISubprogram(name: "f16h_mc2_mce", scope: !3, file: !3, line: 788, type: !139, scopeLine: 789, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!929 = !DILocalVariable(name: "ec", arg: 1, scope: !928, file: !3, line: 788, type: !141)
!930 = !DILocation(line: 788, column: 30, scope: !928)
!931 = !DILocalVariable(name: "xec", arg: 2, scope: !928, file: !3, line: 788, type: !132)
!932 = !DILocation(line: 788, column: 37, scope: !928)
!933 = !DILocalVariable(name: "r4", scope: !928, file: !3, line: 790, type: !132)
!934 = !DILocation(line: 790, column: 5, scope: !928)
!935 = !DILocation(line: 790, column: 10, scope: !928)
!936 = !DILocation(line: 792, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !928, file: !3, line: 792, column: 6)
!938 = !DILocation(line: 792, column: 6, scope: !928)
!939 = !DILocation(line: 793, column: 3, scope: !937)
!940 = !DILocation(line: 795, column: 10, scope: !928)
!941 = !DILocation(line: 795, column: 2, scope: !928)
!942 = !DILocation(line: 797, column: 3, scope: !943)
!943 = distinct !DILexicalBlock(scope: !928, file: !3, line: 795, column: 15)
!944 = !DILocation(line: 798, column: 3, scope: !943)
!945 = !DILocation(line: 802, column: 3, scope: !943)
!946 = !DILocation(line: 805, column: 3, scope: !943)
!947 = !DILocation(line: 809, column: 3, scope: !943)
!948 = !DILocation(line: 813, column: 3, scope: !943)
!949 = !DILocation(line: 817, column: 3, scope: !943)
!950 = !DILocation(line: 820, column: 3, scope: !943)
!951 = !DILocation(line: 823, column: 3, scope: !943)
!952 = !DILocation(line: 826, column: 2, scope: !928)
!953 = !DILocation(line: 827, column: 1, scope: !928)
!954 = distinct !DISubprogram(name: "kasan_check_read", scope: !955, file: !955, line: 34, type: !956, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!955 = !DIFile(filename: "./include/linux/kasan-checks.h", directory: "/home/lizy2001/genbc/linux")
!956 = !DISubroutineType(types: !957)
!957 = !{!127, !473, !7}
!958 = !DILocalVariable(name: "p", arg: 1, scope: !954, file: !955, line: 34, type: !473)
!959 = !DILocation(line: 34, column: 58, scope: !954)
!960 = !DILocalVariable(name: "size", arg: 2, scope: !954, file: !955, line: 34, type: !7)
!961 = !DILocation(line: 34, column: 74, scope: !954)
!962 = !DILocation(line: 36, column: 2, scope: !954)
!963 = distinct !DISubprogram(name: "kcsan_check_access", scope: !964, file: !964, line: 178, type: !965, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!964 = !DIFile(filename: "./include/linux/kcsan-checks.h", directory: "/home/lizy2001/genbc/linux")
!965 = !DISubroutineType(types: !966)
!966 = !{null, !473, !476, !67}
!967 = !DILocalVariable(name: "ptr", arg: 1, scope: !963, file: !964, line: 178, type: !473)
!968 = !DILocation(line: 178, column: 60, scope: !963)
!969 = !DILocalVariable(name: "size", arg: 2, scope: !963, file: !964, line: 178, type: !476)
!970 = !DILocation(line: 178, column: 72, scope: !963)
!971 = !DILocalVariable(name: "type", arg: 3, scope: !963, file: !964, line: 179, type: !67)
!972 = !DILocation(line: 179, column: 15, scope: !963)
!973 = !DILocation(line: 179, column: 23, scope: !963)
!974 = distinct !DISubprogram(name: "amd_decode_mce", scope: !3, file: !3, line: 1050, type: !171, scopeLine: 1051, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!975 = !DILocalVariable(name: "nb", arg: 1, scope: !974, file: !3, line: 1050, type: !173)
!976 = !DILocation(line: 1050, column: 39, scope: !974)
!977 = !DILocalVariable(name: "val", arg: 2, scope: !974, file: !3, line: 1050, type: !69)
!978 = !DILocation(line: 1050, column: 57, scope: !974)
!979 = !DILocalVariable(name: "data", arg: 3, scope: !974, file: !3, line: 1050, type: !120)
!980 = !DILocation(line: 1050, column: 68, scope: !974)
!981 = !DILocalVariable(name: "m", scope: !974, file: !3, line: 1052, type: !70)
!982 = !DILocation(line: 1052, column: 14, scope: !974)
!983 = !DILocation(line: 1052, column: 32, scope: !974)
!984 = !DILocation(line: 1052, column: 18, scope: !974)
!985 = !DILocalVariable(name: "fam", scope: !974, file: !3, line: 1053, type: !7)
!986 = !DILocation(line: 1053, column: 15, scope: !974)
!987 = !DILocation(line: 1053, column: 32, scope: !974)
!988 = !DILocation(line: 1053, column: 35, scope: !974)
!989 = !DILocation(line: 1053, column: 21, scope: !974)
!990 = !DILocalVariable(name: "ecc", scope: !974, file: !3, line: 1054, type: !67)
!991 = !DILocation(line: 1054, column: 6, scope: !974)
!992 = !DILocation(line: 1056, column: 6, scope: !993)
!993 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1056, column: 6)
!994 = !DILocation(line: 1056, column: 9, scope: !993)
!995 = !DILocation(line: 1056, column: 16, scope: !993)
!996 = !DILocation(line: 1056, column: 6, scope: !974)
!997 = !DILocation(line: 1057, column: 3, scope: !993)
!998 = !DILocation(line: 1059, column: 2, scope: !974)
!999 = !DILocation(line: 1061, column: 2, scope: !974)
!1000 = !DILocation(line: 1072, column: 6, scope: !974)
!1001 = !DILocation(line: 1072, column: 6, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1072, column: 6)
!1003 = !DILocalVariable(name: "low", scope: !1004, file: !3, line: 1073, type: !105)
!1004 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 1072, column: 38)
!1005 = !DILocation(line: 1073, column: 7, scope: !1004)
!1006 = !DILocalVariable(name: "high", scope: !1004, file: !3, line: 1073, type: !105)
!1007 = !DILocation(line: 1073, column: 12, scope: !1004)
!1008 = !DILocalVariable(name: "addr", scope: !1004, file: !3, line: 1074, type: !105)
!1009 = !DILocation(line: 1074, column: 7, scope: !1004)
!1010 = !DILocation(line: 1074, column: 14, scope: !1004)
!1011 = !DILocalVariable(name: "_err", scope: !1012, file: !3, line: 1076, type: !67)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 1076, column: 8)
!1013 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1076, column: 7)
!1014 = !DILocation(line: 1076, column: 8, scope: !1012)
!1015 = !DILocalVariable(name: "_l", scope: !1012, file: !3, line: 1076, type: !107)
!1016 = !DILocation(line: 1076, column: 8, scope: !1013)
!1017 = !DILocation(line: 1076, column: 38, scope: !1013)
!1018 = !DILocation(line: 1077, column: 8, scope: !1013)
!1019 = !DILocation(line: 1077, column: 12, scope: !1013)
!1020 = !DILocation(line: 1076, column: 7, scope: !1004)
!1021 = !DILocation(line: 1078, column: 4, scope: !1013)
!1022 = !DILocation(line: 1080, column: 3, scope: !1004)
!1023 = !DILocation(line: 1081, column: 2, scope: !1004)
!1024 = !DILocation(line: 1084, column: 9, scope: !974)
!1025 = !DILocation(line: 1084, column: 12, scope: !974)
!1026 = !DILocation(line: 1084, column: 19, scope: !974)
!1027 = !DILocation(line: 1084, column: 26, scope: !974)
!1028 = !DILocation(line: 1084, column: 8, scope: !974)
!1029 = !DILocation(line: 1084, column: 6, scope: !974)
!1030 = !DILocation(line: 1085, column: 6, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1085, column: 6)
!1032 = !DILocation(line: 1085, column: 6, scope: !974)
!1033 = !DILocation(line: 1086, column: 3, scope: !1031)
!1034 = !DILocation(line: 1088, column: 6, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1088, column: 6)
!1036 = !DILocation(line: 1088, column: 10, scope: !1035)
!1037 = !DILocation(line: 1088, column: 6, scope: !974)
!1038 = !DILocation(line: 1089, column: 3, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1088, column: 19)
!1040 = !DILocation(line: 1092, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 1092, column: 7)
!1042 = !DILocation(line: 1092, column: 11, scope: !1041)
!1043 = !DILocation(line: 1092, column: 19, scope: !1041)
!1044 = !DILocation(line: 1092, column: 22, scope: !1041)
!1045 = !DILocation(line: 1092, column: 25, scope: !1041)
!1046 = !DILocation(line: 1092, column: 30, scope: !1041)
!1047 = !DILocation(line: 1092, column: 7, scope: !1039)
!1048 = !DILocation(line: 1093, column: 4, scope: !1041)
!1049 = !DILocation(line: 1094, column: 2, scope: !1039)
!1050 = !DILocation(line: 1096, column: 6, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1096, column: 6)
!1052 = !DILocation(line: 1096, column: 10, scope: !1051)
!1053 = !DILocation(line: 1096, column: 6, scope: !974)
!1054 = !DILocation(line: 1097, column: 3, scope: !1051)
!1055 = !DILocation(line: 1099, column: 2, scope: !974)
!1056 = !DILocation(line: 1101, column: 6, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1101, column: 6)
!1058 = !DILocation(line: 1101, column: 9, scope: !1057)
!1059 = !DILocation(line: 1101, column: 16, scope: !1057)
!1060 = !DILocation(line: 1101, column: 6, scope: !974)
!1061 = !DILocation(line: 1102, column: 3, scope: !1057)
!1062 = !DILocation(line: 1104, column: 6, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1104, column: 6)
!1064 = !DILocation(line: 1104, column: 9, scope: !1063)
!1065 = !DILocation(line: 1104, column: 6, scope: !974)
!1066 = !DILocation(line: 1105, column: 3, scope: !1063)
!1067 = !DILocation(line: 1107, column: 6, scope: !974)
!1068 = !DILocation(line: 1107, column: 6, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1107, column: 6)
!1070 = !DILocation(line: 1108, column: 3, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 1107, column: 38)
!1072 = !DILocation(line: 1110, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 1110, column: 7)
!1074 = !DILocation(line: 1110, column: 10, scope: !1073)
!1075 = !DILocation(line: 1110, column: 17, scope: !1073)
!1076 = !DILocation(line: 1110, column: 7, scope: !1071)
!1077 = !DILocation(line: 1111, column: 4, scope: !1073)
!1078 = !DILocation(line: 1113, column: 3, scope: !1071)
!1079 = !DILocation(line: 1115, column: 21, scope: !1071)
!1080 = !DILocation(line: 1115, column: 3, scope: !1071)
!1081 = !DILocation(line: 1116, column: 3, scope: !1071)
!1082 = !DILocation(line: 1119, column: 6, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1119, column: 6)
!1084 = !DILocation(line: 1119, column: 9, scope: !1083)
!1085 = !DILocation(line: 1119, column: 6, scope: !974)
!1086 = !DILocation(line: 1120, column: 3, scope: !1083)
!1087 = !DILocation(line: 1123, column: 15, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1123, column: 6)
!1089 = !DILocation(line: 1123, column: 7, scope: !1088)
!1090 = !DILocation(line: 1123, column: 6, scope: !974)
!1091 = !DILocation(line: 1124, column: 3, scope: !1088)
!1092 = !DILocation(line: 1126, column: 10, scope: !974)
!1093 = !DILocation(line: 1126, column: 13, scope: !974)
!1094 = !DILocation(line: 1126, column: 2, scope: !974)
!1095 = !DILocation(line: 1128, column: 18, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !974, file: !3, line: 1126, column: 19)
!1097 = !DILocation(line: 1128, column: 3, scope: !1096)
!1098 = !DILocation(line: 1129, column: 3, scope: !1096)
!1099 = !DILocation(line: 1132, column: 18, scope: !1096)
!1100 = !DILocation(line: 1132, column: 3, scope: !1096)
!1101 = !DILocation(line: 1133, column: 3, scope: !1096)
!1102 = !DILocation(line: 1136, column: 18, scope: !1096)
!1103 = !DILocation(line: 1136, column: 3, scope: !1096)
!1104 = !DILocation(line: 1137, column: 3, scope: !1096)
!1105 = !DILocation(line: 1140, column: 18, scope: !1096)
!1106 = !DILocation(line: 1140, column: 3, scope: !1096)
!1107 = !DILocation(line: 1141, column: 3, scope: !1096)
!1108 = !DILocation(line: 1144, column: 18, scope: !1096)
!1109 = !DILocation(line: 1144, column: 3, scope: !1096)
!1110 = !DILocation(line: 1145, column: 3, scope: !1096)
!1111 = !DILocation(line: 1148, column: 18, scope: !1096)
!1112 = !DILocation(line: 1148, column: 3, scope: !1096)
!1113 = !DILocation(line: 1149, column: 3, scope: !1096)
!1114 = !DILocation(line: 1152, column: 18, scope: !1096)
!1115 = !DILocation(line: 1152, column: 3, scope: !1096)
!1116 = !DILocation(line: 1153, column: 3, scope: !1096)
!1117 = !DILocation(line: 1156, column: 3, scope: !1096)
!1118 = !DILocation(line: 1157, column: 2, scope: !1096)
!1119 = !DILabel(scope: !974, name: "err_code", file: !3, line: 1159)
!1120 = !DILocation(line: 1159, column: 2, scope: !974)
!1121 = !DILocation(line: 1160, column: 22, scope: !974)
!1122 = !DILocation(line: 1160, column: 25, scope: !974)
!1123 = !DILocation(line: 1160, column: 32, scope: !974)
!1124 = !DILocation(line: 1160, column: 2, scope: !974)
!1125 = !DILocation(line: 1162, column: 2, scope: !974)
!1126 = !DILocation(line: 1162, column: 5, scope: !974)
!1127 = !DILocation(line: 1162, column: 12, scope: !974)
!1128 = !DILocation(line: 1163, column: 2, scope: !974)
!1129 = !DILocation(line: 1164, column: 1, scope: !974)
!1130 = distinct !DISubprogram(name: "decode_error_status", scope: !3, file: !3, line: 1033, type: !1131, scopeLine: 1034, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!113, !70}
!1133 = !DILocalVariable(name: "m", arg: 1, scope: !1130, file: !3, line: 1033, type: !70)
!1134 = !DILocation(line: 1033, column: 52, scope: !1130)
!1135 = !DILocation(line: 1035, column: 6, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 1035, column: 6)
!1137 = !DILocation(line: 1035, column: 9, scope: !1136)
!1138 = !DILocation(line: 1035, column: 16, scope: !1136)
!1139 = !DILocation(line: 1035, column: 6, scope: !1130)
!1140 = !DILocation(line: 1036, column: 7, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 1036, column: 7)
!1142 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 1035, column: 33)
!1143 = !DILocation(line: 1036, column: 10, scope: !1141)
!1144 = !DILocation(line: 1036, column: 17, scope: !1141)
!1145 = !DILocation(line: 1036, column: 7, scope: !1142)
!1146 = !DILocation(line: 1037, column: 4, scope: !1141)
!1147 = !DILocation(line: 1038, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 1038, column: 7)
!1149 = !DILocation(line: 1038, column: 10, scope: !1148)
!1150 = !DILocation(line: 1038, column: 20, scope: !1148)
!1151 = !DILocation(line: 1038, column: 7, scope: !1142)
!1152 = !DILocation(line: 1039, column: 4, scope: !1148)
!1153 = !DILocation(line: 1040, column: 3, scope: !1142)
!1154 = !DILocation(line: 1043, column: 6, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 1043, column: 6)
!1156 = !DILocation(line: 1043, column: 9, scope: !1155)
!1157 = !DILocation(line: 1043, column: 16, scope: !1155)
!1158 = !DILocation(line: 1043, column: 6, scope: !1130)
!1159 = !DILocation(line: 1044, column: 3, scope: !1155)
!1160 = !DILocation(line: 1046, column: 2, scope: !1130)
!1161 = !DILocation(line: 1047, column: 1, scope: !1130)
!1162 = distinct !DISubprogram(name: "paravirt_read_msr_safe", scope: !1163, file: !1163, line: 174, type: !1164, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!1163 = !DIFile(filename: "./arch/x86/include/asm/paravirt.h", directory: "/home/lizy2001/genbc/linux")
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!107, !7, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!1167 = !DILocalVariable(name: "msr", arg: 1, scope: !1162, file: !1163, line: 174, type: !7)
!1168 = !DILocation(line: 174, column: 51, scope: !1162)
!1169 = !DILocalVariable(name: "err", arg: 2, scope: !1162, file: !1163, line: 174, type: !1166)
!1170 = !DILocation(line: 174, column: 61, scope: !1162)
!1171 = !DILocalVariable(name: "__ret", scope: !1172, file: !1163, line: 176, type: !107)
!1172 = distinct !DILexicalBlock(scope: !1162, file: !1163, line: 176, column: 9)
!1173 = !DILocation(line: 176, column: 9, scope: !1172)
!1174 = !DILocalVariable(name: "__edi", scope: !1172, file: !1163, line: 176, type: !69)
!1175 = !DILocalVariable(name: "__esi", scope: !1172, file: !1163, line: 176, type: !69)
!1176 = !DILocalVariable(name: "__edx", scope: !1172, file: !1163, line: 176, type: !69)
!1177 = !DILocalVariable(name: "__ecx", scope: !1172, file: !1163, line: 176, type: !69)
!1178 = !DILocalVariable(name: "__eax", scope: !1172, file: !1163, line: 176, type: !69)
!1179 = !DILocation(line: 176, column: 9, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !1163, line: 176, column: 9)
!1181 = distinct !DILexicalBlock(scope: !1172, file: !1163, line: 176, column: 9)
!1182 = !{i32 -2145949477, i32 -2145946966, i32 -2145946732, i32 -2145946681, i32 -2145946653, i32 -2145946628, i32 -2145946944, i32 -2145946931, i32 -2145946493, i32 -2145946374, i32 -2145946839, i32 -2145946812, i32 -2145946784, i32 -2145946754}
!1183 = !DILocalVariable(name: "__mask", scope: !1184, file: !1163, line: 176, type: !69)
!1184 = distinct !DILexicalBlock(scope: !1180, file: !1163, line: 176, column: 9)
!1185 = !DILocation(line: 176, column: 9, scope: !1184)
!1186 = !DILocation(line: 176, column: 9, scope: !1181)
!1187 = !DILocation(line: 176, column: 2, scope: !1162)
!1188 = distinct !DISubprogram(name: "decode_smca_error", scope: !3, file: !3, line: 976, type: !1189, scopeLine: 977, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{null, !70}
!1191 = !DILocalVariable(name: "m", arg: 1, scope: !1188, file: !3, line: 976, type: !70)
!1192 = !DILocation(line: 976, column: 43, scope: !1188)
!1193 = !DILocalVariable(name: "hwid", scope: !1188, file: !3, line: 978, type: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smca_hwid", file: !42, line: 348, size: 96, elements: !1196)
!1196 = !{!1197, !1198, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "bank_type", scope: !1195, file: !42, line: 349, baseType: !7, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "hwid_mcatype", scope: !1195, file: !42, line: 350, baseType: !105, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1195, file: !42, line: 351, baseType: !132, size: 8, offset: 64)
!1200 = !DILocation(line: 978, column: 20, scope: !1188)
!1201 = !DILocalVariable(name: "bank_type", scope: !1188, file: !3, line: 979, type: !41)
!1202 = !DILocation(line: 979, column: 23, scope: !1188)
!1203 = !DILocalVariable(name: "ip_name", scope: !1188, file: !3, line: 980, type: !113)
!1204 = !DILocation(line: 980, column: 14, scope: !1188)
!1205 = !DILocalVariable(name: "xec", scope: !1188, file: !3, line: 981, type: !132)
!1206 = !DILocation(line: 981, column: 5, scope: !1188)
!1207 = !DILocation(line: 981, column: 11, scope: !1188)
!1208 = !DILocation(line: 983, column: 6, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 983, column: 6)
!1210 = !DILocation(line: 983, column: 9, scope: !1209)
!1211 = !DILocation(line: 983, column: 14, scope: !1209)
!1212 = !DILocation(line: 983, column: 6, scope: !1188)
!1213 = !DILocation(line: 984, column: 3, scope: !1209)
!1214 = !DILocation(line: 986, column: 20, scope: !1188)
!1215 = !DILocation(line: 986, column: 23, scope: !1188)
!1216 = !DILocation(line: 986, column: 9, scope: !1188)
!1217 = !DILocation(line: 986, column: 29, scope: !1188)
!1218 = !DILocation(line: 986, column: 7, scope: !1188)
!1219 = !DILocation(line: 987, column: 7, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 987, column: 6)
!1221 = !DILocation(line: 987, column: 6, scope: !1188)
!1222 = !DILocation(line: 988, column: 3, scope: !1220)
!1223 = !DILocation(line: 990, column: 14, scope: !1188)
!1224 = !DILocation(line: 990, column: 20, scope: !1188)
!1225 = !DILocation(line: 990, column: 12, scope: !1188)
!1226 = !DILocation(line: 992, column: 6, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 992, column: 6)
!1228 = !DILocation(line: 992, column: 16, scope: !1227)
!1229 = !DILocation(line: 992, column: 6, scope: !1188)
!1230 = !DILocation(line: 993, column: 3, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1227, file: !3, line: 992, column: 34)
!1232 = !DILocation(line: 994, column: 3, scope: !1231)
!1233 = !DILocation(line: 997, column: 31, scope: !1188)
!1234 = !DILocation(line: 997, column: 12, scope: !1188)
!1235 = !DILocation(line: 997, column: 10, scope: !1188)
!1236 = !DILocation(line: 999, column: 2, scope: !1188)
!1237 = !DILocation(line: 1002, column: 6, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 1002, column: 6)
!1239 = !DILocation(line: 1002, column: 27, scope: !1238)
!1240 = !DILocation(line: 1002, column: 12, scope: !1238)
!1241 = !DILocation(line: 1002, column: 38, scope: !1238)
!1242 = !DILocation(line: 1002, column: 10, scope: !1238)
!1243 = !DILocation(line: 1002, column: 6, scope: !1188)
!1244 = !DILocation(line: 1003, column: 3, scope: !1238)
!1245 = !DILocation(line: 1005, column: 6, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 1005, column: 6)
!1247 = !DILocation(line: 1005, column: 16, scope: !1246)
!1248 = !DILocation(line: 1005, column: 28, scope: !1246)
!1249 = !DILocation(line: 1005, column: 31, scope: !1246)
!1250 = !DILocation(line: 1005, column: 35, scope: !1246)
!1251 = !DILocation(line: 1005, column: 40, scope: !1246)
!1252 = !DILocation(line: 1005, column: 43, scope: !1246)
!1253 = !DILocation(line: 1005, column: 6, scope: !1188)
!1254 = !DILocation(line: 1006, column: 3, scope: !1246)
!1255 = !DILocation(line: 1006, column: 19, scope: !1246)
!1256 = !DILocation(line: 1006, column: 43, scope: !1246)
!1257 = !DILocation(line: 1007, column: 1, scope: !1188)
!1258 = distinct !DISubprogram(name: "decode_mc0_mce", scope: !3, file: !3, line: 573, type: !1189, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !126)
!1259 = !DILocalVariable(name: "m", arg: 1, scope: !1258, file: !3, line: 573, type: !70)
