; ModuleID = '../bcout/drivers/media/tuners/mt2060.llvm.bc'
source_filename = "drivers/media/tuners/mt2060.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_mt2060_driver_init6:\09\09\09"
module asm ".long\09mt2060_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.dvb_tuner_ops = type { %struct.dvb_tuner_info, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.analog_parameters*)*, i32 (%struct.dvb_frontend*, i8*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)* }
%struct.dvb_tuner_info = type { [128 x i8], i32, i32, i32, i32, i32, i32 }

!255 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !258, line: 76, baseType: !7, size: 32, elements: !259)
!258 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!260 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!265 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!266 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!267 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!268 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!269 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!270 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dvb_device_type", file: !272, line: 57, baseType: !7, size: 32, elements: !273)
!272 = !DIFile(filename: "./include/media/dvbdev.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282}
!274 = !DIEnumerator(name: "DVB_DEVICE_SEC", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "DVB_DEVICE_FRONTEND", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "DVB_DEVICE_DEMUX", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "DVB_DEVICE_DVR", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "DVB_DEVICE_CA", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "DVB_DEVICE_NET", value: 5, isUnsigned: true)
!280 = !DIEnumerator(name: "DVB_DEVICE_VIDEO", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !284, line: 305, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !287, !288, !289}
!286 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "i2c_alert_protocol", file: !291, line: 215, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "./include/linux/i2c.h", directory: "/home/lizy2001/genbc/linux")
!292 = !{!293, !294}
!293 = !DIEnumerator(name: "I2C_PROTOCOL_SMBUS_ALERT", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "I2C_PROTOCOL_SMBUS_HOST_NOTIFY", value: 1, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_prop_type", file: !296, line: 19, baseType: !7, size: 32, elements: !297)
!296 = !DIFile(filename: "./include/linux/property.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIEnumerator(name: "DEV_PROP_U8", value: 0, isUnsigned: true)
!299 = !DIEnumerator(name: "DEV_PROP_U16", value: 1, isUnsigned: true)
!300 = !DIEnumerator(name: "DEV_PROP_U32", value: 2, isUnsigned: true)
!301 = !DIEnumerator(name: "DEV_PROP_U64", value: 3, isUnsigned: true)
!302 = !DIEnumerator(name: "DEV_PROP_STRING", value: 4, isUnsigned: true)
!303 = !DIEnumerator(name: "DEV_PROP_REF", value: 5, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !305, line: 10, baseType: !7, size: 32, elements: !306)
!305 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!306 = !{!307, !308}
!307 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!308 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!309 = !{!310, !312, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !311, line: 148, baseType: !7)
!311 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!313 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !316, line: 76, flags: DIFlagFwdDecl)
!316 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!317 = !{!318, !386, !391, !396, !398, !405, !410, !415, !420, !425, !0, !427, !4324, !4326, !4331, !4559}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 22, type: !320, isLocal: true, isDefinition: true, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !322, line: 69, size: 320, elements: !323)
!322 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!323 = !{!324, !328, !329, !349, !356, !360, !364}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !322, line: 70, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !321, file: !322, line: 71, baseType: !314, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !321, file: !322, line: 72, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !322, line: 47, size: 256, elements: !333)
!333 = !{!334, !335, !340, !345}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !332, file: !322, line: 49, baseType: !7, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !322, line: 51, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!313, !325, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !332, file: !322, line: 53, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!313, !344, !339}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !332, file: !322, line: 55, baseType: !346, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !312}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !321, file: !322, line: 73, baseType: !350, size: 16, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !352, line: 19, baseType: !353)
!352 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !354, line: 24, baseType: !355)
!354 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!355 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !321, file: !322, line: 74, baseType: !357, size: 8, offset: 208)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !352, line: 16, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !354, line: 20, baseType: !359)
!359 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !322, line: 75, baseType: !361, size: 8, offset: 216)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !352, line: 17, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !354, line: 21, baseType: !363)
!363 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!364 = !DIDerivedType(tag: DW_TAG_member, scope: !321, file: !322, line: 76, baseType: !365, size: 64, offset: 256)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !321, file: !322, line: 76, size: 64, elements: !366)
!366 = !{!367, !368, !375}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !365, file: !322, line: 77, baseType: !312, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !365, file: !322, line: 78, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !322, line: 86, size: 128, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !371, file: !322, line: 87, baseType: !7, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !371, file: !322, line: 88, baseType: !344, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !365, file: !322, line: 79, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !322, line: 92, size: 256, elements: !379)
!379 = !{!380, !381, !382, !384, !385}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !378, file: !322, line: 94, baseType: !7, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !378, file: !322, line: 95, baseType: !7, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !378, file: !322, line: 96, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !378, file: !322, line: 97, baseType: !330, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !378, file: !322, line: 98, baseType: !312, size: 64, offset: 192)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 22, type: !388, isLocal: true, isDefinition: true, align: 8)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 208, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 26)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 23, type: !393, isLocal: true, isDefinition: true, align: 8)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 440, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 55)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_mt2060_driver_init224", scope: !2, file: !3, line: 535, type: !312, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__exitcall_mt2060_driver_exit", scope: !2, file: !3, line: 535, type: !400, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !401, line: 117, baseType: !402)
!401 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author225", scope: !2, file: !3, line: 537, type: !407, isLocal: true, isDefinition: true, align: 8)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 224, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 28)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description226", scope: !2, file: !3, line: 538, type: !412, isLocal: true, isDefinition: true, align: 8)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 456, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 57)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file227", scope: !2, file: !3, line: 539, type: !417, isLocal: true, isDefinition: true, align: 8)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 320, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 40)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license228", scope: !2, file: !3, line: 539, type: !422, isLocal: true, isDefinition: true, align: 8)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 152, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 19)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 21, type: !313, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "mt2060_tuner_ops", scope: !2, file: !3, line: 386, type: !429, isLocal: true, isDefinition: true)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !431)
!431 = !{!432, !447, !4298, !4299, !4300, !4301, !4302, !4303, !4307, !4308, !4309, !4310, !4311, !4312, !4313, !4314, !4319, !4323}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !430, file: !51, line: 228, baseType: !433, size: 1216)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !434)
!434 = !{!435, !439, !442, !443, !444, !445, !446}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !51, line: 89, baseType: !436, size: 1024)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 1024, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !433, file: !51, line: 91, baseType: !440, size: 32, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !352, line: 21, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !354, line: 27, baseType: !7)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !433, file: !51, line: 92, baseType: !440, size: 32, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !433, file: !51, line: 93, baseType: !440, size: 32, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !433, file: !51, line: 95, baseType: !440, size: 32, offset: 1120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !433, file: !51, line: 96, baseType: !440, size: 32, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !433, file: !51, line: 97, baseType: !440, size: 32, offset: 1184)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !430, file: !51, line: 230, baseType: !448, size: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !453)
!453 = !{!454, !468, !716, !4286, !4287, !4288, !4289, !4290, !4291, !4292, !4296, !4297}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !452, file: !51, line: 687, baseType: !455, size: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !456, line: 19, size: 32, elements: !457)
!456 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !455, file: !456, line: 20, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !460, line: 113, baseType: !461)
!460 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !460, line: 111, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !461, file: !460, line: 112, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !311, line: 168, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 166, size: 32, elements: !466)
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !465, file: !311, line: 167, baseType: !313, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !452, file: !51, line: 688, baseType: !469, size: 6016, offset: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !470)
!470 = !{!471, !483, !487, !488, !489, !490, !494, !495, !501, !508, !512, !513, !523, !608, !612, !617, !622, !623, !624, !625, !637, !648, !652, !656, !660, !665, !670, !674, !675, !676, !680, !681}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !469, file: !51, line: 436, baseType: !472, size: 1280)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !51, line: 339, baseType: !436, size: 1024)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !472, file: !51, line: 340, baseType: !440, size: 32, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !472, file: !51, line: 341, baseType: !440, size: 32, offset: 1056)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !472, file: !51, line: 342, baseType: !440, size: 32, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !472, file: !51, line: 343, baseType: !440, size: 32, offset: 1120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !472, file: !51, line: 344, baseType: !440, size: 32, offset: 1152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !472, file: !51, line: 345, baseType: !440, size: 32, offset: 1184)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !472, file: !51, line: 346, baseType: !440, size: 32, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !472, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !469, file: !51, line: 438, baseType: !484, size: 64, offset: 1280)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 64, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !469, file: !51, line: 440, baseType: !448, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !469, file: !51, line: 441, baseType: !448, size: 64, offset: 1408)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !469, file: !51, line: 442, baseType: !448, size: 64, offset: 1472)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !469, file: !51, line: 444, baseType: !491, size: 64, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!313, !451}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !469, file: !51, line: 445, baseType: !491, size: 64, offset: 1600)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !469, file: !51, line: 447, baseType: !496, size: 64, offset: 1664)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!313, !451, !499, !313}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !469, file: !51, line: 450, baseType: !502, size: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!313, !451, !505, !7, !383, !507}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !311, line: 30, baseType: !506)
!506 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !469, file: !51, line: 457, baseType: !509, size: 64, offset: 1792)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!50, !451}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !469, file: !51, line: 460, baseType: !491, size: 64, offset: 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !469, file: !51, line: 461, baseType: !514, size: 64, offset: 1920)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!313, !451, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !519)
!519 = !{!520, !521, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !518, file: !51, line: 70, baseType: !313, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !518, file: !51, line: 71, baseType: !313, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !518, file: !51, line: 72, baseType: !313, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !469, file: !51, line: 463, baseType: !524, size: 64, offset: 1984)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!313, !451, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !601, !602, !603, !604, !605, !606, !607}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !528, file: !51, line: 587, baseType: !440, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !528, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !528, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !528, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !528, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !528, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !528, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !528, file: !51, line: 595, baseType: !440, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !528, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !528, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !528, file: !51, line: 598, baseType: !440, size: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !528, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !528, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !528, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !528, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !528, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !528, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !528, file: !51, line: 610, baseType: !361, size: 8, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !528, file: !51, line: 611, baseType: !361, size: 8, offset: 552)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !528, file: !51, line: 612, baseType: !361, size: 8, offset: 560)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !528, file: !51, line: 613, baseType: !440, size: 32, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !528, file: !51, line: 614, baseType: !440, size: 32, offset: 608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !528, file: !51, line: 615, baseType: !361, size: 8, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !528, file: !51, line: 621, baseType: !554, size: 384, offset: 672)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 384, elements: !561)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !51, line: 616, size: 128, elements: !556)
!556 = !{!557, !558, !559, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !555, file: !51, line: 617, baseType: !361, size: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !555, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !555, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !555, file: !51, line: 620, baseType: !361, size: 8, offset: 96)
!561 = !{!562}
!562 = !DISubrange(count: 3)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !528, file: !51, line: 624, baseType: !440, size: 32, offset: 1056)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !528, file: !51, line: 627, baseType: !440, size: 32, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !528, file: !51, line: 630, baseType: !361, size: 8, offset: 1120)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !528, file: !51, line: 631, baseType: !361, size: 8, offset: 1128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !528, file: !51, line: 632, baseType: !361, size: 8, offset: 1136)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !528, file: !51, line: 633, baseType: !361, size: 8, offset: 1144)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !528, file: !51, line: 634, baseType: !361, size: 8, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !528, file: !51, line: 635, baseType: !361, size: 8, offset: 1160)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !528, file: !51, line: 637, baseType: !361, size: 8, offset: 1168)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !528, file: !51, line: 638, baseType: !361, size: 8, offset: 1176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !528, file: !51, line: 639, baseType: !361, size: 8, offset: 1184)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !528, file: !51, line: 640, baseType: !361, size: 8, offset: 1192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !528, file: !51, line: 641, baseType: !361, size: 8, offset: 1200)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !528, file: !51, line: 642, baseType: !361, size: 8, offset: 1208)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !528, file: !51, line: 643, baseType: !361, size: 8, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !528, file: !51, line: 644, baseType: !361, size: 8, offset: 1224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !528, file: !51, line: 645, baseType: !361, size: 8, offset: 1232)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !528, file: !51, line: 647, baseType: !440, size: 32, offset: 1248)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !528, file: !51, line: 650, baseType: !582, size: 296, offset: 1280)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !582, file: !6, line: 826, baseType: !362, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !582, file: !6, line: 827, baseType: !586, size: 288, offset: 8)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 288, elements: !599)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !587, file: !6, line: 804, baseType: !362, size: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, scope: !587, file: !6, line: 805, baseType: !591, size: 64, offset: 8)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !587, file: !6, line: 805, size: 64, elements: !592)
!592 = !{!593, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !591, file: !6, line: 806, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !354, line: 31, baseType: !595)
!595 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !591, file: !6, line: 807, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !354, line: 30, baseType: !598)
!598 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!599 = !{!600}
!600 = !DISubrange(count: 4)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !528, file: !51, line: 651, baseType: !582, size: 296, offset: 1576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !528, file: !51, line: 652, baseType: !582, size: 296, offset: 1872)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !528, file: !51, line: 653, baseType: !582, size: 296, offset: 2168)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !528, file: !51, line: 654, baseType: !582, size: 296, offset: 2464)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !528, file: !51, line: 655, baseType: !582, size: 296, offset: 2760)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !528, file: !51, line: 656, baseType: !582, size: 296, offset: 3056)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !528, file: !51, line: 657, baseType: !582, size: 296, offset: 3352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !469, file: !51, line: 466, baseType: !609, size: 64, offset: 2048)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!313, !451, !507}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !469, file: !51, line: 467, baseType: !613, size: 64, offset: 2112)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!313, !451, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !469, file: !51, line: 468, baseType: !618, size: 64, offset: 2176)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!313, !451, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !469, file: !51, line: 469, baseType: !618, size: 64, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !469, file: !51, line: 470, baseType: !613, size: 64, offset: 2304)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !469, file: !51, line: 472, baseType: !491, size: 64, offset: 2368)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !469, file: !51, line: 473, baseType: !626, size: 64, offset: 2432)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!313, !451, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !631)
!631 = !{!632, !636}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !630, file: !6, line: 174, baseType: !633, size: 48)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 48, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 6)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !630, file: !6, line: 175, baseType: !362, size: 8, offset: 48)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !469, file: !51, line: 474, baseType: !638, size: 64, offset: 2496)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!313, !451, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !643)
!643 = !{!644, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !642, file: !6, line: 196, baseType: !645, size: 32)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 32, elements: !599)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !642, file: !6, line: 197, baseType: !362, size: 8, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !642, file: !6, line: 198, baseType: !313, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !469, file: !51, line: 475, baseType: !649, size: 64, offset: 2560)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!313, !451, !171}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !469, file: !51, line: 477, baseType: !653, size: 64, offset: 2624)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!313, !451, !78}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !469, file: !51, line: 478, baseType: !657, size: 64, offset: 2688)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!313, !451, !73}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !469, file: !51, line: 480, baseType: !661, size: 64, offset: 2752)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!313, !451, !664}
!664 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !469, file: !51, line: 481, baseType: !666, size: 64, offset: 2816)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!313, !451, !669}
!669 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !469, file: !51, line: 482, baseType: !671, size: 64, offset: 2880)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!313, !451, !313}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !469, file: !51, line: 483, baseType: !671, size: 64, offset: 2944)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !469, file: !51, line: 484, baseType: !491, size: 64, offset: 3008)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !469, file: !51, line: 490, baseType: !677, size: 64, offset: 3072)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!175, !451}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !469, file: !51, line: 492, baseType: !430, size: 2304, offset: 3136)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !469, file: !51, line: 493, baseType: !682, size: 576, offset: 5440)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !683)
!683 = !{!684, !688, !700, !701, !708, !709, !710, !711, !712}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !682, file: !51, line: 304, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !51, line: 277, baseType: !344, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !682, file: !51, line: 306, baseType: !689, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !451, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !693, file: !51, line: 115, baseType: !7, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !693, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !693, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !693, file: !51, line: 118, baseType: !699, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !352, line: 23, baseType: !594)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !682, file: !51, line: 308, baseType: !618, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !682, file: !51, line: 309, baseType: !702, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!313, !451, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !352, line: 20, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !354, line: 26, baseType: !313)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !682, file: !51, line: 310, baseType: !448, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !682, file: !51, line: 311, baseType: !448, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !682, file: !51, line: 312, baseType: !448, size: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !682, file: !51, line: 313, baseType: !671, size: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !682, file: !51, line: 316, baseType: !713, size: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!313, !451, !312}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !452, file: !51, line: 689, baseType: !717, size: 64, offset: 6080)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !719)
!719 = !{!720, !721, !727, !728, !729, !731, !732, !4264, !4265, !4266, !4285}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !718, file: !272, line: 102, baseType: !313, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !718, file: !272, line: 103, baseType: !722, size: 128, offset: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !311, line: 178, size: 128, elements: !723)
!723 = !{!724, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !722, file: !311, line: 179, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !722, file: !311, line: 179, baseType: !725, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !718, file: !272, line: 104, baseType: !722, size: 128, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !718, file: !272, line: 105, baseType: !325, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !718, file: !272, line: 106, baseType: !730, size: 48, offset: 384)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 48, elements: !634)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !718, file: !272, line: 107, baseType: !312, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !718, file: !272, line: 109, baseType: !733, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !735)
!735 = !{!736, !3721, !3722, !3725, !3726, !3777, !3865, !3866, !3867, !3868, !3869, !3878, !3983, !3996, !4191, !4192, !4196, !4198, !4199, !4200, !4204, !4210, !4211, !4214, !4215, !4216, !4217, !4218, !4219, !4220, !4252, !4253, !4254, !4257, !4260, !4261, !4262, !4263}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !734, file: !237, line: 462, baseType: !737, size: 512)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !738, line: 64, size: 512, elements: !739)
!738 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!739 = !{!740, !741, !742, !744, !801, !3576, !3715, !3716, !3717, !3718, !3719, !3720}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !738, line: 65, baseType: !325, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !737, file: !738, line: 66, baseType: !722, size: 128, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !737, file: !738, line: 67, baseType: !743, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !737, file: !738, line: 68, baseType: !745, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !738, line: 192, size: 704, elements: !747)
!747 = !{!748, !749, !765, !766}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !746, file: !738, line: 193, baseType: !722, size: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !746, file: !738, line: 194, baseType: !750, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !751, line: 83, baseType: !752)
!751 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !751, line: 71, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, scope: !752, file: !751, line: 72, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !752, file: !751, line: 72, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !755, file: !751, line: 73, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !751, line: 20, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !758, file: !751, line: 21, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !762, line: 25, baseType: !763)
!762 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !762, line: 25, elements: !764)
!764 = !{}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !746, file: !738, line: 195, baseType: !737, size: 512, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !746, file: !738, line: 196, baseType: !767, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !738, line: 156, size: 192, elements: !770)
!770 = !{!771, !776, !781}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !769, file: !738, line: 157, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!313, !745, !743}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !738, line: 158, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!325, !745, !743}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !769, file: !738, line: 159, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!313, !745, !743, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !738, line: 148, size: 20736, elements: !788)
!788 = !{!789, !791, !795, !796, !800}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !787, file: !738, line: 149, baseType: !790, size: 192)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 192, elements: !561)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !787, file: !738, line: 150, baseType: !792, size: 4096, offset: 192)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 4096, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !787, file: !738, line: 151, baseType: !313, size: 32, offset: 4288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !787, file: !738, line: 152, baseType: !797, size: 16384, offset: 4320)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 16384, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 2048)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !787, file: !738, line: 153, baseType: !313, size: 32, offset: 20704)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !737, file: !738, line: 69, baseType: !802, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !738, line: 138, size: 448, elements: !804)
!804 = !{!805, !809, !836, !838, !3538, !3566, !3570}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !803, file: !738, line: 139, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !743}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !803, file: !738, line: 140, baseType: !810, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !813, line: 230, size: 128, elements: !814)
!813 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!814 = !{!815, !829}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !812, file: !813, line: 231, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !743, !823, !344}
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !311, line: 60, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !821, line: 73, baseType: !822)
!821 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !821, line: 15, baseType: !664)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !813, line: 30, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !813, line: 31, baseType: !325, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !824, file: !813, line: 32, baseType: !828, size: 16, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !311, line: 19, baseType: !355)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !812, file: !813, line: 232, baseType: !830, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!819, !743, !823, !325, !833}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !311, line: 55, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !821, line: 72, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !821, line: 16, baseType: !669)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !803, file: !738, line: 141, baseType: !837, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !803, file: !738, line: 142, baseType: !839, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !813, line: 84, size: 320, elements: !843)
!843 = !{!844, !845, !849, !3535, !3536}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !813, line: 85, baseType: !325, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !842, file: !813, line: 86, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!828, !743, !823, !313}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !842, file: !813, line: 88, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!828, !743, !853, !313}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !813, line: 168, size: 448, elements: !855)
!855 = !{!856, !857, !858, !859, !3530, !3531}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !854, file: !813, line: 169, baseType: !824, size: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !813, line: 170, baseType: !833, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !854, file: !813, line: 171, baseType: !312, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !854, file: !813, line: 172, baseType: !860, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!819, !863, !743, !853, !344, !1029, !833}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !865)
!865 = !{!866, !884, !3495, !3496, !3497, !3498, !3499, !3500, !3501, !3502, !3503, !3504, !3513, !3514, !3523, !3524, !3525, !3526, !3527, !3528, !3529}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !864, file: !208, line: 920, baseType: !867, size: 128)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !208, line: 917, size: 128, elements: !868)
!868 = !{!869, !875}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !867, file: !208, line: 918, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !871, line: 58, size: 64, elements: !872)
!871 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !871, line: 59, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !867, file: !208, line: 919, baseType: !876, size: 128, align: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !311, line: 216, size: 128, align: 64, elements: !877)
!877 = !{!878, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !876, file: !311, line: 217, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !876, file: !311, line: 218, baseType: !881, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !879}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !864, file: !208, line: 921, baseType: !885, size: 128, offset: 128)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !886, line: 8, size: 128, elements: !887)
!886 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!887 = !{!888, !892}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !885, file: !886, line: 9, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !891, line: 18, flags: DIFlagFwdDecl)
!891 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !885, file: !886, line: 10, baseType: !893, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !891, line: 89, size: 1536, elements: !895)
!895 = !{!896, !897, !907, !915, !916, !931, !3464, !3466, !3478, !3479, !3480, !3481, !3482, !3487, !3488, !3489}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !894, file: !891, line: 91, baseType: !7, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !894, file: !891, line: 92, baseType: !898, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !899, line: 277, baseType: !900)
!899 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !899, line: 277, size: 32, elements: !901)
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !900, file: !899, line: 277, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !899, line: 70, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !899, line: 65, size: 32, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !904, file: !899, line: 66, baseType: !7, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !894, file: !891, line: 93, baseType: !908, size: 128, offset: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !909, line: 38, size: 128, elements: !910)
!909 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!910 = !{!911, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !908, file: !909, line: 39, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !908, file: !909, line: 39, baseType: !914, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !894, file: !891, line: 94, baseType: !893, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !894, file: !891, line: 95, baseType: !917, size: 128, offset: 256)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !891, line: 47, size: 128, elements: !918)
!918 = !{!919, !928}
!919 = !DIDerivedType(tag: DW_TAG_member, scope: !917, file: !891, line: 48, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !917, file: !891, line: 48, size: 64, elements: !921)
!921 = !{!922, !927}
!922 = !DIDerivedType(tag: DW_TAG_member, scope: !920, file: !891, line: 49, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !920, file: !891, line: 49, size: 64, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !923, file: !891, line: 50, baseType: !440, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !923, file: !891, line: 50, baseType: !440, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !920, file: !891, line: 52, baseType: !699, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !917, file: !891, line: 54, baseType: !929, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !894, file: !891, line: 96, baseType: !932, size: 64, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !934)
!934 = !{!935, !936, !937, !945, !952, !953, !1094, !3158, !3159, !3160, !3166, !3167, !3168, !3169, !3170, !3171, !3172, !3173, !3174, !3175, !3176, !3177, !3178, !3179, !3180, !3181, !3182, !3183, !3184, !3185, !3190, !3191, !3192, !3193, !3194, !3195, !3196, !3432, !3440, !3441, !3442, !3460, !3461, !3462, !3463}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !933, file: !208, line: 611, baseType: !828, size: 16)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !933, file: !208, line: 612, baseType: !355, size: 16, offset: 16)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !933, file: !208, line: 613, baseType: !938, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !939, line: 23, baseType: !940)
!939 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 21, size: 32, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !940, file: !939, line: 22, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !311, line: 32, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !821, line: 49, baseType: !7)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !933, file: !208, line: 614, baseType: !946, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !939, line: 28, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !939, line: 26, size: 32, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !947, file: !939, line: 27, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !311, line: 33, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !821, line: 50, baseType: !7)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !933, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !933, file: !208, line: 622, baseType: !954, size: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !957)
!957 = !{!958, !962, !972, !976, !982, !986, !990, !994, !998, !1002, !1006, !1007, !1013, !1017, !1041, !1070, !1074, !1080, !1085, !1089, !1090}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !956, file: !208, line: 1865, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!893, !932, !893, !7}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !956, file: !208, line: 1866, baseType: !963, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!325, !893, !932, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !968, line: 10, size: 128, elements: !969)
!968 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !967, file: !968, line: 11, baseType: !346, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !967, file: !968, line: 12, baseType: !312, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !956, file: !208, line: 1867, baseType: !973, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!313, !932, !313}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !956, file: !208, line: 1868, baseType: !977, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!980, !932, !313}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !956, file: !208, line: 1870, baseType: !983, size: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!313, !893, !344, !313}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !956, file: !208, line: 1872, baseType: !987, size: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!313, !932, !893, !828, !505}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !956, file: !208, line: 1873, baseType: !991, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!313, !893, !932, !893}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !956, file: !208, line: 1874, baseType: !995, size: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!313, !932, !893}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !956, file: !208, line: 1875, baseType: !999, size: 64, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!313, !932, !893, !325}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !956, file: !208, line: 1876, baseType: !1003, size: 64, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!313, !932, !893, !828}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !956, file: !208, line: 1877, baseType: !995, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !956, file: !208, line: 1878, baseType: !1008, size: 64, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!313, !932, !893, !828, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !311, line: 16, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !311, line: 13, baseType: !440)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !956, file: !208, line: 1879, baseType: !1014, size: 64, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!313, !932, !893, !932, !893, !7}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !956, file: !208, line: 1881, baseType: !1018, size: 64, offset: 832)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!313, !893, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1031, !1038, !1039, !1040}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1022, file: !208, line: 220, baseType: !7, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1022, file: !208, line: 221, baseType: !828, size: 16, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1022, file: !208, line: 222, baseType: !938, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1022, file: !208, line: 223, baseType: !946, size: 32, offset: 96)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1022, file: !208, line: 224, baseType: !1029, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !311, line: 46, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !821, line: 88, baseType: !598)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1022, file: !208, line: 225, baseType: !1032, size: 128, offset: 192)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1033, line: 13, size: 128, elements: !1034)
!1033 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1034 = !{!1035, !1037}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1032, file: !1033, line: 14, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1033, line: 8, baseType: !597)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1032, file: !1033, line: 15, baseType: !664, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1022, file: !208, line: 226, baseType: !1032, size: 128, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1022, file: !208, line: 227, baseType: !1032, size: 128, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1022, file: !208, line: 234, baseType: !863, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !956, file: !208, line: 1882, baseType: !1042, size: 64, offset: 896)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!313, !1045, !1047, !440, !7}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1049, line: 22, size: 1152, elements: !1050)
!1049 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1050 = !{!1051, !1052, !1053, !1054, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1048, file: !1049, line: 23, baseType: !440, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1048, file: !1049, line: 24, baseType: !828, size: 16, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1048, file: !1049, line: 25, baseType: !7, size: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1048, file: !1049, line: 26, baseType: !1055, size: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !311, line: 104, baseType: !440)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1048, file: !1049, line: 27, baseType: !699, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1048, file: !1049, line: 28, baseType: !699, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1048, file: !1049, line: 37, baseType: !699, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1048, file: !1049, line: 38, baseType: !1011, size: 32, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1048, file: !1049, line: 39, baseType: !1011, size: 32, offset: 352)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1048, file: !1049, line: 40, baseType: !938, size: 32, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1048, file: !1049, line: 41, baseType: !946, size: 32, offset: 416)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1048, file: !1049, line: 42, baseType: !1029, size: 64, offset: 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1048, file: !1049, line: 43, baseType: !1032, size: 128, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1048, file: !1049, line: 44, baseType: !1032, size: 128, offset: 640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1048, file: !1049, line: 45, baseType: !1032, size: 128, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1048, file: !1049, line: 46, baseType: !1032, size: 128, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1048, file: !1049, line: 47, baseType: !699, size: 64, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1048, file: !1049, line: 48, baseType: !699, size: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !956, file: !208, line: 1883, baseType: !1071, size: 64, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!819, !893, !344, !833}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !956, file: !208, line: 1884, baseType: !1075, size: 64, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!313, !932, !1078, !699, !699}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !956, file: !208, line: 1886, baseType: !1081, size: 64, offset: 1088)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!313, !932, !1084, !313}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !956, file: !208, line: 1887, baseType: !1086, size: 64, offset: 1152)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!313, !932, !893, !863, !7, !828}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !956, file: !208, line: 1890, baseType: !1003, size: 64, offset: 1216)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !956, file: !208, line: 1891, baseType: !1091, size: 64, offset: 1280)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!313, !932, !980, !313}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !933, file: !208, line: 623, baseType: !1095, size: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1150, !2766, !2848, !2931, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2947, !2951, !2952, !2955, !2956, !2959, !2960, !2961, !3002, !3028, !3029, !3030, !3031, !3032, !3033, !3036, !3038, !3045, !3046, !3048, !3049, !3050, !3109, !3110, !3125, !3126, !3127, !3128, !3129, !3132, !3133, !3134, !3149, !3150, !3151, !3152, !3153, !3154, !3155, !3156, !3157}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1096, file: !208, line: 1417, baseType: !722, size: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1096, file: !208, line: 1418, baseType: !1011, size: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1096, file: !208, line: 1419, baseType: !363, size: 8, offset: 160)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1096, file: !208, line: 1420, baseType: !669, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1096, file: !208, line: 1421, baseType: !1029, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1096, file: !208, line: 1422, baseType: !1104, size: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1116, !1120, !1124, !1128, !1129, !1130, !1140, !1143, !1144, !1145, !1147, !1148, !1149}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1105, file: !208, line: 2229, baseType: !325, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1105, file: !208, line: 2230, baseType: !313, size: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1105, file: !208, line: 2238, baseType: !1110, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!313, !1113}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1115, line: 28, flags: DIFlagFwdDecl)
!1115 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1105, file: !208, line: 2239, baseType: !1117, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1105, file: !208, line: 2240, baseType: !1121, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!893, !1104, !313, !325, !312}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1105, file: !208, line: 2242, baseType: !1125, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !1095}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1105, file: !208, line: 2243, baseType: !314, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1105, file: !208, line: 2244, baseType: !1104, size: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1105, file: !208, line: 2245, baseType: !1131, size: 64, offset: 512)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !311, line: 182, size: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1131, file: !311, line: 183, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !311, line: 186, size: 128, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1135, file: !311, line: 187, baseType: !1134, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1135, file: !311, line: 187, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1105, file: !208, line: 2247, baseType: !1141, offset: 576)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1142, line: 187, elements: !764)
!1142 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1105, file: !208, line: 2248, baseType: !1141, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1105, file: !208, line: 2249, baseType: !1141, offset: 576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1105, file: !208, line: 2250, baseType: !1146, offset: 576)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, elements: !561)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1105, file: !208, line: 2252, baseType: !1141, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1105, file: !208, line: 2253, baseType: !1141, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1105, file: !208, line: 2254, baseType: !1141, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1096, file: !208, line: 1423, baseType: !1151, size: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1154)
!1154 = !{!1155, !1159, !1163, !1164, !1168, !1174, !1178, !1179, !1180, !1184, !1188, !1189, !1190, !1191, !1197, !1202, !1203, !1210, !1211, !1212, !1213, !2750, !2765}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1153, file: !208, line: 1936, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!932, !1095}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1153, file: !208, line: 1937, baseType: !1160, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !932}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1153, file: !208, line: 1938, baseType: !1160, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1153, file: !208, line: 1940, baseType: !1165, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{null, !932, !313}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1153, file: !208, line: 1941, baseType: !1169, size: 64, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!313, !932, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1153, file: !208, line: 1942, baseType: !1175, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!313, !932}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1153, file: !208, line: 1943, baseType: !1160, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1153, file: !208, line: 1944, baseType: !1125, size: 64, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1153, file: !208, line: 1945, baseType: !1181, size: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!313, !1095, !313}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1153, file: !208, line: 1946, baseType: !1185, size: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!313, !1095}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1153, file: !208, line: 1947, baseType: !1185, size: 64, offset: 640)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1153, file: !208, line: 1948, baseType: !1185, size: 64, offset: 704)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1153, file: !208, line: 1949, baseType: !1185, size: 64, offset: 768)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1153, file: !208, line: 1950, baseType: !1192, size: 64, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!313, !893, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1153, file: !208, line: 1951, baseType: !1198, size: 64, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!313, !1095, !1201, !344}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1153, file: !208, line: 1952, baseType: !1125, size: 64, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1153, file: !208, line: 1954, baseType: !1204, size: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!313, !1207, !893}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1209, line: 539, flags: DIFlagFwdDecl)
!1209 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1153, file: !208, line: 1955, baseType: !1204, size: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1153, file: !208, line: 1956, baseType: !1204, size: 64, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1153, file: !208, line: 1957, baseType: !1204, size: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1153, file: !208, line: 1963, baseType: !1214, size: 64, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!313, !1095, !1217, !310}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1219, line: 68, size: 512, align: 128, elements: !1220)
!1219 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1220 = !{!1221, !1222, !2742, !2749}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1218, file: !1219, line: 69, baseType: !669, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, scope: !1218, file: !1219, line: 77, baseType: !1223, size: 320, offset: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1218, file: !1219, line: 77, size: 320, elements: !1224)
!1224 = !{!1225, !1406, !1411, !1439, !1447, !1453, !2734, !2741}
!1225 = !DIDerivedType(tag: DW_TAG_member, scope: !1223, file: !1219, line: 78, baseType: !1226, size: 320)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1223, file: !1219, line: 78, size: 320, elements: !1227)
!1227 = !{!1228, !1229, !1404, !1405}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1226, file: !1219, line: 84, baseType: !722, size: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1226, file: !1219, line: 86, baseType: !1230, size: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1241, !1242, !1243, !1258, !1274, !1275, !1276, !1277, !1397, !1398, !1401, !1402, !1403}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1231, file: !208, line: 452, baseType: !932, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1231, file: !208, line: 453, baseType: !1235, size: 128, offset: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1236, line: 292, size: 128, elements: !1237)
!1236 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1237 = !{!1238, !1239, !1240}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1235, file: !1236, line: 293, baseType: !750)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1235, file: !1236, line: 295, baseType: !310, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1235, file: !1236, line: 296, baseType: !312, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1231, file: !208, line: 454, baseType: !310, size: 32, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1231, file: !208, line: 455, baseType: !464, size: 32, offset: 224)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1231, file: !208, line: 460, baseType: !1244, size: 128, offset: 256)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1245, line: 125, size: 128, elements: !1246)
!1245 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1246 = !{!1247, !1257}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1244, file: !1245, line: 126, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1245, line: 31, size: 64, elements: !1249)
!1249 = !{!1250}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1248, file: !1245, line: 32, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1245, line: 24, size: 192, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1252, file: !1245, line: 25, baseType: !669, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1252, file: !1245, line: 26, baseType: !1251, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1252, file: !1245, line: 27, baseType: !1251, size: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1244, file: !1245, line: 127, baseType: !1251, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1231, file: !208, line: 461, baseType: !1259, size: 256, offset: 384)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1260, line: 35, size: 256, elements: !1261)
!1260 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1261 = !{!1262, !1270, !1271, !1273}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1259, file: !1260, line: 36, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1264, line: 13, baseType: !1265)
!1264 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !311, line: 175, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 173, size: 64, elements: !1267)
!1267 = !{!1268}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1266, file: !311, line: 174, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !352, line: 22, baseType: !597)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1259, file: !1260, line: 42, baseType: !1263, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1259, file: !1260, line: 46, baseType: !1272, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !751, line: 29, baseType: !758)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1259, file: !1260, line: 47, baseType: !722, size: 128, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1231, file: !208, line: 462, baseType: !669, size: 64, offset: 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1231, file: !208, line: 463, baseType: !669, size: 64, offset: 704)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1231, file: !208, line: 464, baseType: !669, size: 64, offset: 768)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1231, file: !208, line: 465, baseType: !1278, size: 64, offset: 832)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !208, line: 367, size: 1408, elements: !1281)
!1281 = !{!1282, !1286, !1290, !1294, !1298, !1302, !1308, !1314, !1318, !1323, !1327, !1331, !1335, !1361, !1365, !1371, !1372, !1373, !1377, !1382, !1386, !1393}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1280, file: !208, line: 368, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!313, !1217, !1172}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1280, file: !208, line: 369, baseType: !1287, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!313, !863, !1217}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1280, file: !208, line: 372, baseType: !1291, size: 64, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!313, !1230, !1172}
