; ModuleID = '../bcout/drivers/media/tuners/tda18271-common.llvm.bc'
source_filename = "drivers/media/tuners/tda18271-common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }
%struct.kref = type { %struct.refcount_struct }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.atomic_t = type { i32 }

!284 = !DIEnumerator(name: "TDA18271_ANALOG", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "TDA18271_DIGITAL", value: 1, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_role", file: !282, line: 48, baseType: !5, size: 32, elements: !287)
!287 = !{!288, !289}
!288 = !DIEnumerator(name: "TDA18271_MASTER", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "TDA18271_SLAVE", value: 1, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_i2c_gate", file: !282, line: 53, baseType: !5, size: 32, elements: !291)
!291 = !{!292, !293, !294}
!292 = !DIEnumerator(name: "TDA18271_GATE_AUTO", value: 0, isUnsigned: true)
!293 = !DIEnumerator(name: "TDA18271_GATE_ANALOG", value: 1, isUnsigned: true)
!294 = !DIEnumerator(name: "TDA18271_GATE_DIGITAL", value: 2, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_ver", file: !296, line: 86, baseType: !5, size: 32, elements: !297)
!296 = !DIFile(filename: "drivers/media/tuners/tda18271-priv.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !299}
!298 = !DIEnumerator(name: "TDA18271HDC1", value: 0, isUnsigned: true)
!299 = !DIEnumerator(name: "TDA18271HDC2", value: 1, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_output_options", file: !282, line: 59, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "TDA18271_OUTPUT_LT_XT_ON", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "TDA18271_OUTPUT_LT_OFF", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "TDA18271_OUTPUT_XT_OFF", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_small_i2c", file: !282, line: 70, baseType: !5, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIEnumerator(name: "TDA18271_39_BYTE_CHUNK_INIT", value: 0, isUnsigned: true)
!308 = !DIEnumerator(name: "TDA18271_16_BYTE_CHUNK_INIT", value: 16, isUnsigned: true)
!309 = !DIEnumerator(name: "TDA18271_08_BYTE_CHUNK_INIT", value: 8, isUnsigned: true)
!310 = !DIEnumerator(name: "TDA18271_03_BYTE_CHUNK_INIT", value: 3, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 10, baseType: !5, size: 32, elements: !313)
!312 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!313 = !{!314, !315}
!314 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_pll", file: !296, line: 79, baseType: !5, size: 32, elements: !317)
!317 = !{!318, !319}
!318 = !DIEnumerator(name: "TDA18271_MAIN_PLL", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "TDA18271_CAL_PLL", value: 1, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda18271_map_type", file: !296, line: 164, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330}
!322 = !DIEnumerator(name: "MAIN_PLL", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "CAL_PLL", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "RF_CAL", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "RF_CAL_KMCO", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "RF_CAL_DC_OVER_DT", value: 4, isUnsigned: true)
!327 = !DIEnumerator(name: "BP_FILTER", value: 5, isUnsigned: true)
!328 = !DIEnumerator(name: "RF_BAND", value: 6, isUnsigned: true)
!329 = !DIEnumerator(name: "GAIN_TAPER", value: 7, isUnsigned: true)
!330 = !DIEnumerator(name: "IR_MEASURE", value: 8, isUnsigned: true)
!331 = !{i32 7, !"Dwarf Version", i32 4}
!332 = !{i32 2, !"Debug Info Version", i32 3}
!333 = !{i32 1, !"wchar_size", i32 2}
!334 = !{i32 1, !"Code Model", i32 2}
!335 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!336 = distinct !DISubprogram(name: "tda18271_read_regs", scope: !1, file: !1, line: 109, type: !337, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !713)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !340}
!339 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !49, line: 686, size: 10240, elements: !342)
!342 = !{!343, !358, !663, !4243, !4244, !4245, !4246, !4247, !4248, !4249, !4253, !4254}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !341, file: !49, line: 687, baseType: !344, size: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !345, line: 19, size: 32, elements: !346)
!345 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !344, file: !345, line: 20, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !349, line: 113, baseType: !350)
!349 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !349, line: 111, size: 32, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !350, file: !349, line: 112, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !354, line: 168, baseType: !355)
!354 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 166, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !355, file: !354, line: 167, baseType: !339, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !341, file: !49, line: 688, baseType: !359, size: 6016, offset: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !49, line: 435, size: 6016, elements: !360)
!360 = !{!361, !381, !388, !392, !393, !394, !396, !397, !403, !411, !415, !416, !426, !511, !515, !520, !528, !529, !530, !531, !543, !554, !558, !562, !566, !571, !576, !580, !581, !582, !586, !644}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !359, file: !49, line: 436, baseType: !362, size: 1280)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !49, line: 338, size: 1280, elements: !363)
!363 = !{!364, !369, !374, !375, !376, !377, !378, !379, !380}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !49, line: 339, baseType: !365, size: 1024)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1024, elements: !367)
!366 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!367 = !{!368}
!368 = !DISubrange(count: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !362, file: !49, line: 340, baseType: !370, size: 32, offset: 1024)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !371, line: 21, baseType: !372)
!371 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !373, line: 27, baseType: !5)
!373 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !362, file: !49, line: 341, baseType: !370, size: 32, offset: 1056)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !362, file: !49, line: 342, baseType: !370, size: 32, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !362, file: !49, line: 343, baseType: !370, size: 32, offset: 1120)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !362, file: !49, line: 344, baseType: !370, size: 32, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !362, file: !49, line: 345, baseType: !370, size: 32, offset: 1184)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !362, file: !49, line: 346, baseType: !370, size: 32, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !362, file: !49, line: 347, baseType: !3, size: 32, offset: 1248)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !359, file: !49, line: 438, baseType: !382, size: 64, offset: 1280)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 64, elements: !386)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !371, line: 17, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !373, line: 21, baseType: !385)
!385 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!386 = !{!387}
!387 = !DISubrange(count: 8)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !359, file: !49, line: 440, baseType: !389, size: 64, offset: 1344)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !340}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !359, file: !49, line: 441, baseType: !389, size: 64, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !359, file: !49, line: 442, baseType: !389, size: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !359, file: !49, line: 444, baseType: !395, size: 64, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !359, file: !49, line: 445, baseType: !395, size: 64, offset: 1600)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !359, file: !49, line: 447, baseType: !398, size: 64, offset: 1664)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!339, !340, !401, !339}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !359, file: !49, line: 450, baseType: !404, size: 64, offset: 1728)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!339, !340, !407, !5, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !354, line: 30, baseType: !408)
!408 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !359, file: !49, line: 457, baseType: !412, size: 64, offset: 1792)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!48, !340}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !359, file: !49, line: 460, baseType: !395, size: 64, offset: 1856)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !359, file: !49, line: 461, baseType: !417, size: 64, offset: 1920)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!339, !340, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !49, line: 69, size: 96, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !421, file: !49, line: 70, baseType: !339, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !421, file: !49, line: 71, baseType: !339, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !421, file: !49, line: 72, baseType: !339, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !359, file: !49, line: 463, baseType: !427, size: 64, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!339, !340, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !49, line: 586, size: 3648, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !504, !505, !506, !507, !508, !509, !510}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !431, file: !49, line: 587, baseType: !370, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !431, file: !49, line: 588, baseType: !55, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !431, file: !49, line: 590, baseType: !71, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !431, file: !49, line: 591, baseType: !76, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !431, file: !49, line: 592, baseType: !80, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !431, file: !49, line: 593, baseType: !85, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !431, file: !49, line: 594, baseType: !100, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !431, file: !49, line: 595, baseType: !370, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !431, file: !49, line: 596, baseType: !111, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !431, file: !49, line: 597, baseType: !124, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !431, file: !49, line: 598, baseType: !370, size: 32, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !431, file: !49, line: 599, baseType: !85, size: 32, offset: 352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !431, file: !49, line: 600, baseType: !85, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !431, file: !49, line: 602, baseType: !131, size: 32, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !431, file: !49, line: 603, baseType: !136, size: 32, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !431, file: !49, line: 605, baseType: !142, size: 32, offset: 480)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !431, file: !49, line: 607, baseType: !163, size: 32, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !431, file: !49, line: 610, baseType: !383, size: 8, offset: 544)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !431, file: !49, line: 611, baseType: !383, size: 8, offset: 552)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !431, file: !49, line: 612, baseType: !383, size: 8, offset: 560)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !431, file: !49, line: 613, baseType: !370, size: 32, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !431, file: !49, line: 614, baseType: !370, size: 32, offset: 608)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !431, file: !49, line: 615, baseType: !383, size: 8, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !431, file: !49, line: 621, baseType: !457, size: 384, offset: 672)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 384, elements: !464)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !431, file: !49, line: 616, size: 128, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !458, file: !49, line: 617, baseType: !383, size: 8)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !458, file: !49, line: 618, baseType: !85, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !458, file: !49, line: 619, baseType: !55, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !458, file: !49, line: 620, baseType: !383, size: 8, offset: 96)
!464 = !{!465}
!465 = !DISubrange(count: 3)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !431, file: !49, line: 624, baseType: !370, size: 32, offset: 1056)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !431, file: !49, line: 627, baseType: !370, size: 32, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !431, file: !49, line: 630, baseType: !383, size: 8, offset: 1120)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !431, file: !49, line: 631, baseType: !383, size: 8, offset: 1128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !431, file: !49, line: 632, baseType: !383, size: 8, offset: 1136)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !431, file: !49, line: 633, baseType: !383, size: 8, offset: 1144)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !431, file: !49, line: 634, baseType: !383, size: 8, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !431, file: !49, line: 635, baseType: !383, size: 8, offset: 1160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !431, file: !49, line: 637, baseType: !383, size: 8, offset: 1168)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !431, file: !49, line: 638, baseType: !383, size: 8, offset: 1176)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !431, file: !49, line: 639, baseType: !383, size: 8, offset: 1184)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !431, file: !49, line: 640, baseType: !383, size: 8, offset: 1192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !431, file: !49, line: 641, baseType: !383, size: 8, offset: 1200)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !431, file: !49, line: 642, baseType: !383, size: 8, offset: 1208)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !431, file: !49, line: 643, baseType: !383, size: 8, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !431, file: !49, line: 644, baseType: !383, size: 8, offset: 1224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !431, file: !49, line: 645, baseType: !383, size: 8, offset: 1232)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !431, file: !49, line: 647, baseType: !370, size: 32, offset: 1248)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !431, file: !49, line: 650, baseType: !485, size: 296, offset: 1280)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !4, line: 825, size: 296, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !485, file: !4, line: 826, baseType: !384, size: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !485, file: !4, line: 827, baseType: !489, size: 288, offset: 8)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 288, elements: !502)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !4, line: 803, size: 72, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !490, file: !4, line: 804, baseType: !384, size: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !490, file: !4, line: 805, baseType: !494, size: 64, offset: 8)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !4, line: 805, size: 64, elements: !495)
!495 = !{!496, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !494, file: !4, line: 806, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !373, line: 31, baseType: !498)
!498 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !494, file: !4, line: 807, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !373, line: 30, baseType: !501)
!501 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!502 = !{!503}
!503 = !DISubrange(count: 4)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !431, file: !49, line: 651, baseType: !485, size: 296, offset: 1576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !431, file: !49, line: 652, baseType: !485, size: 296, offset: 1872)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !431, file: !49, line: 653, baseType: !485, size: 296, offset: 2168)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !431, file: !49, line: 654, baseType: !485, size: 296, offset: 2464)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !431, file: !49, line: 655, baseType: !485, size: 296, offset: 2760)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !431, file: !49, line: 656, baseType: !485, size: 296, offset: 3056)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !431, file: !49, line: 657, baseType: !485, size: 296, offset: 3352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !359, file: !49, line: 466, baseType: !512, size: 64, offset: 2048)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!339, !340, !410}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !359, file: !49, line: 467, baseType: !516, size: 64, offset: 2112)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!339, !340, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !359, file: !49, line: 468, baseType: !521, size: 64, offset: 2176)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!339, !340, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !371, line: 19, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !373, line: 24, baseType: !527)
!527 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !359, file: !49, line: 469, baseType: !521, size: 64, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !359, file: !49, line: 470, baseType: !516, size: 64, offset: 2304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !359, file: !49, line: 472, baseType: !395, size: 64, offset: 2368)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !359, file: !49, line: 473, baseType: !532, size: 64, offset: 2432)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!339, !340, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !4, line: 173, size: 56, elements: !537)
!537 = !{!538, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !536, file: !4, line: 174, baseType: !539, size: 48)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 48, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 6)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !536, file: !4, line: 175, baseType: !384, size: 8, offset: 48)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !359, file: !49, line: 474, baseType: !544, size: 64, offset: 2496)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!339, !340, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !4, line: 195, size: 96, elements: !549)
!549 = !{!550, !552, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !548, file: !4, line: 196, baseType: !551, size: 32)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 32, elements: !502)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !548, file: !4, line: 197, baseType: !384, size: 8, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !548, file: !4, line: 198, baseType: !339, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !359, file: !49, line: 475, baseType: !555, size: 64, offset: 2560)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!339, !340, !169}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !359, file: !49, line: 477, baseType: !559, size: 64, offset: 2624)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!339, !340, !76}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !359, file: !49, line: 478, baseType: !563, size: 64, offset: 2688)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!339, !340, !71}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !359, file: !49, line: 480, baseType: !567, size: 64, offset: 2752)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!339, !340, !570}
!570 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !359, file: !49, line: 481, baseType: !572, size: 64, offset: 2816)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!339, !340, !575}
!575 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !359, file: !49, line: 482, baseType: !577, size: 64, offset: 2880)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!339, !340, !339}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !359, file: !49, line: 483, baseType: !577, size: 64, offset: 2944)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !359, file: !49, line: 484, baseType: !395, size: 64, offset: 3008)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !359, file: !49, line: 490, baseType: !583, size: 64, offset: 3072)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!173, !340}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !359, file: !49, line: 492, baseType: !587, size: 2304, offset: 3136)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !49, line: 226, size: 2304, elements: !588)
!588 = !{!589, !599, !600, !601, !602, !603, !604, !605, !617, !622, !623, !624, !625, !626, !627, !634, !639, !643}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !587, file: !49, line: 228, baseType: !590, size: 1216)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !49, line: 88, size: 1216, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !590, file: !49, line: 89, baseType: !365, size: 1024)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !590, file: !49, line: 91, baseType: !370, size: 32, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !590, file: !49, line: 92, baseType: !370, size: 32, offset: 1056)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !590, file: !49, line: 93, baseType: !370, size: 32, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !590, file: !49, line: 95, baseType: !370, size: 32, offset: 1120)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !590, file: !49, line: 96, baseType: !370, size: 32, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !590, file: !49, line: 97, baseType: !370, size: 32, offset: 1184)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !587, file: !49, line: 230, baseType: !389, size: 64, offset: 1216)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !587, file: !49, line: 231, baseType: !395, size: 64, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !587, file: !49, line: 232, baseType: !395, size: 64, offset: 1344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !587, file: !49, line: 233, baseType: !395, size: 64, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !587, file: !49, line: 234, baseType: !395, size: 64, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !587, file: !49, line: 237, baseType: !395, size: 64, offset: 1536)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !587, file: !49, line: 238, baseType: !606, size: 64, offset: 1600)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!339, !340, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !49, line: 114, size: 192, elements: !611)
!611 = !{!612, !613, !614, !615}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !610, file: !49, line: 115, baseType: !5, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !610, file: !49, line: 116, baseType: !5, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !610, file: !49, line: 117, baseType: !5, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !610, file: !49, line: 118, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !371, line: 23, baseType: !497)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !587, file: !49, line: 240, baseType: !618, size: 64, offset: 1664)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!339, !340, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !587, file: !49, line: 242, baseType: !516, size: 64, offset: 1728)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !587, file: !49, line: 243, baseType: !516, size: 64, offset: 1792)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !587, file: !49, line: 244, baseType: !516, size: 64, offset: 1856)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !587, file: !49, line: 248, baseType: !516, size: 64, offset: 1920)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !587, file: !49, line: 249, baseType: !521, size: 64, offset: 1984)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !587, file: !49, line: 250, baseType: !628, size: 64, offset: 2048)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!339, !340, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !371, line: 20, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !373, line: 26, baseType: !339)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !587, file: !49, line: 258, baseType: !635, size: 64, offset: 2112)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!339, !340, !638, !339}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !587, file: !49, line: 267, baseType: !640, size: 64, offset: 2176)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!339, !340, !370}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !587, file: !49, line: 268, baseType: !640, size: 64, offset: 2240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !359, file: !49, line: 493, baseType: !645, size: 576, offset: 5440)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !49, line: 302, size: 576, elements: !646)
!646 = !{!647, !652, !656, !657, !658, !659, !660, !661, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !645, file: !49, line: 304, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !49, line: 276, size: 64, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !648, file: !49, line: 277, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !645, file: !49, line: 306, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !340, !609}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !645, file: !49, line: 308, baseType: !521, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !645, file: !49, line: 309, baseType: !628, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !645, file: !49, line: 310, baseType: !389, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !645, file: !49, line: 311, baseType: !389, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !645, file: !49, line: 312, baseType: !389, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !645, file: !49, line: 313, baseType: !577, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !645, file: !49, line: 316, baseType: !618, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !341, file: !49, line: 689, baseType: !664, size: 64, offset: 6080)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !270, line: 101, size: 960, elements: !666)
!666 = !{!667, !668, !674, !675, !678, !680, !681, !4221, !4222, !4223, !4242}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !665, file: !270, line: 102, baseType: !339, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !665, file: !270, line: 103, baseType: !669, size: 128, offset: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !354, line: 178, size: 128, elements: !670)
!670 = !{!671, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !354, line: 179, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !669, file: !354, line: 179, baseType: !672, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !665, file: !270, line: 104, baseType: !669, size: 128, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !665, file: !270, line: 105, baseType: !676, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !665, file: !270, line: 106, baseType: !679, size: 48, offset: 384)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 48, elements: !540)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !665, file: !270, line: 107, baseType: !621, size: 64, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !665, file: !270, line: 109, baseType: !682, size: 64, offset: 512)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !235, line: 461, size: 5568, elements: !684)
!684 = !{!685, !3678, !3679, !3682, !3683, !3734, !3822, !3823, !3824, !3825, !3826, !3835, !3940, !3953, !4148, !4149, !4153, !4155, !4156, !4157, !4161, !4167, !4168, !4171, !4172, !4173, !4174, !4175, !4176, !4177, !4209, !4210, !4211, !4214, !4217, !4218, !4219, !4220}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !683, file: !235, line: 462, baseType: !686, size: 512)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !687, line: 64, size: 512, elements: !688)
!687 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!688 = !{!689, !690, !691, !693, !750, !3533, !3672, !3673, !3674, !3675, !3676, !3677}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !687, line: 65, baseType: !676, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !686, file: !687, line: 66, baseType: !669, size: 128, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !686, file: !687, line: 67, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !686, file: !687, line: 68, baseType: !694, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !687, line: 192, size: 704, elements: !696)
!696 = !{!697, !698, !714, !715}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !695, file: !687, line: 193, baseType: !669, size: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !695, file: !687, line: 194, baseType: !699, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !700, line: 83, baseType: !701)
!700 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !700, line: 71, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !701, file: !700, line: 72, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !701, file: !700, line: 72, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !704, file: !700, line: 73, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !700, line: 20, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !707, file: !700, line: 21, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !711, line: 25, baseType: !712)
!711 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 25, elements: !713)
!713 = !{}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !695, file: !687, line: 195, baseType: !686, size: 512, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !695, file: !687, line: 196, baseType: !716, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !687, line: 156, size: 192, elements: !719)
!719 = !{!720, !725, !730}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !718, file: !687, line: 157, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!339, !694, !692}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !718, file: !687, line: 158, baseType: !726, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!676, !694, !692}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !718, file: !687, line: 159, baseType: !731, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!339, !694, !692, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !687, line: 148, size: 20736, elements: !737)
!737 = !{!738, !740, !744, !745, !749}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !736, file: !687, line: 149, baseType: !739, size: 192)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 192, elements: !464)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !736, file: !687, line: 150, baseType: !741, size: 4096, offset: 192)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 4096, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !736, file: !687, line: 151, baseType: !339, size: 32, offset: 4288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !736, file: !687, line: 152, baseType: !746, size: 16384, offset: 4320)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 16384, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 2048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !736, file: !687, line: 153, baseType: !339, size: 32, offset: 20704)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !686, file: !687, line: 69, baseType: !751, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !687, line: 138, size: 448, elements: !753)
!753 = !{!754, !758, !785, !787, !3495, !3523, !3527}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !752, file: !687, line: 139, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !692}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !752, file: !687, line: 140, baseType: !759, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !762, line: 230, size: 128, elements: !763)
!762 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!763 = !{!764, !778}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !761, file: !762, line: 231, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !692, !772, !651}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !354, line: 60, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !770, line: 73, baseType: !771)
!770 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !770, line: 15, baseType: !570)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !762, line: 30, size: 128, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !773, file: !762, line: 31, baseType: !676, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !773, file: !762, line: 32, baseType: !777, size: 16, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !354, line: 19, baseType: !527)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !761, file: !762, line: 232, baseType: !779, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!768, !692, !772, !676, !782}
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !354, line: 55, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !770, line: 72, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !770, line: 16, baseType: !575)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !752, file: !687, line: 141, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !752, file: !687, line: 142, baseType: !788, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !762, line: 84, size: 320, elements: !792)
!792 = !{!793, !794, !798, !3492, !3493}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !791, file: !762, line: 85, baseType: !676, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !791, file: !762, line: 86, baseType: !795, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!777, !692, !772, !339}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !791, file: !762, line: 88, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!777, !692, !802, !339}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !762, line: 168, size: 448, elements: !804)
!804 = !{!805, !806, !807, !808, !3487, !3488}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !803, file: !762, line: 169, baseType: !773, size: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !803, file: !762, line: 170, baseType: !782, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !803, file: !762, line: 171, baseType: !621, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !803, file: !762, line: 172, baseType: !809, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!768, !812, !692, !802, !651, !981, !782}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !206, line: 916, size: 1856, align: 32, elements: !814)
!814 = !{!815, !833, !3452, !3453, !3454, !3455, !3456, !3457, !3458, !3459, !3460, !3461, !3470, !3471, !3480, !3481, !3482, !3483, !3484, !3485, !3486}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !813, file: !206, line: 920, baseType: !816, size: 128)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !813, file: !206, line: 917, size: 128, elements: !817)
!817 = !{!818, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !816, file: !206, line: 918, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !820, line: 58, size: 64, elements: !821)
!820 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !819, file: !820, line: 59, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !816, file: !206, line: 919, baseType: !825, size: 128, align: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !354, line: 216, size: 128, align: 64, elements: !826)
!826 = !{!827, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !354, line: 217, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !825, file: !354, line: 218, baseType: !830, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !828}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !813, file: !206, line: 921, baseType: !834, size: 128, offset: 128)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !835, line: 8, size: 128, elements: !836)
!835 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!836 = !{!837, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !834, file: !835, line: 9, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !840, line: 18, flags: DIFlagFwdDecl)
!840 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !834, file: !835, line: 10, baseType: !842, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !840, line: 89, size: 1536, elements: !844)
!844 = !{!845, !846, !856, !864, !865, !880, !3421, !3423, !3435, !3436, !3437, !3438, !3439, !3444, !3445, !3446}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !843, file: !840, line: 91, baseType: !5, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !843, file: !840, line: 92, baseType: !847, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !848, line: 277, baseType: !849)
!848 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !848, line: 277, size: 32, elements: !850)
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !849, file: !848, line: 277, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !848, line: 70, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !848, line: 65, size: 32, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !853, file: !848, line: 66, baseType: !5, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !843, file: !840, line: 93, baseType: !857, size: 128, offset: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !858, line: 38, size: 128, elements: !859)
!858 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!859 = !{!860, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !858, line: 39, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !857, file: !858, line: 39, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !843, file: !840, line: 94, baseType: !842, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !843, file: !840, line: 95, baseType: !866, size: 128, offset: 256)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !840, line: 47, size: 128, elements: !867)
!867 = !{!868, !877}
!868 = !DIDerivedType(tag: DW_TAG_member, scope: !866, file: !840, line: 48, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !866, file: !840, line: 48, size: 64, elements: !870)
!870 = !{!871, !876}
!871 = !DIDerivedType(tag: DW_TAG_member, scope: !869, file: !840, line: 49, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !840, line: 49, size: 64, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !872, file: !840, line: 50, baseType: !370, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !872, file: !840, line: 50, baseType: !370, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !869, file: !840, line: 52, baseType: !616, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !840, line: 54, baseType: !878, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !843, file: !840, line: 96, baseType: !881, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !206, line: 610, size: 4224, elements: !883)
!883 = !{!884, !885, !886, !894, !901, !902, !1046, !3115, !3116, !3117, !3123, !3124, !3125, !3126, !3127, !3128, !3129, !3130, !3131, !3132, !3133, !3134, !3135, !3136, !3137, !3138, !3139, !3140, !3141, !3142, !3147, !3148, !3149, !3150, !3151, !3152, !3153, !3389, !3397, !3398, !3399, !3417, !3418, !3419, !3420}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !882, file: !206, line: 611, baseType: !777, size: 16)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !882, file: !206, line: 612, baseType: !527, size: 16, offset: 16)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !882, file: !206, line: 613, baseType: !887, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !888, line: 23, baseType: !889)
!888 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 21, size: 32, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !889, file: !888, line: 22, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !354, line: 32, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !770, line: 49, baseType: !5)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !882, file: !206, line: 614, baseType: !895, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !888, line: 28, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 26, size: 32, elements: !897)
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !896, file: !888, line: 27, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !354, line: 33, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !770, line: 50, baseType: !5)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !882, file: !206, line: 615, baseType: !5, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !882, file: !206, line: 622, baseType: !903, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !206, line: 1864, size: 1536, align: 512, elements: !906)
!906 = !{!907, !911, !924, !928, !934, !938, !942, !946, !950, !954, !958, !959, !965, !969, !993, !1022, !1026, !1032, !1037, !1041, !1042}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !905, file: !206, line: 1865, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!842, !881, !842, !5}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !905, file: !206, line: 1866, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!676, !842, !881, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !917, line: 10, size: 128, elements: !918)
!917 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!918 = !{!919, !923}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !916, file: !917, line: 11, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !621}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !916, file: !917, line: 12, baseType: !621, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !905, file: !206, line: 1867, baseType: !925, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!339, !881, !339}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !905, file: !206, line: 1868, baseType: !929, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!932, !881, !339}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !206, line: 581, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !905, file: !206, line: 1870, baseType: !935, size: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!339, !842, !651, !339}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !905, file: !206, line: 1872, baseType: !939, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!339, !881, !842, !777, !407}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !905, file: !206, line: 1873, baseType: !943, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!339, !842, !881, !842}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !905, file: !206, line: 1874, baseType: !947, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!339, !881, !842}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !905, file: !206, line: 1875, baseType: !951, size: 64, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!339, !881, !842, !676}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !905, file: !206, line: 1876, baseType: !955, size: 64, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!339, !881, !842, !777}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !905, file: !206, line: 1877, baseType: !947, size: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !905, file: !206, line: 1878, baseType: !960, size: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!339, !881, !842, !777, !963}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !354, line: 16, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !354, line: 13, baseType: !370)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !905, file: !206, line: 1879, baseType: !966, size: 64, offset: 768)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!339, !881, !842, !881, !842, !5}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !905, file: !206, line: 1881, baseType: !970, size: 64, offset: 832)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!339, !842, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !206, line: 219, size: 640, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !983, !990, !991, !992}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !974, file: !206, line: 220, baseType: !5, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !974, file: !206, line: 221, baseType: !777, size: 16, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !974, file: !206, line: 222, baseType: !887, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !974, file: !206, line: 223, baseType: !895, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !974, file: !206, line: 224, baseType: !981, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !354, line: 46, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !770, line: 88, baseType: !501)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !974, file: !206, line: 225, baseType: !984, size: 128, offset: 192)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !985, line: 13, size: 128, elements: !986)
!985 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!986 = !{!987, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !984, file: !985, line: 14, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !985, line: 8, baseType: !500)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !984, file: !985, line: 15, baseType: !570, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !974, file: !206, line: 226, baseType: !984, size: 128, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !974, file: !206, line: 227, baseType: !984, size: 128, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !974, file: !206, line: 234, baseType: !812, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !905, file: !206, line: 1882, baseType: !994, size: 64, offset: 896)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!339, !997, !999, !370, !5}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1001, line: 22, size: 1152, elements: !1002)
!1001 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1002 = !{!1003, !1004, !1005, !1006, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1000, file: !1001, line: 23, baseType: !370, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1000, file: !1001, line: 24, baseType: !777, size: 16, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1000, file: !1001, line: 25, baseType: !5, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1000, file: !1001, line: 26, baseType: !1007, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !354, line: 104, baseType: !370)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1000, file: !1001, line: 27, baseType: !616, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1000, file: !1001, line: 28, baseType: !616, size: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1000, file: !1001, line: 37, baseType: !616, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1000, file: !1001, line: 38, baseType: !963, size: 32, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1000, file: !1001, line: 39, baseType: !963, size: 32, offset: 352)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1000, file: !1001, line: 40, baseType: !887, size: 32, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1000, file: !1001, line: 41, baseType: !895, size: 32, offset: 416)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1000, file: !1001, line: 42, baseType: !981, size: 64, offset: 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1000, file: !1001, line: 43, baseType: !984, size: 128, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1000, file: !1001, line: 44, baseType: !984, size: 128, offset: 640)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1000, file: !1001, line: 45, baseType: !984, size: 128, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1000, file: !1001, line: 46, baseType: !984, size: 128, offset: 896)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1000, file: !1001, line: 47, baseType: !616, size: 64, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1000, file: !1001, line: 48, baseType: !616, size: 64, offset: 1088)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !905, file: !206, line: 1883, baseType: !1023, size: 64, offset: 960)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!768, !842, !651, !782}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !905, file: !206, line: 1884, baseType: !1027, size: 64, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!339, !881, !1030, !616, !616}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !206, line: 50, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !905, file: !206, line: 1886, baseType: !1033, size: 64, offset: 1088)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!339, !881, !1036, !339}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !905, file: !206, line: 1887, baseType: !1038, size: 64, offset: 1152)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!339, !881, !842, !812, !5, !777}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !905, file: !206, line: 1890, baseType: !955, size: 64, offset: 1216)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !905, file: !206, line: 1891, baseType: !1043, size: 64, offset: 1280)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!339, !881, !932, !339}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !882, file: !206, line: 623, baseType: !1047, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !206, line: 1416, size: 9472, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1105, !2723, !2805, !2888, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2904, !2908, !2909, !2912, !2913, !2916, !2917, !2918, !2959, !2985, !2986, !2987, !2988, !2989, !2990, !2993, !2995, !3002, !3003, !3005, !3006, !3007, !3066, !3067, !3082, !3083, !3084, !3085, !3086, !3089, !3090, !3091, !3106, !3107, !3108, !3109, !3110, !3111, !3112, !3113, !3114}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1048, file: !206, line: 1417, baseType: !669, size: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1048, file: !206, line: 1418, baseType: !963, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1048, file: !206, line: 1419, baseType: !385, size: 8, offset: 160)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1048, file: !206, line: 1420, baseType: !575, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1048, file: !206, line: 1421, baseType: !981, size: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1048, file: !206, line: 1422, baseType: !1056, size: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !206, line: 2228, size: 576, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1068, !1072, !1076, !1080, !1084, !1085, !1095, !1098, !1099, !1100, !1102, !1103, !1104}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1057, file: !206, line: 2229, baseType: !676, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1057, file: !206, line: 2230, baseType: !339, size: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1057, file: !206, line: 2238, baseType: !1062, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!339, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1067, line: 28, flags: DIFlagFwdDecl)
!1067 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1057, file: !206, line: 2239, baseType: !1069, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !206, line: 70, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1057, file: !206, line: 2240, baseType: !1073, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!842, !1056, !339, !676, !621}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1057, file: !206, line: 2242, baseType: !1077, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !1047}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1057, file: !206, line: 2243, baseType: !1081, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1083, line: 76, flags: DIFlagFwdDecl)
!1083 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1057, file: !206, line: 2244, baseType: !1056, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1057, file: !206, line: 2245, baseType: !1086, size: 64, offset: 512)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !354, line: 182, size: 64, elements: !1087)
!1087 = !{!1088}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1086, file: !354, line: 183, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !354, line: 186, size: 128, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !354, line: 187, baseType: !1089, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1090, file: !354, line: 187, baseType: !1094, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1057, file: !206, line: 2247, baseType: !1096, offset: 576)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1097, line: 187, elements: !713)
!1097 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1057, file: !206, line: 2248, baseType: !1096, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1057, file: !206, line: 2249, baseType: !1096, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1057, file: !206, line: 2250, baseType: !1101, offset: 576)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, elements: !464)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1057, file: !206, line: 2252, baseType: !1096, offset: 576)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1057, file: !206, line: 2253, baseType: !1096, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1057, file: !206, line: 2254, baseType: !1096, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1048, file: !206, line: 1423, baseType: !1106, size: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !206, line: 1935, size: 1472, elements: !1109)
!1109 = !{!1110, !1114, !1118, !1119, !1123, !1129, !1133, !1134, !1135, !1139, !1143, !1144, !1145, !1146, !1152, !1157, !1158, !1165, !1166, !1167, !1168, !2707, !2722}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1108, file: !206, line: 1936, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!881, !1047}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1108, file: !206, line: 1937, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !881}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1108, file: !206, line: 1938, baseType: !1115, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1108, file: !206, line: 1940, baseType: !1120, size: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !881, !339}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1108, file: !206, line: 1941, baseType: !1124, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!339, !881, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !206, line: 289, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1108, file: !206, line: 1942, baseType: !1130, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!339, !881}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1108, file: !206, line: 1943, baseType: !1115, size: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1108, file: !206, line: 1944, baseType: !1077, size: 64, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1108, file: !206, line: 1945, baseType: !1136, size: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!339, !1047, !339}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1108, file: !206, line: 1946, baseType: !1140, size: 64, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!339, !1047}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1108, file: !206, line: 1947, baseType: !1140, size: 64, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1108, file: !206, line: 1948, baseType: !1140, size: 64, offset: 704)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1108, file: !206, line: 1949, baseType: !1140, size: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1108, file: !206, line: 1950, baseType: !1147, size: 64, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!339, !842, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !206, line: 57, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1108, file: !206, line: 1951, baseType: !1153, size: 64, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!339, !1047, !1156, !651}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1108, file: !206, line: 1952, baseType: !1077, size: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1108, file: !206, line: 1954, baseType: !1159, size: 64, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!339, !1162, !842}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1164, line: 539, flags: DIFlagFwdDecl)
!1164 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1108, file: !206, line: 1955, baseType: !1159, size: 64, offset: 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1108, file: !206, line: 1956, baseType: !1159, size: 64, offset: 1152)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1108, file: !206, line: 1957, baseType: !1159, size: 64, offset: 1216)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1108, file: !206, line: 1963, baseType: !1169, size: 64, offset: 1280)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!339, !1047, !1172, !1195}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1174, line: 68, size: 512, align: 128, elements: !1175)
!1174 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1175 = !{!1176, !1177, !2699, !2706}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1173, file: !1174, line: 69, baseType: !575, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, scope: !1173, file: !1174, line: 77, baseType: !1178, size: 320, offset: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1173, file: !1174, line: 77, size: 320, elements: !1179)
!1179 = !{!1180, !1362, !1367, !1395, !1403, !1409, !2691, !2698}
!1180 = !DIDerivedType(tag: DW_TAG_member, scope: !1178, file: !1174, line: 78, baseType: !1181, size: 320)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1178, file: !1174, line: 78, size: 320, elements: !1182)
!1182 = !{!1183, !1184, !1360, !1361}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1181, file: !1174, line: 84, baseType: !669, size: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1181, file: !1174, line: 86, baseType: !1185, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !206, line: 451, size: 1216, align: 64, elements: !1187)
!1187 = !{!1188, !1189, !1197, !1198, !1199, !1214, !1230, !1231, !1232, !1233, !1353, !1354, !1357, !1358, !1359}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1186, file: !206, line: 452, baseType: !881, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1186, file: !206, line: 453, baseType: !1190, size: 128, offset: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1191, line: 292, size: 128, elements: !1192)
!1191 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1192 = !{!1193, !1194, !1196}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1190, file: !1191, line: 293, baseType: !699)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1190, file: !1191, line: 295, baseType: !1195, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !354, line: 148, baseType: !5)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1190, file: !1191, line: 296, baseType: !621, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1186, file: !206, line: 454, baseType: !1195, size: 32, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1186, file: !206, line: 455, baseType: !353, size: 32, offset: 224)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1186, file: !206, line: 460, baseType: !1200, size: 128, offset: 256)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1201, line: 125, size: 128, elements: !1202)
!1201 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1202 = !{!1203, !1213}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1200, file: !1201, line: 126, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1201, line: 31, size: 64, elements: !1205)
!1205 = !{!1206}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1204, file: !1201, line: 32, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1201, line: 24, size: 192, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1208, file: !1201, line: 25, baseType: !575, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1208, file: !1201, line: 26, baseType: !1207, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1208, file: !1201, line: 27, baseType: !1207, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1200, file: !1201, line: 127, baseType: !1207, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1186, file: !206, line: 461, baseType: !1215, size: 256, offset: 384)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1216, line: 35, size: 256, elements: !1217)
!1216 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1217 = !{!1218, !1226, !1227, !1229}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1215, file: !1216, line: 36, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1220, line: 13, baseType: !1221)
!1220 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !354, line: 175, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 173, size: 64, elements: !1223)
!1223 = !{!1224}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1222, file: !354, line: 174, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !371, line: 22, baseType: !500)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1215, file: !1216, line: 42, baseType: !1219, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1215, file: !1216, line: 46, baseType: !1228, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !700, line: 29, baseType: !707)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1215, file: !1216, line: 47, baseType: !669, size: 128, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1186, file: !206, line: 462, baseType: !575, size: 64, offset: 640)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1186, file: !206, line: 463, baseType: !575, size: 64, offset: 704)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1186, file: !206, line: 464, baseType: !575, size: 64, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1186, file: !206, line: 465, baseType: !1234, size: 64, offset: 832)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !206, line: 367, size: 1408, elements: !1237)
!1237 = !{!1238, !1242, !1246, !1250, !1254, !1258, !1264, !1270, !1274, !1279, !1283, !1287, !1291, !1317, !1321, !1327, !1328, !1329, !1333, !1338, !1342, !1349}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1236, file: !206, line: 368, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!339, !1172, !1127}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1236, file: !206, line: 369, baseType: !1243, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!339, !812, !1172}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1236, file: !206, line: 372, baseType: !1247, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!339, !1185, !1127}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1236, file: !206, line: 375, baseType: !1251, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!339, !1172}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !1236, file: !206, line: 381, baseType: !1255, size: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!339, !812, !1185, !672, !5}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !1236, file: !206, line: 383, baseType: !1259, size: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !1262}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !206, line: 290, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !1236, file: !206, line: 385, baseType: !1265, size: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!339, !812, !1185, !981, !5, !5, !1268, !1269}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !1236, file: !206, line: 388, baseType: !1271, size: 64, offset: 448)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!339, !812, !1185, !981, !5, !5, !1172, !621}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !1236, file: !206, line: 393, baseType: !1275, size: 64, offset: 512)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!1278, !1185, !1278}
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !354, line: 125, baseType: !616)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !1236, file: !206, line: 394, baseType: !1280, size: 64, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !1172, !5, !5}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !1236, file: !206, line: 395, baseType: !1284, size: 64, offset: 640)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!339, !1172, !1195}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !1236, file: !206, line: 396, baseType: !1288, size: 64, offset: 704)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !1172}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !1236, file: !206, line: 397, baseType: !1292, size: 64, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!768, !1295, !1315}
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !206, line: 320, size: 384, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1304, !1305, !1306, !1307, !1308}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !1296, file: !206, line: 321, baseType: !812, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !1296, file: !206, line: 326, baseType: !981, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !1296, file: !206, line: 327, baseType: !1301, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{null, !1295, !570, !570}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1296, file: !206, line: 328, baseType: !621, size: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !1296, file: !206, line: 329, baseType: !339, size: 32, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !1296, file: !206, line: 330, baseType: !525, size: 16, offset: 288)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !1296, file: !206, line: 331, baseType: !525, size: 16, offset: 304)
!1308 = !DIDerivedType(tag: DW_TAG_member, scope: !1296, file: !206, line: 332, baseType: !1309, size: 64, offset: 320)
!1309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1296, file: !206, line: 332, size: 64, elements: !1310)
!1310 = !{!1311, !1312}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !1309, file: !206, line: 333, baseType: !5, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !1309, file: !206, line: 334, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !206, line: 334, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !206, line: 64, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !1236, file: !206, line: 402, baseType: !1318, size: 64, offset: 832)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!339, !1185, !1172, !1172, !181}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !1236, file: !206, line: 404, baseType: !1322, size: 64, offset: 896)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!407, !1172, !1325}
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !1326, line: 305, baseType: !5)
!1326 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !1236, file: !206, line: 405, baseType: !1288, size: 64, offset: 960)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !1236, file: !206, line: 406, baseType: !1251, size: 64, offset: 1024)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !1236, file: !206, line: 407, baseType: !1330, size: 64, offset: 1088)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!339, !1172, !575, !575}
