; ModuleID = '../bcout/drivers/media/tuners/tda827x.llvm.bc'
source_filename = "drivers/media/tuners/tda827x.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.dvb_tuner_ops = type { %struct.dvb_tuner_info, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.analog_parameters*)*, i32 (%struct.dvb_frontend*, i8*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)* }
%struct.dvb_tuner_info = type { [128 x i8], i32, i32, i32, i32, i32, i32 }
%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }
%struct.kref = type { %struct.refcount_struct }

!253 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !258, line: 76, baseType: !7, size: 32, elements: !259)
!258 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!260 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!265 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!266 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!267 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!268 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!269 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!270 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dvb_device_type", file: !272, line: 57, baseType: !7, size: 32, elements: !273)
!272 = !DIFile(filename: "./include/media/dvbdev.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282}
!274 = !DIEnumerator(name: "DVB_DEVICE_SEC", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "DVB_DEVICE_FRONTEND", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "DVB_DEVICE_DEMUX", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "DVB_DEVICE_DVR", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "DVB_DEVICE_CA", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "DVB_DEVICE_NET", value: 5, isUnsigned: true)
!280 = !DIEnumerator(name: "DVB_DEVICE_VIDEO", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tda8290_lna", file: !284, line: 12, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "drivers/media/tuners/tda8290.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !287, !288, !289}
!286 = !DIEnumerator(name: "TDA8290_LNA_OFF", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "TDA8290_LNA_GP0_HIGH_ON", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "TDA8290_LNA_GP0_HIGH_OFF", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "TDA8290_LNA_ON_BRIDGE", value: 3, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !291, line: 305, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!292 = !{!293, !294, !295, !296}
!293 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "v4l2_tuner_type", file: !298, line: 176, baseType: !7, size: 32, elements: !299)
!298 = !DIFile(filename: "./include/uapi/linux/videodev2.h", directory: "/home/lizy2001/genbc/linux")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIEnumerator(name: "V4L2_TUNER_RADIO", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "V4L2_TUNER_ANALOG_TV", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "V4L2_TUNER_DIGITAL_TV", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "V4L2_TUNER_SDR", value: 4, isUnsigned: true)
!304 = !DIEnumerator(name: "V4L2_TUNER_RF", value: 5, isUnsigned: true)
!305 = !{!306, !308, !309, !313}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !307, line: 148, baseType: !7)
!307 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "v4l2_std_id", file: !298, line: 1260, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !311, line: 31, baseType: !312)
!311 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!312 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!313 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!314 = !{!315, !385, !390, !395, !400, !405, !410, !415, !420, !0, !422, !4317, !4321, !4323, !4326, !4337, !4339, !4344}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 17, type: !317, isLocal: true, isDefinition: true, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !319, line: 69, size: 320, elements: !320)
!319 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!320 = !{!321, !325, !329, !350, !356, !360, !363}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 70, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !318, file: !319, line: 71, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !328, line: 76, flags: DIFlagFwdDecl)
!328 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !318, file: !319, line: 72, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !319, line: 47, size: 256, elements: !333)
!333 = !{!334, !335, !341, !346}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !332, file: !319, line: 49, baseType: !7, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !319, line: 51, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !322, !340}
!339 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !332, file: !319, line: 53, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!339, !345, !340}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !332, file: !319, line: 55, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !308}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !318, file: !319, line: 73, baseType: !351, size: 16, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !353, line: 19, baseType: !354)
!353 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !311, line: 24, baseType: !355)
!355 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !318, file: !319, line: 74, baseType: !357, size: 8, offset: 208)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !353, line: 16, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !311, line: 20, baseType: !359)
!359 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !319, line: 75, baseType: !361, size: 8, offset: 216)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !353, line: 17, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !311, line: 21, baseType: !313)
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !318, file: !319, line: 76, baseType: !364, size: 64, offset: 256)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !318, file: !319, line: 76, size: 64, elements: !365)
!365 = !{!366, !367, !374}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !364, file: !319, line: 77, baseType: !308, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !364, file: !319, line: 78, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !319, line: 86, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !370, file: !319, line: 87, baseType: !7, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !370, file: !319, line: 88, baseType: !345, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !364, file: !319, line: 79, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !319, line: 92, size: 256, elements: !378)
!378 = !{!379, !380, !381, !383, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !377, file: !319, line: 94, baseType: !7, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !377, file: !319, line: 95, baseType: !7, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !377, file: !319, line: 96, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !377, file: !319, line: 97, baseType: !330, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !377, file: !319, line: 98, baseType: !308, size: 64, offset: 192)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 17, type: !387, isLocal: true, isDefinition: true, align: 8)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 216, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 27)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 18, type: !392, isLocal: true, isDefinition: true, align: 8)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 520, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 65)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description222", scope: !2, file: !3, line: 892, type: !397, isLocal: true, isDefinition: true, align: 8)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 312, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 39)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author223", scope: !2, file: !3, line: 893, type: !402, isLocal: true, isDefinition: true, align: 8)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 504, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 63)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author224", scope: !2, file: !3, line: 894, type: !407, isLocal: true, isDefinition: true, align: 8)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 416, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 52)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file225", scope: !2, file: !3, line: 895, type: !412, isLocal: true, isDefinition: true, align: 8)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 336, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 42)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license226", scope: !2, file: !3, line: 895, type: !417, isLocal: true, isDefinition: true, align: 8)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 160, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 20)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 16, type: !339, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "tda827xo_tuner_ops", scope: !2, file: !3, line: 807, type: !424, isLocal: true, isDefinition: true)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !426)
!426 = !{!427, !442, !4291, !4292, !4293, !4294, !4295, !4296, !4300, !4301, !4302, !4303, !4304, !4305, !4306, !4307, !4312, !4316}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !425, file: !51, line: 228, baseType: !428, size: 1216)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !429)
!429 = !{!430, !434, !437, !438, !439, !440, !441}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !428, file: !51, line: 89, baseType: !431, size: 1024)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 1024, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !428, file: !51, line: 91, baseType: !435, size: 32, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !353, line: 21, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !311, line: 27, baseType: !7)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !428, file: !51, line: 92, baseType: !435, size: 32, offset: 1056)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !428, file: !51, line: 93, baseType: !435, size: 32, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !428, file: !51, line: 95, baseType: !435, size: 32, offset: 1120)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !428, file: !51, line: 96, baseType: !435, size: 32, offset: 1152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !428, file: !51, line: 97, baseType: !435, size: 32, offset: 1184)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !425, file: !51, line: 230, baseType: !443, size: 64, offset: 1216)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !448)
!448 = !{!449, !463, !709, !4279, !4280, !4281, !4282, !4283, !4284, !4285, !4289, !4290}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !447, file: !51, line: 687, baseType: !450, size: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !451, line: 19, size: 32, elements: !452)
!451 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !450, file: !451, line: 20, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !455, line: 113, baseType: !456)
!455 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !455, line: 111, size: 32, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !456, file: !455, line: 112, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !307, line: 168, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 166, size: 32, elements: !461)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !460, file: !307, line: 167, baseType: !339, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !447, file: !51, line: 688, baseType: !464, size: 6016, offset: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !465)
!465 = !{!466, !478, !482, !483, !484, !485, !489, !490, !496, !503, !507, !508, !518, !601, !605, !610, !615, !616, !617, !618, !630, !641, !645, !649, !653, !658, !663, !667, !668, !669, !673, !674}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !464, file: !51, line: 436, baseType: !467, size: 1280)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !51, line: 339, baseType: !431, size: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !467, file: !51, line: 340, baseType: !435, size: 32, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !467, file: !51, line: 341, baseType: !435, size: 32, offset: 1056)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !467, file: !51, line: 342, baseType: !435, size: 32, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !467, file: !51, line: 343, baseType: !435, size: 32, offset: 1120)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !467, file: !51, line: 344, baseType: !435, size: 32, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !467, file: !51, line: 345, baseType: !435, size: 32, offset: 1184)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !467, file: !51, line: 346, baseType: !435, size: 32, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !467, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !464, file: !51, line: 438, baseType: !479, size: 64, offset: 1280)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 64, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !464, file: !51, line: 440, baseType: !443, size: 64, offset: 1344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !464, file: !51, line: 441, baseType: !443, size: 64, offset: 1408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !464, file: !51, line: 442, baseType: !443, size: 64, offset: 1472)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !464, file: !51, line: 444, baseType: !486, size: 64, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!339, !446}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !464, file: !51, line: 445, baseType: !486, size: 64, offset: 1600)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !464, file: !51, line: 447, baseType: !491, size: 64, offset: 1664)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!339, !446, !494, !339}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !464, file: !51, line: 450, baseType: !497, size: 64, offset: 1728)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!339, !446, !500, !7, !382, !502}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !307, line: 30, baseType: !501)
!501 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !464, file: !51, line: 457, baseType: !504, size: 64, offset: 1792)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!50, !446}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !464, file: !51, line: 460, baseType: !486, size: 64, offset: 1856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !464, file: !51, line: 461, baseType: !509, size: 64, offset: 1920)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!339, !446, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !513, file: !51, line: 70, baseType: !339, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !513, file: !51, line: 71, baseType: !339, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !513, file: !51, line: 72, baseType: !339, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !464, file: !51, line: 463, baseType: !519, size: 64, offset: 1984)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!339, !446, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !594, !595, !596, !597, !598, !599, !600}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !523, file: !51, line: 587, baseType: !435, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !523, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !523, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !523, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !523, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !523, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !523, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !523, file: !51, line: 595, baseType: !435, size: 32, offset: 224)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !523, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !523, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !523, file: !51, line: 598, baseType: !435, size: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !523, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !523, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !523, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !523, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !523, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !523, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !523, file: !51, line: 610, baseType: !361, size: 8, offset: 544)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !523, file: !51, line: 611, baseType: !361, size: 8, offset: 552)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !523, file: !51, line: 612, baseType: !361, size: 8, offset: 560)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !523, file: !51, line: 613, baseType: !435, size: 32, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !523, file: !51, line: 614, baseType: !435, size: 32, offset: 608)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !523, file: !51, line: 615, baseType: !361, size: 8, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !523, file: !51, line: 621, baseType: !549, size: 384, offset: 672)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 384, elements: !556)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !523, file: !51, line: 616, size: 128, elements: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !550, file: !51, line: 617, baseType: !361, size: 8)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !550, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !550, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !550, file: !51, line: 620, baseType: !361, size: 8, offset: 96)
!556 = !{!557}
!557 = !DISubrange(count: 3)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !523, file: !51, line: 624, baseType: !435, size: 32, offset: 1056)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !523, file: !51, line: 627, baseType: !435, size: 32, offset: 1088)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !523, file: !51, line: 630, baseType: !361, size: 8, offset: 1120)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !523, file: !51, line: 631, baseType: !361, size: 8, offset: 1128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !523, file: !51, line: 632, baseType: !361, size: 8, offset: 1136)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !523, file: !51, line: 633, baseType: !361, size: 8, offset: 1144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !523, file: !51, line: 634, baseType: !361, size: 8, offset: 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !523, file: !51, line: 635, baseType: !361, size: 8, offset: 1160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !523, file: !51, line: 637, baseType: !361, size: 8, offset: 1168)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !523, file: !51, line: 638, baseType: !361, size: 8, offset: 1176)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !523, file: !51, line: 639, baseType: !361, size: 8, offset: 1184)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !523, file: !51, line: 640, baseType: !361, size: 8, offset: 1192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !523, file: !51, line: 641, baseType: !361, size: 8, offset: 1200)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !523, file: !51, line: 642, baseType: !361, size: 8, offset: 1208)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !523, file: !51, line: 643, baseType: !361, size: 8, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !523, file: !51, line: 644, baseType: !361, size: 8, offset: 1224)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !523, file: !51, line: 645, baseType: !361, size: 8, offset: 1232)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !523, file: !51, line: 647, baseType: !435, size: 32, offset: 1248)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !523, file: !51, line: 650, baseType: !577, size: 296, offset: 1280)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !577, file: !6, line: 826, baseType: !362, size: 8)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !577, file: !6, line: 827, baseType: !581, size: 288, offset: 8)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 288, elements: !592)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !582, file: !6, line: 804, baseType: !362, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, scope: !582, file: !6, line: 805, baseType: !586, size: 64, offset: 8)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !582, file: !6, line: 805, size: 64, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !586, file: !6, line: 806, baseType: !310, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !586, file: !6, line: 807, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !311, line: 30, baseType: !591)
!591 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!592 = !{!593}
!593 = !DISubrange(count: 4)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !523, file: !51, line: 651, baseType: !577, size: 296, offset: 1576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !523, file: !51, line: 652, baseType: !577, size: 296, offset: 1872)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !523, file: !51, line: 653, baseType: !577, size: 296, offset: 2168)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !523, file: !51, line: 654, baseType: !577, size: 296, offset: 2464)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !523, file: !51, line: 655, baseType: !577, size: 296, offset: 2760)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !523, file: !51, line: 656, baseType: !577, size: 296, offset: 3056)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !523, file: !51, line: 657, baseType: !577, size: 296, offset: 3352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !464, file: !51, line: 466, baseType: !602, size: 64, offset: 2048)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!339, !446, !502}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !464, file: !51, line: 467, baseType: !606, size: 64, offset: 2112)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!339, !446, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !464, file: !51, line: 468, baseType: !611, size: 64, offset: 2176)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!339, !446, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !464, file: !51, line: 469, baseType: !611, size: 64, offset: 2240)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !464, file: !51, line: 470, baseType: !606, size: 64, offset: 2304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !464, file: !51, line: 472, baseType: !486, size: 64, offset: 2368)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !464, file: !51, line: 473, baseType: !619, size: 64, offset: 2432)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!339, !446, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !624)
!624 = !{!625, !629}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !623, file: !6, line: 174, baseType: !626, size: 48)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 48, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 6)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !623, file: !6, line: 175, baseType: !362, size: 8, offset: 48)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !464, file: !51, line: 474, baseType: !631, size: 64, offset: 2496)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!339, !446, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !636)
!636 = !{!637, !639, !640}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !635, file: !6, line: 196, baseType: !638, size: 32)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 32, elements: !592)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !635, file: !6, line: 197, baseType: !362, size: 8, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !635, file: !6, line: 198, baseType: !339, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !464, file: !51, line: 475, baseType: !642, size: 64, offset: 2560)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!339, !446, !171}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !464, file: !51, line: 477, baseType: !646, size: 64, offset: 2624)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!339, !446, !78}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !464, file: !51, line: 478, baseType: !650, size: 64, offset: 2688)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!339, !446, !73}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !464, file: !51, line: 480, baseType: !654, size: 64, offset: 2752)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!339, !446, !657}
!657 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !464, file: !51, line: 481, baseType: !659, size: 64, offset: 2816)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!339, !446, !662}
!662 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !464, file: !51, line: 482, baseType: !664, size: 64, offset: 2880)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!339, !446, !339}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !464, file: !51, line: 483, baseType: !664, size: 64, offset: 2944)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !464, file: !51, line: 484, baseType: !486, size: 64, offset: 3008)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !464, file: !51, line: 490, baseType: !670, size: 64, offset: 3072)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!175, !446}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !464, file: !51, line: 492, baseType: !425, size: 2304, offset: 3136)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !464, file: !51, line: 493, baseType: !675, size: 576, offset: 5440)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !676)
!676 = !{!677, !681, !693, !694, !701, !702, !703, !704, !705}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !675, file: !51, line: 304, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !51, line: 277, baseType: !345, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !675, file: !51, line: 306, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !446, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !687)
!687 = !{!688, !689, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !686, file: !51, line: 115, baseType: !7, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !686, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !686, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !686, file: !51, line: 118, baseType: !692, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !353, line: 23, baseType: !310)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !675, file: !51, line: 308, baseType: !611, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !675, file: !51, line: 309, baseType: !695, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!339, !446, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !353, line: 20, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !311, line: 26, baseType: !339)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !675, file: !51, line: 310, baseType: !443, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !675, file: !51, line: 311, baseType: !443, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !675, file: !51, line: 312, baseType: !443, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !675, file: !51, line: 313, baseType: !664, size: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !675, file: !51, line: 316, baseType: !706, size: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!339, !446, !308}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !447, file: !51, line: 689, baseType: !710, size: 64, offset: 6080)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !712)
!712 = !{!713, !714, !720, !721, !722, !724, !725, !4257, !4258, !4259, !4278}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !711, file: !272, line: 102, baseType: !339, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !711, file: !272, line: 103, baseType: !715, size: 128, offset: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !307, line: 178, size: 128, elements: !716)
!716 = !{!717, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !307, line: 179, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !715, file: !307, line: 179, baseType: !718, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !711, file: !272, line: 104, baseType: !715, size: 128, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !272, line: 105, baseType: !322, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !711, file: !272, line: 106, baseType: !723, size: 48, offset: 384)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 48, elements: !627)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !711, file: !272, line: 107, baseType: !308, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !711, file: !272, line: 109, baseType: !726, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !728)
!728 = !{!729, !3714, !3715, !3718, !3719, !3770, !3858, !3859, !3860, !3861, !3862, !3871, !3976, !3989, !4184, !4185, !4189, !4191, !4192, !4193, !4197, !4203, !4204, !4207, !4208, !4209, !4210, !4211, !4212, !4213, !4245, !4246, !4247, !4250, !4253, !4254, !4255, !4256}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !727, file: !237, line: 462, baseType: !730, size: 512)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !731, line: 64, size: 512, elements: !732)
!731 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!732 = !{!733, !734, !735, !737, !794, !3569, !3708, !3709, !3710, !3711, !3712, !3713}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !731, line: 65, baseType: !322, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !730, file: !731, line: 66, baseType: !715, size: 128, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !730, file: !731, line: 67, baseType: !736, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !730, file: !731, line: 68, baseType: !738, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !731, line: 192, size: 704, elements: !740)
!740 = !{!741, !742, !758, !759}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !739, file: !731, line: 193, baseType: !715, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !739, file: !731, line: 194, baseType: !743, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !744, line: 83, baseType: !745)
!744 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !744, line: 71, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, scope: !745, file: !744, line: 72, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !745, file: !744, line: 72, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !748, file: !744, line: 73, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !744, line: 20, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !751, file: !744, line: 21, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !755, line: 25, baseType: !756)
!755 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 25, elements: !757)
!757 = !{}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !739, file: !731, line: 195, baseType: !730, size: 512, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !739, file: !731, line: 196, baseType: !760, size: 64, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !731, line: 156, size: 192, elements: !763)
!763 = !{!764, !769, !774}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !762, file: !731, line: 157, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!339, !738, !736}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !731, line: 158, baseType: !770, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!322, !738, !736}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !762, file: !731, line: 159, baseType: !775, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!339, !738, !736, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !731, line: 148, size: 20736, elements: !781)
!781 = !{!782, !784, !788, !789, !793}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !780, file: !731, line: 149, baseType: !783, size: 192)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 192, elements: !556)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !780, file: !731, line: 150, baseType: !785, size: 4096, offset: 192)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 4096, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !780, file: !731, line: 151, baseType: !339, size: 32, offset: 4288)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !780, file: !731, line: 152, baseType: !790, size: 16384, offset: 4320)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 16384, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 2048)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !780, file: !731, line: 153, baseType: !339, size: 32, offset: 20704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !730, file: !731, line: 69, baseType: !795, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !731, line: 138, size: 448, elements: !797)
!797 = !{!798, !802, !829, !831, !3531, !3559, !3563}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !796, file: !731, line: 139, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !736}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !796, file: !731, line: 140, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !806, line: 230, size: 128, elements: !807)
!806 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !822}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !805, file: !806, line: 231, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !736, !816, !345}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !307, line: 60, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !814, line: 73, baseType: !815)
!814 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !814, line: 15, baseType: !657)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !806, line: 30, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !806, line: 31, baseType: !322, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !817, file: !806, line: 32, baseType: !821, size: 16, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !307, line: 19, baseType: !355)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !805, file: !806, line: 232, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!812, !736, !816, !322, !826}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !307, line: 55, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !814, line: 72, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !814, line: 16, baseType: !662)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !796, file: !731, line: 141, baseType: !830, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !796, file: !731, line: 142, baseType: !832, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !806, line: 84, size: 320, elements: !836)
!836 = !{!837, !838, !842, !3528, !3529}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !835, file: !806, line: 85, baseType: !322, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !835, file: !806, line: 86, baseType: !839, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!821, !736, !816, !339}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !835, file: !806, line: 88, baseType: !843, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!821, !736, !846, !339}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !806, line: 168, size: 448, elements: !848)
!848 = !{!849, !850, !851, !852, !3523, !3524}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !847, file: !806, line: 169, baseType: !817, size: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !806, line: 170, baseType: !826, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !847, file: !806, line: 171, baseType: !308, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !847, file: !806, line: 172, baseType: !853, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!812, !856, !736, !846, !345, !1022, !826}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !858)
!858 = !{!859, !877, !3488, !3489, !3490, !3491, !3492, !3493, !3494, !3495, !3496, !3497, !3506, !3507, !3516, !3517, !3518, !3519, !3520, !3521, !3522}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !857, file: !208, line: 920, baseType: !860, size: 128)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !857, file: !208, line: 917, size: 128, elements: !861)
!861 = !{!862, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !860, file: !208, line: 918, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !864, line: 58, size: 64, elements: !865)
!864 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !864, line: 59, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !860, file: !208, line: 919, baseType: !869, size: 128, align: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !307, line: 216, size: 128, align: 64, elements: !870)
!870 = !{!871, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !869, file: !307, line: 217, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !869, file: !307, line: 218, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !872}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !857, file: !208, line: 921, baseType: !878, size: 128, offset: 128)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !879, line: 8, size: 128, elements: !880)
!879 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!880 = !{!881, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !878, file: !879, line: 9, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !884, line: 18, flags: DIFlagFwdDecl)
!884 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !878, file: !879, line: 10, baseType: !886, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !884, line: 89, size: 1536, elements: !888)
!888 = !{!889, !890, !900, !908, !909, !924, !3457, !3459, !3471, !3472, !3473, !3474, !3475, !3480, !3481, !3482}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !887, file: !884, line: 91, baseType: !7, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !887, file: !884, line: 92, baseType: !891, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !892, line: 277, baseType: !893)
!892 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !892, line: 277, size: 32, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !893, file: !892, line: 277, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !892, line: 70, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !892, line: 65, size: 32, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !897, file: !892, line: 66, baseType: !7, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !887, file: !884, line: 93, baseType: !901, size: 128, offset: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !902, line: 38, size: 128, elements: !903)
!902 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!903 = !{!904, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !902, line: 39, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !901, file: !902, line: 39, baseType: !907, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !887, file: !884, line: 94, baseType: !886, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !887, file: !884, line: 95, baseType: !910, size: 128, offset: 256)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !884, line: 47, size: 128, elements: !911)
!911 = !{!912, !921}
!912 = !DIDerivedType(tag: DW_TAG_member, scope: !910, file: !884, line: 48, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !884, line: 48, size: 64, elements: !914)
!914 = !{!915, !920}
!915 = !DIDerivedType(tag: DW_TAG_member, scope: !913, file: !884, line: 49, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !913, file: !884, line: 49, size: 64, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !916, file: !884, line: 50, baseType: !435, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !916, file: !884, line: 50, baseType: !435, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !913, file: !884, line: 52, baseType: !692, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !884, line: 54, baseType: !922, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !887, file: !884, line: 96, baseType: !925, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !927)
!927 = !{!928, !929, !930, !938, !945, !946, !1087, !3151, !3152, !3153, !3159, !3160, !3161, !3162, !3163, !3164, !3165, !3166, !3167, !3168, !3169, !3170, !3171, !3172, !3173, !3174, !3175, !3176, !3177, !3178, !3183, !3184, !3185, !3186, !3187, !3188, !3189, !3425, !3433, !3434, !3435, !3453, !3454, !3455, !3456}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !926, file: !208, line: 611, baseType: !821, size: 16)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !926, file: !208, line: 612, baseType: !355, size: 16, offset: 16)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !926, file: !208, line: 613, baseType: !931, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !932, line: 23, baseType: !933)
!932 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !932, line: 21, size: 32, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !933, file: !932, line: 22, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !307, line: 32, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !814, line: 49, baseType: !7)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !926, file: !208, line: 614, baseType: !939, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !932, line: 28, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !932, line: 26, size: 32, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !940, file: !932, line: 27, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !307, line: 33, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !814, line: 50, baseType: !7)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !926, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !926, file: !208, line: 622, baseType: !947, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !950)
!950 = !{!951, !955, !965, !969, !975, !979, !983, !987, !991, !995, !999, !1000, !1006, !1010, !1034, !1063, !1067, !1073, !1078, !1082, !1083}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !949, file: !208, line: 1865, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!886, !925, !886, !7}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !949, file: !208, line: 1866, baseType: !956, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!322, !886, !925, !959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !961, line: 10, size: 128, elements: !962)
!961 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !960, file: !961, line: 11, baseType: !347, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !960, file: !961, line: 12, baseType: !308, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !949, file: !208, line: 1867, baseType: !966, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!339, !925, !339}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !949, file: !208, line: 1868, baseType: !970, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !925, !339}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !949, file: !208, line: 1870, baseType: !976, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!339, !886, !345, !339}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !949, file: !208, line: 1872, baseType: !980, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!339, !925, !886, !821, !500}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !949, file: !208, line: 1873, baseType: !984, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!339, !886, !925, !886}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !949, file: !208, line: 1874, baseType: !988, size: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!339, !925, !886}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !949, file: !208, line: 1875, baseType: !992, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!339, !925, !886, !322}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !949, file: !208, line: 1876, baseType: !996, size: 64, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!339, !925, !886, !821}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !949, file: !208, line: 1877, baseType: !988, size: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !949, file: !208, line: 1878, baseType: !1001, size: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!339, !925, !886, !821, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !307, line: 16, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !307, line: 13, baseType: !435)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !949, file: !208, line: 1879, baseType: !1007, size: 64, offset: 768)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!339, !925, !886, !925, !886, !7}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !949, file: !208, line: 1881, baseType: !1011, size: 64, offset: 832)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!339, !886, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1024, !1031, !1032, !1033}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1015, file: !208, line: 220, baseType: !7, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1015, file: !208, line: 221, baseType: !821, size: 16, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1015, file: !208, line: 222, baseType: !931, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1015, file: !208, line: 223, baseType: !939, size: 32, offset: 96)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1015, file: !208, line: 224, baseType: !1022, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !307, line: 46, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !814, line: 88, baseType: !591)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1015, file: !208, line: 225, baseType: !1025, size: 128, offset: 192)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1026, line: 13, size: 128, elements: !1027)
!1026 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1027 = !{!1028, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1025, file: !1026, line: 14, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1026, line: 8, baseType: !590)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1025, file: !1026, line: 15, baseType: !657, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1015, file: !208, line: 226, baseType: !1025, size: 128, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1015, file: !208, line: 227, baseType: !1025, size: 128, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1015, file: !208, line: 234, baseType: !856, size: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !949, file: !208, line: 1882, baseType: !1035, size: 64, offset: 896)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!339, !1038, !1040, !435, !7}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !878)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1042, line: 22, size: 1152, elements: !1043)
!1042 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1043 = !{!1044, !1045, !1046, !1047, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1041, file: !1042, line: 23, baseType: !435, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1041, file: !1042, line: 24, baseType: !821, size: 16, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1041, file: !1042, line: 25, baseType: !7, size: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1041, file: !1042, line: 26, baseType: !1048, size: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !307, line: 104, baseType: !435)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1041, file: !1042, line: 27, baseType: !692, size: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1041, file: !1042, line: 28, baseType: !692, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1041, file: !1042, line: 37, baseType: !692, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1041, file: !1042, line: 38, baseType: !1004, size: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1041, file: !1042, line: 39, baseType: !1004, size: 32, offset: 352)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1041, file: !1042, line: 40, baseType: !931, size: 32, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1041, file: !1042, line: 41, baseType: !939, size: 32, offset: 416)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1041, file: !1042, line: 42, baseType: !1022, size: 64, offset: 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1041, file: !1042, line: 43, baseType: !1025, size: 128, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1041, file: !1042, line: 44, baseType: !1025, size: 128, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1041, file: !1042, line: 45, baseType: !1025, size: 128, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1041, file: !1042, line: 46, baseType: !1025, size: 128, offset: 896)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1041, file: !1042, line: 47, baseType: !692, size: 64, offset: 1024)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1041, file: !1042, line: 48, baseType: !692, size: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !949, file: !208, line: 1883, baseType: !1064, size: 64, offset: 960)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!812, !886, !345, !826}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !949, file: !208, line: 1884, baseType: !1068, size: 64, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!339, !925, !1071, !692, !692}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !949, file: !208, line: 1886, baseType: !1074, size: 64, offset: 1088)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!339, !925, !1077, !339}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !949, file: !208, line: 1887, baseType: !1079, size: 64, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!339, !925, !886, !856, !7, !821}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !949, file: !208, line: 1890, baseType: !996, size: 64, offset: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !949, file: !208, line: 1891, baseType: !1084, size: 64, offset: 1280)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!339, !925, !973, !339}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !926, file: !208, line: 623, baseType: !1088, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1143, !2759, !2841, !2924, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2940, !2944, !2945, !2948, !2949, !2952, !2953, !2954, !2995, !3021, !3022, !3023, !3024, !3025, !3026, !3029, !3031, !3038, !3039, !3041, !3042, !3043, !3102, !3103, !3118, !3119, !3120, !3121, !3122, !3125, !3126, !3127, !3142, !3143, !3144, !3145, !3146, !3147, !3148, !3149, !3150}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1089, file: !208, line: 1417, baseType: !715, size: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1089, file: !208, line: 1418, baseType: !1004, size: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1089, file: !208, line: 1419, baseType: !313, size: 8, offset: 160)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1089, file: !208, line: 1420, baseType: !662, size: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1089, file: !208, line: 1421, baseType: !1022, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1089, file: !208, line: 1422, baseType: !1097, size: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1109, !1113, !1117, !1121, !1122, !1123, !1133, !1136, !1137, !1138, !1140, !1141, !1142}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1098, file: !208, line: 2229, baseType: !322, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1098, file: !208, line: 2230, baseType: !339, size: 32, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1098, file: !208, line: 2238, baseType: !1103, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!339, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1108, line: 28, flags: DIFlagFwdDecl)
!1108 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1098, file: !208, line: 2239, baseType: !1110, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1098, file: !208, line: 2240, baseType: !1114, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!886, !1097, !339, !322, !308}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1098, file: !208, line: 2242, baseType: !1118, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !1088}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1098, file: !208, line: 2243, baseType: !326, size: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1098, file: !208, line: 2244, baseType: !1097, size: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1098, file: !208, line: 2245, baseType: !1124, size: 64, offset: 512)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !307, line: 182, size: 64, elements: !1125)
!1125 = !{!1126}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1124, file: !307, line: 183, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !307, line: 186, size: 128, elements: !1129)
!1129 = !{!1130, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1128, file: !307, line: 187, baseType: !1127, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1128, file: !307, line: 187, baseType: !1132, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1098, file: !208, line: 2247, baseType: !1134, offset: 576)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1135, line: 187, elements: !757)
!1135 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1098, file: !208, line: 2248, baseType: !1134, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1098, file: !208, line: 2249, baseType: !1134, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1098, file: !208, line: 2250, baseType: !1139, offset: 576)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, elements: !556)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1098, file: !208, line: 2252, baseType: !1134, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1098, file: !208, line: 2253, baseType: !1134, offset: 576)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1098, file: !208, line: 2254, baseType: !1134, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1089, file: !208, line: 1423, baseType: !1144, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1147)
!1147 = !{!1148, !1152, !1156, !1157, !1161, !1167, !1171, !1172, !1173, !1177, !1181, !1182, !1183, !1184, !1190, !1195, !1196, !1203, !1204, !1205, !1206, !2743, !2758}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1146, file: !208, line: 1936, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!925, !1088}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1146, file: !208, line: 1937, baseType: !1153, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{null, !925}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1146, file: !208, line: 1938, baseType: !1153, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1146, file: !208, line: 1940, baseType: !1158, size: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !925, !339}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1146, file: !208, line: 1941, baseType: !1162, size: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!339, !925, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1146, file: !208, line: 1942, baseType: !1168, size: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!339, !925}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1146, file: !208, line: 1943, baseType: !1153, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1146, file: !208, line: 1944, baseType: !1118, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1146, file: !208, line: 1945, baseType: !1174, size: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!339, !1088, !339}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1146, file: !208, line: 1946, baseType: !1178, size: 64, offset: 576)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!339, !1088}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1146, file: !208, line: 1947, baseType: !1178, size: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1146, file: !208, line: 1948, baseType: !1178, size: 64, offset: 704)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1146, file: !208, line: 1949, baseType: !1178, size: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1146, file: !208, line: 1950, baseType: !1185, size: 64, offset: 832)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!339, !886, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1146, file: !208, line: 1951, baseType: !1191, size: 64, offset: 896)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!339, !1088, !1194, !345}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1146, file: !208, line: 1952, baseType: !1118, size: 64, offset: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1146, file: !208, line: 1954, baseType: !1197, size: 64, offset: 1024)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!339, !1200, !886}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1202, line: 539, flags: DIFlagFwdDecl)
!1202 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1146, file: !208, line: 1955, baseType: !1197, size: 64, offset: 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1146, file: !208, line: 1956, baseType: !1197, size: 64, offset: 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1146, file: !208, line: 1957, baseType: !1197, size: 64, offset: 1216)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1146, file: !208, line: 1963, baseType: !1207, size: 64, offset: 1280)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!339, !1088, !1210, !306}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1212, line: 68, size: 512, align: 128, elements: !1213)
!1212 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1213 = !{!1214, !1215, !2735, !2742}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1211, file: !1212, line: 69, baseType: !662, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, scope: !1211, file: !1212, line: 77, baseType: !1216, size: 320, offset: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1211, file: !1212, line: 77, size: 320, elements: !1217)
!1217 = !{!1218, !1399, !1404, !1432, !1440, !1446, !2727, !2734}
!1218 = !DIDerivedType(tag: DW_TAG_member, scope: !1216, file: !1212, line: 78, baseType: !1219, size: 320)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1216, file: !1212, line: 78, size: 320, elements: !1220)
!1220 = !{!1221, !1222, !1397, !1398}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1219, file: !1212, line: 84, baseType: !715, size: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1219, file: !1212, line: 86, baseType: !1223, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1225)
!1225 = !{!1226, !1227, !1234, !1235, !1236, !1251, !1267, !1268, !1269, !1270, !1390, !1391, !1394, !1395, !1396}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1224, file: !208, line: 452, baseType: !925, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1224, file: !208, line: 453, baseType: !1228, size: 128, offset: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1229, line: 292, size: 128, elements: !1230)
!1229 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1228, file: !1229, line: 293, baseType: !743)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1228, file: !1229, line: 295, baseType: !306, size: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1228, file: !1229, line: 296, baseType: !308, size: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1224, file: !208, line: 454, baseType: !306, size: 32, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1224, file: !208, line: 455, baseType: !459, size: 32, offset: 224)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1224, file: !208, line: 460, baseType: !1237, size: 128, offset: 256)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1238, line: 125, size: 128, elements: !1239)
!1238 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1239 = !{!1240, !1250}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1237, file: !1238, line: 126, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1238, line: 31, size: 64, elements: !1242)
!1242 = !{!1243}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1241, file: !1238, line: 32, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1238, line: 24, size: 192, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1245, file: !1238, line: 25, baseType: !662, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1245, file: !1238, line: 26, baseType: !1244, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1245, file: !1238, line: 27, baseType: !1244, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1237, file: !1238, line: 127, baseType: !1244, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1224, file: !208, line: 461, baseType: !1252, size: 256, offset: 384)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1253, line: 35, size: 256, elements: !1254)
!1253 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1254 = !{!1255, !1263, !1264, !1266}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1252, file: !1253, line: 36, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1257, line: 13, baseType: !1258)
!1257 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !307, line: 175, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 173, size: 64, elements: !1260)
!1260 = !{!1261}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1259, file: !307, line: 174, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !353, line: 22, baseType: !590)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1252, file: !1253, line: 42, baseType: !1256, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1252, file: !1253, line: 46, baseType: !1265, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !744, line: 29, baseType: !751)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1252, file: !1253, line: 47, baseType: !715, size: 128, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1224, file: !208, line: 462, baseType: !662, size: 64, offset: 640)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1224, file: !208, line: 463, baseType: !662, size: 64, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1224, file: !208, line: 464, baseType: !662, size: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1224, file: !208, line: 465, baseType: !1271, size: 64, offset: 832)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !208, line: 367, size: 1408, elements: !1274)
!1274 = !{!1275, !1279, !1283, !1287, !1291, !1295, !1301, !1307, !1311, !1316, !1320, !1324, !1328, !1354, !1358, !1364, !1365, !1366, !1370, !1375, !1379, !1386}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1273, file: !208, line: 368, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!339, !1210, !1165}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1273, file: !208, line: 369, baseType: !1280, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!339, !856, !1210}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1273, file: !208, line: 372, baseType: !1284, size: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!339, !1223, !1165}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1273, file: !208, line: 375, baseType: !1288, size: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!339, !1210}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !1273, file: !208, line: 381, baseType: !1292, size: 64, offset: 256)
