; ModuleID = '../bcout/drivers/media/tuners/tea5761.llvm.bc'
source_filename = "drivers/media/tuners/tea5761.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.dvb_tuner_ops = type { %struct.dvb_tuner_info, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.analog_parameters*)*, i32 (%struct.dvb_frontend*, i8*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)* }
%struct.dvb_tuner_info = type { [128 x i8], i32, i32, i32, i32, i32, i32 }
%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }
%struct.kref = type { %struct.refcount_struct }

!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!247 = !DIEnumerator(name: "SYS_UNDEFINED", value: 0, isUnsigned: true)
!248 = !DIEnumerator(name: "SYS_DVBC_ANNEX_A", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "SYS_DVBC_ANNEX_B", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "SYS_DVBT", value: 3, isUnsigned: true)
!251 = !DIEnumerator(name: "SYS_DSS", value: 4, isUnsigned: true)
!252 = !DIEnumerator(name: "SYS_DVBS", value: 5, isUnsigned: true)
!253 = !DIEnumerator(name: "SYS_DVBS2", value: 6, isUnsigned: true)
!254 = !DIEnumerator(name: "SYS_DVBH", value: 7, isUnsigned: true)
!255 = !DIEnumerator(name: "SYS_ISDBT", value: 8, isUnsigned: true)
!256 = !DIEnumerator(name: "SYS_ISDBS", value: 9, isUnsigned: true)
!257 = !DIEnumerator(name: "SYS_ISDBC", value: 10, isUnsigned: true)
!258 = !DIEnumerator(name: "SYS_ATSC", value: 11, isUnsigned: true)
!259 = !DIEnumerator(name: "SYS_ATSCMH", value: 12, isUnsigned: true)
!260 = !DIEnumerator(name: "SYS_DTMB", value: 13, isUnsigned: true)
!261 = !DIEnumerator(name: "SYS_CMMB", value: 14, isUnsigned: true)
!262 = !DIEnumerator(name: "SYS_DAB", value: 15, isUnsigned: true)
!263 = !DIEnumerator(name: "SYS_DVBT2", value: 16, isUnsigned: true)
!264 = !DIEnumerator(name: "SYS_TURBO", value: 17, isUnsigned: true)
!265 = !DIEnumerator(name: "SYS_DVBC_ANNEX_C", value: 18, isUnsigned: true)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fe_interleaving", file: !108, line: 451, baseType: !7, size: 32, elements: !267)
!267 = !{!268, !269, !270, !271}
!268 = !DIEnumerator(name: "INTERLEAVING_NONE", value: 0, isUnsigned: true)
!269 = !DIEnumerator(name: "INTERLEAVING_AUTO", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "INTERLEAVING_240", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "INTERLEAVING_720", value: 3, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fe_sec_mini_cmd", file: !108, line: 233, baseType: !7, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIEnumerator(name: "SEC_MINI_A", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "SEC_MINI_B", value: 1, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dvbfe_search", file: !152, line: 173, baseType: !7, size: 32, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283}
!278 = !DIEnumerator(name: "DVBFE_ALGO_SEARCH_SUCCESS", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "DVBFE_ALGO_SEARCH_ASLEEP", value: 2, isUnsigned: true)
!280 = !DIEnumerator(name: "DVBFE_ALGO_SEARCH_FAILED", value: 4, isUnsigned: true)
!281 = !DIEnumerator(name: "DVBFE_ALGO_SEARCH_INVALID", value: 8, isUnsigned: true)
!282 = !DIEnumerator(name: "DVBFE_ALGO_SEARCH_AGAIN", value: 16, isUnsigned: true)
!283 = !DIEnumerator(name: "DVBFE_ALGO_SEARCH_ERROR", value: 2147483648, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dvb_device_type", file: !285, line: 57, baseType: !7, size: 32, elements: !286)
!285 = !DIFile(filename: "./include/media/dvbdev.h", directory: "/home/lizy2001/genbc/linux")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295}
!287 = !DIEnumerator(name: "DVB_DEVICE_SEC", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "DVB_DEVICE_FRONTEND", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "DVB_DEVICE_DEMUX", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "DVB_DEVICE_DVR", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "DVB_DEVICE_CA", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "DVB_DEVICE_NET", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "DVB_DEVICE_VIDEO", value: 6, isUnsigned: true)
!294 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!295 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !297, line: 305, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!298 = !{!299, !300, !301, !302}
!299 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !304, line: 10, baseType: !7, size: 32, elements: !305)
!304 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!305 = !{!306, !307}
!306 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!308 = !{!309, !311}
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !310, line: 148, baseType: !7)
!310 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!312 = !{!313, !385, !390, !395, !400, !405, !410, !415, !0, !417}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 16, type: !315, isLocal: true, isDefinition: true, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !317, line: 69, size: 320, elements: !318)
!317 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!318 = !{!319, !323, !327, !348, !355, !359, !363}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 70, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !316, file: !317, line: 71, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !326, line: 76, flags: DIFlagFwdDecl)
!326 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !316, file: !317, line: 72, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !317, line: 47, size: 256, elements: !331)
!331 = !{!332, !333, !339, !344}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !317, line: 49, baseType: !7, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !330, file: !317, line: 51, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !320, !338}
!337 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !330, file: !317, line: 53, baseType: !340, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!337, !343, !338}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !330, file: !317, line: 55, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !311}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !316, file: !317, line: 73, baseType: !349, size: 16, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !351, line: 19, baseType: !352)
!351 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !353, line: 24, baseType: !354)
!353 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!354 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !316, file: !317, line: 74, baseType: !356, size: 8, offset: 208)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !351, line: 16, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !353, line: 20, baseType: !358)
!358 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !317, line: 75, baseType: !360, size: 8, offset: 216)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !351, line: 17, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !353, line: 21, baseType: !362)
!362 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !316, file: !317, line: 76, baseType: !364, size: 64, offset: 256)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !317, line: 76, size: 64, elements: !365)
!365 = !{!366, !367, !374}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !364, file: !317, line: 77, baseType: !311, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !364, file: !317, line: 78, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !317, line: 86, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !370, file: !317, line: 87, baseType: !7, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !370, file: !317, line: 88, baseType: !343, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !364, file: !317, line: 79, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !317, line: 92, size: 256, elements: !378)
!378 = !{!379, !380, !381, !383, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !377, file: !317, line: 94, baseType: !7, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !377, file: !317, line: 95, baseType: !7, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !377, file: !317, line: 96, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !377, file: !317, line: 97, baseType: !328, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !377, file: !317, line: 98, baseType: !311, size: 64, offset: 192)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype250", scope: !2, file: !3, line: 16, type: !387, isLocal: true, isDefinition: true, align: 8)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 216, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 27)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug251", scope: !2, file: !3, line: 17, type: !392, isLocal: true, isDefinition: true, align: 8)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 392, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 49)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description252", scope: !2, file: !3, line: 339, type: !397, isLocal: true, isDefinition: true, align: 8)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 416, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 52)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author253", scope: !2, file: !3, line: 340, type: !402, isLocal: true, isDefinition: true, align: 8)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 464, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 58)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file254", scope: !2, file: !3, line: 341, type: !407, isLocal: true, isDefinition: true, align: 8)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 336, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 42)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license255", scope: !2, file: !3, line: 341, type: !412, isLocal: true, isDefinition: true, align: 8)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 184, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 23)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 15, type: !337, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "tea5761_tuner_ops", scope: !2, file: !3, line: 297, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !152, line: 226, size: 2304, elements: !421)
!421 = !{!422, !437, !4430, !4431, !4432, !4433, !4434, !4435, !4439, !4440, !4441, !4442, !4443, !4444, !4445, !4446, !4451, !4455}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !420, file: !152, line: 228, baseType: !423, size: 1216)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !152, line: 88, size: 1216, elements: !424)
!424 = !{!425, !429, !432, !433, !434, !435, !436}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !152, line: 89, baseType: !426, size: 1024)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 1024, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !423, file: !152, line: 91, baseType: !430, size: 32, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !351, line: 21, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !353, line: 27, baseType: !7)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !423, file: !152, line: 92, baseType: !430, size: 32, offset: 1056)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !423, file: !152, line: 93, baseType: !430, size: 32, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !423, file: !152, line: 95, baseType: !430, size: 32, offset: 1120)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !423, file: !152, line: 96, baseType: !430, size: 32, offset: 1152)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !423, file: !152, line: 97, baseType: !430, size: 32, offset: 1184)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !420, file: !152, line: 230, baseType: !438, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !152, line: 686, size: 10240, elements: !443)
!443 = !{!444, !458, !706, !4418, !4419, !4420, !4421, !4422, !4423, !4424, !4428, !4429}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !442, file: !152, line: 687, baseType: !445, size: 32)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !446, line: 19, size: 32, elements: !447)
!446 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !445, file: !446, line: 20, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !450, line: 113, baseType: !451)
!450 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !450, line: 111, size: 32, elements: !452)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !451, file: !450, line: 112, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !310, line: 168, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 166, size: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !455, file: !310, line: 167, baseType: !337, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !442, file: !152, line: 688, baseType: !459, size: 6016, offset: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !152, line: 435, size: 6016, elements: !460)
!460 = !{!461, !473, !477, !478, !479, !480, !484, !485, !491, !498, !502, !503, !513, !598, !602, !607, !612, !613, !614, !615, !627, !638, !642, !646, !650, !655, !660, !664, !665, !666, !670, !671}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !459, file: !152, line: 436, baseType: !462, size: 1280)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !152, line: 338, size: 1280, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !462, file: !152, line: 339, baseType: !426, size: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !462, file: !152, line: 340, baseType: !430, size: 32, offset: 1024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !462, file: !152, line: 341, baseType: !430, size: 32, offset: 1056)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !462, file: !152, line: 342, baseType: !430, size: 32, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !462, file: !152, line: 343, baseType: !430, size: 32, offset: 1120)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !462, file: !152, line: 344, baseType: !430, size: 32, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !462, file: !152, line: 345, baseType: !430, size: 32, offset: 1184)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !462, file: !152, line: 346, baseType: !430, size: 32, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !462, file: !152, line: 347, baseType: !107, size: 32, offset: 1248)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !459, file: !152, line: 438, baseType: !474, size: 64, offset: 1280)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 64, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !459, file: !152, line: 440, baseType: !438, size: 64, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !459, file: !152, line: 441, baseType: !438, size: 64, offset: 1408)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !459, file: !152, line: 442, baseType: !438, size: 64, offset: 1472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !459, file: !152, line: 444, baseType: !481, size: 64, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!337, !441}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !459, file: !152, line: 445, baseType: !481, size: 64, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !459, file: !152, line: 447, baseType: !486, size: 64, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!337, !441, !489, !337}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !459, file: !152, line: 450, baseType: !492, size: 64, offset: 1728)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!337, !441, !495, !7, !382, !497}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !310, line: 30, baseType: !496)
!496 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !459, file: !152, line: 457, baseType: !499, size: 64, offset: 1792)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!151, !441}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !459, file: !152, line: 460, baseType: !481, size: 64, offset: 1856)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !459, file: !152, line: 461, baseType: !504, size: 64, offset: 1920)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!337, !441, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !152, line: 69, size: 96, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !508, file: !152, line: 70, baseType: !337, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !508, file: !152, line: 71, baseType: !337, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !508, file: !152, line: 72, baseType: !337, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !459, file: !152, line: 463, baseType: !514, size: 64, offset: 1984)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!337, !441, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !152, line: 586, size: 3648, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !591, !592, !593, !594, !595, !596, !597}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !518, file: !152, line: 587, baseType: !430, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !518, file: !152, line: 588, baseType: !158, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !518, file: !152, line: 590, baseType: !174, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !518, file: !152, line: 591, baseType: !179, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !518, file: !152, line: 592, baseType: !183, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !518, file: !152, line: 593, baseType: !188, size: 32, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !518, file: !152, line: 594, baseType: !203, size: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !518, file: !152, line: 595, baseType: !430, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !518, file: !152, line: 596, baseType: !214, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !518, file: !152, line: 597, baseType: !227, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !518, file: !152, line: 598, baseType: !430, size: 32, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !518, file: !152, line: 599, baseType: !188, size: 32, offset: 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !518, file: !152, line: 600, baseType: !188, size: 32, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !518, file: !152, line: 602, baseType: !234, size: 32, offset: 416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !518, file: !152, line: 603, baseType: !239, size: 32, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !518, file: !152, line: 605, baseType: !245, size: 32, offset: 480)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !518, file: !152, line: 607, baseType: !266, size: 32, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !518, file: !152, line: 610, baseType: !360, size: 8, offset: 544)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !518, file: !152, line: 611, baseType: !360, size: 8, offset: 552)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !518, file: !152, line: 612, baseType: !360, size: 8, offset: 560)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !518, file: !152, line: 613, baseType: !430, size: 32, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !518, file: !152, line: 614, baseType: !430, size: 32, offset: 608)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !518, file: !152, line: 615, baseType: !360, size: 8, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !518, file: !152, line: 621, baseType: !544, size: 384, offset: 672)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 384, elements: !551)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !152, line: 616, size: 128, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !545, file: !152, line: 617, baseType: !360, size: 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !545, file: !152, line: 618, baseType: !188, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !545, file: !152, line: 619, baseType: !158, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !545, file: !152, line: 620, baseType: !360, size: 8, offset: 96)
!551 = !{!552}
!552 = !DISubrange(count: 3)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !518, file: !152, line: 624, baseType: !430, size: 32, offset: 1056)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !518, file: !152, line: 627, baseType: !430, size: 32, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !518, file: !152, line: 630, baseType: !360, size: 8, offset: 1120)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !518, file: !152, line: 631, baseType: !360, size: 8, offset: 1128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !518, file: !152, line: 632, baseType: !360, size: 8, offset: 1136)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !518, file: !152, line: 633, baseType: !360, size: 8, offset: 1144)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !518, file: !152, line: 634, baseType: !360, size: 8, offset: 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !518, file: !152, line: 635, baseType: !360, size: 8, offset: 1160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !518, file: !152, line: 637, baseType: !360, size: 8, offset: 1168)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !518, file: !152, line: 638, baseType: !360, size: 8, offset: 1176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !518, file: !152, line: 639, baseType: !360, size: 8, offset: 1184)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !518, file: !152, line: 640, baseType: !360, size: 8, offset: 1192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !518, file: !152, line: 641, baseType: !360, size: 8, offset: 1200)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !518, file: !152, line: 642, baseType: !360, size: 8, offset: 1208)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !518, file: !152, line: 643, baseType: !360, size: 8, offset: 1216)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !518, file: !152, line: 644, baseType: !360, size: 8, offset: 1224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !518, file: !152, line: 645, baseType: !360, size: 8, offset: 1232)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !518, file: !152, line: 647, baseType: !430, size: 32, offset: 1248)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !518, file: !152, line: 650, baseType: !572, size: 296, offset: 1280)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !108, line: 825, size: 296, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !572, file: !108, line: 826, baseType: !361, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !572, file: !108, line: 827, baseType: !576, size: 288, offset: 8)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 288, elements: !589)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !108, line: 803, size: 72, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !577, file: !108, line: 804, baseType: !361, size: 8)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !108, line: 805, baseType: !581, size: 64, offset: 8)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !108, line: 805, size: 64, elements: !582)
!582 = !{!583, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !581, file: !108, line: 806, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !353, line: 31, baseType: !585)
!585 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !581, file: !108, line: 807, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !353, line: 30, baseType: !588)
!588 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!589 = !{!590}
!590 = !DISubrange(count: 4)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !518, file: !152, line: 651, baseType: !572, size: 296, offset: 1576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !518, file: !152, line: 652, baseType: !572, size: 296, offset: 1872)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !518, file: !152, line: 653, baseType: !572, size: 296, offset: 2168)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !518, file: !152, line: 654, baseType: !572, size: 296, offset: 2464)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !518, file: !152, line: 655, baseType: !572, size: 296, offset: 2760)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !518, file: !152, line: 656, baseType: !572, size: 296, offset: 3056)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !518, file: !152, line: 657, baseType: !572, size: 296, offset: 3352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !459, file: !152, line: 466, baseType: !599, size: 64, offset: 2048)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!337, !441, !497}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !459, file: !152, line: 467, baseType: !603, size: 64, offset: 2112)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!337, !441, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !459, file: !152, line: 468, baseType: !608, size: 64, offset: 2176)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!337, !441, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !459, file: !152, line: 469, baseType: !608, size: 64, offset: 2240)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !459, file: !152, line: 470, baseType: !603, size: 64, offset: 2304)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !459, file: !152, line: 472, baseType: !481, size: 64, offset: 2368)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !459, file: !152, line: 473, baseType: !616, size: 64, offset: 2432)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!337, !441, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !108, line: 173, size: 56, elements: !621)
!621 = !{!622, !626}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !620, file: !108, line: 174, baseType: !623, size: 48)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 48, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 6)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !620, file: !108, line: 175, baseType: !361, size: 8, offset: 48)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !459, file: !152, line: 474, baseType: !628, size: 64, offset: 2496)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!337, !441, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !108, line: 195, size: 96, elements: !633)
!633 = !{!634, !636, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !632, file: !108, line: 196, baseType: !635, size: 32)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 32, elements: !589)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !632, file: !108, line: 197, baseType: !361, size: 8, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !632, file: !108, line: 198, baseType: !337, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !459, file: !152, line: 475, baseType: !639, size: 64, offset: 2560)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!337, !441, !272}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !459, file: !152, line: 477, baseType: !643, size: 64, offset: 2624)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!337, !441, !179}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !459, file: !152, line: 478, baseType: !647, size: 64, offset: 2688)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!337, !441, !174}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !459, file: !152, line: 480, baseType: !651, size: 64, offset: 2752)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!337, !441, !654}
!654 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !459, file: !152, line: 481, baseType: !656, size: 64, offset: 2816)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!337, !441, !659}
!659 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !459, file: !152, line: 482, baseType: !661, size: 64, offset: 2880)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!337, !441, !337}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !459, file: !152, line: 483, baseType: !661, size: 64, offset: 2944)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !459, file: !152, line: 484, baseType: !481, size: 64, offset: 3008)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !459, file: !152, line: 490, baseType: !667, size: 64, offset: 3072)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!276, !441}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !459, file: !152, line: 492, baseType: !420, size: 2304, offset: 3136)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !459, file: !152, line: 493, baseType: !672, size: 576, offset: 5440)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !152, line: 302, size: 576, elements: !673)
!673 = !{!674, !678, !690, !691, !698, !699, !700, !701, !702}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !672, file: !152, line: 304, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !152, line: 276, size: 64, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !152, line: 277, baseType: !343, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !672, file: !152, line: 306, baseType: !679, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !441, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !152, line: 114, size: 192, elements: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !683, file: !152, line: 115, baseType: !7, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !683, file: !152, line: 116, baseType: !7, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !683, file: !152, line: 117, baseType: !7, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !683, file: !152, line: 118, baseType: !689, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !351, line: 23, baseType: !584)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !672, file: !152, line: 308, baseType: !608, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !672, file: !152, line: 309, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!337, !441, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !351, line: 20, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !353, line: 26, baseType: !337)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !672, file: !152, line: 310, baseType: !438, size: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !672, file: !152, line: 311, baseType: !438, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !672, file: !152, line: 312, baseType: !438, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !672, file: !152, line: 313, baseType: !661, size: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !672, file: !152, line: 316, baseType: !703, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!337, !441, !311}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !442, file: !152, line: 689, baseType: !707, size: 64, offset: 6080)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !285, line: 101, size: 960, elements: !709)
!709 = !{!710, !711, !717, !718, !719, !721, !722, !4396, !4397, !4398, !4417}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !708, file: !285, line: 102, baseType: !337, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !708, file: !285, line: 103, baseType: !712, size: 128, offset: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !310, line: 178, size: 128, elements: !713)
!713 = !{!714, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !310, line: 179, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !712, file: !310, line: 179, baseType: !715, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !708, file: !285, line: 104, baseType: !712, size: 128, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !285, line: 105, baseType: !320, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !708, file: !285, line: 106, baseType: !720, size: 48, offset: 384)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 48, elements: !624)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !708, file: !285, line: 107, baseType: !311, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !708, file: !285, line: 109, baseType: !723, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !73, line: 461, size: 5568, elements: !725)
!725 = !{!726, !3853, !3854, !3857, !3858, !3909, !3997, !3998, !3999, !4000, !4001, !4010, !4115, !4128, !4323, !4324, !4328, !4330, !4331, !4332, !4336, !4342, !4343, !4346, !4347, !4348, !4349, !4350, !4351, !4352, !4384, !4385, !4386, !4389, !4392, !4393, !4394, !4395}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !724, file: !73, line: 462, baseType: !727, size: 512)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !728, line: 64, size: 512, elements: !729)
!728 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!729 = !{!730, !731, !732, !734, !791, !3708, !3847, !3848, !3849, !3850, !3851, !3852}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !728, line: 65, baseType: !320, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !727, file: !728, line: 66, baseType: !712, size: 128, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !727, file: !728, line: 67, baseType: !733, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !727, file: !728, line: 68, baseType: !735, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !728, line: 192, size: 704, elements: !737)
!737 = !{!738, !739, !755, !756}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !736, file: !728, line: 193, baseType: !712, size: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !736, file: !728, line: 194, baseType: !740, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !741, line: 83, baseType: !742)
!741 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !741, line: 71, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, scope: !742, file: !741, line: 72, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !742, file: !741, line: 72, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !745, file: !741, line: 73, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !741, line: 20, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !748, file: !741, line: 21, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !752, line: 25, baseType: !753)
!752 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 25, elements: !754)
!754 = !{}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !736, file: !728, line: 195, baseType: !727, size: 512, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !736, file: !728, line: 196, baseType: !757, size: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !728, line: 156, size: 192, elements: !760)
!760 = !{!761, !766, !771}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !759, file: !728, line: 157, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!337, !735, !733}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !759, file: !728, line: 158, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!320, !735, !733}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !759, file: !728, line: 159, baseType: !772, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!337, !735, !733, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !728, line: 148, size: 20736, elements: !778)
!778 = !{!779, !781, !785, !786, !790}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !777, file: !728, line: 149, baseType: !780, size: 192)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, elements: !551)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !777, file: !728, line: 150, baseType: !782, size: 4096, offset: 192)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 4096, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !777, file: !728, line: 151, baseType: !337, size: 32, offset: 4288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !777, file: !728, line: 152, baseType: !787, size: 16384, offset: 4320)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 16384, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 2048)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !777, file: !728, line: 153, baseType: !337, size: 32, offset: 20704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !727, file: !728, line: 69, baseType: !792, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !728, line: 138, size: 448, elements: !794)
!794 = !{!795, !799, !826, !828, !3670, !3698, !3702}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !793, file: !728, line: 139, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !733}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !793, file: !728, line: 140, baseType: !800, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !803, line: 230, size: 128, elements: !804)
!803 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!804 = !{!805, !819}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !802, file: !803, line: 231, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!809, !733, !813, !343}
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !310, line: 60, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !811, line: 73, baseType: !812)
!811 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !811, line: 15, baseType: !654)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !803, line: 30, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !803, line: 31, baseType: !320, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !814, file: !803, line: 32, baseType: !818, size: 16, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !310, line: 19, baseType: !354)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !802, file: !803, line: 232, baseType: !820, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!809, !733, !813, !320, !823}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 55, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !811, line: 72, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !811, line: 16, baseType: !659)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !793, file: !728, line: 141, baseType: !827, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !793, file: !728, line: 142, baseType: !829, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !803, line: 84, size: 320, elements: !833)
!833 = !{!834, !835, !839, !3667, !3668}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !832, file: !803, line: 85, baseType: !320, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !832, file: !803, line: 86, baseType: !836, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!818, !733, !813, !337}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !832, file: !803, line: 88, baseType: !840, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!818, !733, !843, !337}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !803, line: 168, size: 448, elements: !845)
!845 = !{!846, !847, !848, !849, !3662, !3663}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !844, file: !803, line: 169, baseType: !814, size: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !844, file: !803, line: 170, baseType: !823, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !844, file: !803, line: 171, baseType: !311, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !844, file: !803, line: 172, baseType: !850, size: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!809, !853, !733, !843, !343, !1019, !823}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !18, line: 916, size: 1856, align: 32, elements: !855)
!855 = !{!856, !874, !3627, !3628, !3629, !3630, !3631, !3632, !3633, !3634, !3635, !3636, !3645, !3646, !3655, !3656, !3657, !3658, !3659, !3660, !3661}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !854, file: !18, line: 920, baseType: !857, size: 128)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !854, file: !18, line: 917, size: 128, elements: !858)
!858 = !{!859, !865}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !857, file: !18, line: 918, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !861, line: 58, size: 64, elements: !862)
!861 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !860, file: !861, line: 59, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !857, file: !18, line: 919, baseType: !866, size: 128, align: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !310, line: 216, size: 128, align: 64, elements: !867)
!867 = !{!868, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !866, file: !310, line: 217, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !866, file: !310, line: 218, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !869}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !854, file: !18, line: 921, baseType: !875, size: 128, offset: 128)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !876, line: 8, size: 128, elements: !877)
!876 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!877 = !{!878, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !875, file: !876, line: 9, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !881, line: 18, flags: DIFlagFwdDecl)
!881 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!882 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !875, file: !876, line: 10, baseType: !883, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !881, line: 89, size: 1536, elements: !885)
!885 = !{!886, !887, !897, !905, !906, !921, !3596, !3598, !3610, !3611, !3612, !3613, !3614, !3619, !3620, !3621}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !884, file: !881, line: 91, baseType: !7, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !884, file: !881, line: 92, baseType: !888, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !889, line: 277, baseType: !890)
!889 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !889, line: 277, size: 32, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !890, file: !889, line: 277, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !889, line: 70, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !889, line: 65, size: 32, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !894, file: !889, line: 66, baseType: !7, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !884, file: !881, line: 93, baseType: !898, size: 128, offset: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !899, line: 38, size: 128, elements: !900)
!899 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!900 = !{!901, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !899, line: 39, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !898, file: !899, line: 39, baseType: !904, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !884, file: !881, line: 94, baseType: !883, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !884, file: !881, line: 95, baseType: !907, size: 128, offset: 256)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !881, line: 47, size: 128, elements: !908)
!908 = !{!909, !918}
!909 = !DIDerivedType(tag: DW_TAG_member, scope: !907, file: !881, line: 48, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !907, file: !881, line: 48, size: 64, elements: !911)
!911 = !{!912, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, scope: !910, file: !881, line: 49, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !910, file: !881, line: 49, size: 64, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !913, file: !881, line: 50, baseType: !430, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !913, file: !881, line: 50, baseType: !430, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !910, file: !881, line: 52, baseType: !689, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !907, file: !881, line: 54, baseType: !919, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !884, file: !881, line: 96, baseType: !922, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !18, line: 610, size: 4224, elements: !924)
!924 = !{!925, !926, !927, !935, !942, !943, !1084, !3290, !3291, !3292, !3298, !3299, !3300, !3301, !3302, !3303, !3304, !3305, !3306, !3307, !3308, !3309, !3310, !3311, !3312, !3313, !3314, !3315, !3316, !3317, !3322, !3323, !3324, !3325, !3326, !3327, !3328, !3564, !3572, !3573, !3574, !3592, !3593, !3594, !3595}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !923, file: !18, line: 611, baseType: !818, size: 16)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !923, file: !18, line: 612, baseType: !354, size: 16, offset: 16)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !923, file: !18, line: 613, baseType: !928, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !929, line: 23, baseType: !930)
!929 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !929, line: 21, size: 32, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !930, file: !929, line: 22, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !310, line: 32, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !811, line: 49, baseType: !7)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !923, file: !18, line: 614, baseType: !936, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !929, line: 28, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !929, line: 26, size: 32, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !937, file: !929, line: 27, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !310, line: 33, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !811, line: 50, baseType: !7)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !923, file: !18, line: 615, baseType: !7, size: 32, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !923, file: !18, line: 622, baseType: !944, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !18, line: 1864, size: 1536, align: 512, elements: !947)
!947 = !{!948, !952, !962, !966, !972, !976, !980, !984, !988, !992, !996, !997, !1003, !1007, !1031, !1060, !1064, !1070, !1075, !1079, !1080}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !946, file: !18, line: 1865, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!883, !922, !883, !7}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !946, file: !18, line: 1866, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!320, !883, !922, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !958, line: 10, size: 128, elements: !959)
!958 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !957, file: !958, line: 11, baseType: !345, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !957, file: !958, line: 12, baseType: !311, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !946, file: !18, line: 1867, baseType: !963, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!337, !922, !337}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !946, file: !18, line: 1868, baseType: !967, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !922, !337}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !18, line: 581, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !946, file: !18, line: 1870, baseType: !973, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!337, !883, !343, !337}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !946, file: !18, line: 1872, baseType: !977, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!337, !922, !883, !818, !495}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !946, file: !18, line: 1873, baseType: !981, size: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!337, !883, !922, !883}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !946, file: !18, line: 1874, baseType: !985, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!337, !922, !883}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !946, file: !18, line: 1875, baseType: !989, size: 64, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!337, !922, !883, !320}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !946, file: !18, line: 1876, baseType: !993, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!337, !922, !883, !818}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !946, file: !18, line: 1877, baseType: !985, size: 64, offset: 640)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !946, file: !18, line: 1878, baseType: !998, size: 64, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!337, !922, !883, !818, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !310, line: 16, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !310, line: 13, baseType: !430)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !946, file: !18, line: 1879, baseType: !1004, size: 64, offset: 768)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!337, !922, !883, !922, !883, !7}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !946, file: !18, line: 1881, baseType: !1008, size: 64, offset: 832)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!337, !883, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !18, line: 219, size: 640, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1021, !1028, !1029, !1030}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1012, file: !18, line: 220, baseType: !7, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1012, file: !18, line: 221, baseType: !818, size: 16, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1012, file: !18, line: 222, baseType: !928, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1012, file: !18, line: 223, baseType: !936, size: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1012, file: !18, line: 224, baseType: !1019, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !310, line: 46, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !811, line: 88, baseType: !588)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1012, file: !18, line: 225, baseType: !1022, size: 128, offset: 192)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1023, line: 13, size: 128, elements: !1024)
!1023 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1024 = !{!1025, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1022, file: !1023, line: 14, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1023, line: 8, baseType: !587)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1022, file: !1023, line: 15, baseType: !654, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1012, file: !18, line: 226, baseType: !1022, size: 128, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1012, file: !18, line: 227, baseType: !1022, size: 128, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1012, file: !18, line: 234, baseType: !853, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !946, file: !18, line: 1882, baseType: !1032, size: 64, offset: 896)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!337, !1035, !1037, !430, !7}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1039, line: 22, size: 1152, elements: !1040)
!1039 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1040 = !{!1041, !1042, !1043, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1038, file: !1039, line: 23, baseType: !430, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1038, file: !1039, line: 24, baseType: !818, size: 16, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1038, file: !1039, line: 25, baseType: !7, size: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1038, file: !1039, line: 26, baseType: !1045, size: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !310, line: 104, baseType: !430)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1038, file: !1039, line: 27, baseType: !689, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1038, file: !1039, line: 28, baseType: !689, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1038, file: !1039, line: 37, baseType: !689, size: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1038, file: !1039, line: 38, baseType: !1001, size: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1038, file: !1039, line: 39, baseType: !1001, size: 32, offset: 352)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1038, file: !1039, line: 40, baseType: !928, size: 32, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1038, file: !1039, line: 41, baseType: !936, size: 32, offset: 416)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1038, file: !1039, line: 42, baseType: !1019, size: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1038, file: !1039, line: 43, baseType: !1022, size: 128, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1038, file: !1039, line: 44, baseType: !1022, size: 128, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1038, file: !1039, line: 45, baseType: !1022, size: 128, offset: 768)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1038, file: !1039, line: 46, baseType: !1022, size: 128, offset: 896)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1038, file: !1039, line: 47, baseType: !689, size: 64, offset: 1024)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1038, file: !1039, line: 48, baseType: !689, size: 64, offset: 1088)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !946, file: !18, line: 1883, baseType: !1061, size: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!809, !883, !343, !823}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !946, file: !18, line: 1884, baseType: !1065, size: 64, offset: 1024)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!337, !922, !1068, !689, !689}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !18, line: 50, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !946, file: !18, line: 1886, baseType: !1071, size: 64, offset: 1088)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!337, !922, !1074, !337}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !946, file: !18, line: 1887, baseType: !1076, size: 64, offset: 1152)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!337, !922, !883, !853, !7, !818}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !946, file: !18, line: 1890, baseType: !993, size: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !946, file: !18, line: 1891, baseType: !1081, size: 64, offset: 1280)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!337, !922, !970, !337}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !923, file: !18, line: 623, baseType: !1085, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !18, line: 1416, size: 9472, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1140, !2898, !2980, !3063, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3079, !3083, !3084, !3087, !3088, !3091, !3092, !3093, !3134, !3160, !3161, !3162, !3163, !3164, !3165, !3168, !3170, !3177, !3178, !3180, !3181, !3182, !3241, !3242, !3257, !3258, !3259, !3260, !3261, !3264, !3265, !3266, !3281, !3282, !3283, !3284, !3285, !3286, !3287, !3288, !3289}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1086, file: !18, line: 1417, baseType: !712, size: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1086, file: !18, line: 1418, baseType: !1001, size: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1086, file: !18, line: 1419, baseType: !362, size: 8, offset: 160)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1086, file: !18, line: 1420, baseType: !659, size: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1086, file: !18, line: 1421, baseType: !1019, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1086, file: !18, line: 1422, baseType: !1094, size: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !18, line: 2228, size: 576, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1106, !1110, !1114, !1118, !1119, !1120, !1130, !1133, !1134, !1135, !1137, !1138, !1139}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1095, file: !18, line: 2229, baseType: !320, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1095, file: !18, line: 2230, baseType: !337, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1095, file: !18, line: 2238, baseType: !1100, size: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!337, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1105, line: 28, flags: DIFlagFwdDecl)
!1105 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1095, file: !18, line: 2239, baseType: !1107, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !18, line: 70, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1095, file: !18, line: 2240, baseType: !1111, size: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!883, !1094, !337, !320, !311}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1095, file: !18, line: 2242, baseType: !1115, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !1085}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1095, file: !18, line: 2243, baseType: !324, size: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1095, file: !18, line: 2244, baseType: !1094, size: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1095, file: !18, line: 2245, baseType: !1121, size: 64, offset: 512)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !310, line: 182, size: 64, elements: !1122)
!1122 = !{!1123}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1121, file: !310, line: 183, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !310, line: 186, size: 128, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1125, file: !310, line: 187, baseType: !1124, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1125, file: !310, line: 187, baseType: !1129, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1095, file: !18, line: 2247, baseType: !1131, offset: 576)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1132, line: 187, elements: !754)
!1132 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1095, file: !18, line: 2248, baseType: !1131, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1095, file: !18, line: 2249, baseType: !1131, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1095, file: !18, line: 2250, baseType: !1136, offset: 576)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, elements: !551)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1095, file: !18, line: 2252, baseType: !1131, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1095, file: !18, line: 2253, baseType: !1131, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1095, file: !18, line: 2254, baseType: !1131, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1086, file: !18, line: 1423, baseType: !1141, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !18, line: 1935, size: 1472, elements: !1144)
!1144 = !{!1145, !1149, !1153, !1154, !1158, !1164, !1168, !1169, !1170, !1174, !1178, !1179, !1180, !1181, !1187, !1192, !1193, !1200, !1201, !1202, !1203, !2882, !2897}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1143, file: !18, line: 1936, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!922, !1085}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1143, file: !18, line: 1937, baseType: !1150, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !922}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1143, file: !18, line: 1938, baseType: !1150, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1143, file: !18, line: 1940, baseType: !1155, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{null, !922, !337}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1143, file: !18, line: 1941, baseType: !1159, size: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!337, !922, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !18, line: 289, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1143, file: !18, line: 1942, baseType: !1165, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!337, !922}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1143, file: !18, line: 1943, baseType: !1150, size: 64, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1143, file: !18, line: 1944, baseType: !1115, size: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1143, file: !18, line: 1945, baseType: !1171, size: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!337, !1085, !337}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1143, file: !18, line: 1946, baseType: !1175, size: 64, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!337, !1085}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1143, file: !18, line: 1947, baseType: !1175, size: 64, offset: 640)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1143, file: !18, line: 1948, baseType: !1175, size: 64, offset: 704)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1143, file: !18, line: 1949, baseType: !1175, size: 64, offset: 768)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1143, file: !18, line: 1950, baseType: !1182, size: 64, offset: 832)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!337, !883, !1185}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !18, line: 57, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1143, file: !18, line: 1951, baseType: !1188, size: 64, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!337, !1085, !1191, !343}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1143, file: !18, line: 1952, baseType: !1115, size: 64, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1143, file: !18, line: 1954, baseType: !1194, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!337, !1197, !883}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1199, line: 539, flags: DIFlagFwdDecl)
!1199 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1143, file: !18, line: 1955, baseType: !1194, size: 64, offset: 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1143, file: !18, line: 1956, baseType: !1194, size: 64, offset: 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1143, file: !18, line: 1957, baseType: !1194, size: 64, offset: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1143, file: !18, line: 1963, baseType: !1204, size: 64, offset: 1280)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!337, !1085, !1207, !309}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1209, line: 68, size: 512, align: 128, elements: !1210)
!1209 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1210 = !{!1211, !1212, !2874, !2881}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1208, file: !1209, line: 69, baseType: !659, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, scope: !1208, file: !1209, line: 77, baseType: !1213, size: 320, offset: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1208, file: !1209, line: 77, size: 320, elements: !1214)
!1214 = !{!1215, !1396, !1401, !1429, !1437, !1443, !2805, !2873}
!1215 = !DIDerivedType(tag: DW_TAG_member, scope: !1213, file: !1209, line: 78, baseType: !1216, size: 320)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1213, file: !1209, line: 78, size: 320, elements: !1217)
!1217 = !{!1218, !1219, !1394, !1395}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1216, file: !1209, line: 84, baseType: !712, size: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1216, file: !1209, line: 86, baseType: !1220, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !18, line: 451, size: 1216, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1231, !1232, !1233, !1248, !1264, !1265, !1266, !1267, !1387, !1388, !1391, !1392, !1393}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1221, file: !18, line: 452, baseType: !922, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1221, file: !18, line: 453, baseType: !1225, size: 128, offset: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1226, line: 292, size: 128, elements: !1227)
!1226 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1225, file: !1226, line: 293, baseType: !740)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1225, file: !1226, line: 295, baseType: !309, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1225, file: !1226, line: 296, baseType: !311, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1221, file: !18, line: 454, baseType: !309, size: 32, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1221, file: !18, line: 455, baseType: !454, size: 32, offset: 224)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1221, file: !18, line: 460, baseType: !1234, size: 128, offset: 256)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1235, line: 125, size: 128, elements: !1236)
!1235 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1236 = !{!1237, !1247}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1234, file: !1235, line: 126, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1235, line: 31, size: 64, elements: !1239)
!1239 = !{!1240}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1238, file: !1235, line: 32, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1235, line: 24, size: 192, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1242, file: !1235, line: 25, baseType: !659, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1242, file: !1235, line: 26, baseType: !1241, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1242, file: !1235, line: 27, baseType: !1241, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1234, file: !1235, line: 127, baseType: !1241, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1221, file: !18, line: 461, baseType: !1249, size: 256, offset: 384)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1250, line: 35, size: 256, elements: !1251)
!1250 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1251 = !{!1252, !1260, !1261, !1263}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1249, file: !1250, line: 36, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1254, line: 13, baseType: !1255)
!1254 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !310, line: 175, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 173, size: 64, elements: !1257)
!1257 = !{!1258}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1256, file: !310, line: 174, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !351, line: 22, baseType: !587)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1249, file: !1250, line: 42, baseType: !1253, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1249, file: !1250, line: 46, baseType: !1262, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !741, line: 29, baseType: !748)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1249, file: !1250, line: 47, baseType: !712, size: 128, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1221, file: !18, line: 462, baseType: !659, size: 64, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1221, file: !18, line: 463, baseType: !659, size: 64, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1221, file: !18, line: 464, baseType: !659, size: 64, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1221, file: !18, line: 465, baseType: !1268, size: 64, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !18, line: 367, size: 1408, elements: !1271)
!1271 = !{!1272, !1276, !1280, !1284, !1288, !1292, !1298, !1304, !1308, !1313, !1317, !1321, !1325, !1351, !1355, !1361, !1362, !1363, !1367, !1372, !1376, !1383}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1270, file: !18, line: 368, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!337, !1207, !1162}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1270, file: !18, line: 369, baseType: !1277, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!337, !853, !1207}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1270, file: !18, line: 372, baseType: !1281, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!337, !1220, !1162}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1270, file: !18, line: 375, baseType: !1285, size: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!337, !1207}
