; ModuleID = '../bcout/drivers/media/tuners/tuner-types.llvm.bc'
source_filename = "drivers/media/tuners/tuner-types.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.tunertype = type { i8*, i32, %struct.tuner_params*, i16, i16, i32, i8*, i8* }
%struct.tuner_params = type { i32, i32, i16, i16, i32, %struct.tuner_range* }
%struct.tuner_range = type { i16, i8, i8 }

@.str = private unnamed_addr constant [21 x i8] c"Temic PAL (4002 FH5)\00", align 1
@.str.1 = private unnamed_addr constant [39 x i8] c"Philips PAL_I (FI1246 and compatibles)\00", align 1
@.str.2 = private unnamed_addr constant [45 x i8] c"Philips NTSC (FI1236,FM1236 and compatibles)\00", align 1
@.str.3 = private unnamed_addr constant [54 x i8] c"Philips (SECAM+PAL_BG) (FI1216MF, FM1216MF, FR1216MF)\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"NoTuner\00", align 1
@.str.5 = private unnamed_addr constant [40 x i8] c"Philips PAL_BG (FI1216 and compatibles)\00", align 1
@.str.6 = private unnamed_addr constant [22 x i8] c"Temic NTSC (4032 FY5)\00", align 1
@.str.7 = private unnamed_addr constant [23 x i8] c"Temic PAL_I (4062 FY5)\00", align 1
@.str.8 = private unnamed_addr constant [22 x i8] c"Temic NTSC (4036 FY5)\00", align 1
@.str.9 = private unnamed_addr constant [11 x i8] c"Alps HSBH1\00", align 1
@.str.10 = private unnamed_addr constant [11 x i8] c"Alps TSBE1\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "tua603x_agc103", scope: !2, file: !3, line: 52, type: !314, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/media/tuners/tuner-types.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "param_type", file: !6, line: 18, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/media/tuner-types.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "TUNER_PARAM_TYPE_RADIO", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "TUNER_PARAM_TYPE_PAL", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "TUNER_PARAM_TYPE_SECAM", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "TUNER_PARAM_TYPE_NTSC", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "TUNER_PARAM_TYPE_DIGITAL", value: 4, isUnsigned: true)
!14 = !{!15, !76, !79, !85, !90, !95, !100, !105, !110, !112, !114, !116, !118, !120, !122, !124, !126, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !261, !263, !265, !267, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !289, !291, !293, !295, !297, !0, !299, !301, !303, !305, !307, !312, !315, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "tuners", scope: !2, file: !3, line: 1439, type: !17, isLocal: false, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 35328, elements: !74)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tunertype", file: !6, line: 189, size: 384, elements: !19)
!19 = !{!20, !23, !24, !64, !65, !66, !69, !73}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !6, line: 190, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !18, file: !6, line: 191, baseType: !7, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !18, file: !6, line: 192, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tuner_params", file: !6, line: 145, size: 192, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !44, !45, !46, !47, !48, !49, !55, !56}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !6, line: 146, baseType: !5, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cb_first_if_lower_freq", scope: !26, file: !6, line: 148, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "has_tda9887", scope: !26, file: !6, line: 149, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "port1_fm_high_sensitivity", scope: !26, file: !6, line: 150, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "port2_fm_high_sensitivity", scope: !26, file: !6, line: 151, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fm_gain_normal", scope: !26, file: !6, line: 152, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "intercarrier_mode", scope: !26, file: !6, line: 153, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "port1_active", scope: !26, file: !6, line: 154, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "port2_active", scope: !26, file: !6, line: 155, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "port1_invert_for_secam_lc", scope: !26, file: !6, line: 156, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "port2_invert_for_secam_lc", scope: !26, file: !6, line: 157, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "port1_set_for_fm_mono", scope: !26, file: !6, line: 158, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "default_pll_gating_18", scope: !26, file: !6, line: 159, baseType: !7, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "radio_if", scope: !26, file: !6, line: 160, baseType: !7, size: 2, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "default_top_low", scope: !26, file: !6, line: 161, baseType: !43, size: 5, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "default_top_mid", scope: !26, file: !6, line: 162, baseType: !43, size: 5, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "default_top_high", scope: !26, file: !6, line: 163, baseType: !43, size: 5, offset: 56, flags: DIFlagBitField, extraData: i64 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "default_top_secam_low", scope: !26, file: !6, line: 164, baseType: !43, size: 5, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "default_top_secam_mid", scope: !26, file: !6, line: 165, baseType: !43, size: 5, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "default_top_secam_high", scope: !26, file: !6, line: 166, baseType: !43, size: 5, offset: 74, flags: DIFlagBitField, extraData: i64 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "iffreq", scope: !26, file: !6, line: 168, baseType: !50, size: 16, offset: 80)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !51, line: 19, baseType: !52)
!51 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !53, line: 24, baseType: !54)
!53 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!54 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !26, file: !6, line: 170, baseType: !7, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ranges", scope: !26, file: !6, line: 171, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tuner_range", file: !6, line: 47, size: 32, elements: !59)
!59 = !{!60, !61, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !58, file: !6, line: 48, baseType: !54, size: 16)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !58, file: !6, line: 49, baseType: !62, size: 8, offset: 16)
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !58, file: !6, line: 50, baseType: !62, size: 8, offset: 24)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !18, file: !6, line: 194, baseType: !50, size: 16, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !18, file: !6, line: 195, baseType: !50, size: 16, offset: 208)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !18, file: !6, line: 196, baseType: !67, size: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !51, line: 21, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !53, line: 27, baseType: !7)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "initdata", scope: !18, file: !6, line: 198, baseType: !70, size: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !51, line: 17, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !53, line: 21, baseType: !62)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sleepdata", scope: !18, file: !6, line: 199, baseType: !70, size: 64, offset: 320)
!74 = !{!75}
!75 = !DISubrange(count: 92)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "tuner_count", scope: !2, file: !3, line: 1948, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description250", scope: !2, file: !3, line: 1951, type: !81, isLocal: true, isDefinition: true, align: 8)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 464, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!83 = !{!84}
!84 = !DISubrange(count: 58)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author251", scope: !2, file: !3, line: 1952, type: !87, isLocal: true, isDefinition: true, align: 8)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 480, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 60)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file252", scope: !2, file: !3, line: 1953, type: !92, isLocal: true, isDefinition: true, align: 8)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 400, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 50)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license253", scope: !2, file: !3, line: 1953, type: !97, isLocal: true, isDefinition: true, align: 8)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 192, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 24)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "tuner_temic_pal_params", scope: !2, file: !3, line: 70, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "tuner_temic_pal_ranges", scope: !2, file: !3, line: 64, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 96, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 3)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "tuner_philips_pal_i_params", scope: !2, file: !3, line: 86, type: !102, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "tuner_philips_pal_i_ranges", scope: !2, file: !3, line: 80, type: !107, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "tuner_philips_ntsc_params", scope: !2, file: !3, line: 102, type: !102, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "tuner_philips_ntsc_ranges", scope: !2, file: !3, line: 96, type: !107, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "tuner_philips_secam_params", scope: !2, file: !3, line: 119, type: !102, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "tuner_philips_secam_ranges", scope: !2, file: !3, line: 113, type: !107, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
