; ModuleID = '../bcout/drivers/gpu/drm/drm_flip_work.llvm.bc'
source_filename = "drivers/gpu/drm/drm_flip_work.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !49, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/gpu/drm/drm_flip_work.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3, !36, !44}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 30, baseType: !5, size: 64, elements: !6)
!4 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!7 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!8 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!9 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!10 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!11 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!12 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!13 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!14 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!15 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!16 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!17 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!18 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!19 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!20 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!21 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!22 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!23 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!24 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!25 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!26 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!27 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!28 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!29 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!30 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!31 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!32 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!33 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!34 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!35 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !37, line: 305, baseType: !38, size: 32, elements: !39)
!37 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 10, baseType: !38, size: 32, elements: !46)
!45 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !48}
!47 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!49 = !{!50, !52, !53, !54, !61, !62, !115, !120}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !51, line: 148, baseType: !38)
!51 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !51, line: 178, size: 128, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !51, line: 179, baseType: !56, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !57, file: !51, line: 179, baseType: !56, size: 64, offset: 64)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_flip_work", file: !64, line: 73, size: 640, elements: !65)
!64 = !DIFile(filename: "./include/drm/drm_flip_work.h", directory: "/home/lizy2001/genbc/linux")
!65 = !{!66, !70, !75, !97, !98, !99}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !64, line: 74, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !63, file: !64, line: 75, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "drm_flip_func_t", file: !64, line: 52, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !62, !53}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !63, file: !64, line: 76, baseType: !76, size: 256, offset: 128)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !4, line: 102, size: 256, elements: !77)
!77 = !{!78, !90, !91}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !4, line: 103, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !80, line: 13, baseType: !81)
!80 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !51, line: 175, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 173, size: 64, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !82, file: !51, line: 174, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !86, line: 22, baseType: !87)
!86 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !88, line: 30, baseType: !89)
!88 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!89 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !76, file: !4, line: 104, baseType: !57, size: 128, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !76, file: !4, line: 105, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !4, line: 21, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !63, file: !64, line: 77, baseType: !57, size: 128, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "commited", scope: !63, file: !64, line: 78, baseType: !57, size: 128, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !63, file: !64, line: 79, baseType: !100, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !101, line: 83, baseType: !102)
!101 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !101, line: 71, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !101, line: 72, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !101, line: 72, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !105, file: !101, line: 73, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !101, line: 20, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !108, file: !101, line: 21, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !112, line: 25, baseType: !113)
!112 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 25, elements: !114)
!114 = !{}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_flip_task", file: !64, line: 59, size: 192, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !116, file: !64, line: 60, baseType: !57, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !64, line: 61, baseType: !53, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!122 = !{!"rsp"}
!123 = !{i32 7, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{i32 1, !"wchar_size", i32 2}
!126 = !{i32 1, !"Code Model", i32 2}
!127 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!128 = distinct !DISubprogram(name: "drm_flip_work_allocate_task", scope: !1, file: !1, line: 37, type: !129, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !114)
!129 = !DISubroutineType(types: !130)
!130 = !{!115, !53, !50}
!131 = !DILocalVariable(name: "data", arg: 1, scope: !128, file: !1, line: 37, type: !53)
!132 = !DILocation(line: 37, column: 57, scope: !128)
!133 = !DILocalVariable(name: "flags", arg: 2, scope: !128, file: !1, line: 37, type: !50)
!134 = !DILocation(line: 37, column: 69, scope: !128)
!135 = !DILocalVariable(name: "task", scope: !128, file: !1, line: 39, type: !115)
!136 = !DILocation(line: 39, column: 24, scope: !128)
!137 = !DILocation(line: 41, column: 32, scope: !128)
!138 = !DILocation(line: 41, column: 9, scope: !128)
!139 = !DILocation(line: 41, column: 7, scope: !128)
!140 = !DILocation(line: 42, column: 6, scope: !141)
!141 = distinct !DILexicalBlock(scope: !128, file: !1, line: 42, column: 6)
!142 = !DILocation(line: 42, column: 6, scope: !128)
!143 = !DILocation(line: 43, column: 16, scope: !141)
!144 = !DILocation(line: 43, column: 3, scope: !141)
!145 = !DILocation(line: 43, column: 9, scope: !141)
!146 = !DILocation(line: 43, column: 14, scope: !141)
!147 = !DILocation(line: 45, column: 9, scope: !128)
!148 = !DILocation(line: 45, column: 2, scope: !128)
!149 = distinct !DISubprogram(name: "kzalloc", scope: !37, file: !37, line: 662, type: !150, scopeLine: 663, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !114)
!150 = !DISubroutineType(types: !151)
!151 = !{!53, !152, !50}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 55, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !154, line: 72, baseType: !155)
!154 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !154, line: 16, baseType: !52)
!156 = !DILocalVariable(name: "s", arg: 1, scope: !157, file: !37, line: 445, type: !160)
!157 = distinct !DISubprogram(name: "kmem_cache_alloc_trace", scope: !37, file: !37, line: 445, type: !158, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !114)
!158 = !DISubroutineType(types: !159)
!159 = !{!53, !160, !50, !152}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !162, line: 117, flags: DIFlagFwdDecl)
!162 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!163 = !DILocation(line: 445, column: 72, scope: !157, inlinedAt: !164)
!164 = distinct !DILocation(line: 552, column: 10, scope: !165, inlinedAt: !168)
!165 = distinct !DILexicalBlock(scope: !166, file: !37, line: 540, column: 34)
!166 = distinct !DILexicalBlock(scope: !167, file: !37, line: 540, column: 6)
!167 = distinct !DISubprogram(name: "kmalloc", scope: !37, file: !37, line: 538, type: !150, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !114)
!168 = distinct !DILocation(line: 664, column: 9, scope: !149)
!169 = !DILocalVariable(name: "flags", arg: 2, scope: !157, file: !37, line: 446, type: !50)
