; ModuleID = '../bcout/drivers/gpu/drm/drm_edid.llvm.bc'
source_filename = "drivers/gpu/drm/drm_edid.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.drm_display_mode = type { i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, %struct.list_head, [32 x i8], i32, i32 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kmem_cache = type opaque
%struct.edid_quirk = type { [4 x i8], i32, i32 }
%struct.anon.78 = type { i32, i32 }
%struct.minimode = type { i16, i16, i16, i16 }
%struct.stereo_mandatory_mode = type { i32, i32, i32, i32 }
%struct.edid = type { [8 x i8], [2 x i8], [2 x i8], i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.est_timings, [8 x %struct.std_timing], [4 x %struct.detailed_timing], i8, i8 }
%struct.est_timings = type { i8, i8, i8 }
%struct.std_timing = type { i8, i8 }
%struct.detailed_timing = type { i16, %union.anon.0 }
%union.anon.0 = type { %struct.detailed_pixel_timing }

!313 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_16_9_TOP", value: 2, isUnsigned: true)
!314 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_14_9_TOP", value: 3, isUnsigned: true)
!315 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_16_9_CENTER", value: 4, isUnsigned: true)
!316 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_PICTURE", value: 8, isUnsigned: true)
!317 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_4_3", value: 9, isUnsigned: true)
!318 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_16_9", value: 10, isUnsigned: true)
!319 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_14_9", value: 11, isUnsigned: true)
!320 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_4_3_SP_14_9", value: 13, isUnsigned: true)
!321 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_16_9_SP_14_9", value: 14, isUnsigned: true)
!322 = !DIEnumerator(name: "HDMI_ACTIVE_ASPECT_16_9_SP_4_3", value: 15, isUnsigned: true)
!323 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hdmi_extended_colorimetry", file: !182, line: 118, baseType: !7, size: 32, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332}
!325 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_XV_YCC_601", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_XV_YCC_709", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_S_YCC_601", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_OPYCC_601", value: 3, isUnsigned: true)
!329 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_OPRGB", value: 4, isUnsigned: true)
!330 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_BT2020_CONST_LUM", value: 5, isUnsigned: true)
!331 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_BT2020", value: 6, isUnsigned: true)
!332 = !DIEnumerator(name: "HDMI_EXTENDED_COLORIMETRY_RESERVED", value: 7, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hdmi_nups", file: !182, line: 139, baseType: !7, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIEnumerator(name: "HDMI_NUPS_UNKNOWN", value: 0, isUnsigned: true)
!336 = !DIEnumerator(name: "HDMI_NUPS_HORIZONTAL", value: 1, isUnsigned: true)
!337 = !DIEnumerator(name: "HDMI_NUPS_VERTICAL", value: 2, isUnsigned: true)
!338 = !DIEnumerator(name: "HDMI_NUPS_BOTH", value: 3, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hdmi_ycc_quantization_range", file: !182, line: 146, baseType: !7, size: 32, elements: !340)
!340 = !{!341, !342}
!341 = !DIEnumerator(name: "HDMI_YCC_QUANTIZATION_RANGE_LIMITED", value: 0, isUnsigned: true)
!342 = !DIEnumerator(name: "HDMI_YCC_QUANTIZATION_RANGE_FULL", value: 1, isUnsigned: true)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hdmi_content_type", file: !182, line: 151, baseType: !7, size: 32, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIEnumerator(name: "HDMI_CONTENT_TYPE_GRAPHICS", value: 0, isUnsigned: true)
!346 = !DIEnumerator(name: "HDMI_CONTENT_TYPE_PHOTO", value: 1, isUnsigned: true)
!347 = !DIEnumerator(name: "HDMI_CONTENT_TYPE_CINEMA", value: 2, isUnsigned: true)
!348 = !DIEnumerator(name: "HDMI_CONTENT_TYPE_GAME", value: 3, isUnsigned: true)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hdmi_3d_structure", file: !182, line: 341, baseType: !139, size: 32, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359}
!351 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_INVALID", value: -1)
!352 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_FRAME_PACKING", value: 0)
!353 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_FIELD_ALTERNATIVE", value: 1)
!354 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_LINE_ALTERNATIVE", value: 2)
!355 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_SIDE_BY_SIDE_FULL", value: 3)
!356 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_L_DEPTH", value: 4)
!357 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_L_DEPTH_GFX_GFX_DEPTH", value: 5)
!358 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_TOP_AND_BOTTOM", value: 6)
!359 = !DIEnumerator(name: "HDMI_3D_STRUCTURE_SIDE_BY_SIDE_HALF", value: 8)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !361, line: 305, baseType: !7, size: 32, elements: !362)
!361 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!362 = !{!363, !364, !365, !366}
!363 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!364 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!365 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!366 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!367 = !{!368, !369, !522, !523, !139, !525, !574, !575, !576, !578, !579, !586, !426, !428, !589, !7, !590, !591, !594, !596, !598, !600, !620, !627}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edid", file: !371, line: 290, size: 1024, elements: !372)
!371 = !DIFile(filename: "./include/drm/drm_edid.h", directory: "/home/lizy2001/genbc/linux")
!372 = !{!373, !382, !386, !387, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !415, !421, !520, !521}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !370, file: !371, line: 291, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 64, elements: !380)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !376, line: 17, baseType: !377)
!376 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !378, line: 21, baseType: !379)
!378 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!379 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!380 = !{!381}
!381 = !DISubrange(count: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mfg_id", scope: !370, file: !371, line: 293, baseType: !383, size: 16, offset: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 16, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 2)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prod_code", scope: !370, file: !371, line: 294, baseType: !383, size: 16, offset: 80)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !370, file: !371, line: 295, baseType: !388, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !376, line: 21, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !378, line: 27, baseType: !7)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mfg_week", scope: !370, file: !371, line: 296, baseType: !375, size: 8, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mfg_year", scope: !370, file: !371, line: 297, baseType: !375, size: 8, offset: 136)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !370, file: !371, line: 299, baseType: !375, size: 8, offset: 144)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !370, file: !371, line: 300, baseType: !375, size: 8, offset: 152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !370, file: !371, line: 302, baseType: !375, size: 8, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "width_cm", scope: !370, file: !371, line: 303, baseType: !375, size: 8, offset: 168)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "height_cm", scope: !370, file: !371, line: 304, baseType: !375, size: 8, offset: 176)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !370, file: !371, line: 305, baseType: !375, size: 8, offset: 184)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !370, file: !371, line: 306, baseType: !375, size: 8, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "red_green_lo", scope: !370, file: !371, line: 308, baseType: !375, size: 8, offset: 200)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "black_white_lo", scope: !370, file: !371, line: 309, baseType: !375, size: 8, offset: 208)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "red_x", scope: !370, file: !371, line: 310, baseType: !375, size: 8, offset: 216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "red_y", scope: !370, file: !371, line: 311, baseType: !375, size: 8, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "green_x", scope: !370, file: !371, line: 312, baseType: !375, size: 8, offset: 232)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "green_y", scope: !370, file: !371, line: 313, baseType: !375, size: 8, offset: 240)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blue_x", scope: !370, file: !371, line: 314, baseType: !375, size: 8, offset: 248)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "blue_y", scope: !370, file: !371, line: 315, baseType: !375, size: 8, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "white_x", scope: !370, file: !371, line: 316, baseType: !375, size: 8, offset: 264)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "white_y", scope: !370, file: !371, line: 317, baseType: !375, size: 8, offset: 272)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "established_timings", scope: !370, file: !371, line: 319, baseType: !410, size: 24, offset: 280)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "est_timings", file: !371, line: 44, size: 24, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !410, file: !371, line: 45, baseType: !375, size: 8)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !410, file: !371, line: 46, baseType: !375, size: 8, offset: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mfg_rsvd", scope: !410, file: !371, line: 47, baseType: !375, size: 8, offset: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "standard_timings", scope: !370, file: !371, line: 321, baseType: !416, size: 128, offset: 304)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 128, elements: !380)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "std_timing", file: !371, line: 58, size: 16, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "hsize", scope: !417, file: !371, line: 59, baseType: !375, size: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vfreq_aspect", scope: !417, file: !371, line: 60, baseType: !375, size: 8, offset: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "detailed_timings", scope: !370, file: !371, line: 323, baseType: !422, size: 576, offset: 432)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 576, elements: !518)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detailed_timing", file: !371, line: 170, size: 144, elements: !424)
!424 = !{!425, !430}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_clock", scope: !423, file: !371, line: 171, baseType: !426, size: 16)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !427, line: 29, baseType: !428)
!427 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !378, line: 24, baseType: !429)
!429 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !423, file: !371, line: 175, baseType: !431, size: 128, offset: 16)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !371, line: 172, size: 128, elements: !432)
!432 = !{!433, !452}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_data", scope: !431, file: !371, line: 173, baseType: !434, size: 128)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detailed_pixel_timing", file: !371, line: 70, size: 128, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "hactive_lo", scope: !434, file: !371, line: 71, baseType: !375, size: 8)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "hblank_lo", scope: !434, file: !371, line: 72, baseType: !375, size: 8, offset: 8)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hactive_hblank_hi", scope: !434, file: !371, line: 73, baseType: !375, size: 8, offset: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "vactive_lo", scope: !434, file: !371, line: 74, baseType: !375, size: 8, offset: 24)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vblank_lo", scope: !434, file: !371, line: 75, baseType: !375, size: 8, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vactive_vblank_hi", scope: !434, file: !371, line: 76, baseType: !375, size: 8, offset: 40)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_offset_lo", scope: !434, file: !371, line: 77, baseType: !375, size: 8, offset: 48)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_pulse_width_lo", scope: !434, file: !371, line: 78, baseType: !375, size: 8, offset: 56)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_offset_pulse_width_lo", scope: !434, file: !371, line: 79, baseType: !375, size: 8, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_vsync_offset_pulse_width_hi", scope: !434, file: !371, line: 80, baseType: !375, size: 8, offset: 72)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "width_mm_lo", scope: !434, file: !371, line: 81, baseType: !375, size: 8, offset: 80)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "height_mm_lo", scope: !434, file: !371, line: 82, baseType: !375, size: 8, offset: 88)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "width_height_mm_hi", scope: !434, file: !371, line: 83, baseType: !375, size: 8, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hborder", scope: !434, file: !371, line: 84, baseType: !375, size: 8, offset: 104)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vborder", scope: !434, file: !371, line: 85, baseType: !375, size: 8, offset: 112)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !434, file: !371, line: 86, baseType: !375, size: 8, offset: 120)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "other_data", scope: !431, file: !371, line: 174, baseType: !453, size: 128)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detailed_non_pixel", file: !371, line: 145, size: 128, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !453, file: !371, line: 146, baseType: !375, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !371, line: 147, baseType: !375, size: 8, offset: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !453, file: !371, line: 150, baseType: !375, size: 8, offset: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !453, file: !371, line: 157, baseType: !459, size: 104, offset: 24)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !371, line: 151, size: 104, elements: !460)
!460 = !{!461, !468, !499, !506, !510}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !459, file: !371, line: 152, baseType: !462, size: 104)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detailed_data_string", file: !371, line: 90, size: 104, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !462, file: !371, line: 91, baseType: !465, size: 104)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 104, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 13)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !459, file: !371, line: 153, baseType: !469, size: 104)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detailed_data_monitor_range", file: !371, line: 99, size: 104, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "min_vfreq", scope: !469, file: !371, line: 100, baseType: !375, size: 8)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_vfreq", scope: !469, file: !371, line: 101, baseType: !375, size: 8, offset: 8)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "min_hfreq_khz", scope: !469, file: !371, line: 102, baseType: !375, size: 8, offset: 16)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_hfreq_khz", scope: !469, file: !371, line: 103, baseType: !375, size: 8, offset: 24)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_clock_mhz", scope: !469, file: !371, line: 104, baseType: !375, size: 8, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !469, file: !371, line: 105, baseType: !375, size: 8, offset: 40)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "formula", scope: !469, file: !371, line: 124, baseType: !478, size: 56, offset: 48)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !469, file: !371, line: 106, size: 56, elements: !479)
!479 = !{!480, !489}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gtf2", scope: !478, file: !371, line: 114, baseType: !481, size: 56)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !478, file: !371, line: 107, size: 56, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !481, file: !371, line: 108, baseType: !375, size: 8)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hfreq_start_khz", scope: !481, file: !371, line: 109, baseType: !375, size: 8, offset: 8)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !481, file: !371, line: 110, baseType: !375, size: 8, offset: 16)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !481, file: !371, line: 111, baseType: !426, size: 16, offset: 24)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !481, file: !371, line: 112, baseType: !375, size: 8, offset: 40)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !481, file: !371, line: 113, baseType: !375, size: 8, offset: 48)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cvt", scope: !478, file: !371, line: 123, baseType: !490, size: 56)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !478, file: !371, line: 115, size: 56, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !490, file: !371, line: 116, baseType: !375, size: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data1", scope: !490, file: !371, line: 117, baseType: !375, size: 8, offset: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data2", scope: !490, file: !371, line: 118, baseType: !375, size: 8, offset: 16)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "supported_aspects", scope: !490, file: !371, line: 119, baseType: !375, size: 8, offset: 24)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !490, file: !371, line: 120, baseType: !375, size: 8, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "supported_scalings", scope: !490, file: !371, line: 121, baseType: !375, size: 8, offset: 40)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_refresh", scope: !490, file: !371, line: 122, baseType: !375, size: 8, offset: 48)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !459, file: !371, line: 154, baseType: !500, size: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detailed_data_wpindex", file: !371, line: 127, size: 32, elements: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "white_yx_lo", scope: !500, file: !371, line: 128, baseType: !375, size: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "white_x_hi", scope: !500, file: !371, line: 129, baseType: !375, size: 8, offset: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "white_y_hi", scope: !500, file: !371, line: 130, baseType: !375, size: 8, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !500, file: !371, line: 131, baseType: !375, size: 8, offset: 24)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "timings", scope: !459, file: !371, line: 155, baseType: !507, size: 96)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 96, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 6)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cvt", scope: !459, file: !371, line: 156, baseType: !511, size: 96)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 96, elements: !518)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cvt_timing", file: !371, line: 141, size: 24, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !512, file: !371, line: 142, baseType: !515, size: 24)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 24, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 3)
!518 = !{!519}
!519 = !DISubrange(count: 4)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !370, file: !371, line: 325, baseType: !375, size: 8, offset: 1008)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !370, file: !371, line: 327, baseType: !375, size: 8, offset: 1016)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !524, line: 148, baseType: !7)
!524 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_display_mode", file: !138, line: 224, size: 960, elements: !527)
!527 = !{!528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !561, !567, !572, !573}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !526, file: !138, line: 230, baseType: !139, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hdisplay", scope: !526, file: !138, line: 231, baseType: !530, size: 16, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !376, line: 19, baseType: !428)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_start", scope: !526, file: !138, line: 232, baseType: !530, size: 16, offset: 48)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_end", scope: !526, file: !138, line: 233, baseType: !530, size: 16, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "htotal", scope: !526, file: !138, line: 234, baseType: !530, size: 16, offset: 80)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hskew", scope: !526, file: !138, line: 235, baseType: !530, size: 16, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vdisplay", scope: !526, file: !138, line: 236, baseType: !530, size: 16, offset: 112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_start", scope: !526, file: !138, line: 237, baseType: !530, size: 16, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_end", scope: !526, file: !138, line: 238, baseType: !530, size: 16, offset: 144)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vtotal", scope: !526, file: !138, line: 239, baseType: !530, size: 16, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vscan", scope: !526, file: !138, line: 240, baseType: !530, size: 16, offset: 176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !526, file: !138, line: 275, baseType: !388, size: 32, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_clock", scope: !526, file: !138, line: 292, baseType: !139, size: 32, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_hdisplay", scope: !526, file: !138, line: 293, baseType: !530, size: 16, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_hblank_start", scope: !526, file: !138, line: 294, baseType: !530, size: 16, offset: 272)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_hblank_end", scope: !526, file: !138, line: 295, baseType: !530, size: 16, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_hsync_start", scope: !526, file: !138, line: 296, baseType: !530, size: 16, offset: 304)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_hsync_end", scope: !526, file: !138, line: 297, baseType: !530, size: 16, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_htotal", scope: !526, file: !138, line: 298, baseType: !530, size: 16, offset: 336)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_hskew", scope: !526, file: !138, line: 299, baseType: !530, size: 16, offset: 352)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_vdisplay", scope: !526, file: !138, line: 300, baseType: !530, size: 16, offset: 368)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_vblank_start", scope: !526, file: !138, line: 301, baseType: !530, size: 16, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_vblank_end", scope: !526, file: !138, line: 302, baseType: !530, size: 16, offset: 400)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_vsync_start", scope: !526, file: !138, line: 303, baseType: !530, size: 16, offset: 416)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_vsync_end", scope: !526, file: !138, line: 304, baseType: !530, size: 16, offset: 432)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_vtotal", scope: !526, file: !138, line: 305, baseType: !530, size: 16, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "width_mm", scope: !526, file: !138, line: 313, baseType: !530, size: 16, offset: 464)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "height_mm", scope: !526, file: !138, line: 321, baseType: !530, size: 16, offset: 480)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !138, line: 350, baseType: !375, size: 8, offset: 496)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "expose_to_userspace", scope: !526, file: !138, line: 361, baseType: !559, size: 8, offset: 504)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !524, line: 30, baseType: !560)
!560 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !526, file: !138, line: 368, baseType: !562, size: 128, offset: 512)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !524, line: 178, size: 128, elements: !563)
!563 = !{!564, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !524, line: 179, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !562, file: !524, line: 179, baseType: !565, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !526, file: !138, line: 375, baseType: !568, size: 256, offset: 640)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 256, elements: !570)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !{!571}
!571 = !DISubrange(count: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !526, file: !138, line: 383, baseType: !137, size: 32, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "picture_aspect_ratio", scope: !526, file: !138, line: 390, baseType: !181, size: 32, offset: 928)
!574 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "displayid_block", file: !581, line: 62, size: 24, elements: !582)
!581 = !DIFile(filename: "./include/drm/drm_displayid.h", directory: "/home/lizy2001/genbc/linux")
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !580, file: !581, line: 63, baseType: !375, size: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rev", scope: !580, file: !581, line: 64, baseType: !375, size: 8, offset: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "num_bytes", scope: !580, file: !581, line: 65, baseType: !375, size: 8, offset: 16)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !376, line: 23, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !378, line: 31, baseType: !588)
!588 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !593)
!593 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !565)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "displayid_detailed_timing_block", file: !581, line: 90, size: 24, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !601, file: !581, line: 91, baseType: !580, size: 24)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "timings", scope: !601, file: !581, line: 92, baseType: !605, offset: 24)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, elements: !618)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "displayid_detailed_timings_1", file: !581, line: 77, size: 160, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_clock", scope: !606, file: !581, line: 78, baseType: !515, size: 24)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !606, file: !581, line: 79, baseType: !375, size: 8, offset: 24)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "hactive", scope: !606, file: !581, line: 80, baseType: !383, size: 16, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hblank", scope: !606, file: !581, line: 81, baseType: !383, size: 16, offset: 48)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "hsync", scope: !606, file: !581, line: 82, baseType: !383, size: 16, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "hsw", scope: !606, file: !581, line: 83, baseType: !383, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vactive", scope: !606, file: !581, line: 84, baseType: !383, size: 16, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vblank", scope: !606, file: !581, line: 85, baseType: !383, size: 16, offset: 112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "vsync", scope: !606, file: !581, line: 86, baseType: !383, size: 16, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "vsw", scope: !606, file: !581, line: 87, baseType: !383, size: 16, offset: 144)
!618 = !{!619}
!619 = !DISubrange(count: -1)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "displayid_hdr", file: !581, line: 55, size: 32, elements: !622)
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rev", scope: !621, file: !581, line: 56, baseType: !375, size: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !621, file: !581, line: 57, baseType: !375, size: 8, offset: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prod_id", scope: !621, file: !581, line: 58, baseType: !375, size: 8, offset: 16)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ext_count", scope: !621, file: !581, line: 59, baseType: !375, size: 8, offset: 24)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "displayid_tiled_block", file: !581, line: 68, size: 192, elements: !629)
!629 = !{!630, !631, !632, !633, !635, !639}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !628, file: !581, line: 69, baseType: !580, size: 24)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tile_cap", scope: !628, file: !581, line: 70, baseType: !375, size: 8, offset: 24)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "topo", scope: !628, file: !581, line: 71, baseType: !515, size: 24, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tile_size", scope: !628, file: !581, line: 72, baseType: !634, size: 32, offset: 56)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 32, elements: !518)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tile_pixel_bezel", scope: !628, file: !581, line: 73, baseType: !636, size: 40, offset: 88)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 40, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 5)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "topology_id", scope: !628, file: !581, line: 74, baseType: !374, size: 64, offset: 128)
!640 = !{!641, !702, !707, !0, !712, !717, !719, !724, !729, !734, !746, !761, !764, !769, !782, !792, !795}
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__param_edid_fixup", scope: !2, file: !3, line: 1583, type: !643, isLocal: true, isDefinition: true, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !645, line: 69, size: 320, elements: !646)
!645 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!646 = !{!647, !650, !654, !673, !675, !679, !680}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !645, line: 70, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !644, file: !645, line: 71, baseType: !651, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !653, line: 76, flags: DIFlagFwdDecl)
!653 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !644, file: !645, line: 72, baseType: !655, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !645, line: 47, size: 256, elements: !658)
!658 = !{!659, !660, !665, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !657, file: !645, line: 49, baseType: !7, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !657, file: !645, line: 51, baseType: !661, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!139, !648, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !657, file: !645, line: 53, baseType: !666, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!139, !590, !664}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !657, file: !645, line: 55, baseType: !670, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !368}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !644, file: !645, line: 73, baseType: !674, size: 16, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !644, file: !645, line: 74, baseType: !676, size: 8, offset: 208)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !376, line: 16, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !378, line: 20, baseType: !678)
!678 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !644, file: !645, line: 75, baseType: !375, size: 8, offset: 216)
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !645, line: 76, baseType: !681, size: 64, offset: 256)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !645, line: 76, size: 64, elements: !682)
!682 = !{!683, !684, !691}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !681, file: !645, line: 77, baseType: !368, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !681, file: !645, line: 78, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !645, line: 86, size: 128, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !687, file: !645, line: 87, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !687, file: !645, line: 88, baseType: !590, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !681, file: !645, line: 79, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !645, line: 92, size: 256, elements: !695)
!695 = !{!696, !697, !698, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !694, file: !645, line: 94, baseType: !7, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !694, file: !645, line: 95, baseType: !7, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !694, file: !645, line: 96, baseType: !699, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !694, file: !645, line: 97, baseType: !655, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !694, file: !645, line: 98, baseType: !368, size: 64, offset: 192)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_edid_fixuptype252", scope: !2, file: !3, line: 1583, type: !704, isLocal: true, isDefinition: true, align: 8)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 224, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 28)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_edid_fixup253", scope: !2, file: !3, line: 1584, type: !709, isLocal: true, isDefinition: true, align: 8)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 632, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 79)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "__param_str_edid_fixup", scope: !2, file: !3, line: 1583, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 120, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 15)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "edid_fixup", scope: !2, file: !3, line: 1582, type: !139, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "drm_dmt_modes", scope: !2, file: !3, line: 224, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 84480, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 88)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "edid_cea_modes_1", scope: !2, file: !3, line: 718, type: !726, isLocal: true, isDefinition: true)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 121920, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 127)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "edid_cea_modes_193", scope: !2, file: !3, line: 1386, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 25920, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 27)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "edid_quirk_list", scope: !2, file: !3, line: 106, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 5568, elements: !744)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edid_quirk", file: !3, line: 102, size: 96, elements: !739)
!739 = !{!740, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !738, file: !3, line: 103, baseType: !741, size: 32)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32, elements: !518)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "product_id", scope: !738, file: !3, line: 104, baseType: !139, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "quirks", scope: !738, file: !3, line: 105, baseType: !388, size: 32, offset: 64)
!744 = !{!745}
!745 = !DISubrange(count: 58)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "cea_interlaced", scope: !748, file: !3, line: 2566, type: !753, isLocal: true, isDefinition: true)
!748 = distinct !DISubprogram(name: "drm_mode_do_interlace_quirk", scope: !3, file: !3, line: 2560, type: !749, scopeLine: 2562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !752)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !525, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!752 = !{}
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 448, elements: !759)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !3, line: 2564, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !755, file: !3, line: 2565, baseType: !139, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !755, file: !3, line: 2565, baseType: !139, size: 32, offset: 32)
!759 = !{!760}
!760 = !DISubrange(count: 7)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "edid_4k_modes", scope: !2, file: !3, line: 1527, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 4800, elements: !637)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "edid_est_modes", scope: !2, file: !3, line: 589, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 16320, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 17)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "est3_modes", scope: !2, file: !3, line: 650, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 2816, elements: !780)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "minimode", file: !3, line: 643, size: 64, elements: !774)
!774 = !{!775, !777, !778, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !773, file: !3, line: 644, baseType: !776, size: 16)
!776 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !773, file: !3, line: 645, baseType: !776, size: 16, offset: 16)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !773, file: !3, line: 646, baseType: !776, size: 16, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !773, file: !3, line: 647, baseType: !776, size: 16, offset: 48)
!780 = !{!781}
!781 = !DISubrange(count: 44)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "stereo_mandatory_modes", scope: !2, file: !3, line: 3805, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 1024, elements: !380)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stereo_mandatory_mode", file: !3, line: 3800, size: 128, elements: !787)
!787 = !{!788, !789, !790, !791}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !786, file: !3, line: 3801, baseType: !139, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !786, file: !3, line: 3801, baseType: !139, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "vrefresh", scope: !786, file: !3, line: 3801, baseType: !139, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !786, file: !3, line: 3802, baseType: !7, size: 32, offset: 96)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "extra_modes", scope: !2, file: !3, line: 703, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 448, elements: !759)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "hdmi_colorimetry_val", scope: !2, file: !3, line: 5685, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 352, elements: !799)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!799 = !{!800}
!800 = !DISubrange(count: 11)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 64, elements: !380)
!802 = !{i32 7, !"Dwarf Version", i32 4}
!803 = !{i32 2, !"Debug Info Version", i32 3}
!804 = !{i32 1, !"wchar_size", i32 2}
!805 = !{i32 1, !"Code Model", i32 2}
!806 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!807 = distinct !DISubprogram(name: "drm_edid_header_is_valid", scope: !3, file: !3, line: 1570, type: !808, scopeLine: 1571, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !752)
!808 = !DISubroutineType(types: !809)
!809 = !{!139, !576}
!810 = !DILocalVariable(name: "raw_edid", arg: 1, scope: !807, file: !3, line: 1570, type: !576)
!811 = !DILocation(line: 1570, column: 40, scope: !807)
!812 = !DILocalVariable(name: "i", scope: !807, file: !3, line: 1572, type: !139)
!813 = !DILocation(line: 1572, column: 6, scope: !807)
!814 = !DILocalVariable(name: "score", scope: !807, file: !3, line: 1572, type: !139)
!815 = !DILocation(line: 1572, column: 9, scope: !807)
!816 = !DILocation(line: 1574, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !807, file: !3, line: 1574, column: 2)
!818 = !DILocation(line: 1574, column: 7, scope: !817)
!819 = !DILocation(line: 1574, column: 14, scope: !820)
!820 = distinct !DILexicalBlock(scope: !817, file: !3, line: 1574, column: 2)
!821 = !DILocation(line: 1574, column: 16, scope: !820)
!822 = !DILocation(line: 1574, column: 2, scope: !817)
!823 = !DILocation(line: 1575, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !820, file: !3, line: 1575, column: 7)
!825 = !DILocation(line: 1575, column: 16, scope: !824)
!826 = !DILocation(line: 1575, column: 34, scope: !824)
!827 = !DILocation(line: 1575, column: 22, scope: !824)
!828 = !DILocation(line: 1575, column: 19, scope: !824)
!829 = !DILocation(line: 1575, column: 7, scope: !820)
!830 = !DILocation(line: 1576, column: 9, scope: !824)
!831 = !DILocation(line: 1576, column: 4, scope: !824)
!832 = !DILocation(line: 1575, column: 35, scope: !824)
!833 = !DILocation(line: 1574, column: 40, scope: !820)
!834 = !DILocation(line: 1574, column: 2, scope: !820)
!835 = distinct !{!835, !822, !836}
!836 = !DILocation(line: 1576, column: 9, scope: !817)
!837 = !DILocation(line: 1578, column: 9, scope: !807)
!838 = !DILocation(line: 1578, column: 2, scope: !807)
!839 = distinct !DISubprogram(name: "drm_edid_are_equal", scope: !3, file: !3, line: 1625, type: !840, scopeLine: 1626, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !752)
!840 = !DISubroutineType(types: !841)
!841 = !{!559, !842, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!844 = !DILocalVariable(name: "edid1", arg: 1, scope: !839, file: !3, line: 1625, type: !842)
!845 = !DILocation(line: 1625, column: 44, scope: !839)
!846 = !DILocalVariable(name: "edid2", arg: 2, scope: !839, file: !3, line: 1625, type: !842)
!847 = !DILocation(line: 1625, column: 70, scope: !839)
!848 = !DILocalVariable(name: "edid1_len", scope: !839, file: !3, line: 1627, type: !139)
!849 = !DILocation(line: 1627, column: 6, scope: !839)
!850 = !DILocalVariable(name: "edid2_len", scope: !839, file: !3, line: 1627, type: !139)
!851 = !DILocation(line: 1627, column: 17, scope: !839)
!852 = !DILocalVariable(name: "edid1_present", scope: !839, file: !3, line: 1628, type: !559)
!853 = !DILocation(line: 1628, column: 7, scope: !839)
!854 = !DILocation(line: 1628, column: 23, scope: !839)
!855 = !DILocation(line: 1628, column: 29, scope: !839)
!856 = !DILocalVariable(name: "edid2_present", scope: !839, file: !3, line: 1629, type: !559)
!857 = !DILocation(line: 1629, column: 7, scope: !839)
!858 = !DILocation(line: 1629, column: 23, scope: !839)
!859 = !DILocation(line: 1629, column: 29, scope: !839)
!860 = !DILocation(line: 1631, column: 6, scope: !861)
!861 = distinct !DILexicalBlock(scope: !839, file: !3, line: 1631, column: 6)
!862 = !DILocation(line: 1631, column: 23, scope: !861)
!863 = !DILocation(line: 1631, column: 20, scope: !861)
!864 = !DILocation(line: 1631, column: 6, scope: !839)
!865 = !DILocation(line: 1632, column: 3, scope: !861)
!866 = !DILocation(line: 1634, column: 6, scope: !867)
!867 = distinct !DILexicalBlock(scope: !839, file: !3, line: 1634, column: 6)
!868 = !DILocation(line: 1634, column: 6, scope: !839)
!869 = !DILocation(line: 1635, column: 34, scope: !870)
!870 = distinct !DILexicalBlock(scope: !867, file: !3, line: 1634, column: 13)
!871 = !DILocation(line: 1635, column: 41, scope: !870)
!872 = !DILocation(line: 1635, column: 32, scope: !870)
!873 = !DILocation(line: 1635, column: 27, scope: !870)
!874 = !DILocation(line: 1635, column: 13, scope: !870)
!875 = !DILocation(line: 1636, column: 34, scope: !870)
!876 = !DILocation(line: 1636, column: 41, scope: !870)
!877 = !DILocation(line: 1636, column: 32, scope: !870)
!878 = !DILocation(line: 1636, column: 27, scope: !870)
!879 = !DILocation(line: 1636, column: 13, scope: !870)
!880 = !DILocation(line: 1638, column: 7, scope: !881)
!881 = distinct !DILexicalBlock(scope: !870, file: !3, line: 1638, column: 7)
!882 = !DILocation(line: 1638, column: 20, scope: !881)
!883 = !DILocation(line: 1638, column: 17, scope: !881)
!884 = !DILocation(line: 1638, column: 7, scope: !870)
!885 = !DILocation(line: 1639, column: 4, scope: !881)
!886 = !DILocation(line: 1641, column: 14, scope: !887)
!887 = distinct !DILexicalBlock(scope: !870, file: !3, line: 1641, column: 7)
!888 = !DILocation(line: 1641, column: 21, scope: !887)
!889 = !DILocation(line: 1641, column: 28, scope: !887)
!890 = !DILocation(line: 1641, column: 7, scope: !887)
!891 = !DILocation(line: 1641, column: 7, scope: !870)
!892 = !DILocation(line: 1642, column: 4, scope: !887)
!893 = !DILocation(line: 1643, column: 2, scope: !870)
!894 = !DILocation(line: 1645, column: 2, scope: !839)
!895 = !DILocation(line: 1646, column: 1, scope: !839)
!896 = distinct !DISubprogram(name: "drm_edid_block_valid", scope: !3, file: !3, line: 1661, type: !897, scopeLine: 1663, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !752)
!897 = !DISubroutineType(types: !898)
!898 = !{!559, !522, !139, !559, !589}
!899 = !DILocalVariable(name: "raw_edid", arg: 1, scope: !896, file: !3, line: 1661, type: !522)
!900 = !DILocation(line: 1661, column: 31, scope: !896)
!901 = !DILocalVariable(name: "block", arg: 2, scope: !896, file: !3, line: 1661, type: !139)
!902 = !DILocation(line: 1661, column: 45, scope: !896)
!903 = !DILocalVariable(name: "print_bad_edid", arg: 3, scope: !896, file: !3, line: 1661, type: !559)
!904 = !DILocation(line: 1661, column: 57, scope: !896)
!905 = !DILocalVariable(name: "edid_corrupt", arg: 4, scope: !896, file: !3, line: 1662, type: !589)
!906 = !DILocation(line: 1662, column: 12, scope: !896)
!907 = !DILocalVariable(name: "csum", scope: !896, file: !3, line: 1664, type: !375)
!908 = !DILocation(line: 1664, column: 5, scope: !896)
!909 = !DILocalVariable(name: "edid", scope: !896, file: !3, line: 1665, type: !369)
!910 = !DILocation(line: 1665, column: 15, scope: !896)
!911 = !DILocation(line: 1665, column: 37, scope: !896)
!912 = !DILocation(line: 1665, column: 22, scope: !896)
!913 = !DILocalVariable(name: "__ret_warn_on", scope: !914, file: !3, line: 1667, type: !139)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 1667, column: 6)
!915 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1667, column: 6)
!916 = !DILocation(line: 1667, column: 6, scope: !914)
!917 = !DILocation(line: 1667, column: 6, scope: !918)
!918 = distinct !DILexicalBlock(scope: !914, file: !3, line: 1667, column: 6)
!919 = !DILocation(line: 1667, column: 6, scope: !920)
!920 = distinct !DILexicalBlock(scope: !918, file: !3, line: 1667, column: 6)
!921 = !DILocation(line: 1667, column: 6, scope: !922)
!922 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1667, column: 6)
!923 = !DILocation(line: 1667, column: 6, scope: !924)
!924 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1667, column: 6)
!925 = !{i32 -2140397629, i32 -2140397600, i32 -2140397554, i32 -2140397496, i32 -2140397442, i32 -2140397388, i32 -2140397333, i32 -2140397302}
!926 = !DILocation(line: 1667, column: 6, scope: !927)
!927 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1667, column: 6)
!928 = !{i32 -2140396893, i32 -2140396886, i32 -2140396834, i32 -2140396803, i32 -2140396773}
!929 = !DILocation(line: 1667, column: 6, scope: !930)
!930 = distinct !DILexicalBlock(scope: !920, file: !3, line: 1667, column: 6)
!931 = !DILocation(line: 1667, column: 6, scope: !915)
!932 = !DILocation(line: 1667, column: 6, scope: !896)
!933 = !DILocation(line: 1668, column: 3, scope: !915)
!934 = !DILocation(line: 1670, column: 6, scope: !935)
!935 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1670, column: 6)
!936 = !DILocation(line: 1670, column: 17, scope: !935)
!937 = !DILocation(line: 1670, column: 21, scope: !935)
!938 = !DILocation(line: 1670, column: 24, scope: !935)
!939 = !DILocation(line: 1670, column: 35, scope: !935)
!940 = !DILocation(line: 1670, column: 6, scope: !896)
!941 = !DILocation(line: 1671, column: 14, scope: !935)
!942 = !DILocation(line: 1671, column: 3, scope: !935)
!943 = !DILocation(line: 1673, column: 6, scope: !944)
!944 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1673, column: 6)
!945 = !DILocation(line: 1673, column: 12, scope: !944)
!946 = !DILocation(line: 1673, column: 6, scope: !896)
!947 = !DILocalVariable(name: "score", scope: !948, file: !3, line: 1674, type: !139)
!948 = distinct !DILexicalBlock(scope: !944, file: !3, line: 1673, column: 18)
!949 = !DILocation(line: 1674, column: 7, scope: !948)
!950 = !DILocation(line: 1674, column: 40, scope: !948)
!951 = !DILocation(line: 1674, column: 15, scope: !948)
!952 = !DILocation(line: 1676, column: 7, scope: !953)
!953 = distinct !DILexicalBlock(scope: !948, file: !3, line: 1676, column: 7)
!954 = !DILocation(line: 1676, column: 13, scope: !953)
!955 = !DILocation(line: 1676, column: 7, scope: !948)
!956 = !DILocation(line: 1677, column: 8, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 1677, column: 8)
!958 = distinct !DILexicalBlock(scope: !953, file: !3, line: 1676, column: 19)
!959 = !DILocation(line: 1677, column: 8, scope: !958)
!960 = !DILocation(line: 1678, column: 6, scope: !957)
!961 = !DILocation(line: 1678, column: 19, scope: !957)
!962 = !DILocation(line: 1678, column: 5, scope: !957)
!963 = !DILocation(line: 1679, column: 3, scope: !958)
!964 = !DILocation(line: 1679, column: 14, scope: !965)
!965 = distinct !DILexicalBlock(scope: !953, file: !3, line: 1679, column: 14)
!966 = !DILocation(line: 1679, column: 23, scope: !965)
!967 = !DILocation(line: 1679, column: 20, scope: !965)
!968 = !DILocation(line: 1679, column: 14, scope: !953)
!969 = !DILocation(line: 1685, column: 8, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !3, line: 1685, column: 8)
!971 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1679, column: 35)
!972 = !DILocation(line: 1685, column: 8, scope: !971)
!973 = !DILocation(line: 1686, column: 6, scope: !970)
!974 = !DILocation(line: 1686, column: 19, scope: !970)
!975 = !DILocation(line: 1686, column: 5, scope: !970)
!976 = !DILocation(line: 1687, column: 4, scope: !971)
!977 = !DILocation(line: 1688, column: 11, scope: !971)
!978 = !DILocation(line: 1688, column: 4, scope: !971)
!979 = !DILocation(line: 1689, column: 3, scope: !971)
!980 = !DILocation(line: 1690, column: 8, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 1690, column: 8)
!982 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1689, column: 10)
!983 = !DILocation(line: 1690, column: 8, scope: !982)
!984 = !DILocation(line: 1691, column: 6, scope: !981)
!985 = !DILocation(line: 1691, column: 19, scope: !981)
!986 = !DILocation(line: 1691, column: 5, scope: !981)
!987 = !DILocation(line: 1692, column: 4, scope: !982)
!988 = !DILocation(line: 1694, column: 2, scope: !948)
!989 = !DILocation(line: 1696, column: 33, scope: !896)
!990 = !DILocation(line: 1696, column: 9, scope: !896)
!991 = !DILocation(line: 1696, column: 7, scope: !896)
!992 = !DILocation(line: 1697, column: 35, scope: !993)
!993 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1697, column: 6)
!994 = !DILocation(line: 1697, column: 45, scope: !993)
!995 = !DILocation(line: 1697, column: 6, scope: !993)
!996 = !DILocation(line: 1697, column: 6, scope: !896)
!997 = !DILocation(line: 1698, column: 7, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 1698, column: 7)
!999 = distinct !DILexicalBlock(scope: !993, file: !3, line: 1697, column: 52)
!1000 = !DILocation(line: 1698, column: 7, scope: !999)
!1001 = !DILocation(line: 1699, column: 5, scope: !998)
!1002 = !DILocation(line: 1699, column: 18, scope: !998)
!1003 = !DILocation(line: 1699, column: 4, scope: !998)
!1004 = !DILocation(line: 1702, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !999, file: !3, line: 1702, column: 7)
!1006 = !DILocation(line: 1702, column: 19, scope: !1005)
!1007 = !DILocation(line: 1702, column: 7, scope: !999)
!1008 = !DILocation(line: 1703, column: 4, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1702, column: 31)
!1010 = !DILocation(line: 1704, column: 4, scope: !1009)
!1011 = !DILocation(line: 1705, column: 3, scope: !1009)
!1012 = !DILocation(line: 1706, column: 8, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1706, column: 8)
!1014 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1705, column: 10)
!1015 = !DILocation(line: 1706, column: 8, scope: !1014)
!1016 = !DILocation(line: 1707, column: 5, scope: !1013)
!1017 = !DILocation(line: 1709, column: 4, scope: !1014)
!1018 = !DILocation(line: 1711, column: 2, scope: !999)
!1019 = !DILocation(line: 1714, column: 10, scope: !896)
!1020 = !DILocation(line: 1714, column: 2, scope: !896)
!1021 = !DILocation(line: 1716, column: 7, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1716, column: 7)
!1023 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1714, column: 23)
!1024 = !DILocation(line: 1716, column: 13, scope: !1022)
!1025 = !DILocation(line: 1716, column: 21, scope: !1022)
!1026 = !DILocation(line: 1716, column: 7, scope: !1023)
!1027 = !DILocation(line: 1717, column: 4, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 1716, column: 27)
!1029 = !DILocation(line: 1718, column: 4, scope: !1028)
!1030 = !DILocation(line: 1721, column: 7, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1721, column: 7)
!1032 = !DILocation(line: 1721, column: 13, scope: !1031)
!1033 = !DILocation(line: 1721, column: 22, scope: !1031)
!1034 = !DILocation(line: 1721, column: 7, scope: !1023)
!1035 = !DILocation(line: 1722, column: 4, scope: !1031)
!1036 = !DILocation(line: 1723, column: 3, scope: !1023)
!1037 = !DILocation(line: 1726, column: 3, scope: !1023)
!1038 = !DILocation(line: 1729, column: 2, scope: !896)
!1039 = !DILabel(scope: !896, name: "bad", file: !3, line: 1731)
!1040 = !DILocation(line: 1731, column: 1, scope: !896)
!1041 = !DILocation(line: 1732, column: 6, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1732, column: 6)
!1043 = !DILocation(line: 1732, column: 6, scope: !896)
!1044 = !DILocation(line: 1733, column: 24, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 1733, column: 7)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 1732, column: 22)
!1047 = !DILocation(line: 1733, column: 7, scope: !1045)
!1048 = !DILocation(line: 1733, column: 7, scope: !1046)
!1049 = !DILocation(line: 1734, column: 4, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 1733, column: 48)
!1051 = !DILocation(line: 1735, column: 3, scope: !1050)
!1052 = !DILocation(line: 1736, column: 4, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 1735, column: 10)
!1054 = !DILocation(line: 1739, column: 12, scope: !1053)
!1055 = !DILocation(line: 1737, column: 4, scope: !1053)
!1056 = !DILocation(line: 1741, column: 2, scope: !1046)
!1057 = !DILocation(line: 1742, column: 2, scope: !896)
!1058 = !DILocation(line: 1743, column: 1, scope: !896)
!1059 = distinct !DISubprogram(name: "drm_edid_block_checksum", scope: !3, file: !3, line: 1589, type: !808, scopeLine: 1590, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !752)
!1060 = !DILocalVariable(name: "raw_edid", arg: 1, scope: !1059, file: !3, line: 1589, type: !576)
!1061 = !DILocation(line: 1589, column: 46, scope: !1059)
!1062 = !DILocalVariable(name: "i", scope: !1059, file: !3, line: 1591, type: !139)
!1063 = !DILocation(line: 1591, column: 6, scope: !1059)
!1064 = !DILocalVariable(name: "csum", scope: !1059, file: !3, line: 1592, type: !375)
!1065 = !DILocation(line: 1592, column: 5, scope: !1059)
!1066 = !DILocalVariable(name: "crc", scope: !1059, file: !3, line: 1592, type: !375)
!1067 = !DILocation(line: 1592, column: 15, scope: !1059)
!1068 = !DILocation(line: 1594, column: 9, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 1594, column: 2)
!1070 = !DILocation(line: 1594, column: 7, scope: !1069)
!1071 = !DILocation(line: 1594, column: 14, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 1594, column: 2)
!1073 = !DILocation(line: 1594, column: 16, scope: !1072)
!1074 = !DILocation(line: 1594, column: 2, scope: !1069)
!1075 = !DILocation(line: 1595, column: 11, scope: !1072)
!1076 = !DILocation(line: 1595, column: 20, scope: !1072)
!1077 = !DILocation(line: 1595, column: 8, scope: !1072)
!1078 = !DILocation(line: 1595, column: 3, scope: !1072)
!1079 = !DILocation(line: 1594, column: 36, scope: !1072)
!1080 = !DILocation(line: 1594, column: 2, scope: !1072)
!1081 = distinct !{!1081, !1074, !1082}
!1082 = !DILocation(line: 1595, column: 21, scope: !1069)
!1083 = !DILocation(line: 1597, column: 16, scope: !1059)
!1084 = !DILocation(line: 1597, column: 14, scope: !1059)
!1085 = !DILocation(line: 1597, column: 8, scope: !1059)
!1086 = !DILocation(line: 1597, column: 6, scope: !1059)
!1087 = !DILocation(line: 1599, column: 9, scope: !1059)
!1088 = !DILocation(line: 1599, column: 2, scope: !1059)
!1089 = distinct !DISubprogram(name: "drm_edid_block_checksum_diff", scope: !3, file: !3, line: 1602, type: !1090, scopeLine: 1603, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !752)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!559, !576, !375}
!1092 = !DILocalVariable(name: "raw_edid", arg: 1, scope: !1089, file: !3, line: 1602, type: !576)
!1093 = !DILocation(line: 1602, column: 52, scope: !1089)
!1094 = !DILocalVariable(name: "real_checksum", arg: 2, scope: !1089, file: !3, line: 1602, type: !375)
!1095 = !DILocation(line: 1602, column: 65, scope: !1089)
!1096 = !DILocation(line: 1604, column: 6, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 1604, column: 6)
!1098 = !DILocation(line: 1604, column: 35, scope: !1097)
!1099 = !DILocation(line: 1604, column: 32, scope: !1097)
!1100 = !DILocation(line: 1604, column: 6, scope: !1089)
!1101 = !DILocation(line: 1605, column: 3, scope: !1097)
!1102 = !DILocation(line: 1607, column: 3, scope: !1097)
!1103 = !DILocation(line: 1608, column: 1, scope: !1089)
!1104 = distinct !DISubprogram(name: "drm_edid_is_zero", scope: !3, file: !3, line: 1610, type: !1105, scopeLine: 1611, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !752)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!559, !576, !139}
!1107 = !DILocalVariable(name: "in_edid", arg: 1, scope: !1104, file: !3, line: 1610, type: !576)
!1108 = !DILocation(line: 1610, column: 40, scope: !1104)
!1109 = !DILocalVariable(name: "length", arg: 2, scope: !1104, file: !3, line: 1610, type: !139)
!1110 = !DILocation(line: 1610, column: 53, scope: !1104)
!1111 = !DILocation(line: 1612, column: 17, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 1612, column: 6)
!1113 = !DILocation(line: 1612, column: 29, scope: !1112)
!1114 = !DILocation(line: 1612, column: 6, scope: !1112)
!1115 = !DILocation(line: 1612, column: 6, scope: !1104)
!1116 = !DILocation(line: 1613, column: 3, scope: !1112)
!1117 = !DILocation(line: 1615, column: 2, scope: !1104)
!1118 = !DILocation(line: 1616, column: 1, scope: !1104)
!1119 = distinct !DISubprogram(name: "drm_edid_is_valid", scope: !3, file: !3, line: 1754, type: !1120, scopeLine: 1755, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !752)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!559, !369}
!1122 = !DILocalVariable(name: "edid", arg: 1, scope: !1119, file: !3, line: 1754, type: !369)
!1123 = !DILocation(line: 1754, column: 37, scope: !1119)
!1124 = !DILocalVariable(name: "i", scope: !1119, file: !3, line: 1756, type: !139)
!1125 = !DILocation(line: 1756, column: 6, scope: !1119)
!1126 = !DILocalVariable(name: "raw", scope: !1119, file: !3, line: 1757, type: !522)
!1127 = !DILocation(line: 1757, column: 6, scope: !1119)
!1128 = !DILocation(line: 1757, column: 18, scope: !1119)
!1129 = !DILocation(line: 1757, column: 12, scope: !1119)
!1130 = !DILocation(line: 1759, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 1759, column: 6)
!1132 = !DILocation(line: 1759, column: 6, scope: !1119)
!1133 = !DILocation(line: 1760, column: 3, scope: !1131)
!1134 = !DILocation(line: 1762, column: 9, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 1762, column: 2)
!1136 = !DILocation(line: 1762, column: 7, scope: !1135)
!1137 = !DILocation(line: 1762, column: 14, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 1762, column: 2)
!1139 = !DILocation(line: 1762, column: 19, scope: !1138)
!1140 = !DILocation(line: 1762, column: 25, scope: !1138)
!1141 = !DILocation(line: 1762, column: 16, scope: !1138)
!1142 = !DILocation(line: 1762, column: 2, scope: !1135)
!1143 = !DILocation(line: 1763, column: 29, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 1763, column: 7)
!1145 = !DILocation(line: 1763, column: 35, scope: !1144)
!1146 = !DILocation(line: 1763, column: 37, scope: !1144)
!1147 = !DILocation(line: 1763, column: 33, scope: !1144)
!1148 = !DILocation(line: 1763, column: 52, scope: !1144)
!1149 = !DILocation(line: 1763, column: 8, scope: !1144)
!1150 = !DILocation(line: 1763, column: 7, scope: !1138)
!1151 = !DILocation(line: 1764, column: 4, scope: !1144)
!1152 = !DILocation(line: 1763, column: 65, scope: !1144)
!1153 = !DILocation(line: 1762, column: 38, scope: !1138)
!1154 = !DILocation(line: 1762, column: 2, scope: !1138)
!1155 = distinct !{!1155, !1142, !1156}
!1156 = !DILocation(line: 1764, column: 11, scope: !1135)
!1157 = !DILocation(line: 1766, column: 2, scope: !1119)
!1158 = !DILocation(line: 1767, column: 1, scope: !1119)
!1159 = distinct !DISubprogram(name: "drm_add_override_edid_modes", scope: !3, file: !3, line: 1890, type: !1160, scopeLine: 1891, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !752)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!139, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_connector", file: !198, line: 1170, size: 9280, elements: !1164)
!1164 = !{!1165, !5421, !5422, !5435, !5436, !5437, !5438, !5439, !5440, !5441, !5442, !5443, !5444, !5445, !5446, !5447, !5448, !5449, !5450, !5493, !5979, !5980, !5981, !5982, !5983, !5984, !5985, !5986, !5988, !5989, !5993, !6012, !6013, !6014, !6015, !6016, !6017, !6019, !6021, !6023, !6024, !6147, !6148, !6149, !6150, !6151, !6152, !6153, !6154, !6155, !6163, !6164, !6165, !6166, !6167, !6168, !6169, !6170, !6171}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1163, file: !198, line: 1172, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_device", file: !191, line: 53, size: 11840, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1185, !4903, !4909, !5086, !5087, !5088, !5089, !5090, !5093, !5094, !5095, !5096, !5097, !5098, !5099, !5100, !5101, !5102, !5103, !5104, !5105, !5106, !5107, !5108, !5111, !5112, !5113, !5114, !5115, !5116, !5119, !5123, !5124, !5409, !5410, !5411, !5414, !5417, !5418}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_dev_list", scope: !1167, file: !191, line: 59, baseType: !562, size: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "if_version", scope: !1167, file: !191, line: 62, baseType: !139, size: 32, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1167, file: !191, line: 65, baseType: !1172, size: 32, offset: 160)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !1173, line: 19, size: 32, elements: !1174)
!1173 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!1174 = !{!1175}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1172, file: !1173, line: 20, baseType: !1176, size: 32)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !1177, line: 113, baseType: !1178)
!1177 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !1177, line: 111, size: 32, elements: !1179)
!1179 = !{!1180}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1178, file: !1177, line: 112, baseType: !1181, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !524, line: 168, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 166, size: 32, elements: !1183)
!1183 = !{!1184}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1182, file: !524, line: 167, baseType: !139, size: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1167, file: !191, line: 68, baseType: !1186, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !97, line: 461, size: 5568, elements: !1188)
!1188 = !{!1189, !4358, !4359, !4362, !4363, !4414, !4505, !4506, !4507, !4508, !4509, !4518, !4623, !4636, !4830, !4831, !4835, !4837, !4838, !4839, !4843, !4849, !4850, !4853, !4854, !4855, !4856, !4857, !4858, !4859, !4891, !4892, !4893, !4896, !4899, !4900, !4901, !4902}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !1187, file: !97, line: 462, baseType: !1190, size: 512)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !1191, line: 64, size: 512, elements: !1192)
!1191 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!1192 = !{!1193, !1194, !1195, !1197, !1253, !4231, !4352, !4353, !4354, !4355, !4356, !4357}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1190, file: !1191, line: 65, baseType: !648, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !1190, file: !1191, line: 66, baseType: !562, size: 128, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1190, file: !1191, line: 67, baseType: !1196, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !1190, file: !1191, line: 68, baseType: !1198, size: 64, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !1191, line: 192, size: 704, elements: !1200)
!1200 = !{!1201, !1202, !1217, !1218}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1199, file: !1191, line: 193, baseType: !562, size: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !1199, file: !1191, line: 194, baseType: !1203, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !1204, line: 83, baseType: !1205)
!1204 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !1204, line: 71, elements: !1206)
!1206 = !{!1207}
!1207 = !DIDerivedType(tag: DW_TAG_member, scope: !1205, file: !1204, line: 72, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1205, file: !1204, line: 72, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !1208, file: !1204, line: 73, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !1204, line: 20, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !1211, file: !1204, line: 21, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !1215, line: 25, baseType: !1216)
!1215 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1215, line: 25, elements: !752)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !1199, file: !1191, line: 195, baseType: !1190, size: 512, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !1199, file: !1191, line: 196, baseType: !1219, size: 64, offset: 640)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !1191, line: 156, size: 192, elements: !1222)
!1222 = !{!1223, !1228, !1233}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1221, file: !1191, line: 157, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!139, !1198, !1196}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1221, file: !1191, line: 158, baseType: !1229, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1230)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!648, !1198, !1196}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !1221, file: !1191, line: 159, baseType: !1234, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!139, !1198, !1196, !1238}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !1191, line: 148, size: 20736, elements: !1240)
!1240 = !{!1241, !1243, !1247, !1248, !1252}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !1239, file: !1191, line: 149, baseType: !1242, size: 192)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 192, elements: !516)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !1239, file: !1191, line: 150, baseType: !1244, size: 4096, offset: 192)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 4096, elements: !1245)
!1245 = !{!1246}
!1246 = !DISubrange(count: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !1239, file: !1191, line: 151, baseType: !139, size: 32, offset: 4288)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1239, file: !1191, line: 152, baseType: !1249, size: 16384, offset: 4320)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 16384, elements: !1250)
!1250 = !{!1251}
!1251 = !DISubrange(count: 2048)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1239, file: !1191, line: 153, baseType: !139, size: 32, offset: 20704)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !1190, file: !1191, line: 69, baseType: !1254, size: 64, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !1191, line: 138, size: 448, elements: !1256)
!1256 = !{!1257, !1261, !1288, !1290, !4193, !4221, !4225}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !1255, file: !1191, line: 139, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1196}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !1255, file: !1191, line: 140, baseType: !1262, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !1265, line: 230, size: 128, elements: !1266)
!1265 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!1266 = !{!1267, !1281}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !1264, file: !1265, line: 231, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!1271, !1196, !1275, !590}
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !524, line: 60, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !1273, line: 73, baseType: !1274)
!1273 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !1273, line: 15, baseType: !593)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !1265, line: 30, size: 128, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !1265, line: 31, baseType: !648, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1276, file: !1265, line: 32, baseType: !1280, size: 16, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !524, line: 19, baseType: !429)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !1264, file: !1265, line: 232, baseType: !1282, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!1271, !1196, !1275, !648, !1285}
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !524, line: 55, baseType: !1286)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1273, line: 72, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1273, line: 16, baseType: !574)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !1255, file: !1191, line: 141, baseType: !1289, size: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !1255, file: !1191, line: 142, baseType: !1291, size: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !1265, line: 84, size: 320, elements: !1295)
!1295 = !{!1296, !1297, !1301, !4190, !4191}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1294, file: !1265, line: 85, baseType: !648, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !1294, file: !1265, line: 86, baseType: !1298, size: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!1280, !1196, !1275, !139}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !1294, file: !1265, line: 88, baseType: !1302, size: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!1280, !1196, !1305, !139}
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !1265, line: 168, size: 448, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !4185, !4186}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !1306, file: !1265, line: 169, baseType: !1276, size: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1306, file: !1265, line: 170, baseType: !1285, size: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1306, file: !1265, line: 171, baseType: !368, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1306, file: !1265, line: 172, baseType: !1312, size: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!1271, !1315, !1196, !1305, !590, !1481, !1285}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !68, line: 916, size: 1856, align: 32, elements: !1317)
!1317 = !{!1318, !1336, !4150, !4151, !4152, !4153, !4154, !4155, !4156, !4157, !4158, !4159, !4168, !4169, !4178, !4179, !4180, !4181, !4182, !4183, !4184}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !1316, file: !68, line: 920, baseType: !1319, size: 128)
!1319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1316, file: !68, line: 917, size: 128, elements: !1320)
!1320 = !{!1321, !1327}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !1319, file: !68, line: 918, baseType: !1322, size: 64)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !1323, line: 58, size: 64, elements: !1324)
!1323 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!1324 = !{!1325}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1322, file: !1323, line: 59, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !1319, file: !68, line: 919, baseType: !1328, size: 128, align: 64)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !524, line: 216, size: 128, align: 64, elements: !1329)
!1329 = !{!1330, !1332}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1328, file: !524, line: 217, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1328, file: !524, line: 218, baseType: !1333, size: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{null, !1331}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !1316, file: !68, line: 921, baseType: !1337, size: 128, offset: 128)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !1338, line: 8, size: 128, elements: !1339)
!1338 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!1339 = !{!1340, !1344}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !1337, file: !1338, line: 9, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !1343, line: 18, flags: DIFlagFwdDecl)
!1343 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !1337, file: !1338, line: 10, baseType: !1345, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !1343, line: 89, size: 1536, elements: !1347)
!1347 = !{!1348, !1349, !1359, !1367, !1368, !1383, !4118, !4120, !4132, !4133, !4134, !4135, !4136, !4142, !4143, !4144}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !1346, file: !1343, line: 91, baseType: !7, size: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !1346, file: !1343, line: 92, baseType: !1350, size: 32, offset: 32)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !1351, line: 277, baseType: !1352)
!1351 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !1351, line: 277, size: 32, elements: !1353)
!1353 = !{!1354}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !1352, file: !1351, line: 277, baseType: !1355, size: 32)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !1351, line: 70, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !1351, line: 65, size: 32, elements: !1357)
!1357 = !{!1358}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1356, file: !1351, line: 66, baseType: !7, size: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !1346, file: !1343, line: 93, baseType: !1360, size: 128, offset: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !1361, line: 38, size: 128, elements: !1362)
!1361 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!1362 = !{!1363, !1365}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1360, file: !1361, line: 39, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1360, file: !1361, line: 39, baseType: !1366, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !1346, file: !1343, line: 94, baseType: !1345, size: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1346, file: !1343, line: 95, baseType: !1369, size: 128, offset: 256)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !1343, line: 47, size: 128, elements: !1370)
!1370 = !{!1371, !1380}
!1371 = !DIDerivedType(tag: DW_TAG_member, scope: !1369, file: !1343, line: 48, baseType: !1372, size: 64)
!1372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1369, file: !1343, line: 48, size: 64, elements: !1373)
!1373 = !{!1374, !1379}
!1374 = !DIDerivedType(tag: DW_TAG_member, scope: !1372, file: !1343, line: 49, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1372, file: !1343, line: 49, size: 64, elements: !1376)
!1376 = !{!1377, !1378}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1375, file: !1343, line: 50, baseType: !388, size: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1375, file: !1343, line: 50, baseType: !388, size: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !1372, file: !1343, line: 52, baseType: !586, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1369, file: !1343, line: 54, baseType: !1381, size: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !1346, file: !1343, line: 96, baseType: !1384, size: 64, offset: 384)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !68, line: 610, size: 4224, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1397, !1404, !1405, !1548, !3831, !3832, !3833, !3839, !3840, !3841, !3842, !3843, !3844, !3845, !3846, !3847, !3848, !3849, !3850, !3851, !3852, !3853, !3854, !3855, !3856, !3857, !3858, !3863, !3864, !3865, !3866, !3867, !3868, !3869, !4094, !4102, !4103, !4104, !4114, !4115, !4116, !4117}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !1385, file: !68, line: 611, baseType: !1280, size: 16)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !1385, file: !68, line: 612, baseType: !429, size: 16, offset: 16)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !1385, file: !68, line: 613, baseType: !1390, size: 32, offset: 32)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !1391, line: 23, baseType: !1392)
!1391 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1391, line: 21, size: 32, elements: !1393)
!1393 = !{!1394}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1392, file: !1391, line: 22, baseType: !1395, size: 32)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !524, line: 32, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !1273, line: 49, baseType: !7)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !1385, file: !68, line: 614, baseType: !1398, size: 32, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !1391, line: 28, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1391, line: 26, size: 32, elements: !1400)
!1400 = !{!1401}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1399, file: !1391, line: 27, baseType: !1402, size: 32)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !524, line: 33, baseType: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !1273, line: 50, baseType: !7)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !1385, file: !68, line: 615, baseType: !7, size: 32, offset: 96)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !1385, file: !68, line: 622, baseType: !1406, size: 64, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !68, line: 1864, size: 1536, align: 512, elements: !1409)
!1409 = !{!1410, !1414, !1424, !1428, !1434, !1438, !1442, !1446, !1450, !1454, !1458, !1459, !1465, !1469, !1495, !1524, !1528, !1534, !1539, !1543, !1544}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !1408, file: !68, line: 1865, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!1345, !1384, !1345, !7}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !1408, file: !68, line: 1866, baseType: !1415, size: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!648, !1345, !1384, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !1420, line: 10, size: 128, elements: !1421)
!1420 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1421 = !{!1422, !1423}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1419, file: !1420, line: 11, baseType: !670, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1419, file: !1420, line: 12, baseType: !368, size: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !1408, file: !68, line: 1867, baseType: !1425, size: 64, offset: 128)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!139, !1384, !139}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !1408, file: !68, line: 1868, baseType: !1429, size: 64, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!1432, !1384, !139}
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !68, line: 581, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !1408, file: !68, line: 1870, baseType: !1435, size: 64, offset: 256)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!139, !1345, !590, !139}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !1408, file: !68, line: 1872, baseType: !1439, size: 64, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!139, !1384, !1345, !1280, !559}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1408, file: !68, line: 1873, baseType: !1443, size: 64, offset: 384)
