; ModuleID = '../bcout/drivers/gpu/drm/drm_fourcc.llvm.bc'
source_filename = "drivers/gpu/drm/drm_fourcc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.drm_format_info = type { i32, i8, i8, %union.anon.0, [4 x i8], [4 x i8], i8, i8, i8, i8 }
%union.anon.0 = type { [4 x i8] }
%struct.drm_device = type { %struct.list_head, i32, %struct.kref, %struct.device*, %struct.anon, %struct.drm_driver*, i8*, %struct.drm_minor*, %struct.drm_minor*, i8, %struct.drm_master*, i32, i8, %struct.inode*, i8*, %struct.mutex, %struct.mutex, %struct.atomic_t, %struct.mutex, %struct.list_head, %struct.list_head, %struct.mutex, %struct.list_head, i8, i32, i8, %struct.drm_vblank_crtc*, %struct.spinlock, %struct.spinlock, i32, %struct.list_head, %struct.spinlock, %struct.drm_agp_head*, %struct.pci_dev*, i32, %struct.drm_mode_config, %struct.mutex, %struct.idr, %struct.drm_vma_offset_manager*, %struct.drm_vram_mm*, i32, %struct.drm_fb_helper* }
%struct.kref = type { %struct.refcount_struct }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.device = type opaque
%struct.anon = type { %struct.list_head, i8*, %struct.spinlock }
%struct.drm_driver = type opaque
%struct.drm_minor = type opaque
%struct.drm_master = type opaque
%struct.inode = type opaque
%struct.atomic_t = type { i32 }
%struct.drm_vblank_crtc = type opaque
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "formats", scope: !2, file: !3, line: 159, type: !56, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "__drm_format_info", scope: !3, file: !3, line: 157, type: !4, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !55)
!3 = !DIFile(filename: "drivers/gpu/drm/drm_fourcc.c", directory: "/home/lizy2001/genbc/linux")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_format_info", file: !9, line: 56, size: 192, elements: !10)
!9 = !DIFile(filename: "./include/drm/drm_fourcc.h", directory: "/home/lizy2001/genbc/linux")
!10 = !{!11, !17, !21, !22, !30, !31, !32, !33, !34, !38}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !8, file: !9, line: 58, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !13, line: 21, baseType: !14)
!13 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !15, line: 27, baseType: !16)
!15 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !8, file: !9, line: 67, baseType: !18, size: 8, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !13, line: 17, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !15, line: 21, baseType: !20)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !8, file: !9, line: 70, baseType: !18, size: 8, offset: 40)
!22 = !DIDerivedType(tag: DW_TAG_member, scope: !8, file: !9, line: 72, baseType: !23, size: 32, offset: 48)
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !9, line: 72, size: 32, elements: !24)
!24 = !{!25, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !23, file: !9, line: 81, baseType: !26, size: 32)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 4)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "char_per_block", scope: !23, file: !9, line: 107, baseType: !26, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "block_w", scope: !8, file: !9, line: 116, baseType: !26, size: 32, offset: 80)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "block_h", scope: !8, file: !9, line: 124, baseType: !26, size: 32, offset: 112)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hsub", scope: !8, file: !9, line: 127, baseType: !18, size: 8, offset: 144)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vsub", scope: !8, file: !9, line: 129, baseType: !18, size: 8, offset: 152)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "has_alpha", scope: !8, file: !9, line: 132, baseType: !35, size: 8, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !36, line: 30, baseType: !37)
!36 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!37 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "is_yuv", scope: !8, file: !9, line: 135, baseType: !35, size: 8, offset: 168)
!39 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !48, globals: !54, splitDebugInlining: false, nameTableKind: None)
!40 = !{!41}
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "switch_power_state", file: !42, line: 33, baseType: !16, size: 32, elements: !43)
!42 = !DIFile(filename: "./include/drm/drm_device.h", directory: "/home/lizy2001/genbc/linux")
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "DRM_SWITCH_POWER_ON", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "DRM_SWITCH_POWER_OFF", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DRM_SWITCH_POWER_CHANGING", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DRM_SWITCH_POWER_DYNAMIC_OFF", value: 3, isUnsigned: true)
!48 = !{!14, !49, !50, !51, !53, !20}
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !13, line: 23, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !15, line: 31, baseType: !50)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !36, line: 107, baseType: !51)
!54 = !{!0}
!55 = !{}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 18624, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 97)
!59 = !{i32 7, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 2}
!62 = !{i32 1, !"Code Model", i32 2}
!63 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!64 = distinct !DISubprogram(name: "drm_mode_legacy_fb_format", scope: !3, file: !3, line: 46, type: !65, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !55)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !67, !67}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !36, line: 104, baseType: !12)
!68 = !DILocalVariable(name: "bpp", arg: 1, scope: !64, file: !3, line: 46, type: !67)
!69 = !DILocation(line: 46, column: 45, scope: !64)
!70 = !DILocalVariable(name: "depth", arg: 2, scope: !64, file: !3, line: 46, type: !67)
!71 = !DILocation(line: 46, column: 59, scope: !64)
!72 = !DILocalVariable(name: "fmt", scope: !64, file: !3, line: 48, type: !67)
!73 = !DILocation(line: 48, column: 11, scope: !64)
!74 = !DILocation(line: 50, column: 10, scope: !64)
!75 = !DILocation(line: 50, column: 2, scope: !64)
!76 = !DILocation(line: 52, column: 7, scope: !77)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 52, column: 7)
!78 = distinct !DILexicalBlock(scope: !64, file: !3, line: 50, column: 15)
!79 = !DILocation(line: 52, column: 13, scope: !77)
!80 = !DILocation(line: 52, column: 7, scope: !78)
!81 = !DILocation(line: 53, column: 8, scope: !77)
!82 = !DILocation(line: 53, column: 4, scope: !77)
!83 = !DILocation(line: 54, column: 3, scope: !78)
!84 = !DILocation(line: 57, column: 11, scope: !78)
!85 = !DILocation(line: 57, column: 3, scope: !78)
!86 = !DILocation(line: 59, column: 8, scope: !87)
!87 = distinct !DILexicalBlock(scope: !78, file: !3, line: 57, column: 18)
!88 = !DILocation(line: 60, column: 4, scope: !87)
!89 = !DILocation(line: 62, column: 8, scope: !87)
!90 = !DILocation(line: 63, column: 4, scope: !87)
!91 = !DILocation(line: 65, column: 4, scope: !87)
!92 = !DILocation(line: 67, column: 3, scope: !78)
!93 = !DILocation(line: 70, column: 7, scope: !94)
!94 = distinct !DILexicalBlock(scope: !78, file: !3, line: 70, column: 7)
!95 = !DILocation(line: 70, column: 13, scope: !94)
!96 = !DILocation(line: 70, column: 7, scope: !78)
!97 = !DILocation(line: 71, column: 8, scope: !94)
!98 = !DILocation(line: 71, column: 4, scope: !94)
!99 = !DILocation(line: 72, column: 3, scope: !78)
!100 = !DILocation(line: 75, column: 11, scope: !78)
!101 = !DILocation(line: 75, column: 3, scope: !78)
!102 = !DILocation(line: 77, column: 8, scope: !103)
!103 = distinct !DILexicalBlock(scope: !78, file: !3, line: 75, column: 18)
!104 = !DILocation(line: 78, column: 4, scope: !103)
!105 = !DILocation(line: 80, column: 8, scope: !103)
!106 = !DILocation(line: 81, column: 4, scope: !103)
!107 = !DILocation(line: 83, column: 8, scope: !103)
!108 = !DILocation(line: 84, column: 4, scope: !103)
!109 = !DILocation(line: 86, column: 4, scope: !103)
!110 = !DILocation(line: 88, column: 3, scope: !78)
!111 = !DILocation(line: 91, column: 3, scope: !78)
!112 = !DILocation(line: 94, column: 9, scope: !64)
!113 = !DILocation(line: 94, column: 2, scope: !64)
!114 = distinct !DISubprogram(name: "drm_driver_legacy_fb_format", scope: !3, file: !3, line: 109, type: !115, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !55)
!115 = !DISubroutineType(types: !116)
!116 = !{!67, !117, !67, !67}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_device", file: !42, line: 53, size: 11840, elements: !119)
!119 = !{!120, !126, !127, !141, !144, !165, !168, !169, !172, !173, !174, !177, !178, !179, !183, !186, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !215, !216, !217, !218, !219, !220, !223, !226, !227, !498, !499, !500, !503, !506, !507}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_dev_list", scope: !118, file: !42, line: 59, baseType: !121, size: 128)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !36, line: 178, size: 128, elements: !122)
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !36, line: 179, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !36, line: 179, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "if_version", scope: !118, file: !42, line: 62, baseType: !49, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !118, file: !42, line: 65, baseType: !128, size: 32, offset: 160)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !129, line: 19, size: 32, elements: !130)
!129 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !128, file: !129, line: 20, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !133, line: 113, baseType: !134)
!133 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !133, line: 111, size: 32, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !134, file: !133, line: 112, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !36, line: 168, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 166, size: 32, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !138, file: !36, line: 167, baseType: !49, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !118, file: !42, line: 68, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !42, line: 68, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !118, file: !42, line: 83, baseType: !145, size: 192, offset: 256)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !118, file: !42, line: 76, size: 192, elements: !146)
!146 = !{!147, !148, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !145, file: !42, line: 78, baseType: !121, size: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "final_kfree", scope: !145, file: !42, line: 80, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !145, file: !42, line: 82, baseType: !151, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !152, line: 83, baseType: !153)
!152 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !152, line: 71, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !152, line: 72, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !152, line: 72, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !156, file: !152, line: 73, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !152, line: 20, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !159, file: !152, line: 21, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !163, line: 25, baseType: !164)
!163 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 25, elements: !55)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !118, file: !42, line: 86, baseType: !166, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_driver", file: !42, line: 12, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dev_private", scope: !118, file: !42, line: 98, baseType: !149, size: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !118, file: !42, line: 101, baseType: !170, size: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_minor", file: !42, line: 13, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !118, file: !42, line: 104, baseType: !170, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "registered", scope: !118, file: !42, line: 111, baseType: !35, size: 8, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !118, file: !42, line: 119, baseType: !175, size: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_master", file: !42, line: 14, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "driver_features", scope: !118, file: !42, line: 129, baseType: !12, size: 32, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "unplugged", scope: !118, file: !42, line: 137, baseType: !35, size: 8, offset: 864)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "anon_inode", scope: !118, file: !42, line: 140, baseType: !180, size: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !182, line: 21, flags: DIFlagFwdDecl)
!182 = !DIFile(filename: "./include/linux/uprobes.h", directory: "/home/lizy2001/genbc/linux")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !118, file: !42, line: 143, baseType: !184, size: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "struct_mutex", scope: !118, file: !42, line: 153, baseType: !187, size: 192, offset: 1024)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !188, line: 53, size: 192, elements: !189)
!188 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!189 = !{!190, !200, !201}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !187, file: !188, line: 54, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !192, line: 13, baseType: !193)
!192 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !36, line: 175, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 173, size: 64, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !194, file: !36, line: 174, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !13, line: 22, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !15, line: 30, baseType: !199)
!199 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !187, file: !188, line: 55, baseType: !151, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !187, file: !188, line: 59, baseType: !121, size: 128, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "master_mutex", scope: !118, file: !42, line: 160, baseType: !187, size: 192, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "open_count", scope: !118, file: !42, line: 168, baseType: !137, size: 32, offset: 1408)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "filelist_mutex", scope: !118, file: !42, line: 171, baseType: !187, size: 192, offset: 1472)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !118, file: !42, line: 177, baseType: !121, size: 128, offset: 1664)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "filelist_internal", scope: !118, file: !42, line: 185, baseType: !121, size: 128, offset: 1792)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "clientlist_mutex", scope: !118, file: !42, line: 192, baseType: !187, size: 192, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "clientlist", scope: !118, file: !42, line: 199, baseType: !121, size: 128, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "irq_enabled", scope: !118, file: !42, line: 208, baseType: !35, size: 8, offset: 2240)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !118, file: !42, line: 213, baseType: !49, size: 32, offset: 2272)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vblank_disable_immediate", scope: !118, file: !42, line: 228, baseType: !35, size: 8, offset: 2304)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vblank", scope: !118, file: !42, line: 238, baseType: !213, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_vblank_crtc", file: !42, line: 16, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "vblank_time_lock", scope: !118, file: !42, line: 245, baseType: !151, offset: 2432)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vbl_lock", scope: !118, file: !42, line: 250, baseType: !151, offset: 2432)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "max_vblank_count", scope: !118, file: !42, line: 273, baseType: !12, size: 32, offset: 2432)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vblank_event_list", scope: !118, file: !42, line: 276, baseType: !121, size: 128, offset: 2496)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "event_lock", scope: !118, file: !42, line: 284, baseType: !151, offset: 2624)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "agp", scope: !118, file: !42, line: 287, baseType: !221, size: 64, offset: 2624)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_agp_head", file: !42, line: 287, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pdev", scope: !118, file: !42, line: 290, baseType: !224, size: 64, offset: 2688)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "pci_dev", file: !42, line: 25, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "num_crtcs", scope: !118, file: !42, line: 297, baseType: !16, size: 32, offset: 2752)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mode_config", scope: !118, file: !42, line: 300, baseType: !228, size: 8384, offset: 2816)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_mode_config", file: !229, line: 358, size: 8384, elements: !230)
!229 = !DIFile(filename: "./include/drm/drm_mode_config.h", directory: "/home/lizy2001/genbc/linux")
!230 = !{!231, !232, !256, !266, !267, !281, !282, !283, !284, !285, !286, !287, !291, !292, !301, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !389, !392, !393, !394, !395, !421, !422, !423, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !228, file: !229, line: 369, baseType: !187, size: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "connection_mutex", scope: !228, file: !229, line: 379, baseType: !233, size: 384, offset: 192)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_modeset_lock", file: !234, line: 76, size: 384, elements: !235)
!234 = !DIFile(filename: "./include/drm/drm_modeset_lock.h", directory: "/home/lizy2001/genbc/linux")
!235 = !{!236, !255}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !233, file: !234, line: 80, baseType: !237, size: 256)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ww_mutex", file: !188, line: 71, size: 256, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !237, file: !188, line: 72, baseType: !187, size: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !237, file: !188, line: 73, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ww_acquire_ctx", file: !243, line: 31, size: 192, elements: !244)
!243 = !DIFile(filename: "./include/linux/ww_mutex.h", directory: "/home/lizy2001/genbc/linux")
!244 = !{!245, !249, !251, !252, !254}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !242, file: !243, line: 32, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !248, line: 9, flags: DIFlagFwdDecl)
!248 = !DIFile(filename: "./arch/x86/include/asm/current.h", directory: "/home/lizy2001/genbc/linux")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "stamp", scope: !242, file: !243, line: 33, baseType: !250, size: 64, offset: 64)
!250 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "acquired", scope: !242, file: !243, line: 34, baseType: !16, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wounded", scope: !242, file: !243, line: 35, baseType: !253, size: 16, offset: 160)
!253 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "is_wait_die", scope: !242, file: !243, line: 36, baseType: !253, size: 16, offset: 176)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !233, file: !234, line: 86, baseType: !121, size: 128, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "acquire_ctx", scope: !228, file: !229, line: 389, baseType: !257, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_modeset_acquire_ctx", file: !234, line: 43, size: 448, elements: !259)
!259 = !{!260, !261, !263, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ww_ctx", scope: !258, file: !234, line: 45, baseType: !242, size: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "contended", scope: !258, file: !234, line: 52, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !258, file: !234, line: 57, baseType: !121, size: 128, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "trylock_only", scope: !258, file: !234, line: 62, baseType: !35, size: 8, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "interruptible", scope: !258, file: !234, line: 65, baseType: !35, size: 8, offset: 392)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "idr_mutex", scope: !228, file: !229, line: 397, baseType: !187, size: 192, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "object_idr", scope: !228, file: !229, line: 405, baseType: !268, size: 192, offset: 832)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !269, line: 19, size: 192, elements: !270)
!269 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!270 = !{!271, !279, !280}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !268, file: !269, line: 20, baseType: !272, size: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !273, line: 292, size: 128, elements: !274)
!273 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!274 = !{!275, !276, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !272, file: !273, line: 293, baseType: !151)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !272, file: !273, line: 295, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !36, line: 148, baseType: !16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !272, file: !273, line: 296, baseType: !149, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !268, file: !269, line: 21, baseType: !16, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !268, file: !269, line: 22, baseType: !16, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tile_idr", scope: !228, file: !229, line: 413, baseType: !268, size: 192, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fb_lock", scope: !228, file: !229, line: 416, baseType: !187, size: 192, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num_fb", scope: !228, file: !229, line: 418, baseType: !49, size: 32, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fb_list", scope: !228, file: !229, line: 420, baseType: !121, size: 128, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "connector_list_lock", scope: !228, file: !229, line: 426, baseType: !151, offset: 1600)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num_connector", scope: !228, file: !229, line: 431, baseType: !49, size: 32, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "connector_ida", scope: !228, file: !229, line: 435, baseType: !288, size: 128, offset: 1664)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida", file: !269, line: 244, size: 128, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "xa", scope: !288, file: !269, line: 245, baseType: !272, size: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "connector_list", scope: !228, file: !229, line: 443, baseType: !121, size: 128, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "connector_free_list", scope: !228, file: !229, line: 453, baseType: !293, size: 64, offset: 1920)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_head", file: !294, line: 54, size: 64, elements: !295)
!294 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !293, file: !294, line: 55, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !294, line: 58, size: 64, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !294, line: 59, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "connector_free_work", scope: !228, file: !229, line: 457, baseType: !302, size: 256, offset: 1984)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !303, line: 102, size: 256, elements: !304)
!303 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !303, line: 103, baseType: !191, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !302, file: !303, line: 104, baseType: !121, size: 128, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !302, file: !303, line: 105, baseType: !308, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !303, line: 21, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "num_encoder", scope: !228, file: !229, line: 465, baseType: !49, size: 32, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "encoder_list", scope: !228, file: !229, line: 473, baseType: !121, size: 128, offset: 2304)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num_total_plane", scope: !228, file: !229, line: 482, baseType: !49, size: 32, offset: 2432)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "plane_list", scope: !228, file: !229, line: 489, baseType: !121, size: 128, offset: 2496)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_crtc", scope: !228, file: !229, line: 497, baseType: !49, size: 32, offset: 2624)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "crtc_list", scope: !228, file: !229, line: 504, baseType: !121, size: 128, offset: 2688)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "property_list", scope: !228, file: !229, line: 513, baseType: !121, size: 128, offset: 2816)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "privobj_list", scope: !228, file: !229, line: 522, baseType: !121, size: 128, offset: 2944)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "min_width", scope: !228, file: !229, line: 524, baseType: !49, size: 32, offset: 3072)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "min_height", scope: !228, file: !229, line: 524, baseType: !49, size: 32, offset: 3104)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "max_width", scope: !228, file: !229, line: 525, baseType: !49, size: 32, offset: 3136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_height", scope: !228, file: !229, line: 525, baseType: !49, size: 32, offset: 3168)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !228, file: !229, line: 526, baseType: !326, size: 64, offset: 3200)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_mode_config_funcs", file: !229, line: 47, size: 576, elements: !329)
!329 = !{!330, !354, !358, !362, !370, !376, !380, !384, !388}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fb_create", scope: !328, file: !229, line: 77, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !117, !336, !338}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_framebuffer", file: !229, line: 77, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_file", file: !229, line: 34, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_mode_fb_cmd2", file: !341, line: 494, size: 832, elements: !342)
!341 = !DIFile(filename: "./include/uapi/drm/drm_mode.h", directory: "/home/lizy2001/genbc/linux")
!342 = !{!343, !344, !345, !346, !347, !348, !350, !351, !352}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fb_id", scope: !340, file: !341, line: 495, baseType: !14, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !340, file: !341, line: 496, baseType: !14, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !340, file: !341, line: 497, baseType: !14, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !340, file: !341, line: 498, baseType: !14, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !341, line: 499, baseType: !14, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !340, file: !341, line: 525, baseType: !349, size: 128, offset: 160)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !27)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pitches", scope: !340, file: !341, line: 526, baseType: !349, size: 128, offset: 288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offsets", scope: !340, file: !341, line: 527, baseType: !349, size: 128, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !340, file: !341, line: 528, baseType: !353, size: 256, offset: 576)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 256, elements: !27)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "get_format_info", scope: !328, file: !229, line: 92, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!6, !338}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "output_poll_changed", scope: !328, file: !229, line: 109, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !117}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mode_valid", scope: !328, file: !229, line: 119, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !117, !367}
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "drm_mode_status", file: !229, line: 119, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_display_mode", file: !229, line: 39, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_check", scope: !328, file: !229, line: 196, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!49, !117, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_atomic_state", file: !229, line: 36, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_commit", scope: !328, file: !229, line: 278, baseType: !377, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!49, !117, !374, !35}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_state_alloc", scope: !328, file: !229, line: 297, baseType: !381, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!374, !117}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_state_clear", scope: !328, file: !229, line: 318, baseType: !385, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !374}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_state_free", scope: !328, file: !229, line: 333, baseType: !385, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fb_base", scope: !228, file: !229, line: 527, baseType: !390, size: 64, offset: 3264)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !36, line: 158, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !36, line: 153, baseType: !51)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "poll_enabled", scope: !228, file: !229, line: 530, baseType: !35, size: 8, offset: 3328)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "poll_running", scope: !228, file: !229, line: 531, baseType: !35, size: 8, offset: 3336)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_event", scope: !228, file: !229, line: 532, baseType: !35, size: 8, offset: 3344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "output_poll_work", scope: !228, file: !229, line: 533, baseType: !396, size: 704, offset: 3392)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_work", file: !303, line: 115, size: 704, elements: !397)
!397 = !{!398, !399, !417, !420}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !396, file: !303, line: 116, baseType: !302, size: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !396, file: !303, line: 117, baseType: !400, size: 320, offset: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_list", file: !401, line: 11, size: 320, elements: !402)
!401 = !DIFile(filename: "./include/linux/timer.h", directory: "/home/lizy2001/genbc/linux")
!402 = !{!403, !410, !411, !416}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !400, file: !401, line: 16, baseType: !404, size: 128)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !36, line: 186, size: 128, elements: !405)
!405 = !{!406, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !36, line: 187, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !404, file: !36, line: 187, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !400, file: !401, line: 17, baseType: !250, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !400, file: !401, line: 18, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !401, line: 19, baseType: !12, size: 32, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !396, file: !303, line: 120, baseType: !418, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "workqueue_struct", file: !303, line: 18, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !396, file: !303, line: 121, baseType: !49, size: 32, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "blob_lock", scope: !228, file: !229, line: 541, baseType: !187, size: 192, offset: 4096)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "property_blob_list", scope: !228, file: !229, line: 549, baseType: !121, size: 128, offset: 4288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "edid_property", scope: !228, file: !229, line: 557, baseType: !424, size: 64, offset: 4416)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_property", file: !229, line: 557, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dpms_property", scope: !228, file: !229, line: 562, baseType: !424, size: 64, offset: 4480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "path_property", scope: !228, file: !229, line: 567, baseType: !424, size: 64, offset: 4544)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tile_property", scope: !228, file: !229, line: 573, baseType: !424, size: 64, offset: 4608)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "link_status_property", scope: !228, file: !229, line: 578, baseType: !424, size: 64, offset: 4672)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "plane_type_property", scope: !228, file: !229, line: 583, baseType: !424, size: 64, offset: 4736)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "prop_src_x", scope: !228, file: !229, line: 588, baseType: !424, size: 64, offset: 4800)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prop_src_y", scope: !228, file: !229, line: 593, baseType: !424, size: 64, offset: 4864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prop_src_w", scope: !228, file: !229, line: 598, baseType: !424, size: 64, offset: 4928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prop_src_h", scope: !228, file: !229, line: 603, baseType: !424, size: 64, offset: 4992)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prop_crtc_x", scope: !228, file: !229, line: 608, baseType: !424, size: 64, offset: 5056)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prop_crtc_y", scope: !228, file: !229, line: 613, baseType: !424, size: 64, offset: 5120)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prop_crtc_w", scope: !228, file: !229, line: 618, baseType: !424, size: 64, offset: 5184)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prop_crtc_h", scope: !228, file: !229, line: 623, baseType: !424, size: 64, offset: 5248)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prop_fb_id", scope: !228, file: !229, line: 628, baseType: !424, size: 64, offset: 5312)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prop_in_fence_fd", scope: !228, file: !229, line: 633, baseType: !424, size: 64, offset: 5376)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prop_out_fence_ptr", scope: !228, file: !229, line: 639, baseType: !424, size: 64, offset: 5440)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prop_crtc_id", scope: !228, file: !229, line: 644, baseType: !424, size: 64, offset: 5504)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prop_fb_damage_clips", scope: !228, file: !229, line: 653, baseType: !424, size: 64, offset: 5568)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prop_active", scope: !228, file: !229, line: 659, baseType: !424, size: 64, offset: 5632)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode_id", scope: !228, file: !229, line: 665, baseType: !424, size: 64, offset: 5696)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prop_vrr_enabled", scope: !228, file: !229, line: 670, baseType: !424, size: 64, offset: 5760)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dvi_i_subconnector_property", scope: !228, file: !229, line: 676, baseType: !424, size: 64, offset: 5824)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dvi_i_select_subconnector_property", scope: !228, file: !229, line: 681, baseType: !424, size: 64, offset: 5888)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dp_subconnector_property", scope: !228, file: !229, line: 687, baseType: !424, size: 64, offset: 5952)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tv_subconnector_property", scope: !228, file: !229, line: 693, baseType: !424, size: 64, offset: 6016)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tv_select_subconnector_property", scope: !228, file: !229, line: 698, baseType: !424, size: 64, offset: 6080)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tv_mode_property", scope: !228, file: !229, line: 703, baseType: !424, size: 64, offset: 6144)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tv_left_margin_property", scope: !228, file: !229, line: 708, baseType: !424, size: 64, offset: 6208)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tv_right_margin_property", scope: !228, file: !229, line: 713, baseType: !424, size: 64, offset: 6272)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tv_top_margin_property", scope: !228, file: !229, line: 718, baseType: !424, size: 64, offset: 6336)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tv_bottom_margin_property", scope: !228, file: !229, line: 723, baseType: !424, size: 64, offset: 6400)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_brightness_property", scope: !228, file: !229, line: 728, baseType: !424, size: 64, offset: 6464)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tv_contrast_property", scope: !228, file: !229, line: 733, baseType: !424, size: 64, offset: 6528)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_flicker_reduction_property", scope: !228, file: !229, line: 738, baseType: !424, size: 64, offset: 6592)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tv_overscan_property", scope: !228, file: !229, line: 743, baseType: !424, size: 64, offset: 6656)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tv_saturation_property", scope: !228, file: !229, line: 748, baseType: !424, size: 64, offset: 6720)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tv_hue_property", scope: !228, file: !229, line: 752, baseType: !424, size: 64, offset: 6784)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_mode_property", scope: !228, file: !229, line: 758, baseType: !424, size: 64, offset: 6848)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_property", scope: !228, file: !229, line: 763, baseType: !424, size: 64, offset: 6912)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "content_type_property", scope: !228, file: !229, line: 768, baseType: !424, size: 64, offset: 6976)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "degamma_lut_property", scope: !228, file: !229, line: 773, baseType: !424, size: 64, offset: 7040)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "degamma_lut_size_property", scope: !228, file: !229, line: 778, baseType: !424, size: 64, offset: 7104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ctm_property", scope: !228, file: !229, line: 784, baseType: !424, size: 64, offset: 7168)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_lut_property", scope: !228, file: !229, line: 790, baseType: !424, size: 64, offset: 7232)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_lut_size_property", scope: !228, file: !229, line: 795, baseType: !424, size: 64, offset: 7296)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "suggested_x_property", scope: !228, file: !229, line: 801, baseType: !424, size: 64, offset: 7360)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "suggested_y_property", scope: !228, file: !229, line: 806, baseType: !424, size: 64, offset: 7424)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "non_desktop_property", scope: !228, file: !229, line: 813, baseType: !424, size: 64, offset: 7488)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "panel_orientation_property", scope: !228, file: !229, line: 820, baseType: !424, size: 64, offset: 7552)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_fb_id_property", scope: !228, file: !229, line: 827, baseType: !424, size: 64, offset: 7616)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_pixel_formats_property", scope: !228, file: !229, line: 835, baseType: !424, size: 64, offset: 7680)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_out_fence_ptr_property", scope: !228, file: !229, line: 843, baseType: !424, size: 64, offset: 7744)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_output_metadata_property", scope: !228, file: !229, line: 850, baseType: !424, size: 64, offset: 7808)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "content_protection_property", scope: !228, file: !229, line: 856, baseType: !424, size: 64, offset: 7872)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hdcp_content_type_property", scope: !228, file: !229, line: 862, baseType: !424, size: 64, offset: 7936)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_depth", scope: !228, file: !229, line: 865, baseType: !67, size: 32, offset: 8000)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prefer_shadow", scope: !228, file: !229, line: 865, baseType: !67, size: 32, offset: 8032)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "prefer_shadow_fbdev", scope: !228, file: !229, line: 872, baseType: !35, size: 8, offset: 8064)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fbdev_use_iomem", scope: !228, file: !229, line: 884, baseType: !35, size: 8, offset: 8072)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "quirk_addfb_prefer_xbgr_30bpp", scope: !228, file: !229, line: 892, baseType: !35, size: 8, offset: 8080)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "quirk_addfb_prefer_host_byte_order", scope: !228, file: !229, line: 906, baseType: !35, size: 8, offset: 8088)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "async_page_flip", scope: !228, file: !229, line: 912, baseType: !35, size: 8, offset: 8096)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "allow_fb_modifiers", scope: !228, file: !229, line: 919, baseType: !35, size: 8, offset: 8104)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "normalize_zpos", scope: !228, file: !229, line: 927, baseType: !35, size: 8, offset: 8112)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_property", scope: !228, file: !229, line: 933, baseType: !424, size: 64, offset: 8128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_width", scope: !228, file: !229, line: 936, baseType: !67, size: 32, offset: 8192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_height", scope: !228, file: !229, line: 936, baseType: !67, size: 32, offset: 8224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "suspend_state", scope: !228, file: !229, line: 945, baseType: !374, size: 64, offset: 8256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "helper_private", scope: !228, file: !229, line: 947, baseType: !495, size: 64, offset: 8320)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_mode_config_helper_funcs", file: !229, line: 947, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "object_name_lock", scope: !118, file: !42, line: 303, baseType: !187, size: 192, offset: 11200)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "object_name_idr", scope: !118, file: !42, line: 306, baseType: !268, size: 192, offset: 11392)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vma_offset_manager", scope: !118, file: !42, line: 309, baseType: !501, size: 64, offset: 11584)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_vma_offset_manager", file: !42, line: 19, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vram_mm", scope: !118, file: !42, line: 312, baseType: !504, size: 64, offset: 11648)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_vram_mm", file: !42, line: 20, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "switch_power_state", scope: !118, file: !42, line: 322, baseType: !41, size: 32, offset: 11712)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fb_helper", scope: !118, file: !42, line: 330, baseType: !508, size: 64, offset: 11776)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_fb_helper", file: !42, line: 21, flags: DIFlagFwdDecl)
!510 = !DILocalVariable(name: "dev", arg: 1, scope: !114, file: !3, line: 109, type: !117)
!511 = !DILocation(line: 109, column: 57, scope: !114)
!512 = !DILocalVariable(name: "bpp", arg: 2, scope: !114, file: !3, line: 110, type: !67)
!513 = !DILocation(line: 110, column: 19, scope: !114)
!514 = !DILocalVariable(name: "depth", arg: 3, scope: !114, file: !3, line: 110, type: !67)
!515 = !DILocation(line: 110, column: 33, scope: !114)
!516 = !DILocalVariable(name: "fmt", scope: !114, file: !3, line: 112, type: !67)
!517 = !DILocation(line: 112, column: 11, scope: !114)
!518 = !DILocation(line: 112, column: 43, scope: !114)
!519 = !DILocation(line: 112, column: 48, scope: !114)
!520 = !DILocation(line: 112, column: 17, scope: !114)
!521 = !DILocation(line: 114, column: 6, scope: !522)
!522 = distinct !DILexicalBlock(scope: !114, file: !3, line: 114, column: 6)
!523 = !DILocation(line: 114, column: 11, scope: !522)
!524 = !DILocation(line: 114, column: 23, scope: !522)
!525 = !DILocation(line: 114, column: 6, scope: !114)
!526 = !DILocation(line: 115, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !3, line: 115, column: 7)
!528 = distinct !DILexicalBlock(scope: !522, file: !3, line: 114, column: 59)
!529 = !DILocation(line: 115, column: 11, scope: !527)
!530 = !DILocation(line: 115, column: 7, scope: !528)
!531 = !DILocation(line: 116, column: 8, scope: !527)
!532 = !DILocation(line: 116, column: 4, scope: !527)
!533 = !DILocation(line: 117, column: 7, scope: !534)
!534 = distinct !DILexicalBlock(scope: !528, file: !3, line: 117, column: 7)
!535 = !DILocation(line: 117, column: 11, scope: !534)
!536 = !DILocation(line: 117, column: 7, scope: !528)
!537 = !DILocation(line: 118, column: 8, scope: !534)
!538 = !DILocation(line: 118, column: 4, scope: !534)
!539 = !DILocation(line: 119, column: 7, scope: !540)
!540 = distinct !DILexicalBlock(scope: !528, file: !3, line: 119, column: 7)
!541 = !DILocation(line: 119, column: 11, scope: !540)
!542 = !DILocation(line: 119, column: 7, scope: !528)
!543 = !DILocation(line: 120, column: 8, scope: !540)
!544 = !DILocation(line: 120, column: 4, scope: !540)
!545 = !DILocation(line: 121, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !528, file: !3, line: 121, column: 7)
!547 = !DILocation(line: 121, column: 11, scope: !546)
!548 = !DILocation(line: 121, column: 7, scope: !528)
!549 = !DILocation(line: 122, column: 8, scope: !546)
!550 = !DILocation(line: 122, column: 4, scope: !546)
!551 = !DILocation(line: 123, column: 2, scope: !528)
!552 = !DILocation(line: 125, column: 6, scope: !553)
!553 = distinct !DILexicalBlock(scope: !114, file: !3, line: 125, column: 6)
!554 = !DILocation(line: 125, column: 11, scope: !553)
!555 = !DILocation(line: 125, column: 23, scope: !553)
!556 = !DILocation(line: 125, column: 53, scope: !553)
!557 = !DILocation(line: 126, column: 6, scope: !553)
!558 = !DILocation(line: 126, column: 10, scope: !553)
!559 = !DILocation(line: 125, column: 6, scope: !114)
!560 = !DILocation(line: 127, column: 7, scope: !553)
!561 = !DILocation(line: 127, column: 3, scope: !553)
!562 = !DILocation(line: 129, column: 9, scope: !114)
!563 = !DILocation(line: 129, column: 2, scope: !114)
!564 = distinct !DISubprogram(name: "drm_get_format_name", scope: !3, file: !3, line: 138, type: !565, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !55)
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !67, !569}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
