; ModuleID = '../bcout/drivers/gpu/drm/drm_dsc.llvm.bc'
source_filename = "drivers/gpu/drm/drm_dsc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dp_sdp_header = type { i8, i8, i8, i8 }
%struct.drm_dsc_picture_parameter_set = type <{ i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i16, i8, i8, i16, i8, i8, i16, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i16, i8, i8, i8, i8, [14 x i8], [15 x i16], i8, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i16 }>
%struct.drm_dsc_config = type { i8, i8, i8, i8, i16, i16, i8, i16, i16, i8, i8, i16, i8, i8, i8, i16, i16, i8, i8, i16, [14 x i16], [15 x %struct.drm_dsc_rc_range_parameters], i16, i8, i8, i8, i16, i16, i16, i16, i16, i8, i8, i16, i16, i8, i8, i8, i8, i8, i16, i16 }
%struct.drm_dsc_rc_range_parameters = type { i8, i8, i8 }

@.str = private unnamed_addr constant [49 x i8] c"FinalOfs < RcModelSze for this InitialXmitDelay\0A\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local void @drm_dsc_dp_pps_header_init(%struct.dp_sdp_header* %pps_header) #0 !dbg !28 {
entry:
  %pps_header.addr = alloca %struct.dp_sdp_header*, align 8
  store %struct.dp_sdp_header* %pps_header, %struct.dp_sdp_header** %pps_header.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.dp_sdp_header** %pps_header.addr, metadata !44, metadata !DIExpression()), !dbg !45

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !17, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/gpu/drm/drm_dsc.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "drm_debug_category", file: !4, line: 277, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/drm/drm_print.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "DRM_UT_CORE", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "DRM_UT_DRIVER", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "DRM_UT_KMS", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "DRM_UT_PRIME", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "DRM_UT_ATOMIC", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "DRM_UT_VBL", value: 32, isUnsigned: true)
!13 = !DIEnumerator(name: "DRM_UT_STATE", value: 64, isUnsigned: true)
!14 = !DIEnumerator(name: "DRM_UT_LEASE", value: 128, isUnsigned: true)
!15 = !DIEnumerator(name: "DRM_UT_DP", value: 256, isUnsigned: true)
!16 = !DIEnumerator(name: "DRM_UT_DRMRES", value: 512, isUnsigned: true)
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !19, line: 30, baseType: !20)
!19 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !21, line: 24, baseType: !22)
!21 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !{i32 7, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 2}
!26 = !{i32 1, !"Code Model", i32 2}
!27 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!28 = distinct !DISubprogram(name: "drm_dsc_dp_pps_header_init", scope: !1, file: !1, line: 43, type: !29, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !43)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dp_sdp_header", file: !33, line: 1214, size: 32, elements: !34)
!33 = !DIFile(filename: "./include/drm/drm_dp_helper.h", directory: "/home/lizy2001/genbc/linux")
!34 = !{!35, !40, !41, !42}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "HB0", scope: !32, file: !33, line: 1215, baseType: !36, size: 8)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !37, line: 17, baseType: !38)
!37 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !21, line: 21, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "HB1", scope: !32, file: !33, line: 1216, baseType: !36, size: 8, offset: 8)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "HB2", scope: !32, file: !33, line: 1217, baseType: !36, size: 8, offset: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "HB3", scope: !32, file: !33, line: 1218, baseType: !36, size: 8, offset: 24)
!43 = !{}
!44 = !DILocalVariable(name: "pps_header", arg: 1, scope: !28, file: !1, line: 43, type: !31)
!45 = !DILocation(line: 43, column: 55, scope: !28)
!46 = !DILocation(line: 45, column: 9, scope: !28)
!47 = !DILocation(line: 45, column: 2, scope: !28)
!48 = !DILocation(line: 47, column: 2, scope: !28)
!49 = !DILocation(line: 47, column: 14, scope: !28)
!50 = !DILocation(line: 47, column: 18, scope: !28)
!51 = !DILocation(line: 48, column: 2, scope: !28)
!52 = !DILocation(line: 48, column: 14, scope: !28)
!53 = !DILocation(line: 48, column: 18, scope: !28)
!54 = !DILocation(line: 49, column: 1, scope: !28)
!55 = distinct !DISubprogram(name: "drm_dsc_pps_payload_pack", scope: !1, file: !1, line: 69, type: !56, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !43)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !117}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_dsc_picture_parameter_set", file: !60, line: 285, size: 1024, elements: !61)
!60 = !DIFile(filename: "./include/drm/drm_dsc.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !98, !102, !103, !104, !105, !106, !109, !110, !111, !112, !113, !114, !115, !116}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dsc_version", scope: !59, file: !60, line: 291, baseType: !36, size: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pps_identifier", scope: !59, file: !60, line: 297, baseType: !36, size: 8, offset: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pps_reserved", scope: !59, file: !60, line: 302, baseType: !36, size: 8, offset: 16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pps_3", scope: !59, file: !60, line: 315, baseType: !36, size: 8, offset: 24)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pps_4", scope: !59, file: !60, line: 329, baseType: !36, size: 8, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel_low", scope: !59, file: !60, line: 335, baseType: !36, size: 8, offset: 40)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height", scope: !59, file: !60, line: 341, baseType: !18, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width", scope: !59, file: !60, line: 347, baseType: !18, size: 16, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "slice_height", scope: !59, file: !60, line: 352, baseType: !18, size: 16, offset: 80)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "slice_width", scope: !59, file: !60, line: 357, baseType: !18, size: 16, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !59, file: !60, line: 363, baseType: !18, size: 16, offset: 112)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "initial_xmit_delay_high", scope: !59, file: !60, line: 371, baseType: !36, size: 8, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "initial_xmit_delay_low", scope: !59, file: !60, line: 376, baseType: !36, size: 8, offset: 136)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "initial_dec_delay", scope: !59, file: !60, line: 384, baseType: !18, size: 16, offset: 144)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pps20_reserved", scope: !59, file: !60, line: 390, baseType: !36, size: 8, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scale_value", scope: !59, file: !60, line: 397, baseType: !36, size: 8, offset: 168)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "scale_increment_interval", scope: !59, file: !60, line: 403, baseType: !18, size: 16, offset: 176)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "scale_decrement_interval_high", scope: !59, file: !60, line: 410, baseType: !36, size: 8, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "scale_decrement_interval_low", scope: !59, file: !60, line: 415, baseType: !36, size: 8, offset: 200)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pps26_reserved", scope: !59, file: !60, line: 420, baseType: !36, size: 8, offset: 208)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "first_line_bpg_offset", scope: !59, file: !60, line: 427, baseType: !36, size: 8, offset: 216)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nfl_bpg_offset", scope: !59, file: !60, line: 433, baseType: !18, size: 16, offset: 224)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "slice_bpg_offset", scope: !59, file: !60, line: 439, baseType: !18, size: 16, offset: 240)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "initial_offset", scope: !59, file: !60, line: 444, baseType: !18, size: 16, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "final_offset", scope: !59, file: !60, line: 449, baseType: !18, size: 16, offset: 272)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flatness_min_qp", scope: !59, file: !60, line: 456, baseType: !36, size: 8, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flatness_max_qp", scope: !59, file: !60, line: 463, baseType: !36, size: 8, offset: 296)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rc_model_size", scope: !59, file: !60, line: 468, baseType: !18, size: 16, offset: 304)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "rc_edge_factor", scope: !59, file: !60, line: 475, baseType: !36, size: 8, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rc_quant_incr_limit0", scope: !59, file: !60, line: 481, baseType: !36, size: 8, offset: 328)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rc_quant_incr_limit1", scope: !59, file: !60, line: 487, baseType: !36, size: 8, offset: 336)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rc_tgt_offset", scope: !59, file: !60, line: 495, baseType: !36, size: 8, offset: 344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buf_thresh", scope: !59, file: !60, line: 501, baseType: !95, size: 112, offset: 352)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 112, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 14)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rc_range_parameters", scope: !59, file: !60, line: 507, baseType: !99, size: 240, offset: 464)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 240, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 15)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "native_422_420", scope: !59, file: !60, line: 516, baseType: !36, size: 8, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "second_line_bpg_offset", scope: !59, file: !60, line: 524, baseType: !36, size: 8, offset: 712)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nsl_bpg_offset", scope: !59, file: !60, line: 530, baseType: !18, size: 16, offset: 720)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "second_line_offset_adj", scope: !59, file: !60, line: 536, baseType: !18, size: 16, offset: 736)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_94_reserved", scope: !59, file: !60, line: 541, baseType: !107, size: 32, offset: 752)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !37, line: 21, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !21, line: 27, baseType: !5)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_98_reserved", scope: !59, file: !60, line: 546, baseType: !107, size: 32, offset: 784)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_102_reserved", scope: !59, file: !60, line: 551, baseType: !107, size: 32, offset: 816)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_106_reserved", scope: !59, file: !60, line: 556, baseType: !107, size: 32, offset: 848)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_110_reserved", scope: !59, file: !60, line: 561, baseType: !107, size: 32, offset: 880)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_114_reserved", scope: !59, file: !60, line: 566, baseType: !107, size: 32, offset: 912)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_118_reserved", scope: !59, file: !60, line: 571, baseType: !107, size: 32, offset: 944)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pps_long_122_reserved", scope: !59, file: !60, line: 576, baseType: !107, size: 32, offset: 976)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pps_short_126_reserved", scope: !59, file: !60, line: 581, baseType: !18, size: 16, offset: 1008)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_dsc_config", file: !60, line: 75, size: 1088, elements: !120)
!120 = !{!121, !122, !123, !127, !128, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !147, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "line_buf_depth", scope: !119, file: !60, line: 80, baseType: !36, size: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_component", scope: !119, file: !60, line: 84, baseType: !36, size: 8, offset: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "convert_rgb", scope: !119, file: !60, line: 90, baseType: !124, size: 8, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !125, line: 30, baseType: !126)
!125 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !119, file: !60, line: 94, baseType: !36, size: 8, offset: 24)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "slice_width", scope: !119, file: !60, line: 98, baseType: !129, size: 16, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !37, line: 19, baseType: !20)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "slice_height", scope: !119, file: !60, line: 102, baseType: !129, size: 16, offset: 48)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "simple_422", scope: !119, file: !60, line: 106, baseType: !124, size: 8, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width", scope: !119, file: !60, line: 110, baseType: !129, size: 16, offset: 80)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height", scope: !119, file: !60, line: 114, baseType: !129, size: 16, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rc_tgt_offset_high", scope: !119, file: !60, line: 119, baseType: !36, size: 8, offset: 112)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rc_tgt_offset_low", scope: !119, file: !60, line: 124, baseType: !36, size: 8, offset: 120)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !119, file: !60, line: 129, baseType: !129, size: 16, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rc_edge_factor", scope: !119, file: !60, line: 134, baseType: !36, size: 8, offset: 144)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rc_quant_incr_limit1", scope: !119, file: !60, line: 139, baseType: !36, size: 8, offset: 152)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rc_quant_incr_limit0", scope: !119, file: !60, line: 144, baseType: !36, size: 8, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "initial_xmit_delay", scope: !119, file: !60, line: 149, baseType: !129, size: 16, offset: 176)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "initial_dec_delay", scope: !119, file: !60, line: 156, baseType: !129, size: 16, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "block_pred_enable", scope: !119, file: !60, line: 162, baseType: !124, size: 8, offset: 208)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "first_line_bpg_offset", scope: !119, file: !60, line: 168, baseType: !36, size: 8, offset: 216)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initial_offset", scope: !119, file: !60, line: 172, baseType: !129, size: 16, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buf_thresh", scope: !119, file: !60, line: 176, baseType: !146, size: 224, offset: 240)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 224, elements: !96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rc_range_params", scope: !119, file: !60, line: 182, baseType: !148, size: 360, offset: 464)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 360, elements: !100)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_dsc_rc_range_parameters", file: !60, line: 53, size: 24, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "range_min_qp", scope: !149, file: !60, line: 57, baseType: !36, size: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "range_max_qp", scope: !149, file: !60, line: 61, baseType: !36, size: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "range_bpg_offset", scope: !149, file: !60, line: 66, baseType: !36, size: 8, offset: 16)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rc_model_size", scope: !119, file: !60, line: 186, baseType: !129, size: 16, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flatness_min_qp", scope: !119, file: !60, line: 190, baseType: !36, size: 8, offset: 848)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flatness_max_qp", scope: !119, file: !60, line: 194, baseType: !36, size: 8, offset: 856)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scale_value", scope: !119, file: !60, line: 198, baseType: !36, size: 8, offset: 864)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scale_decrement_interval", scope: !119, file: !60, line: 204, baseType: !129, size: 16, offset: 880)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scale_increment_interval", scope: !119, file: !60, line: 210, baseType: !129, size: 16, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nfl_bpg_offset", scope: !119, file: !60, line: 214, baseType: !129, size: 16, offset: 912)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "slice_bpg_offset", scope: !119, file: !60, line: 218, baseType: !129, size: 16, offset: 928)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "final_offset", scope: !119, file: !60, line: 222, baseType: !129, size: 16, offset: 944)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_enable", scope: !119, file: !60, line: 226, baseType: !124, size: 8, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mux_word_size", scope: !119, file: !60, line: 230, baseType: !36, size: 8, offset: 968)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "slice_chunk_size", scope: !119, file: !60, line: 236, baseType: !129, size: 16, offset: 976)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rc_bits", scope: !119, file: !60, line: 240, baseType: !129, size: 16, offset: 992)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dsc_version_minor", scope: !119, file: !60, line: 244, baseType: !36, size: 8, offset: 1008)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dsc_version_major", scope: !119, file: !60, line: 248, baseType: !36, size: 8, offset: 1016)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "native_422", scope: !119, file: !60, line: 252, baseType: !124, size: 8, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "native_420", scope: !119, file: !60, line: 256, baseType: !124, size: 8, offset: 1032)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "second_line_bpg_offset", scope: !119, file: !60, line: 261, baseType: !36, size: 8, offset: 1040)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nsl_bpg_offset", scope: !119, file: !60, line: 267, baseType: !129, size: 16, offset: 1056)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "second_line_offset_adj", scope: !119, file: !60, line: 272, baseType: !129, size: 16, offset: 1072)
!174 = !DILocalVariable(name: "pps_payload", arg: 1, scope: !55, file: !1, line: 69, type: !58)
!175 = !DILocation(line: 69, column: 69, scope: !55)
!176 = !DILocalVariable(name: "dsc_cfg", arg: 2, scope: !55, file: !1, line: 70, type: !117)
!177 = !DILocation(line: 70, column: 34, scope: !55)
!178 = !DILocalVariable(name: "i", scope: !55, file: !1, line: 72, type: !179)
!179 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!180 = !DILocation(line: 72, column: 6, scope: !55)
!181 = !DILocation(line: 75, column: 2, scope: !55)
!182 = !DILocation(line: 75, column: 2, scope: !183)
!183 = distinct !DILexicalBlock(scope: !55, file: !1, line: 75, column: 2)
!184 = !DILocation(line: 78, column: 9, scope: !55)
!185 = !DILocation(line: 78, column: 2, scope: !55)
!186 = !DILocation(line: 82, column: 3, scope: !55)
!187 = !DILocation(line: 82, column: 12, scope: !55)
!188 = !DILocation(line: 83, column: 3, scope: !55)
!189 = !DILocation(line: 83, column: 12, scope: !55)
!190 = !DILocation(line: 83, column: 30, scope: !55)
!191 = !DILocation(line: 82, column: 30, scope: !55)
!192 = !DILocation(line: 81, column: 2, scope: !55)
!193 = !DILocation(line: 81, column: 15, scope: !55)
!194 = !DILocation(line: 81, column: 27, scope: !55)
!195 = !DILocation(line: 89, column: 3, scope: !55)
!196 = !DILocation(line: 89, column: 12, scope: !55)
!197 = !DILocation(line: 90, column: 3, scope: !55)
!198 = !DILocation(line: 90, column: 12, scope: !55)
!199 = !DILocation(line: 90, column: 31, scope: !55)
!200 = !DILocation(line: 89, column: 27, scope: !55)
!201 = !DILocation(line: 88, column: 2, scope: !55)
!202 = !DILocation(line: 88, column: 15, scope: !55)
!203 = !DILocation(line: 88, column: 21, scope: !55)
!204 = !DILocation(line: 94, column: 5, scope: !55)
!205 = !DILocation(line: 94, column: 14, scope: !55)
!206 = !DILocation(line: 94, column: 29, scope: !55)
!207 = !DILocation(line: 94, column: 54, scope: !55)
!208 = !DILocation(line: 96, column: 3, scope: !55)
!209 = !DILocation(line: 96, column: 12, scope: !55)
!210 = !DILocation(line: 96, column: 23, scope: !55)
!211 = !DILocation(line: 95, column: 23, scope: !55)
!212 = !DILocation(line: 97, column: 3, scope: !55)
!213 = !DILocation(line: 97, column: 12, scope: !55)
!214 = !DILocation(line: 97, column: 23, scope: !55)
!215 = !DILocation(line: 96, column: 47, scope: !55)
!216 = !DILocation(line: 98, column: 3, scope: !55)
!217 = !DILocation(line: 98, column: 12, scope: !55)
!218 = !DILocation(line: 98, column: 24, scope: !55)
!219 = !DILocation(line: 97, column: 50, scope: !55)
!220 = !DILocation(line: 99, column: 3, scope: !55)
!221 = !DILocation(line: 99, column: 12, scope: !55)
!222 = !DILocation(line: 99, column: 30, scope: !55)
!223 = !DILocation(line: 98, column: 53, scope: !55)
!224 = !DILocation(line: 94, column: 3, scope: !55)
!225 = !DILocation(line: 93, column: 2, scope: !55)
!226 = !DILocation(line: 93, column: 15, scope: !55)
!227 = !DILocation(line: 93, column: 21, scope: !55)
!228 = !DILocation(line: 103, column: 4, scope: !55)
!229 = !DILocation(line: 103, column: 13, scope: !55)
!230 = !DILocation(line: 103, column: 28, scope: !55)
!231 = !DILocation(line: 103, column: 3, scope: !55)
!232 = !DILocation(line: 102, column: 2, scope: !55)
!233 = !DILocation(line: 102, column: 15, scope: !55)
!234 = !DILocation(line: 102, column: 34, scope: !55)
!235 = !DILocation(line: 113, column: 28, scope: !55)
!236 = !DILocation(line: 113, column: 2, scope: !55)
!237 = !DILocation(line: 113, column: 15, scope: !55)
!238 = !DILocation(line: 113, column: 26, scope: !55)
!239 = !DILocation(line: 116, column: 27, scope: !55)
!240 = !DILocation(line: 116, column: 2, scope: !55)
!241 = !DILocation(line: 116, column: 15, scope: !55)
!242 = !DILocation(line: 116, column: 25, scope: !55)
!243 = !DILocation(line: 119, column: 30, scope: !55)
