; ModuleID = '../bcout/drivers/gpu/drm/drm_vma_manager.llvm.bc'
source_filename = "drivers/gpu/drm/drm_vma_manager.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.drm_vma_offset_manager = type { %struct.rwlock_t, %struct.drm_mm }
%struct.rwlock_t = type { %struct.arch_rwlock_t }
%struct.arch_rwlock_t = type {}
%struct.drm_mm = type { void (%struct.drm_mm_node*, i64, i64*, i64*)*, %struct.list_head, %struct.drm_mm_node, %struct.rb_root_cached, %struct.rb_root_cached, %struct.rb_root, i64 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.drm_mm_node = type { i64, i64, i64, %struct.drm_mm*, %struct.list_head, %struct.list_head, %struct.rb_node, %struct.rb_node, %struct.rb_node, i64, i64, i64, i64 }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.rb_root_cached = type { %struct.rb_root, %struct.rb_node* }
%struct.rb_root = type { %struct.rb_node* }
%struct.drm_vma_offset_node = type { %struct.rwlock_t, %struct.drm_mm_node, %struct.rb_root, i8 }
%struct.drm_file = type opaque
%struct.drm_vma_offset_file = type { %struct.rb_node, %struct.drm_file*, i64 }

@kmalloc_caches = external dso_local global [3 x [14 x %struct.kmem_cache*]], align 16
@.str = private unnamed_addr constant [21 x i8] c"include/linux/slab.h\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !26, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/gpu/drm/drm_vma_manager.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3, !9, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 10, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "drm_mm_insert_mode", file: !10, line: 68, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "./include/drm/drm_mm.h", directory: "/home/lizy2001/genbc/linux")
!11 = !{!12, !13, !14, !15, !16, !17, !18}
!12 = !DIEnumerator(name: "DRM_MM_INSERT_BEST", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "DRM_MM_INSERT_LOW", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "DRM_MM_INSERT_HIGH", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "DRM_MM_INSERT_EVICT", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "DRM_MM_INSERT_ONCE", value: 2147483648, isUnsigned: true)
!17 = !DIEnumerator(name: "DRM_MM_INSERT_HIGHEST", value: 2147483650, isUnsigned: true)
!18 = !DIEnumerator(name: "DRM_MM_INSERT_LOWEST", value: 2147483649, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !20, line: 305, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!26 = !{!27, !28, !86, !105, !106, !114, !34, !32}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_mm_node", file: !10, line: 155, size: 1344, elements: !30)
!30 = !{!31, !33, !39, !40, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !29, file: !10, line: 157, baseType: !32, size: 64)
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !29, file: !10, line: 159, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !35, line: 23, baseType: !36)
!35 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !37, line: 31, baseType: !38)
!37 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!38 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !10, line: 161, baseType: !34, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !29, file: !10, line: 163, baseType: !41, size: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_mm", file: !10, line: 188, size: 1920, elements: !43)
!43 = !{!44, !51, !58, !59, !74, !75, !76}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "color_adjust", scope: !42, file: !10, line: 198, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !32, !50, !50}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "hole_stack", scope: !42, file: !10, line: 204, baseType: !52, size: 128, offset: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 178, size: 128, elements: !54)
!53 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !53, line: 179, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !53, line: 179, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "head_node", scope: !42, file: !10, line: 207, baseType: !29, size: 1344, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "interval_tree", scope: !42, file: !10, line: 209, baseType: !60, size: 128, offset: 1536)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !61, line: 125, size: 128, elements: !62)
!61 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!62 = !{!63, !73}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !60, file: !61, line: 126, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !61, line: 31, size: 64, elements: !65)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !64, file: !61, line: 32, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !61, line: 24, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !68, file: !61, line: 25, baseType: !32, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !68, file: !61, line: 26, baseType: !67, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !68, file: !61, line: 27, baseType: !67, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !60, file: !61, line: 127, baseType: !67, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "holes_size", scope: !42, file: !10, line: 210, baseType: !60, size: 128, offset: 1664)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "holes_addr", scope: !42, file: !10, line: 211, baseType: !64, size: 64, offset: 1792)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "scan_active", scope: !42, file: !10, line: 213, baseType: !32, size: 64, offset: 1856)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !29, file: !10, line: 164, baseType: !52, size: 128, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hole_stack", scope: !29, file: !10, line: 165, baseType: !52, size: 128, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !29, file: !10, line: 166, baseType: !68, size: 192, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "rb_hole_size", scope: !29, file: !10, line: 167, baseType: !68, size: 192, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rb_hole_addr", scope: !29, file: !10, line: 168, baseType: !68, size: 192, align: 64, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__subtree_last", scope: !29, file: !10, line: 169, baseType: !34, size: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hole_size", scope: !29, file: !10, line: 170, baseType: !34, size: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subtree_max_hole", scope: !29, file: !10, line: 171, baseType: !34, size: 64, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !10, line: 172, baseType: !32, size: 64, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_vma_offset_node", file: !88, line: 52, size: 1472, elements: !89)
!88 = !DIFile(filename: "./include/drm/drm_vma_manager.h", directory: "/home/lizy2001/genbc/linux")
!89 = !{!90, !100, !101, !102}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "vm_lock", scope: !87, file: !88, line: 53, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "rwlock_t", file: !92, line: 20, baseType: !93)
!92 = !DIFile(filename: "./include/linux/rwlock_types.h", directory: "/home/lizy2001/genbc/linux")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 11, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !93, file: !92, line: 12, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_rwlock_t", file: !97, line: 33, baseType: !98)
!97 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 31, elements: !99)
!99 = !{}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vm_node", scope: !87, file: !88, line: 54, baseType: !29, size: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "vm_files", scope: !87, file: !88, line: 55, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !87, file: !88, line: 56, baseType: !103, size: 1, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !53, line: 30, baseType: !104)
!104 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !53, line: 148, baseType: !5)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_vma_offset_file", file: !88, line: 46, size: 320, elements: !108)
!108 = !{!109, !110, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !107, file: !88, line: 47, baseType: !68, size: 192, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "vm_tag", scope: !107, file: !88, line: 48, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "drm_file", file: !88, line: 44, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vm_count", scope: !107, file: !88, line: 49, baseType: !32, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!115 = !{i32 7, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 2}
!118 = !{i32 1, !"Code Model", i32 2}
!119 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!120 = distinct !DISubprogram(name: "drm_vma_offset_manager_init", scope: !1, file: !1, line: 85, type: !121, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123, !32, !32}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "drm_vma_offset_manager", file: !88, line: 59, size: 1920, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "vm_lock", scope: !124, file: !88, line: 60, baseType: !91)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vm_addr_space_mm", scope: !124, file: !88, line: 61, baseType: !42, size: 1920)
!128 = !DILocalVariable(name: "mgr", arg: 1, scope: !120, file: !1, line: 85, type: !123)
!129 = !DILocation(line: 85, column: 65, scope: !120)
!130 = !DILocalVariable(name: "page_offset", arg: 2, scope: !120, file: !1, line: 86, type: !32)
!131 = !DILocation(line: 86, column: 20, scope: !120)
!132 = !DILocalVariable(name: "size", arg: 3, scope: !120, file: !1, line: 86, type: !32)
!133 = !DILocation(line: 86, column: 47, scope: !120)
!134 = !DILocation(line: 88, column: 2, scope: !120)
!135 = !DILocation(line: 88, column: 2, scope: !136)
!136 = distinct !DILexicalBlock(scope: !120, file: !1, line: 88, column: 2)
!137 = !DILocation(line: 89, column: 15, scope: !120)
!138 = !DILocation(line: 89, column: 20, scope: !120)
!139 = !DILocation(line: 89, column: 38, scope: !120)
!140 = !DILocation(line: 89, column: 51, scope: !120)
!141 = !DILocation(line: 89, column: 2, scope: !120)
!142 = !DILocation(line: 90, column: 1, scope: !120)
!143 = distinct !DISubprogram(name: "drm_vma_offset_manager_destroy", scope: !1, file: !1, line: 104, type: !144, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !123}
!146 = !DILocalVariable(name: "mgr", arg: 1, scope: !143, file: !1, line: 104, type: !123)
!147 = !DILocation(line: 104, column: 68, scope: !143)
!148 = !DILocation(line: 106, column: 19, scope: !143)
!149 = !DILocation(line: 106, column: 24, scope: !143)
!150 = !DILocation(line: 106, column: 2, scope: !143)
!151 = !DILocation(line: 107, column: 1, scope: !143)
!152 = distinct !DISubprogram(name: "drm_vma_offset_lookup_locked", scope: !1, file: !1, line: 140, type: !153, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!153 = !DISubroutineType(types: !154)
!154 = !{!86, !123, !32, !32}
!155 = !DILocalVariable(name: "mgr", arg: 1, scope: !152, file: !1, line: 140, type: !123)
!156 = !DILocation(line: 140, column: 89, scope: !152)
!157 = !DILocalVariable(name: "start", arg: 2, scope: !152, file: !1, line: 141, type: !32)
!158 = !DILocation(line: 141, column: 23, scope: !152)
!159 = !DILocalVariable(name: "pages", arg: 3, scope: !152, file: !1, line: 142, type: !32)
!160 = !DILocation(line: 142, column: 23, scope: !152)
!161 = !DILocalVariable(name: "node", scope: !152, file: !1, line: 144, type: !28)
!162 = !DILocation(line: 144, column: 22, scope: !152)
!163 = !DILocalVariable(name: "best", scope: !152, file: !1, line: 144, type: !28)
!164 = !DILocation(line: 144, column: 29, scope: !152)
!165 = !DILocalVariable(name: "iter", scope: !152, file: !1, line: 145, type: !67)
!166 = !DILocation(line: 145, column: 18, scope: !152)
