; ModuleID = '../bcout/drivers/net/wireless/intersil/hostap/hostap_plx.llvm.bc'
source_filename = "drivers/net/wireless/intersil/hostap/hostap_plx.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_prism2_plx_driver_init6:\09\09\09"
module asm ".long\09prism2_plx_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.kparam_array = type { i32, i32, i32*, %struct.kernel_param_ops*, i8* }
%struct.kparam_string = type { i32, i8* }
%struct.pci_driver = type { %struct.list_head, i8*, %struct.pci_device_id*, i32 (%struct.pci_dev*, %struct.pci_device_id*)*, void (%struct.pci_dev*)*, i32 (%struct.pci_dev*, i32)*, i32 (%struct.pci_dev*)*, void (%struct.pci_dev*)*, i32 (%struct.pci_dev*, i32)*, %struct.pci_error_handlers*, %struct.attribute_group**, %struct.device_driver, %struct.pci_dynids }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.pci_device_id = type { i32, i32, i32, i32, i32, i32, i64 }

!217 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!218 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!219 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!220 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !209, line: 602, baseType: !7, size: 32, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228}
!223 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!224 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!225 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!226 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!227 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!228 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !209, line: 615, baseType: !7, size: 32, elements: !230)
!230 = !{!231, !232, !233, !234}
!231 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!232 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!233 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!234 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !209, line: 626, baseType: !7, size: 32, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !209, line: 638, baseType: !7, size: 32, elements: !243)
!243 = !{!244, !245}
!244 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!245 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !209, line: 647, baseType: !7, size: 32, elements: !247)
!247 = !{!248, !249}
!248 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !251, line: 54, baseType: !7, size: 32, elements: !252)
!251 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!252 = !{!253, !254, !255, !256}
!253 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !31, line: 423, baseType: !7, size: 32, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!260 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!261 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!262 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !264, file: !31, line: 2085, baseType: !7, size: 32, elements: !7157)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !31, line: 1858, size: 15808, elements: !265)
!265 = !{!266, !271, !294, !311, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !328, !336, !337, !338, !339, !340, !341, !342, !343, !344, !370, !380, !381, !382, !387, !388, !506, !531, !5630, !6146, !6150, !6190, !6191, !6192, !6193, !6194, !6195, !6196, !6197, !6198, !6199, !6200, !6201, !6202, !6203, !6204, !6205, !6206, !6207, !6208, !6209, !6210, !6211, !6212, !6213, !6214, !6215, !6216, !6221, !6222, !6223, !6503, !6504, !6505, !6506, !6509, !6512, !6515, !6518, !6521, !6522, !6535, !6536, !6537, !6538, !6539, !6540, !6547, !6548, !6582, !6583, !6584, !6585, !6586, !6587, !6588, !6589, !6590, !6593, !6594, !6595, !6596, !6597, !6598, !6599, !6600, !6601, !6606, !6607, !6608, !6613, !6650, !7112, !7114, !7115, !7119, !7120, !7121, !7122, !7128, !7130, !7133, !7136, !7138, !7139, !7140, !7141, !7142, !7146, !7149}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !31, line: 1859, baseType: !267, size: 128)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !269)
!268 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!269 = !{!270}
!270 = !DISubrange(count: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !264, file: !31, line: 1860, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !31, line: 938, size: 384, elements: !274)
!274 = !{!275, !283, !289, !291}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !273, file: !31, line: 939, baseType: !276, size: 128)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !277, line: 186, size: 128, elements: !278)
!277 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !277, line: 187, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !276, file: !277, line: 187, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !273, file: !31, line: 940, baseType: !284, size: 128, offset: 128)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !277, line: 178, size: 128, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !277, line: 179, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !284, file: !277, line: 179, baseType: !287, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !273, file: !31, line: 941, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !31, line: 942, baseType: !292, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !264, file: !31, line: 1861, baseType: !295, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !31, line: 930, size: 128, elements: !297)
!297 = !{!298, !307}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !296, file: !31, line: 931, baseType: !299, size: 128, align: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !277, line: 216, size: 128, align: 64, elements: !300)
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !277, line: 217, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !299, file: !277, line: 218, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !302}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !296, file: !31, line: 932, baseType: !308, offset: 128)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: -1)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !264, file: !31, line: 1866, baseType: !312, size: 64, offset: 256)
!312 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !264, file: !31, line: 1867, baseType: !312, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !264, file: !31, line: 1868, baseType: !312, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !264, file: !31, line: 1869, baseType: !32, size: 32, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !31, line: 1877, baseType: !312, size: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !264, file: !31, line: 1879, baseType: !284, size: 128, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !264, file: !31, line: 1880, baseType: !284, size: 128, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !264, file: !31, line: 1881, baseType: !284, size: 128, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !264, file: !31, line: 1882, baseType: !284, size: 128, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !264, file: !31, line: 1883, baseType: !284, size: 128, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !264, file: !31, line: 1884, baseType: !284, size: 128, offset: 1216)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !264, file: !31, line: 1889, baseType: !324, size: 256, offset: 1344)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !264, file: !31, line: 1886, size: 256, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !324, file: !31, line: 1887, baseType: !284, size: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !324, file: !31, line: 1888, baseType: !284, size: 128, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !264, file: !31, line: 1891, baseType: !329, size: 64, offset: 1600)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !330, line: 12, baseType: !331)
!330 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !332, line: 23, baseType: !333)
!332 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !334, line: 31, baseType: !335)
!334 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!335 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !264, file: !31, line: 1892, baseType: !329, size: 64, offset: 1664)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !264, file: !31, line: 1893, baseType: !329, size: 64, offset: 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !264, file: !31, line: 1894, baseType: !329, size: 64, offset: 1792)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !264, file: !31, line: 1895, baseType: !329, size: 64, offset: 1856)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !264, file: !31, line: 1896, baseType: !329, size: 64, offset: 1920)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !264, file: !31, line: 1897, baseType: !329, size: 64, offset: 1984)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !264, file: !31, line: 1899, baseType: !32, size: 32, offset: 2048)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !264, file: !31, line: 1900, baseType: !32, size: 32, offset: 2080)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !264, file: !31, line: 1902, baseType: !345, size: 1472, offset: 2112)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !31, line: 169, size: 1472, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !345, file: !31, line: 170, baseType: !312, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !345, file: !31, line: 171, baseType: !312, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !345, file: !31, line: 172, baseType: !312, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !345, file: !31, line: 173, baseType: !312, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !345, file: !31, line: 174, baseType: !312, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !345, file: !31, line: 175, baseType: !312, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !345, file: !31, line: 176, baseType: !312, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !345, file: !31, line: 177, baseType: !312, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !345, file: !31, line: 178, baseType: !312, size: 64, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !345, file: !31, line: 179, baseType: !312, size: 64, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !345, file: !31, line: 180, baseType: !312, size: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !345, file: !31, line: 181, baseType: !312, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !345, file: !31, line: 182, baseType: !312, size: 64, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !345, file: !31, line: 183, baseType: !312, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !345, file: !31, line: 184, baseType: !312, size: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !345, file: !31, line: 185, baseType: !312, size: 64, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !345, file: !31, line: 186, baseType: !312, size: 64, offset: 1024)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !345, file: !31, line: 187, baseType: !312, size: 64, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !345, file: !31, line: 188, baseType: !312, size: 64, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !345, file: !31, line: 189, baseType: !312, size: 64, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !345, file: !31, line: 190, baseType: !312, size: 64, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !345, file: !31, line: 191, baseType: !312, size: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !345, file: !31, line: 192, baseType: !312, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !264, file: !31, line: 1904, baseType: !371, size: 64, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !372, line: 13, baseType: !373)
!372 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !277, line: 175, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 173, size: 64, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !374, file: !277, line: 174, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !332, line: 22, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !334, line: 30, baseType: !379)
!379 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !264, file: !31, line: 1905, baseType: !371, size: 64, offset: 3648)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !264, file: !31, line: 1906, baseType: !371, size: 64, offset: 3712)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !264, file: !31, line: 1909, baseType: !383, size: 32, offset: 3776)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !277, line: 168, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 166, size: 32, elements: !385)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !384, file: !277, line: 167, baseType: !32, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !264, file: !31, line: 1910, baseType: !383, size: 32, offset: 3808)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !264, file: !31, line: 1913, baseType: !389, size: 64, offset: 3840)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !392, line: 324, size: 320, elements: !393)
!392 = !DIFile(filename: "./include/net/iw_handler.h", directory: "/home/lizy2001/genbc/linux")
!393 = !{!394, !472, !473, !474, !475, !476, !485}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "standard", scope: !391, file: !392, line: 329, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "iw_handler", file: !392, line: 315, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!32, !290, !401, !408, !471}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_request_info", file: !392, line: 304, size: 32, elements: !403)
!403 = !{!404, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !402, file: !392, line: 305, baseType: !405, size: 16)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !334, line: 24, baseType: !406)
!406 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !402, file: !392, line: 306, baseType: !405, size: 16, offset: 16)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "iwreq_data", file: !410, line: 902, size: 128, elements: !411)
!410 = !DIFile(filename: "./include/uapi/linux/wireless.h", directory: "/home/lizy2001/genbc/linux")
!411 = !{!412, !413, !420, !430, !439, !440, !441, !442, !443, !444, !446, !447, !448, !449, !456, !468, !469, !470}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !409, file: !410, line: 904, baseType: !267, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "essid", scope: !409, file: !410, line: 908, baseType: !414, size: 128)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_point", file: !410, line: 691, size: 128, elements: !415)
!415 = !{!416, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !414, file: !410, line: 692, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !414, file: !410, line: 693, baseType: !405, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !410, line: 694, baseType: !405, size: 16, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nwid", scope: !409, file: !410, line: 909, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_param", file: !410, line: 680, size: 64, elements: !422)
!422 = !{!423, !425, !428, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !421, file: !410, line: 681, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !334, line: 26, baseType: !32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !421, file: !410, line: 682, baseType: !426, size: 8, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !334, line: 21, baseType: !427)
!427 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !421, file: !410, line: 683, baseType: !426, size: 8, offset: 40)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !421, file: !410, line: 684, baseType: !405, size: 16, offset: 48)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !409, file: !410, line: 910, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_freq", file: !410, line: 706, size: 64, elements: !432)
!432 = !{!433, !434, !437, !438}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !431, file: !410, line: 707, baseType: !424, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !431, file: !410, line: 708, baseType: !435, size: 16, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !334, line: 23, baseType: !436)
!436 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !431, file: !410, line: 709, baseType: !426, size: 8, offset: 48)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !410, line: 710, baseType: !426, size: 8, offset: 56)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sens", scope: !409, file: !410, line: 914, baseType: !421, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !409, file: !410, line: 915, baseType: !421, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "txpower", scope: !409, file: !410, line: 916, baseType: !421, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rts", scope: !409, file: !410, line: 917, baseType: !421, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !409, file: !410, line: 918, baseType: !421, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !409, file: !410, line: 919, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !334, line: 27, baseType: !7)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !409, file: !410, line: 920, baseType: !421, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !409, file: !410, line: 922, baseType: !414, size: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !409, file: !410, line: 923, baseType: !421, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !409, file: !410, line: 924, baseType: !450, size: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_quality", file: !410, line: 716, size: 32, elements: !451)
!451 = !{!452, !453, !454, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !450, file: !410, line: 717, baseType: !426, size: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !450, file: !410, line: 719, baseType: !426, size: 8, offset: 8)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !450, file: !410, line: 720, baseType: !426, size: 8, offset: 16)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !450, file: !410, line: 721, baseType: !426, size: 8, offset: 24)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ap_addr", scope: !409, file: !410, line: 926, baseType: !457, size: 128)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !458, line: 32, size: 128, elements: !459)
!458 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!459 = !{!460, !464}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !457, file: !458, line: 33, baseType: !461, size: 16)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !458, line: 26, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !463, line: 10, baseType: !406)
!463 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !457, file: !458, line: 34, baseType: !465, size: 112, offset: 16)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 112, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 14)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !409, file: !410, line: 927, baseType: !457, size: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !409, file: !410, line: 929, baseType: !421, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !410, line: 930, baseType: !414, size: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_standard", scope: !391, file: !392, line: 332, baseType: !405, size: 16, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_private", scope: !391, file: !392, line: 335, baseType: !405, size: 16, offset: 80)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "num_private_args", scope: !391, file: !392, line: 337, baseType: !405, size: 16, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !391, file: !392, line: 341, baseType: !395, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "private_args", scope: !391, file: !392, line: 346, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_priv_args", file: !410, line: 1063, size: 192, elements: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !479, file: !410, line: 1064, baseType: !445, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "set_args", scope: !479, file: !410, line: 1065, baseType: !405, size: 16, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "get_args", scope: !479, file: !410, line: 1066, baseType: !405, size: 16, offset: 48)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !410, line: 1067, baseType: !267, size: 128, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "get_wireless_stats", scope: !391, file: !392, line: 352, baseType: !486, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !290}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_statistics", file: !410, line: 881, size: 256, elements: !491)
!491 = !{!492, !493, !494, !502}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !490, file: !410, line: 882, baseType: !405, size: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !490, file: !410, line: 885, baseType: !450, size: 32, offset: 16)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "discard", scope: !490, file: !410, line: 887, baseType: !495, size: 160, offset: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_discarded", file: !410, line: 731, size: 160, elements: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nwid", scope: !495, file: !410, line: 732, baseType: !445, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !495, file: !410, line: 733, baseType: !445, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !495, file: !410, line: 734, baseType: !445, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !495, file: !410, line: 735, baseType: !445, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !495, file: !410, line: 736, baseType: !445, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !490, file: !410, line: 888, baseType: !503, size: 32, offset: 224)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_missed", file: !410, line: 743, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "beacon", scope: !503, file: !410, line: 744, baseType: !445, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !264, file: !31, line: 1914, baseType: !507, size: 64, offset: 3904)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !392, line: 420, size: 128, elements: !509)
!509 = !{!510, !528}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "spy_data", scope: !508, file: !392, line: 422, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_spy_data", file: !392, line: 396, size: 800, elements: !513)
!513 = !{!514, !515, !521, !524, !525, !526}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "spy_number", scope: !512, file: !392, line: 398, baseType: !32, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "spy_address", scope: !512, file: !392, line: 399, baseType: !516, size: 384, offset: 32)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 384, elements: !518)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !277, line: 79, baseType: !427)
!518 = !{!519, !520}
!519 = !DISubrange(count: 8)
!520 = !DISubrange(count: 6)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "spy_stat", scope: !512, file: !392, line: 400, baseType: !522, size: 256, offset: 416)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 256, elements: !523)
!523 = !{!519}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "spy_thr_low", scope: !512, file: !392, line: 402, baseType: !450, size: 32, offset: 672)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "spy_thr_high", scope: !512, file: !392, line: 403, baseType: !450, size: 32, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spy_thr_under", scope: !512, file: !392, line: 404, baseType: !527, size: 64, offset: 736)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 64, elements: !523)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "libipw", scope: !508, file: !392, line: 424, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "libipw_device", file: !392, line: 418, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !264, file: !31, line: 1916, baseType: !532, size: 64, offset: 3968)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !31, line: 1283, size: 4416, elements: !535)
!535 = !{!536, !540, !544, !545, !546, !704, !708, !713, !717, !718, !722, !723, !834, !839, !843, !849, !853, !885, !893, !897, !902, !906, !907, !913, !917, !921, !925, !926, !948, !952, !967, !978, !982, !991, !995, !996, !1000, !1021, !1025, !1029, !1033, !1037, !1044, !1048, !1065, !1069, !1118, !1122, !1127, !1131, !1135, !1139, !1149, !1150, !1158, !1164, !1165, !1169, !1173, !1177, !1181, !1182, !1186, !1187, !5590, !5610, !5614, !5620, !5626}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !534, file: !31, line: 1284, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!32, !290}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !534, file: !31, line: 1285, baseType: !541, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !290}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !534, file: !31, line: 1286, baseType: !537, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !534, file: !31, line: 1287, baseType: !537, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !534, file: !31, line: 1288, baseType: !547, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !551, !290}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !31, line: 120, baseType: !30)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !553, line: 713, size: 1600, elements: !554)
!553 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!554 = !{!555, !577, !585, !592, !596, !608, !609, !610, !611, !612, !613, !617, !618, !619, !620, !621, !622, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !662, !663, !664, !665, !667, !668, !673, !678, !683, !684, !685, !686, !687, !688, !689, !690, !691, !693, !694, !696, !697, !698}
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 714, baseType: !556, size: 192)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 714, size: 192, elements: !557)
!557 = !{!558, !568, !576}
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !553, line: 715, baseType: !559, size: 192)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !556, file: !553, line: 715, size: 192, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !559, file: !553, line: 717, baseType: !551, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !559, file: !553, line: 718, baseType: !551, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !553, line: 720, baseType: !564, size: 64, offset: 128)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !553, line: 720, size: 64, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !564, file: !553, line: 721, baseType: !290, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !564, file: !553, line: 726, baseType: !312, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !556, file: !553, line: 729, baseType: !569, size: 192, align: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !570, line: 24, size: 192, align: 64, elements: !571)
!570 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!571 = !{!572, !573, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !569, file: !570, line: 25, baseType: !312, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !569, file: !570, line: 26, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !569, file: !570, line: 27, baseType: !574, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !556, file: !553, line: 730, baseType: !284, size: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 733, baseType: !578, size: 64, offset: 192)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 733, size: 64, elements: !579)
!579 = !{!580, !584}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !578, file: !553, line: 734, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !583, line: 19, flags: DIFlagFwdDecl)
!583 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !578, file: !553, line: 735, baseType: !32, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 738, baseType: !586, size: 64, offset: 256)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 738, size: 64, elements: !587)
!587 = !{!588, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !586, file: !553, line: 739, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !590, line: 29, baseType: !377)
!590 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!591 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !586, file: !553, line: 740, baseType: !331, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !552, file: !553, line: 748, baseType: !593, size: 384, align: 64, offset: 320)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 384, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 48)
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 750, baseType: !597, size: 128, offset: 704)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 750, size: 128, elements: !598)
!598 = !{!599, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, scope: !597, file: !553, line: 751, baseType: !600, size: 128)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !553, line: 751, size: 128, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !600, file: !553, line: 752, baseType: !312, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !600, file: !553, line: 753, baseType: !604, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !551}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !597, file: !553, line: 755, baseType: !284, size: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !552, file: !553, line: 761, baseType: !7, size: 32, offset: 832)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !552, file: !553, line: 762, baseType: !7, size: 32, offset: 864)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !552, file: !553, line: 763, baseType: !405, size: 16, offset: 896)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !552, file: !553, line: 764, baseType: !405, size: 16, offset: 912)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !552, file: !553, line: 769, baseType: !405, size: 16, offset: 928)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !552, file: !553, line: 780, baseType: !614, offset: 944)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !552, file: !553, line: 782, baseType: !426, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !552, file: !553, line: 783, baseType: !426, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !552, file: !553, line: 784, baseType: !426, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !552, file: !553, line: 785, baseType: !426, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !552, file: !553, line: 786, baseType: !426, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !552, file: !553, line: 787, baseType: !426, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !552, file: !553, line: 795, baseType: !624, offset: 960)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, elements: !615)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !552, file: !553, line: 807, baseType: !614, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !552, file: !553, line: 809, baseType: !426, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !552, file: !553, line: 810, baseType: !426, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !552, file: !553, line: 811, baseType: !426, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !552, file: !553, line: 812, baseType: !426, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !552, file: !553, line: 813, baseType: !426, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !552, file: !553, line: 815, baseType: !426, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !552, file: !553, line: 816, baseType: !426, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !552, file: !553, line: 817, baseType: !426, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !552, file: !553, line: 818, baseType: !426, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !552, file: !553, line: 819, baseType: !426, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !552, file: !553, line: 821, baseType: !426, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !552, file: !553, line: 822, baseType: !426, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !552, file: !553, line: 823, baseType: !426, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !552, file: !553, line: 832, baseType: !614, offset: 976)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !552, file: !553, line: 834, baseType: !426, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !552, file: !553, line: 835, baseType: !426, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !552, file: !553, line: 836, baseType: !426, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !552, file: !553, line: 837, baseType: !426, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !552, file: !553, line: 838, baseType: !426, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !552, file: !553, line: 840, baseType: !426, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !552, file: !553, line: 843, baseType: !426, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !552, file: !553, line: 844, baseType: !426, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !552, file: !553, line: 845, baseType: !426, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !552, file: !553, line: 847, baseType: !426, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !552, file: !553, line: 848, baseType: !426, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!651 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 866, baseType: !652, size: 32, offset: 992)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 866, size: 32, elements: !653)
!653 = !{!654, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !652, file: !553, line: 867, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !656, line: 37, baseType: !445)
!656 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!657 = !DIDerivedType(tag: DW_TAG_member, scope: !652, file: !553, line: 868, baseType: !658, size: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !652, file: !553, line: 868, size: 32, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !658, file: !553, line: 869, baseType: !405, size: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !658, file: !553, line: 870, baseType: !405, size: 16, offset: 16)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !552, file: !553, line: 873, baseType: !445, size: 32, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !552, file: !553, line: 874, baseType: !32, size: 32, offset: 1056)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !552, file: !553, line: 875, baseType: !445, size: 32, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !552, file: !553, line: 876, baseType: !666, size: 16, offset: 1120)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !656, line: 30, baseType: !405)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !552, file: !553, line: 877, baseType: !405, size: 16, offset: 1136)
!668 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 879, baseType: !669, size: 32, offset: 1152)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 879, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !669, file: !553, line: 880, baseType: !7, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !669, file: !553, line: 881, baseType: !7, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 888, baseType: !674, size: 32, offset: 1184)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 888, size: 32, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !674, file: !553, line: 889, baseType: !445, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !674, file: !553, line: 890, baseType: !445, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, scope: !552, file: !553, line: 893, baseType: !679, size: 16, offset: 1216)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !553, line: 893, size: 16, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !679, file: !553, line: 894, baseType: !666, size: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !679, file: !553, line: 895, baseType: !426, size: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !552, file: !553, line: 898, baseType: !405, size: 16, offset: 1232)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !552, file: !553, line: 899, baseType: !405, size: 16, offset: 1248)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !552, file: !553, line: 900, baseType: !405, size: 16, offset: 1264)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !552, file: !553, line: 902, baseType: !666, size: 16, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !552, file: !553, line: 903, baseType: !405, size: 16, offset: 1296)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !552, file: !553, line: 904, baseType: !405, size: 16, offset: 1312)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !552, file: !553, line: 905, baseType: !405, size: 16, offset: 1328)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !552, file: !553, line: 908, baseType: !624, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !552, file: !553, line: 912, baseType: !692, size: 32, offset: 1344)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !553, line: 606, baseType: !7)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !552, file: !553, line: 913, baseType: !692, size: 32, offset: 1376)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !552, file: !553, line: 914, baseType: !695, size: 64, offset: 1408)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !552, file: !553, line: 915, baseType: !695, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !552, file: !553, line: 916, baseType: !7, size: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !552, file: !553, line: 917, baseType: !699, size: 32, offset: 1568)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !700, line: 113, baseType: !701)
!700 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !700, line: 111, size: 32, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !701, file: !700, line: 112, baseType: !383, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !534, file: !31, line: 1290, baseType: !705, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!329, !551, !290, !329}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !534, file: !31, line: 1293, baseType: !709, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !290, !551, !290}
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !332, line: 19, baseType: !405)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !534, file: !31, line: 1296, baseType: !714, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !290, !32}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !534, file: !31, line: 1298, baseType: !541, size: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !534, file: !31, line: 1299, baseType: !719, size: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!32, !290, !417}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !534, file: !31, line: 1301, baseType: !537, size: 64, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !534, file: !31, line: 1302, baseType: !724, size: 64, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!32, !290, !727, !32}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !729, line: 234, size: 320, elements: !730)
!729 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!730 = !{!731, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !728, file: !729, line: 239, baseType: !732, size: 128)
!732 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !728, file: !729, line: 236, size: 128, elements: !733)
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !732, file: !729, line: 238, baseType: !267, size: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !728, file: !729, line: 255, baseType: !736, size: 192, offset: 128)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !728, file: !729, line: 241, size: 192, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !755, !756, !757, !758}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !736, file: !729, line: 242, baseType: !457, size: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !736, file: !729, line: 243, baseType: !457, size: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !736, file: !729, line: 244, baseType: !457, size: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !736, file: !729, line: 245, baseType: !457, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !736, file: !729, line: 246, baseType: !457, size: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !736, file: !729, line: 247, baseType: !436, size: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !736, file: !729, line: 248, baseType: !32, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !736, file: !729, line: 249, baseType: !32, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !736, file: !729, line: 250, baseType: !747, size: 192)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !729, line: 196, size: 192, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !747, file: !729, line: 197, baseType: !312, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !747, file: !729, line: 198, baseType: !312, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !747, file: !729, line: 199, baseType: !406, size: 16, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !747, file: !729, line: 200, baseType: !427, size: 8, offset: 144)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !747, file: !729, line: 201, baseType: !427, size: 8, offset: 152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !747, file: !729, line: 202, baseType: !427, size: 8, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !736, file: !729, line: 251, baseType: !267, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !736, file: !729, line: 252, baseType: !267, size: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !736, file: !729, line: 253, baseType: !417, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !736, file: !729, line: 254, baseType: !759, size: 128)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !729, line: 207, size: 128, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !729, line: 208, baseType: !7, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !729, line: 209, baseType: !7, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !759, file: !729, line: 222, baseType: !764, size: 64, offset: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !759, file: !729, line: 210, size: 64, elements: !765)
!765 = !{!766, !774, !781, !793, !799, !806, !817, !825}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !764, file: !729, line: 212, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !769, line: 56, baseType: !770)
!769 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 53, size: 32, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !770, file: !769, line: 54, baseType: !406, size: 16)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !770, file: !769, line: 55, baseType: !406, size: 16, offset: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !764, file: !729, line: 213, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !769, line: 80, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 77, size: 64, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !777, file: !769, line: 78, baseType: !7, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !777, file: !769, line: 79, baseType: !7, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !764, file: !729, line: 214, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !769, line: 66, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 58, size: 192, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !784, file: !769, line: 59, baseType: !7, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !784, file: !769, line: 60, baseType: !7, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !784, file: !769, line: 61, baseType: !7, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !784, file: !769, line: 62, baseType: !7, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !784, file: !769, line: 63, baseType: !7, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !784, file: !769, line: 64, baseType: !406, size: 16, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !784, file: !769, line: 65, baseType: !406, size: 16, offset: 176)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !764, file: !729, line: 215, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !769, line: 70, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 68, size: 32, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !796, file: !769, line: 69, baseType: !7, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !764, file: !729, line: 216, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !769, line: 75, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 72, size: 160, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !802, file: !769, line: 73, baseType: !7, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !802, file: !769, line: 74, baseType: !267, size: 128, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !764, file: !729, line: 217, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !769, line: 89, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 82, size: 192, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !809, file: !769, line: 83, baseType: !406, size: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !809, file: !769, line: 84, baseType: !7, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !809, file: !769, line: 85, baseType: !7, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !809, file: !769, line: 86, baseType: !7, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !809, file: !769, line: 87, baseType: !7, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !809, file: !769, line: 88, baseType: !7, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !764, file: !729, line: 220, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !769, line: 44, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 40, size: 96, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !820, file: !769, line: 41, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !820, file: !769, line: 42, baseType: !7, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !820, file: !769, line: 43, baseType: !406, size: 16, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !764, file: !729, line: 221, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !769, line: 51, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 46, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !828, file: !769, line: 47, baseType: !7, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !828, file: !769, line: 48, baseType: !7, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !828, file: !769, line: 49, baseType: !406, size: 16, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !828, file: !769, line: 50, baseType: !7, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !534, file: !31, line: 1304, baseType: !835, size: 64, offset: 768)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!32, !290, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !534, file: !31, line: 1306, baseType: !840, size: 64, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!32, !290, !32}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !534, file: !31, line: 1308, baseType: !844, size: 64, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!32, !290, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !31, line: 206, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !534, file: !31, line: 1310, baseType: !850, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !290, !7}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !534, file: !31, line: 1313, baseType: !854, size: 64, offset: 1024)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !290, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !859, line: 214, size: 1536, elements: !860)
!859 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !858, file: !859, line: 215, baseType: !333, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !858, file: !859, line: 216, baseType: !333, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !858, file: !859, line: 217, baseType: !333, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !858, file: !859, line: 218, baseType: !333, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !858, file: !859, line: 219, baseType: !333, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !858, file: !859, line: 220, baseType: !333, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !858, file: !859, line: 221, baseType: !333, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !858, file: !859, line: 222, baseType: !333, size: 64, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !858, file: !859, line: 223, baseType: !333, size: 64, offset: 512)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !858, file: !859, line: 224, baseType: !333, size: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !858, file: !859, line: 227, baseType: !333, size: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !858, file: !859, line: 228, baseType: !333, size: 64, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !858, file: !859, line: 229, baseType: !333, size: 64, offset: 768)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !858, file: !859, line: 230, baseType: !333, size: 64, offset: 832)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !858, file: !859, line: 231, baseType: !333, size: 64, offset: 896)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !858, file: !859, line: 232, baseType: !333, size: 64, offset: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !858, file: !859, line: 235, baseType: !333, size: 64, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !858, file: !859, line: 236, baseType: !333, size: 64, offset: 1088)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !858, file: !859, line: 237, baseType: !333, size: 64, offset: 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !858, file: !859, line: 238, baseType: !333, size: 64, offset: 1216)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !858, file: !859, line: 239, baseType: !333, size: 64, offset: 1280)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !858, file: !859, line: 242, baseType: !333, size: 64, offset: 1344)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !858, file: !859, line: 243, baseType: !333, size: 64, offset: 1408)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !858, file: !859, line: 244, baseType: !333, size: 64, offset: 1472)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !534, file: !31, line: 1315, baseType: !886, size: 64, offset: 1088)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!889, !891, !32}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !277, line: 30, baseType: !890)
!890 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !534, file: !31, line: 1316, baseType: !894, size: 64, offset: 1152)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!32, !32, !891, !417}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !534, file: !31, line: 1319, baseType: !898, size: 64, offset: 1216)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!901, !290}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !534, file: !31, line: 1321, baseType: !903, size: 64, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!32, !290, !666, !712}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !534, file: !31, line: 1323, baseType: !903, size: 64, offset: 1344)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !534, file: !31, line: 1331, baseType: !908, size: 64, offset: 1408)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!32, !290, !32, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !332, line: 17, baseType: !426)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !534, file: !31, line: 1333, baseType: !914, size: 64, offset: 1472)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!32, !290, !32, !712, !912, !666}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !534, file: !31, line: 1336, baseType: !918, size: 64, offset: 1536)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!32, !290, !32, !32, !32}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !534, file: !31, line: 1339, baseType: !922, size: 64, offset: 1600)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!32, !290, !32, !889}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !534, file: !31, line: 1341, baseType: !922, size: 64, offset: 1664)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !534, file: !31, line: 1343, baseType: !927, size: 64, offset: 1728)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!32, !290, !32, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !932, line: 20, size: 576, elements: !933)
!932 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!933 = !{!934, !935, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !931, file: !932, line: 21, baseType: !445, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !931, file: !932, line: 22, baseType: !936, size: 256, offset: 32)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 256, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !931, file: !932, line: 23, baseType: !445, size: 32, offset: 288)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !931, file: !932, line: 24, baseType: !445, size: 32, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !931, file: !932, line: 25, baseType: !445, size: 32, offset: 352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !931, file: !932, line: 26, baseType: !445, size: 32, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !931, file: !932, line: 27, baseType: !445, size: 32, offset: 416)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !931, file: !932, line: 28, baseType: !445, size: 32, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !931, file: !932, line: 29, baseType: !445, size: 32, offset: 480)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !931, file: !932, line: 30, baseType: !445, size: 32, offset: 512)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !931, file: !932, line: 31, baseType: !666, size: 16, offset: 544)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !534, file: !31, line: 1346, baseType: !949, size: 64, offset: 1792)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!32, !290, !32, !32}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !534, file: !31, line: 1348, baseType: !953, size: 64, offset: 1856)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!32, !290, !32, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !932, line: 9, size: 512, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !957, file: !932, line: 10, baseType: !333, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !957, file: !932, line: 11, baseType: !333, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !957, file: !932, line: 12, baseType: !333, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !957, file: !932, line: 13, baseType: !333, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !957, file: !932, line: 14, baseType: !333, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !957, file: !932, line: 15, baseType: !333, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !957, file: !932, line: 16, baseType: !333, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !957, file: !932, line: 17, baseType: !333, size: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !534, file: !31, line: 1352, baseType: !968, size: 64, offset: 1920)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!32, !290, !32, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !974, line: 213, size: 32, elements: !975)
!974 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !973, file: !974, line: 214, baseType: !405, size: 16)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !973, file: !974, line: 215, baseType: !405, size: 16, offset: 16)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !534, file: !31, line: 1355, baseType: !979, size: 64, offset: 1984)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!32, !290, !32, !551}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !534, file: !31, line: 1357, baseType: !983, size: 64, offset: 2048)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!32, !290, !32, !986, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !859, line: 956, size: 128, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !987, file: !859, line: 957, baseType: !445, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !987, file: !859, line: 958, baseType: !333, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !534, file: !31, line: 1361, baseType: !992, size: 64, offset: 2112)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!32, !290, !32, !331, !32}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !534, file: !31, line: 1364, baseType: !922, size: 64, offset: 2176)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !534, file: !31, line: 1367, baseType: !997, size: 64, offset: 2240)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!32, !290, !37, !417}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !534, file: !31, line: 1400, baseType: !1001, size: 64, offset: 2304)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!32, !290, !290, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1006, line: 75, size: 384, elements: !1007)
!1006 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1007 = !{!1008, !1009, !1012, !1016, !1020}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1005, file: !1006, line: 76, baseType: !292, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1005, file: !1006, line: 77, baseType: !1010, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1005, file: !1006, line: 78, baseType: !1013, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1006, line: 78, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1005, file: !1006, line: 79, baseType: !1017, size: 160, offset: 192)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 160, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 20)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1005, file: !1006, line: 80, baseType: !912, size: 8, offset: 352)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !534, file: !31, line: 1403, baseType: !1022, size: 64, offset: 2368)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!32, !290, !290}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !534, file: !31, line: 1405, baseType: !1026, size: 64, offset: 2432)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!290, !290, !551, !889}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !534, file: !31, line: 1408, baseType: !1030, size: 64, offset: 2496)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!329, !290, !329}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !534, file: !31, line: 1410, baseType: !1034, size: 64, offset: 2560)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!32, !290, !329}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !534, file: !31, line: 1412, baseType: !1038, size: 64, offset: 2624)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!32, !290, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1043, line: 35, flags: DIFlagFwdDecl)
!1043 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !534, file: !31, line: 1414, baseType: !1045, size: 64, offset: 2688)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !290, !1041}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !534, file: !31, line: 1417, baseType: !1049, size: 64, offset: 2752)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!32, !1052, !971, !290, !1063, !712, !712, !1004}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1054, line: 8, size: 96, elements: !1055)
!1054 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1053, file: !1054, line: 9, baseType: !426, size: 8)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1053, file: !1054, line: 10, baseType: !426, size: 8, offset: 8)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1053, file: !1054, line: 11, baseType: !405, size: 16, offset: 16)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1053, file: !1054, line: 12, baseType: !424, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1053, file: !1054, line: 13, baseType: !405, size: 16, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1053, file: !1054, line: 14, baseType: !426, size: 8, offset: 80)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1053, file: !1054, line: 15, baseType: !426, size: 8, offset: 88)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !534, file: !31, line: 1424, baseType: !1066, size: 64, offset: 2816)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!32, !1052, !971, !290, !1063, !712}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !534, file: !31, line: 1429, baseType: !1070, size: 64, offset: 2880)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!32, !551, !1073, !290, !290, !1117}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1006, line: 203, size: 1024, elements: !1075)
!1075 = !{!1076, !1077, !1087, !1091, !1095, !1096, !1100, !1101, !1102, !1103, !1105, !1106, !1107, !1108}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1074, file: !1006, line: 204, baseType: !551, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1074, file: !1006, line: 205, baseType: !1078, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !974, line: 44, size: 128, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1080, file: !974, line: 45, baseType: !445, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1080, file: !974, line: 46, baseType: !405, size: 16, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1080, file: !974, line: 47, baseType: !405, size: 16, offset: 48)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1080, file: !974, line: 48, baseType: !445, size: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1080, file: !974, line: 49, baseType: !445, size: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1074, file: !1006, line: 206, baseType: !1088, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!32, !551, !1073}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1074, file: !1006, line: 208, baseType: !1092, size: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!32, !1073}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1074, file: !1006, line: 209, baseType: !417, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1074, file: !1006, line: 211, baseType: !1097, size: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1099, line: 76, flags: DIFlagFwdDecl)
!1099 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1074, file: !1006, line: 212, baseType: !1004, size: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1074, file: !1006, line: 213, baseType: !712, size: 16, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1074, file: !1006, line: 214, baseType: !712, size: 16, offset: 464)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1074, file: !1006, line: 215, baseType: !1104, size: 32, offset: 480)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !332, line: 21, baseType: !445)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1074, file: !1006, line: 216, baseType: !7, size: 32, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1074, file: !1006, line: 216, baseType: !7, size: 32, offset: 544)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1074, file: !1006, line: 217, baseType: !889, size: 8, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, scope: !1074, file: !1006, line: 218, baseType: !1109, size: 384, offset: 640)
!1109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1074, file: !1006, line: 218, size: 384, elements: !1110)
!1110 = !{!1111, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1109, file: !1006, line: 219, baseType: !1112, size: 384)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 384, elements: !594)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1109, file: !1006, line: 224, baseType: !1114, size: 384)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 384, elements: !1116)
!1115 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1116 = !{!520}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !534, file: !31, line: 1434, baseType: !1119, size: 64, offset: 2944)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!32, !551, !971, !290, !1063, !712, !1104, !1104, !1004}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !534, file: !31, line: 1440, baseType: !1123, size: 64, offset: 3008)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!32, !290, !1126, !712, !1004}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !534, file: !31, line: 1444, baseType: !1128, size: 64, offset: 3072)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!32, !551, !1104, !1104, !290, !1104, !32}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !534, file: !31, line: 1449, baseType: !1132, size: 64, offset: 3136)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!32, !290, !1126, !712}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !534, file: !31, line: 1452, baseType: !1136, size: 64, offset: 3200)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!32, !290, !889}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !534, file: !31, line: 1454, baseType: !1140, size: 64, offset: 3264)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!32, !290, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !31, line: 820, size: 264, elements: !1145)
!1145 = !{!1146, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1144, file: !31, line: 821, baseType: !1147, size: 256)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 256, elements: !937)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1144, file: !31, line: 822, baseType: !427, size: 8, offset: 256)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !534, file: !31, line: 1456, baseType: !1140, size: 64, offset: 3328)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !534, file: !31, line: 1458, baseType: !1151, size: 64, offset: 3392)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!32, !290, !471, !1154}
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 55, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1156, line: 72, baseType: !1157)
!1156 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1156, line: 16, baseType: !312)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !534, file: !31, line: 1460, baseType: !1159, size: 64, offset: 3456)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !290, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !31, line: 67, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !534, file: !31, line: 1462, baseType: !1159, size: 64, offset: 3520)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !534, file: !31, line: 1464, baseType: !1166, size: 64, offset: 3584)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!417, !290, !290}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !534, file: !31, line: 1466, baseType: !1170, size: 64, offset: 3648)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !290, !417}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !534, file: !31, line: 1469, baseType: !1174, size: 64, offset: 3712)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!32, !290, !32, !1104}
