; ModuleID = '../bcout/drivers/net/wireless/intersil/hostap/hostap_ioctl.llvm.bc'
source_filename = "drivers/net/wireless/intersil/hostap/hostap_ioctl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"


!196 = !DIEnumerator(name: "BPF_XDP_CPUMAP", value: 35, isUnsigned: true)
!197 = !DIEnumerator(name: "BPF_SK_LOOKUP", value: 36, isUnsigned: true)
!198 = !DIEnumerator(name: "BPF_XDP", value: 37, isUnsigned: true)
!199 = !DIEnumerator(name: "__MAX_BPF_ATTACH_TYPE", value: 38, isUnsigned: true)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_tramp_prog_type", file: !95, line: 578, baseType: !13, size: 32, elements: !201)
!201 = !{!202, !203, !204, !205, !206}
!202 = !DIEnumerator(name: "BPF_TRAMP_FENTRY", value: 0, isUnsigned: true)
!203 = !DIEnumerator(name: "BPF_TRAMP_FEXIT", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "BPF_TRAMP_MODIFY_RETURN", value: 2, isUnsigned: true)
!205 = !DIEnumerator(name: "BPF_TRAMP_MAX", value: 3, isUnsigned: true)
!206 = !DIEnumerator(name: "BPF_TRAMP_REPLACE", value: 4, isUnsigned: true)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_map_type", file: !126, line: 130, baseType: !13, size: 32, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!209 = !DIEnumerator(name: "BPF_MAP_TYPE_UNSPEC", value: 0, isUnsigned: true)
!210 = !DIEnumerator(name: "BPF_MAP_TYPE_HASH", value: 1, isUnsigned: true)
!211 = !DIEnumerator(name: "BPF_MAP_TYPE_ARRAY", value: 2, isUnsigned: true)
!212 = !DIEnumerator(name: "BPF_MAP_TYPE_PROG_ARRAY", value: 3, isUnsigned: true)
!213 = !DIEnumerator(name: "BPF_MAP_TYPE_PERF_EVENT_ARRAY", value: 4, isUnsigned: true)
!214 = !DIEnumerator(name: "BPF_MAP_TYPE_PERCPU_HASH", value: 5, isUnsigned: true)
!215 = !DIEnumerator(name: "BPF_MAP_TYPE_PERCPU_ARRAY", value: 6, isUnsigned: true)
!216 = !DIEnumerator(name: "BPF_MAP_TYPE_STACK_TRACE", value: 7, isUnsigned: true)
!217 = !DIEnumerator(name: "BPF_MAP_TYPE_CGROUP_ARRAY", value: 8, isUnsigned: true)
!218 = !DIEnumerator(name: "BPF_MAP_TYPE_LRU_HASH", value: 9, isUnsigned: true)
!219 = !DIEnumerator(name: "BPF_MAP_TYPE_LRU_PERCPU_HASH", value: 10, isUnsigned: true)
!220 = !DIEnumerator(name: "BPF_MAP_TYPE_LPM_TRIE", value: 11, isUnsigned: true)
!221 = !DIEnumerator(name: "BPF_MAP_TYPE_ARRAY_OF_MAPS", value: 12, isUnsigned: true)
!222 = !DIEnumerator(name: "BPF_MAP_TYPE_HASH_OF_MAPS", value: 13, isUnsigned: true)
!223 = !DIEnumerator(name: "BPF_MAP_TYPE_DEVMAP", value: 14, isUnsigned: true)
!224 = !DIEnumerator(name: "BPF_MAP_TYPE_SOCKMAP", value: 15, isUnsigned: true)
!225 = !DIEnumerator(name: "BPF_MAP_TYPE_CPUMAP", value: 16, isUnsigned: true)
!226 = !DIEnumerator(name: "BPF_MAP_TYPE_XSKMAP", value: 17, isUnsigned: true)
!227 = !DIEnumerator(name: "BPF_MAP_TYPE_SOCKHASH", value: 18, isUnsigned: true)
!228 = !DIEnumerator(name: "BPF_MAP_TYPE_CGROUP_STORAGE", value: 19, isUnsigned: true)
!229 = !DIEnumerator(name: "BPF_MAP_TYPE_REUSEPORT_SOCKARRAY", value: 20, isUnsigned: true)
!230 = !DIEnumerator(name: "BPF_MAP_TYPE_PERCPU_CGROUP_STORAGE", value: 21, isUnsigned: true)
!231 = !DIEnumerator(name: "BPF_MAP_TYPE_QUEUE", value: 22, isUnsigned: true)
!232 = !DIEnumerator(name: "BPF_MAP_TYPE_STACK", value: 23, isUnsigned: true)
!233 = !DIEnumerator(name: "BPF_MAP_TYPE_SK_STORAGE", value: 24, isUnsigned: true)
!234 = !DIEnumerator(name: "BPF_MAP_TYPE_DEVMAP_HASH", value: 25, isUnsigned: true)
!235 = !DIEnumerator(name: "BPF_MAP_TYPE_STRUCT_OPS", value: 26, isUnsigned: true)
!236 = !DIEnumerator(name: "BPF_MAP_TYPE_RINGBUF", value: 27, isUnsigned: true)
!237 = !DIEnumerator(name: "BPF_MAP_TYPE_INODE_STORAGE", value: 28, isUnsigned: true)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !239, line: 26, baseType: !13, size: 32, elements: !240)
!239 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!240 = !{!241, !242, !243}
!241 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!242 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!243 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !6, line: 423, baseType: !13, size: 32, elements: !245)
!245 = !{!246, !247, !248, !249}
!246 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!247 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!248 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!249 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !251, file: !6, line: 2085, baseType: !13, size: 32, elements: !7145)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !6, line: 1858, size: 15808, elements: !252)
!252 = !{!253, !258, !281, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !315, !323, !324, !325, !326, !327, !328, !329, !330, !331, !357, !367, !368, !369, !374, !375, !493, !518, !5586, !6151, !6155, !6195, !6196, !6197, !6198, !6199, !6200, !6201, !6202, !6203, !6204, !6205, !6206, !6207, !6208, !6209, !6210, !6211, !6212, !6213, !6214, !6215, !6216, !6217, !6218, !6219, !6220, !6221, !6226, !6227, !6228, !6504, !6505, !6506, !6507, !6510, !6513, !6516, !6519, !6522, !6523, !6536, !6537, !6538, !6539, !6540, !6541, !6548, !6549, !6583, !6584, !6585, !6586, !6587, !6588, !6589, !6590, !6591, !6594, !6595, !6596, !6597, !6598, !6599, !6600, !6601, !6602, !6607, !6608, !6609, !6614, !6651, !7100, !7102, !7103, !7107, !7108, !7109, !7110, !7116, !7118, !7121, !7124, !7126, !7127, !7128, !7129, !7130, !7134, !7137}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !6, line: 1859, baseType: !254, size: 128)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 128, elements: !256)
!255 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!256 = !{!257}
!257 = !DISubrange(count: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !251, file: !6, line: 1860, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !6, line: 938, size: 384, elements: !261)
!261 = !{!262, !270, !276, !278}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !260, file: !6, line: 939, baseType: !263, size: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !264, line: 186, size: 128, elements: !265)
!264 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!265 = !{!266, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !264, line: 187, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !263, file: !264, line: 187, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !260, file: !6, line: 940, baseType: !271, size: 128, offset: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !264, line: 178, size: 128, elements: !272)
!272 = !{!273, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !264, line: 179, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !264, line: 179, baseType: !274, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !260, file: !6, line: 941, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !6, line: 942, baseType: !279, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !251, file: !6, line: 1861, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !6, line: 930, size: 128, elements: !284)
!284 = !{!285, !294}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !283, file: !6, line: 931, baseType: !286, size: 128, align: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !264, line: 216, size: 128, align: 64, elements: !287)
!287 = !{!288, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !264, line: 217, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !286, file: !264, line: 218, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !289}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !283, file: !6, line: 932, baseType: !295, offset: 128)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: -1)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !251, file: !6, line: 1866, baseType: !299, size: 64, offset: 256)
!299 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !251, file: !6, line: 1867, baseType: !299, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !251, file: !6, line: 1868, baseType: !299, size: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !251, file: !6, line: 1869, baseType: !7, size: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !251, file: !6, line: 1877, baseType: !299, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !251, file: !6, line: 1879, baseType: !271, size: 128, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !251, file: !6, line: 1880, baseType: !271, size: 128, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !251, file: !6, line: 1881, baseType: !271, size: 128, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !251, file: !6, line: 1882, baseType: !271, size: 128, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !251, file: !6, line: 1883, baseType: !271, size: 128, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !251, file: !6, line: 1884, baseType: !271, size: 128, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !251, file: !6, line: 1889, baseType: !311, size: 256, offset: 1344)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !6, line: 1886, size: 256, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !311, file: !6, line: 1887, baseType: !271, size: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !311, file: !6, line: 1888, baseType: !271, size: 128, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !251, file: !6, line: 1891, baseType: !316, size: 64, offset: 1600)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !317, line: 12, baseType: !318)
!317 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !319, line: 23, baseType: !320)
!319 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !321, line: 31, baseType: !322)
!321 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!322 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !251, file: !6, line: 1892, baseType: !316, size: 64, offset: 1664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !251, file: !6, line: 1893, baseType: !316, size: 64, offset: 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !251, file: !6, line: 1894, baseType: !316, size: 64, offset: 1792)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !251, file: !6, line: 1895, baseType: !316, size: 64, offset: 1856)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !251, file: !6, line: 1896, baseType: !316, size: 64, offset: 1920)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !251, file: !6, line: 1897, baseType: !316, size: 64, offset: 1984)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !251, file: !6, line: 1899, baseType: !7, size: 32, offset: 2048)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !251, file: !6, line: 1900, baseType: !7, size: 32, offset: 2080)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !251, file: !6, line: 1902, baseType: !332, size: 1472, offset: 2112)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !6, line: 169, size: 1472, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !332, file: !6, line: 170, baseType: !299, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !332, file: !6, line: 171, baseType: !299, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !332, file: !6, line: 172, baseType: !299, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !332, file: !6, line: 173, baseType: !299, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !332, file: !6, line: 174, baseType: !299, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !332, file: !6, line: 175, baseType: !299, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !332, file: !6, line: 176, baseType: !299, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !332, file: !6, line: 177, baseType: !299, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !332, file: !6, line: 178, baseType: !299, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !332, file: !6, line: 179, baseType: !299, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !332, file: !6, line: 180, baseType: !299, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !332, file: !6, line: 181, baseType: !299, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !332, file: !6, line: 182, baseType: !299, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !332, file: !6, line: 183, baseType: !299, size: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !332, file: !6, line: 184, baseType: !299, size: 64, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !332, file: !6, line: 185, baseType: !299, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !332, file: !6, line: 186, baseType: !299, size: 64, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !332, file: !6, line: 187, baseType: !299, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !332, file: !6, line: 188, baseType: !299, size: 64, offset: 1152)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !332, file: !6, line: 189, baseType: !299, size: 64, offset: 1216)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !332, file: !6, line: 190, baseType: !299, size: 64, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !332, file: !6, line: 191, baseType: !299, size: 64, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !332, file: !6, line: 192, baseType: !299, size: 64, offset: 1408)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !251, file: !6, line: 1904, baseType: !358, size: 64, offset: 3584)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !359, line: 13, baseType: !360)
!359 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !264, line: 175, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 173, size: 64, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !361, file: !264, line: 174, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !319, line: 22, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !321, line: 30, baseType: !366)
!366 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !251, file: !6, line: 1905, baseType: !358, size: 64, offset: 3648)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !251, file: !6, line: 1906, baseType: !358, size: 64, offset: 3712)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !251, file: !6, line: 1909, baseType: !370, size: 32, offset: 3776)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !264, line: 168, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 166, size: 32, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !371, file: !264, line: 167, baseType: !7, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !251, file: !6, line: 1910, baseType: !370, size: 32, offset: 3808)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !251, file: !6, line: 1913, baseType: !376, size: 64, offset: 3840)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !379, line: 324, size: 320, elements: !380)
!379 = !DIFile(filename: "./include/net/iw_handler.h", directory: "/home/lizy2001/genbc/linux")
!380 = !{!381, !459, !460, !461, !462, !463, !472}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "standard", scope: !378, file: !379, line: 329, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "iw_handler", file: !379, line: 315, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!7, !277, !388, !395, !458}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_request_info", file: !379, line: 304, size: 32, elements: !390)
!390 = !{!391, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !389, file: !379, line: 305, baseType: !392, size: 16)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !321, line: 24, baseType: !393)
!393 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !389, file: !379, line: 306, baseType: !392, size: 16, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "iwreq_data", file: !397, line: 902, size: 128, elements: !398)
!397 = !DIFile(filename: "./include/uapi/linux/wireless.h", directory: "/home/lizy2001/genbc/linux")
!398 = !{!399, !400, !407, !417, !426, !427, !428, !429, !430, !431, !433, !434, !435, !436, !443, !455, !456, !457}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !396, file: !397, line: 904, baseType: !254, size: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "essid", scope: !396, file: !397, line: 908, baseType: !401, size: 128)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_point", file: !397, line: 691, size: 128, elements: !402)
!402 = !{!403, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !401, file: !397, line: 692, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !401, file: !397, line: 693, baseType: !392, size: 16, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !397, line: 694, baseType: !392, size: 16, offset: 80)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nwid", scope: !396, file: !397, line: 909, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_param", file: !397, line: 680, size: 64, elements: !409)
!409 = !{!410, !412, !415, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !408, file: !397, line: 681, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !321, line: 26, baseType: !7)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !408, file: !397, line: 682, baseType: !413, size: 8, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !321, line: 21, baseType: !414)
!414 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !408, file: !397, line: 683, baseType: !413, size: 8, offset: 40)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !397, line: 684, baseType: !392, size: 16, offset: 48)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !396, file: !397, line: 910, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_freq", file: !397, line: 706, size: 64, elements: !419)
!419 = !{!420, !421, !424, !425}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !418, file: !397, line: 707, baseType: !411, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !418, file: !397, line: 708, baseType: !422, size: 16, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !321, line: 23, baseType: !423)
!423 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !418, file: !397, line: 709, baseType: !413, size: 8, offset: 48)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !418, file: !397, line: 710, baseType: !413, size: 8, offset: 56)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sens", scope: !396, file: !397, line: 914, baseType: !408, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bitrate", scope: !396, file: !397, line: 915, baseType: !408, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "txpower", scope: !396, file: !397, line: 916, baseType: !408, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rts", scope: !396, file: !397, line: 917, baseType: !408, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !396, file: !397, line: 918, baseType: !408, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !396, file: !397, line: 919, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !321, line: 27, baseType: !13)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !396, file: !397, line: 920, baseType: !408, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !396, file: !397, line: 922, baseType: !401, size: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !396, file: !397, line: 923, baseType: !408, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !396, file: !397, line: 924, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_quality", file: !397, line: 716, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !437, file: !397, line: 717, baseType: !413, size: 8)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !437, file: !397, line: 719, baseType: !413, size: 8, offset: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !437, file: !397, line: 720, baseType: !413, size: 8, offset: 16)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !437, file: !397, line: 721, baseType: !413, size: 8, offset: 24)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ap_addr", scope: !396, file: !397, line: 926, baseType: !444, size: 128)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !445, line: 32, size: 128, elements: !446)
!445 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!446 = !{!447, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !444, file: !445, line: 33, baseType: !448, size: 16)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !445, line: 26, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !450, line: 10, baseType: !393)
!450 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !444, file: !445, line: 34, baseType: !452, size: 112, offset: 16)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 112, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 14)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !396, file: !397, line: 927, baseType: !444, size: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !396, file: !397, line: 929, baseType: !408, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !397, line: 930, baseType: !401, size: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "num_standard", scope: !378, file: !379, line: 332, baseType: !392, size: 16, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "num_private", scope: !378, file: !379, line: 335, baseType: !392, size: 16, offset: 80)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_private_args", scope: !378, file: !379, line: 337, baseType: !392, size: 16, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !378, file: !379, line: 341, baseType: !382, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "private_args", scope: !378, file: !379, line: 346, baseType: !464, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_priv_args", file: !397, line: 1063, size: 192, elements: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !466, file: !397, line: 1064, baseType: !432, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "set_args", scope: !466, file: !397, line: 1065, baseType: !392, size: 16, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "get_args", scope: !466, file: !397, line: 1066, baseType: !392, size: 16, offset: 48)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !466, file: !397, line: 1067, baseType: !254, size: 128, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "get_wireless_stats", scope: !378, file: !379, line: 352, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !277}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_statistics", file: !397, line: 881, size: 256, elements: !478)
!478 = !{!479, !480, !481, !489}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !477, file: !397, line: 882, baseType: !392, size: 16)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "qual", scope: !477, file: !397, line: 885, baseType: !437, size: 32, offset: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "discard", scope: !477, file: !397, line: 887, baseType: !482, size: 160, offset: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_discarded", file: !397, line: 731, size: 160, elements: !483)
!483 = !{!484, !485, !486, !487, !488}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nwid", scope: !482, file: !397, line: 732, baseType: !432, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !482, file: !397, line: 733, baseType: !432, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !482, file: !397, line: 734, baseType: !432, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !482, file: !397, line: 735, baseType: !432, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !482, file: !397, line: 736, baseType: !432, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !477, file: !397, line: 888, baseType: !490, size: 32, offset: 224)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_missed", file: !397, line: 743, size: 32, elements: !491)
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "beacon", scope: !490, file: !397, line: 744, baseType: !432, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !251, file: !6, line: 1914, baseType: !494, size: 64, offset: 3904)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !379, line: 420, size: 128, elements: !496)
!496 = !{!497, !515}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "spy_data", scope: !495, file: !379, line: 422, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iw_spy_data", file: !379, line: 396, size: 800, elements: !500)
!500 = !{!501, !502, !508, !511, !512, !513}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "spy_number", scope: !499, file: !379, line: 398, baseType: !7, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "spy_address", scope: !499, file: !379, line: 399, baseType: !503, size: 384, offset: 32)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 384, elements: !505)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !264, line: 79, baseType: !414)
!505 = !{!506, !507}
!506 = !DISubrange(count: 8)
!507 = !DISubrange(count: 6)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "spy_stat", scope: !499, file: !379, line: 400, baseType: !509, size: 256, offset: 416)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 256, elements: !510)
!510 = !{!506}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "spy_thr_low", scope: !499, file: !379, line: 402, baseType: !437, size: 32, offset: 672)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "spy_thr_high", scope: !499, file: !379, line: 403, baseType: !437, size: 32, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "spy_thr_under", scope: !499, file: !379, line: 404, baseType: !514, size: 64, offset: 736)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 64, elements: !510)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "libipw", scope: !495, file: !379, line: 424, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "libipw_device", file: !379, line: 418, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !251, file: !6, line: 1916, baseType: !519, size: 64, offset: 3968)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !6, line: 1283, size: 4416, elements: !522)
!522 = !{!523, !527, !531, !532, !533, !691, !695, !700, !704, !705, !709, !710, !821, !826, !830, !836, !840, !872, !880, !884, !889, !893, !894, !900, !904, !908, !912, !913, !935, !939, !954, !965, !969, !978, !982, !983, !987, !1008, !1012, !1016, !1020, !1024, !1031, !1035, !1052, !1056, !1105, !1109, !1114, !1118, !1122, !1126, !1136, !1137, !1145, !1151, !1152, !1156, !1160, !1164, !1168, !1169, !1173, !1174, !5546, !5566, !5570, !5576, !5582}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !521, file: !6, line: 1284, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!7, !277}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !521, file: !6, line: 1285, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !277}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !521, file: !6, line: 1286, baseType: !524, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !521, file: !6, line: 1287, baseType: !524, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !521, file: !6, line: 1288, baseType: !534, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !538, !277}
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !6, line: 120, baseType: !5)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !540, line: 713, size: 1600, elements: !541)
!540 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!541 = !{!542, !564, !572, !579, !583, !595, !596, !597, !598, !599, !600, !604, !605, !606, !607, !608, !609, !610, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !649, !650, !651, !652, !654, !655, !660, !665, !670, !671, !672, !673, !674, !675, !676, !677, !678, !680, !681, !683, !684, !685}
!542 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 714, baseType: !543, size: 192)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 714, size: 192, elements: !544)
!544 = !{!545, !555, !563}
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !543, file: !540, line: 715, baseType: !546, size: 192)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !543, file: !540, line: 715, size: 192, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !540, line: 717, baseType: !538, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !546, file: !540, line: 718, baseType: !538, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !546, file: !540, line: 720, baseType: !551, size: 64, offset: 128)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !546, file: !540, line: 720, size: 64, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !551, file: !540, line: 721, baseType: !277, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !551, file: !540, line: 726, baseType: !299, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !543, file: !540, line: 729, baseType: !556, size: 192, align: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !557, line: 24, size: 192, align: 64, elements: !558)
!557 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!558 = !{!559, !560, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !556, file: !557, line: 25, baseType: !299, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !556, file: !557, line: 26, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !556, file: !557, line: 27, baseType: !561, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !543, file: !540, line: 730, baseType: !271, size: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 733, baseType: !565, size: 64, offset: 192)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 733, size: 64, elements: !566)
!566 = !{!567, !571}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !565, file: !540, line: 734, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !570, line: 124, flags: DIFlagFwdDecl)
!570 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !565, file: !540, line: 735, baseType: !7, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 738, baseType: !573, size: 64, offset: 256)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 738, size: 64, elements: !574)
!574 = !{!575, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !573, file: !540, line: 739, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !577, line: 29, baseType: !364)
!577 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!578 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !573, file: !540, line: 740, baseType: !318, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !539, file: !540, line: 748, baseType: !580, size: 384, align: 64, offset: 320)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 384, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 48)
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 750, baseType: !584, size: 128, offset: 704)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 750, size: 128, elements: !585)
!585 = !{!586, !594}
!586 = !DIDerivedType(tag: DW_TAG_member, scope: !584, file: !540, line: 751, baseType: !587, size: 128)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !540, line: 751, size: 128, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !587, file: !540, line: 752, baseType: !299, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !587, file: !540, line: 753, baseType: !591, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !538}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !584, file: !540, line: 755, baseType: !271, size: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !539, file: !540, line: 761, baseType: !13, size: 32, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !539, file: !540, line: 762, baseType: !13, size: 32, offset: 864)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !539, file: !540, line: 763, baseType: !392, size: 16, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !539, file: !540, line: 764, baseType: !392, size: 16, offset: 912)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !539, file: !540, line: 769, baseType: !392, size: 16, offset: 928)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !539, file: !540, line: 780, baseType: !601, offset: 944)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !539, file: !540, line: 782, baseType: !413, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !539, file: !540, line: 783, baseType: !413, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !539, file: !540, line: 784, baseType: !413, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !539, file: !540, line: 785, baseType: !413, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !539, file: !540, line: 786, baseType: !413, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !539, file: !540, line: 787, baseType: !413, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !539, file: !540, line: 795, baseType: !611, offset: 960)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, elements: !602)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !539, file: !540, line: 807, baseType: !601, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !539, file: !540, line: 809, baseType: !413, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !539, file: !540, line: 810, baseType: !413, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !539, file: !540, line: 811, baseType: !413, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !539, file: !540, line: 812, baseType: !413, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !539, file: !540, line: 813, baseType: !413, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !539, file: !540, line: 815, baseType: !413, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !539, file: !540, line: 816, baseType: !413, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !539, file: !540, line: 817, baseType: !413, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !539, file: !540, line: 818, baseType: !413, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !539, file: !540, line: 819, baseType: !413, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !539, file: !540, line: 821, baseType: !413, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !539, file: !540, line: 822, baseType: !413, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !539, file: !540, line: 823, baseType: !413, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !539, file: !540, line: 832, baseType: !601, offset: 976)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !539, file: !540, line: 834, baseType: !413, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !539, file: !540, line: 835, baseType: !413, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !539, file: !540, line: 836, baseType: !413, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !539, file: !540, line: 837, baseType: !413, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !539, file: !540, line: 838, baseType: !413, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !539, file: !540, line: 840, baseType: !413, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !539, file: !540, line: 843, baseType: !413, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !539, file: !540, line: 844, baseType: !413, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !539, file: !540, line: 845, baseType: !413, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !539, file: !540, line: 847, baseType: !413, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !539, file: !540, line: 848, baseType: !413, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!638 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 866, baseType: !639, size: 32, offset: 992)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 866, size: 32, elements: !640)
!640 = !{!641, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !639, file: !540, line: 867, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !643, line: 37, baseType: !432)
!643 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!644 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !540, line: 868, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !639, file: !540, line: 868, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !645, file: !540, line: 869, baseType: !392, size: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !645, file: !540, line: 870, baseType: !392, size: 16, offset: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !539, file: !540, line: 873, baseType: !432, size: 32, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !539, file: !540, line: 874, baseType: !7, size: 32, offset: 1056)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !539, file: !540, line: 875, baseType: !432, size: 32, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !539, file: !540, line: 876, baseType: !653, size: 16, offset: 1120)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !643, line: 30, baseType: !392)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !539, file: !540, line: 877, baseType: !392, size: 16, offset: 1136)
!655 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 879, baseType: !656, size: 32, offset: 1152)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 879, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !656, file: !540, line: 880, baseType: !13, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !656, file: !540, line: 881, baseType: !13, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 888, baseType: !661, size: 32, offset: 1184)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 888, size: 32, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !661, file: !540, line: 889, baseType: !432, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !661, file: !540, line: 890, baseType: !432, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, scope: !539, file: !540, line: 893, baseType: !666, size: 16, offset: 1216)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !539, file: !540, line: 893, size: 16, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !666, file: !540, line: 894, baseType: !653, size: 16)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !666, file: !540, line: 895, baseType: !413, size: 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !539, file: !540, line: 898, baseType: !392, size: 16, offset: 1232)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !539, file: !540, line: 899, baseType: !392, size: 16, offset: 1248)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !539, file: !540, line: 900, baseType: !392, size: 16, offset: 1264)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !539, file: !540, line: 902, baseType: !653, size: 16, offset: 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !539, file: !540, line: 903, baseType: !392, size: 16, offset: 1296)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !539, file: !540, line: 904, baseType: !392, size: 16, offset: 1312)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !539, file: !540, line: 905, baseType: !392, size: 16, offset: 1328)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !539, file: !540, line: 908, baseType: !611, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !539, file: !540, line: 912, baseType: !679, size: 32, offset: 1344)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !540, line: 606, baseType: !13)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !539, file: !540, line: 913, baseType: !679, size: 32, offset: 1376)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !539, file: !540, line: 914, baseType: !682, size: 64, offset: 1408)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !540, line: 915, baseType: !682, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !539, file: !540, line: 916, baseType: !13, size: 32, offset: 1536)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !539, file: !540, line: 917, baseType: !686, size: 32, offset: 1568)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !687, line: 113, baseType: !688)
!687 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !687, line: 111, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !688, file: !687, line: 112, baseType: !370, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !521, file: !6, line: 1290, baseType: !692, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!316, !538, !277, !316}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !521, file: !6, line: 1293, baseType: !696, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!699, !277, !538, !277}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !319, line: 19, baseType: !392)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !521, file: !6, line: 1296, baseType: !701, size: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !277, !7}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !521, file: !6, line: 1298, baseType: !528, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !521, file: !6, line: 1299, baseType: !706, size: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!7, !277, !404}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !521, file: !6, line: 1301, baseType: !524, size: 64, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !521, file: !6, line: 1302, baseType: !711, size: 64, offset: 704)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!7, !277, !714, !7}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !716, line: 234, size: 320, elements: !717)
!716 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!717 = !{!718, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !715, file: !716, line: 239, baseType: !719, size: 128)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !716, line: 236, size: 128, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !719, file: !716, line: 238, baseType: !254, size: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !715, file: !716, line: 255, baseType: !723, size: 192, offset: 128)
!723 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !716, line: 241, size: 192, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !742, !743, !744, !745}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !723, file: !716, line: 242, baseType: !444, size: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !723, file: !716, line: 243, baseType: !444, size: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !723, file: !716, line: 244, baseType: !444, size: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !723, file: !716, line: 245, baseType: !444, size: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !723, file: !716, line: 246, baseType: !444, size: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !723, file: !716, line: 247, baseType: !423, size: 16)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !723, file: !716, line: 248, baseType: !7, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !723, file: !716, line: 249, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !723, file: !716, line: 250, baseType: !734, size: 192)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !716, line: 196, size: 192, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !734, file: !716, line: 197, baseType: !299, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !734, file: !716, line: 198, baseType: !299, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !734, file: !716, line: 199, baseType: !393, size: 16, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !734, file: !716, line: 200, baseType: !414, size: 8, offset: 144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !734, file: !716, line: 201, baseType: !414, size: 8, offset: 152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !734, file: !716, line: 202, baseType: !414, size: 8, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !723, file: !716, line: 251, baseType: !254, size: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !723, file: !716, line: 252, baseType: !254, size: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !723, file: !716, line: 253, baseType: !404, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !723, file: !716, line: 254, baseType: !746, size: 128)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !716, line: 207, size: 128, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !716, line: 208, baseType: !13, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !746, file: !716, line: 209, baseType: !13, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !746, file: !716, line: 222, baseType: !751, size: 64, offset: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !746, file: !716, line: 210, size: 64, elements: !752)
!752 = !{!753, !761, !768, !780, !786, !793, !804, !812}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !751, file: !716, line: 212, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !756, line: 56, baseType: !757)
!756 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 53, size: 32, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !757, file: !756, line: 54, baseType: !393, size: 16)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !757, file: !756, line: 55, baseType: !393, size: 16, offset: 16)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !751, file: !716, line: 213, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !756, line: 80, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 77, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !764, file: !756, line: 78, baseType: !13, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !764, file: !756, line: 79, baseType: !13, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !751, file: !716, line: 214, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !756, line: 66, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 58, size: 192, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !771, file: !756, line: 59, baseType: !13, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !771, file: !756, line: 60, baseType: !13, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !771, file: !756, line: 61, baseType: !13, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !771, file: !756, line: 62, baseType: !13, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !771, file: !756, line: 63, baseType: !13, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !771, file: !756, line: 64, baseType: !393, size: 16, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !771, file: !756, line: 65, baseType: !393, size: 16, offset: 176)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !751, file: !716, line: 215, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !756, line: 70, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 68, size: 32, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !783, file: !756, line: 69, baseType: !13, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !751, file: !716, line: 216, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !756, line: 75, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 72, size: 160, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !789, file: !756, line: 73, baseType: !13, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !789, file: !756, line: 74, baseType: !254, size: 128, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !751, file: !716, line: 217, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !756, line: 89, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 82, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !796, file: !756, line: 83, baseType: !393, size: 16)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !796, file: !756, line: 84, baseType: !13, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !796, file: !756, line: 85, baseType: !13, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !796, file: !756, line: 86, baseType: !13, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !796, file: !756, line: 87, baseType: !13, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !796, file: !756, line: 88, baseType: !13, size: 32, offset: 160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !751, file: !716, line: 220, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !756, line: 44, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 40, size: 96, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !807, file: !756, line: 41, baseType: !13, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !807, file: !756, line: 42, baseType: !13, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !807, file: !756, line: 43, baseType: !393, size: 16, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !751, file: !716, line: 221, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !756, line: 51, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !756, line: 46, size: 128, elements: !816)
!816 = !{!817, !818, !819, !820}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !815, file: !756, line: 47, baseType: !13, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !815, file: !756, line: 48, baseType: !13, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !815, file: !756, line: 49, baseType: !393, size: 16, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !815, file: !756, line: 50, baseType: !13, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !521, file: !6, line: 1304, baseType: !822, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!7, !277, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !521, file: !6, line: 1306, baseType: !827, size: 64, offset: 832)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!7, !277, !7}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !521, file: !6, line: 1308, baseType: !831, size: 64, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!7, !277, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !6, line: 206, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !521, file: !6, line: 1310, baseType: !837, size: 64, offset: 960)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !277, !13}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !521, file: !6, line: 1313, baseType: !841, size: 64, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !277, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !846, line: 214, size: 1536, elements: !847)
!846 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !845, file: !846, line: 215, baseType: !320, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !845, file: !846, line: 216, baseType: !320, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !845, file: !846, line: 217, baseType: !320, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !845, file: !846, line: 218, baseType: !320, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !845, file: !846, line: 219, baseType: !320, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !845, file: !846, line: 220, baseType: !320, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !845, file: !846, line: 221, baseType: !320, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !845, file: !846, line: 222, baseType: !320, size: 64, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !845, file: !846, line: 223, baseType: !320, size: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !845, file: !846, line: 224, baseType: !320, size: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !845, file: !846, line: 227, baseType: !320, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !845, file: !846, line: 228, baseType: !320, size: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !845, file: !846, line: 229, baseType: !320, size: 64, offset: 768)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !845, file: !846, line: 230, baseType: !320, size: 64, offset: 832)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !845, file: !846, line: 231, baseType: !320, size: 64, offset: 896)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !845, file: !846, line: 232, baseType: !320, size: 64, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !845, file: !846, line: 235, baseType: !320, size: 64, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !845, file: !846, line: 236, baseType: !320, size: 64, offset: 1088)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !845, file: !846, line: 237, baseType: !320, size: 64, offset: 1152)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !845, file: !846, line: 238, baseType: !320, size: 64, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !845, file: !846, line: 239, baseType: !320, size: 64, offset: 1280)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !845, file: !846, line: 242, baseType: !320, size: 64, offset: 1344)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !845, file: !846, line: 243, baseType: !320, size: 64, offset: 1408)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !845, file: !846, line: 244, baseType: !320, size: 64, offset: 1472)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !521, file: !6, line: 1315, baseType: !873, size: 64, offset: 1088)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !878, !7}
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !264, line: 30, baseType: !877)
!877 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !521, file: !6, line: 1316, baseType: !881, size: 64, offset: 1152)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!7, !7, !878, !404}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !521, file: !6, line: 1319, baseType: !885, size: 64, offset: 1216)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!888, !277}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !521, file: !6, line: 1321, baseType: !890, size: 64, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!7, !277, !653, !699}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !521, file: !6, line: 1323, baseType: !890, size: 64, offset: 1344)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !521, file: !6, line: 1331, baseType: !895, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!7, !277, !7, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !319, line: 17, baseType: !413)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !521, file: !6, line: 1333, baseType: !901, size: 64, offset: 1472)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!7, !277, !7, !699, !899, !653}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !521, file: !6, line: 1336, baseType: !905, size: 64, offset: 1536)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!7, !277, !7, !7, !7}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !521, file: !6, line: 1339, baseType: !909, size: 64, offset: 1600)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!7, !277, !7, !876}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !521, file: !6, line: 1341, baseType: !909, size: 64, offset: 1664)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !521, file: !6, line: 1343, baseType: !914, size: 64, offset: 1728)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!7, !277, !7, !917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !919, line: 20, size: 576, elements: !920)
!919 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!920 = !{!921, !922, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !918, file: !919, line: 21, baseType: !432, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !918, file: !919, line: 22, baseType: !923, size: 256, offset: 32)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 256, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !918, file: !919, line: 23, baseType: !432, size: 32, offset: 288)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !918, file: !919, line: 24, baseType: !432, size: 32, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !918, file: !919, line: 25, baseType: !432, size: 32, offset: 352)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !918, file: !919, line: 26, baseType: !432, size: 32, offset: 384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !918, file: !919, line: 27, baseType: !432, size: 32, offset: 416)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !918, file: !919, line: 28, baseType: !432, size: 32, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !918, file: !919, line: 29, baseType: !432, size: 32, offset: 480)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !918, file: !919, line: 30, baseType: !432, size: 32, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !918, file: !919, line: 31, baseType: !653, size: 16, offset: 544)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !521, file: !6, line: 1346, baseType: !936, size: 64, offset: 1792)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!7, !277, !7, !7}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !521, file: !6, line: 1348, baseType: !940, size: 64, offset: 1856)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!7, !277, !7, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !919, line: 9, size: 512, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !944, file: !919, line: 10, baseType: !320, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !944, file: !919, line: 11, baseType: !320, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !944, file: !919, line: 12, baseType: !320, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !944, file: !919, line: 13, baseType: !320, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !944, file: !919, line: 14, baseType: !320, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !944, file: !919, line: 15, baseType: !320, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !944, file: !919, line: 16, baseType: !320, size: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !944, file: !919, line: 17, baseType: !320, size: 64, offset: 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !521, file: !6, line: 1352, baseType: !955, size: 64, offset: 1920)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!7, !277, !7, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !961, line: 213, size: 32, elements: !962)
!961 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !960, file: !961, line: 214, baseType: !392, size: 16)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !960, file: !961, line: 215, baseType: !392, size: 16, offset: 16)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !521, file: !6, line: 1355, baseType: !966, size: 64, offset: 1984)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!7, !277, !7, !538}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !521, file: !6, line: 1357, baseType: !970, size: 64, offset: 2048)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!7, !277, !7, !973, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !846, line: 956, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !974, file: !846, line: 957, baseType: !432, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !974, file: !846, line: 958, baseType: !320, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !521, file: !6, line: 1361, baseType: !979, size: 64, offset: 2112)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!7, !277, !7, !318, !7}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !521, file: !6, line: 1364, baseType: !909, size: 64, offset: 2176)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !521, file: !6, line: 1367, baseType: !984, size: 64, offset: 2240)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!7, !277, !12, !404}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !521, file: !6, line: 1400, baseType: !988, size: 64, offset: 2304)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!7, !277, !277, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !993, line: 75, size: 384, elements: !994)
!993 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!994 = !{!995, !996, !999, !1003, !1007}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !992, file: !993, line: 76, baseType: !279, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !992, file: !993, line: 77, baseType: !997, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !992, file: !993, line: 78, baseType: !1000, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !993, line: 78, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !992, file: !993, line: 79, baseType: !1004, size: 160, offset: 192)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 160, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 20)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !992, file: !993, line: 80, baseType: !899, size: 8, offset: 352)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !521, file: !6, line: 1403, baseType: !1009, size: 64, offset: 2368)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!7, !277, !277}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !521, file: !6, line: 1405, baseType: !1013, size: 64, offset: 2432)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!277, !277, !538, !876}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !521, file: !6, line: 1408, baseType: !1017, size: 64, offset: 2496)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!316, !277, !316}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !521, file: !6, line: 1410, baseType: !1021, size: 64, offset: 2560)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!7, !277, !316}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !521, file: !6, line: 1412, baseType: !1025, size: 64, offset: 2624)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!7, !277, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1030, line: 35, flags: DIFlagFwdDecl)
!1030 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !521, file: !6, line: 1414, baseType: !1032, size: 64, offset: 2688)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !277, !1028}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !521, file: !6, line: 1417, baseType: !1036, size: 64, offset: 2752)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!7, !1039, !958, !277, !1050, !699, !699, !991}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1041, line: 8, size: 96, elements: !1042)
!1041 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1040, file: !1041, line: 9, baseType: !413, size: 8)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1040, file: !1041, line: 10, baseType: !413, size: 8, offset: 8)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1040, file: !1041, line: 11, baseType: !392, size: 16, offset: 16)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1040, file: !1041, line: 12, baseType: !411, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1040, file: !1041, line: 13, baseType: !392, size: 16, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1040, file: !1041, line: 14, baseType: !413, size: 8, offset: 80)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1040, file: !1041, line: 15, baseType: !413, size: 8, offset: 88)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !521, file: !6, line: 1424, baseType: !1053, size: 64, offset: 2816)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!7, !1039, !958, !277, !1050, !699}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !521, file: !6, line: 1429, baseType: !1057, size: 64, offset: 2880)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!7, !538, !1060, !277, !277, !1104}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !993, line: 203, size: 1024, elements: !1062)
!1062 = !{!1063, !1064, !1074, !1078, !1082, !1083, !1087, !1088, !1089, !1090, !1092, !1093, !1094, !1095}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1061, file: !993, line: 204, baseType: !538, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1061, file: !993, line: 205, baseType: !1065, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !961, line: 44, size: 128, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1067, file: !961, line: 45, baseType: !432, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1067, file: !961, line: 46, baseType: !392, size: 16, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1067, file: !961, line: 47, baseType: !392, size: 16, offset: 48)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1067, file: !961, line: 48, baseType: !432, size: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1067, file: !961, line: 49, baseType: !432, size: 32, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1061, file: !993, line: 206, baseType: !1075, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!7, !538, !1060}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1061, file: !993, line: 208, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!7, !1060}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !993, line: 209, baseType: !404, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1061, file: !993, line: 211, baseType: !1084, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1086, line: 76, flags: DIFlagFwdDecl)
!1086 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1061, file: !993, line: 212, baseType: !991, size: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1061, file: !993, line: 213, baseType: !699, size: 16, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1061, file: !993, line: 214, baseType: !699, size: 16, offset: 464)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1061, file: !993, line: 215, baseType: !1091, size: 32, offset: 480)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !319, line: 21, baseType: !432)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1061, file: !993, line: 216, baseType: !13, size: 32, offset: 512)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1061, file: !993, line: 216, baseType: !13, size: 32, offset: 544)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1061, file: !993, line: 217, baseType: !876, size: 8, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, scope: !1061, file: !993, line: 218, baseType: !1096, size: 384, offset: 640)
!1096 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1061, file: !993, line: 218, size: 384, elements: !1097)
!1097 = !{!1098, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1096, file: !993, line: 219, baseType: !1099, size: 384)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 384, elements: !581)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1096, file: !993, line: 224, baseType: !1101, size: 384)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 384, elements: !1103)
!1102 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1103 = !{!507}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !521, file: !6, line: 1434, baseType: !1106, size: 64, offset: 2944)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!7, !538, !958, !277, !1050, !699, !1091, !1091, !991}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !521, file: !6, line: 1440, baseType: !1110, size: 64, offset: 3008)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!7, !277, !1113, !699, !991}
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !521, file: !6, line: 1444, baseType: !1115, size: 64, offset: 3072)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!7, !538, !1091, !1091, !277, !1091, !7}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !521, file: !6, line: 1449, baseType: !1119, size: 64, offset: 3136)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!7, !277, !1113, !699}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !521, file: !6, line: 1452, baseType: !1123, size: 64, offset: 3200)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!7, !277, !876}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !521, file: !6, line: 1454, baseType: !1127, size: 64, offset: 3264)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!7, !277, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !6, line: 820, size: 264, elements: !1132)
!1132 = !{!1133, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1131, file: !6, line: 821, baseType: !1134, size: 256)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 256, elements: !924)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1131, file: !6, line: 822, baseType: !414, size: 8, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !521, file: !6, line: 1456, baseType: !1127, size: 64, offset: 3328)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !521, file: !6, line: 1458, baseType: !1138, size: 64, offset: 3392)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!7, !277, !458, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !264, line: 55, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1143, line: 72, baseType: !1144)
!1143 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1143, line: 16, baseType: !299)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !521, file: !6, line: 1460, baseType: !1146, size: 64, offset: 3456)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !277, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !6, line: 67, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !521, file: !6, line: 1462, baseType: !1146, size: 64, offset: 3520)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !521, file: !6, line: 1464, baseType: !1153, size: 64, offset: 3584)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!404, !277, !277}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !521, file: !6, line: 1466, baseType: !1157, size: 64, offset: 3648)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{null, !277, !404}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !521, file: !6, line: 1469, baseType: !1161, size: 64, offset: 3712)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!7, !277, !7, !1091}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !521, file: !6, line: 1472, baseType: !1165, size: 64, offset: 3776)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!7, !878}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !521, file: !6, line: 1473, baseType: !1123, size: 64, offset: 3840)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !521, file: !6, line: 1475, baseType: !1170, size: 64, offset: 3904)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!7, !277, !538}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !521, file: !6, line: 1477, baseType: !701, size: 64, offset: 3968)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !521, file: !6, line: 1479, baseType: !1175, size: 64, offset: 4032)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!7, !277, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !6, line: 894, size: 256, elements: !1180)
!1180 = !{!1181, !1182}
