; ModuleID = '../bcout/drivers/media/dvb-frontends/dib0070.llvm.bc'
source_filename = "drivers/media/dvb-frontends/dib0070.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.lock_class_key = type {}
%struct.dvb_tuner_ops = type { %struct.dvb_tuner_info, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.analog_parameters*)*, i32 (%struct.dvb_frontend*, i8*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)* }
%struct.dvb_tuner_info = type { [128 x i8], i32, i32, i32, i32, i32, i32 }
%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }

!281 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "frontend_tune_state", file: !284, line: 164, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "drivers/media/dvb-frontends/dibx000_common.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!286 = !DIEnumerator(name: "CT_TUNER_START", value: 10, isUnsigned: true)
!287 = !DIEnumerator(name: "CT_TUNER_STEP_0", value: 11, isUnsigned: true)
!288 = !DIEnumerator(name: "CT_TUNER_STEP_1", value: 12, isUnsigned: true)
!289 = !DIEnumerator(name: "CT_TUNER_STEP_2", value: 13, isUnsigned: true)
!290 = !DIEnumerator(name: "CT_TUNER_STEP_3", value: 14, isUnsigned: true)
!291 = !DIEnumerator(name: "CT_TUNER_STEP_4", value: 15, isUnsigned: true)
!292 = !DIEnumerator(name: "CT_TUNER_STEP_5", value: 16, isUnsigned: true)
!293 = !DIEnumerator(name: "CT_TUNER_STEP_6", value: 17, isUnsigned: true)
!294 = !DIEnumerator(name: "CT_TUNER_STEP_7", value: 18, isUnsigned: true)
!295 = !DIEnumerator(name: "CT_TUNER_STOP", value: 19, isUnsigned: true)
!296 = !DIEnumerator(name: "CT_AGC_START", value: 20, isUnsigned: true)
!297 = !DIEnumerator(name: "CT_AGC_STEP_0", value: 21, isUnsigned: true)
!298 = !DIEnumerator(name: "CT_AGC_STEP_1", value: 22, isUnsigned: true)
!299 = !DIEnumerator(name: "CT_AGC_STEP_2", value: 23, isUnsigned: true)
!300 = !DIEnumerator(name: "CT_AGC_STEP_3", value: 24, isUnsigned: true)
!301 = !DIEnumerator(name: "CT_AGC_STEP_4", value: 25, isUnsigned: true)
!302 = !DIEnumerator(name: "CT_AGC_STOP", value: 26, isUnsigned: true)
!303 = !DIEnumerator(name: "CT_DEMOD_START", value: 30, isUnsigned: true)
!304 = !DIEnumerator(name: "CT_DEMOD_STEP_1", value: 31, isUnsigned: true)
!305 = !DIEnumerator(name: "CT_DEMOD_STEP_2", value: 32, isUnsigned: true)
!306 = !DIEnumerator(name: "CT_DEMOD_STEP_3", value: 33, isUnsigned: true)
!307 = !DIEnumerator(name: "CT_DEMOD_STEP_4", value: 34, isUnsigned: true)
!308 = !DIEnumerator(name: "CT_DEMOD_STEP_5", value: 35, isUnsigned: true)
!309 = !DIEnumerator(name: "CT_DEMOD_STEP_6", value: 36, isUnsigned: true)
!310 = !DIEnumerator(name: "CT_DEMOD_STEP_7", value: 37, isUnsigned: true)
!311 = !DIEnumerator(name: "CT_DEMOD_STEP_8", value: 38, isUnsigned: true)
!312 = !DIEnumerator(name: "CT_DEMOD_STEP_9", value: 39, isUnsigned: true)
!313 = !DIEnumerator(name: "CT_DEMOD_STEP_10", value: 40, isUnsigned: true)
!314 = !DIEnumerator(name: "CT_DEMOD_STEP_11", value: 41, isUnsigned: true)
!315 = !DIEnumerator(name: "CT_DEMOD_SEARCH_NEXT", value: 51, isUnsigned: true)
!316 = !DIEnumerator(name: "CT_DEMOD_STEP_LOCKED", value: 52, isUnsigned: true)
!317 = !DIEnumerator(name: "CT_DEMOD_STOP", value: 53, isUnsigned: true)
!318 = !DIEnumerator(name: "CT_DONE", value: 100, isUnsigned: true)
!319 = !DIEnumerator(name: "CT_SHUTDOWN", value: 101, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !321, line: 305, baseType: !7, size: 32, elements: !322)
!321 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!327 = !{!328, !329, !331, !337, !332, !340}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !330, line: 148, baseType: !7)
!330 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !333, line: 19, baseType: !334)
!333 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !335, line: 24, baseType: !336)
!335 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!336 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !333, line: 17, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !335, line: 21, baseType: !339)
!339 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !333, line: 21, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !335, line: 27, baseType: !7)
!342 = !{!343, !407, !412, !417, !4461, !4466, !4471, !4476, !4479, !0, !4481, !4484, !4487, !4503, !4513, !4516}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 24, type: !345, isLocal: true, isDefinition: true, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !347, line: 69, size: 320, elements: !348)
!347 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!348 = !{!349, !353, !357, !378, !380, !384, !385}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !346, file: !347, line: 70, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !346, file: !347, line: 71, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !356, line: 76, flags: DIFlagFwdDecl)
!356 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !346, file: !347, line: 72, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !347, line: 47, size: 256, elements: !361)
!361 = !{!362, !363, !369, !374}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !360, file: !347, line: 49, baseType: !7, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !360, file: !347, line: 51, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !350, !368}
!367 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !360, file: !347, line: 53, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!367, !373, !368}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !360, file: !347, line: 55, baseType: !375, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !328}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !346, file: !347, line: 73, baseType: !379, size: 16, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !346, file: !347, line: 74, baseType: !381, size: 8, offset: 208)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !333, line: 16, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !335, line: 20, baseType: !383)
!383 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !347, line: 75, baseType: !337, size: 8, offset: 216)
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !347, line: 76, baseType: !386, size: 64, offset: 256)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !346, file: !347, line: 76, size: 64, elements: !387)
!387 = !{!388, !389, !396}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !386, file: !347, line: 77, baseType: !328, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !386, file: !347, line: 78, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !347, line: 86, size: 128, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !392, file: !347, line: 87, baseType: !7, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !392, file: !347, line: 88, baseType: !373, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !386, file: !347, line: 79, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !347, line: 92, size: 256, elements: !400)
!400 = !{!401, !402, !403, !405, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !399, file: !347, line: 94, baseType: !7, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !399, file: !347, line: 95, baseType: !7, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !399, file: !347, line: 96, baseType: !404, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !399, file: !347, line: 97, baseType: !358, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !399, file: !347, line: 98, baseType: !328, size: 64, offset: 192)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 24, type: !409, isLocal: true, isDefinition: true, align: 8)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 216, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 27)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 25, type: !414, isLocal: true, isDefinition: true, align: 8)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 400, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 50)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "__key", scope: !419, file: !3, line: 748, type: !1156, isLocal: true, isDefinition: true)
!419 = distinct !DISubprogram(name: "dib0070_attach", scope: !3, file: !3, line: 739, type: !420, scopeLine: 740, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !779)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !422, !4314, !4436}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !424)
!424 = !{!425, !439, !731, !4302, !4303, !4304, !4305, !4306, !4307, !4308, !4312, !4313}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !423, file: !51, line: 687, baseType: !426, size: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !427, line: 19, size: 32, elements: !428)
!427 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !426, file: !427, line: 20, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !431, line: 113, baseType: !432)
!431 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !431, line: 111, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !432, file: !431, line: 112, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !330, line: 168, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 166, size: 32, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !436, file: !330, line: 167, baseType: !367, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !423, file: !51, line: 688, baseType: !440, size: 6016, offset: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !441)
!441 = !{!442, !457, !461, !465, !466, !467, !471, !472, !478, !485, !489, !490, !500, !585, !589, !594, !598, !599, !600, !601, !613, !624, !628, !632, !636, !641, !646, !650, !651, !652, !656, !713}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !440, file: !51, line: 436, baseType: !443, size: 1280)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !444)
!444 = !{!445, !449, !450, !451, !452, !453, !454, !455, !456}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !51, line: 339, baseType: !446, size: 1024)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 1024, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !443, file: !51, line: 340, baseType: !340, size: 32, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !443, file: !51, line: 341, baseType: !340, size: 32, offset: 1056)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !443, file: !51, line: 342, baseType: !340, size: 32, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !443, file: !51, line: 343, baseType: !340, size: 32, offset: 1120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !443, file: !51, line: 344, baseType: !340, size: 32, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !443, file: !51, line: 345, baseType: !340, size: 32, offset: 1184)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !443, file: !51, line: 346, baseType: !340, size: 32, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !443, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !440, file: !51, line: 438, baseType: !458, size: 64, offset: 1280)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 64, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 8)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !440, file: !51, line: 440, baseType: !462, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !422}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !440, file: !51, line: 441, baseType: !462, size: 64, offset: 1408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !440, file: !51, line: 442, baseType: !462, size: 64, offset: 1472)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !440, file: !51, line: 444, baseType: !468, size: 64, offset: 1536)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!367, !422}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !440, file: !51, line: 445, baseType: !468, size: 64, offset: 1600)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !440, file: !51, line: 447, baseType: !473, size: 64, offset: 1664)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!367, !422, !476, !367}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !440, file: !51, line: 450, baseType: !479, size: 64, offset: 1728)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!367, !422, !482, !7, !404, !484}
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !330, line: 30, baseType: !483)
!483 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !440, file: !51, line: 457, baseType: !486, size: 64, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!50, !422}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !440, file: !51, line: 460, baseType: !468, size: 64, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !440, file: !51, line: 461, baseType: !491, size: 64, offset: 1920)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!367, !422, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !495, file: !51, line: 70, baseType: !367, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !495, file: !51, line: 71, baseType: !367, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !495, file: !51, line: 72, baseType: !367, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !440, file: !51, line: 463, baseType: !501, size: 64, offset: 1984)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!367, !422, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !578, !579, !580, !581, !582, !583, !584}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !505, file: !51, line: 587, baseType: !340, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !505, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !505, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !505, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !505, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !505, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !505, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !505, file: !51, line: 595, baseType: !340, size: 32, offset: 224)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !505, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !505, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !505, file: !51, line: 598, baseType: !340, size: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !505, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !505, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !505, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !505, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !505, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !505, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !505, file: !51, line: 610, baseType: !337, size: 8, offset: 544)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !505, file: !51, line: 611, baseType: !337, size: 8, offset: 552)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !505, file: !51, line: 612, baseType: !337, size: 8, offset: 560)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !505, file: !51, line: 613, baseType: !340, size: 32, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !505, file: !51, line: 614, baseType: !340, size: 32, offset: 608)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !505, file: !51, line: 615, baseType: !337, size: 8, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !505, file: !51, line: 621, baseType: !531, size: 384, offset: 672)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 384, elements: !538)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !505, file: !51, line: 616, size: 128, elements: !533)
!533 = !{!534, !535, !536, !537}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !532, file: !51, line: 617, baseType: !337, size: 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !532, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !532, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !532, file: !51, line: 620, baseType: !337, size: 8, offset: 96)
!538 = !{!539}
!539 = !DISubrange(count: 3)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !505, file: !51, line: 624, baseType: !340, size: 32, offset: 1056)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !505, file: !51, line: 627, baseType: !340, size: 32, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !505, file: !51, line: 630, baseType: !337, size: 8, offset: 1120)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !505, file: !51, line: 631, baseType: !337, size: 8, offset: 1128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !505, file: !51, line: 632, baseType: !337, size: 8, offset: 1136)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !505, file: !51, line: 633, baseType: !337, size: 8, offset: 1144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !505, file: !51, line: 634, baseType: !337, size: 8, offset: 1152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !505, file: !51, line: 635, baseType: !337, size: 8, offset: 1160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !505, file: !51, line: 637, baseType: !337, size: 8, offset: 1168)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !505, file: !51, line: 638, baseType: !337, size: 8, offset: 1176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !505, file: !51, line: 639, baseType: !337, size: 8, offset: 1184)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !505, file: !51, line: 640, baseType: !337, size: 8, offset: 1192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !505, file: !51, line: 641, baseType: !337, size: 8, offset: 1200)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !505, file: !51, line: 642, baseType: !337, size: 8, offset: 1208)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !505, file: !51, line: 643, baseType: !337, size: 8, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !505, file: !51, line: 644, baseType: !337, size: 8, offset: 1224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !505, file: !51, line: 645, baseType: !337, size: 8, offset: 1232)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !505, file: !51, line: 647, baseType: !340, size: 32, offset: 1248)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !505, file: !51, line: 650, baseType: !559, size: 296, offset: 1280)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !559, file: !6, line: 826, baseType: !338, size: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !559, file: !6, line: 827, baseType: !563, size: 288, offset: 8)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 288, elements: !576)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !564, file: !6, line: 804, baseType: !338, size: 8)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !564, file: !6, line: 805, baseType: !568, size: 64, offset: 8)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !564, file: !6, line: 805, size: 64, elements: !569)
!569 = !{!570, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !568, file: !6, line: 806, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !335, line: 31, baseType: !572)
!572 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !568, file: !6, line: 807, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !335, line: 30, baseType: !575)
!575 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!576 = !{!577}
!577 = !DISubrange(count: 4)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !505, file: !51, line: 651, baseType: !559, size: 296, offset: 1576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !505, file: !51, line: 652, baseType: !559, size: 296, offset: 1872)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !505, file: !51, line: 653, baseType: !559, size: 296, offset: 2168)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !505, file: !51, line: 654, baseType: !559, size: 296, offset: 2464)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !505, file: !51, line: 655, baseType: !559, size: 296, offset: 2760)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !505, file: !51, line: 656, baseType: !559, size: 296, offset: 3056)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !505, file: !51, line: 657, baseType: !559, size: 296, offset: 3352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !440, file: !51, line: 466, baseType: !586, size: 64, offset: 2048)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!367, !422, !484}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !440, file: !51, line: 467, baseType: !590, size: 64, offset: 2112)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!367, !422, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !440, file: !51, line: 468, baseType: !595, size: 64, offset: 2176)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!367, !422, !331}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !440, file: !51, line: 469, baseType: !595, size: 64, offset: 2240)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !440, file: !51, line: 470, baseType: !590, size: 64, offset: 2304)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !440, file: !51, line: 472, baseType: !468, size: 64, offset: 2368)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !440, file: !51, line: 473, baseType: !602, size: 64, offset: 2432)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!367, !422, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !607)
!607 = !{!608, !612}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !606, file: !6, line: 174, baseType: !609, size: 48)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 48, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 6)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !606, file: !6, line: 175, baseType: !338, size: 8, offset: 48)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !440, file: !51, line: 474, baseType: !614, size: 64, offset: 2496)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!367, !422, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !619)
!619 = !{!620, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !618, file: !6, line: 196, baseType: !621, size: 32)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 32, elements: !576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !618, file: !6, line: 197, baseType: !338, size: 8, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !618, file: !6, line: 198, baseType: !367, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !440, file: !51, line: 475, baseType: !625, size: 64, offset: 2560)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!367, !422, !171}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !440, file: !51, line: 477, baseType: !629, size: 64, offset: 2624)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!367, !422, !78}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !440, file: !51, line: 478, baseType: !633, size: 64, offset: 2688)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!367, !422, !73}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !440, file: !51, line: 480, baseType: !637, size: 64, offset: 2752)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!367, !422, !640}
!640 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !440, file: !51, line: 481, baseType: !642, size: 64, offset: 2816)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!367, !422, !645}
!645 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !440, file: !51, line: 482, baseType: !647, size: 64, offset: 2880)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!367, !422, !367}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !440, file: !51, line: 483, baseType: !647, size: 64, offset: 2944)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !440, file: !51, line: 484, baseType: !468, size: 64, offset: 3008)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !440, file: !51, line: 490, baseType: !653, size: 64, offset: 3072)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!175, !422}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !440, file: !51, line: 492, baseType: !657, size: 2304, offset: 3136)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !658)
!658 = !{!659, !669, !670, !671, !672, !673, !674, !675, !687, !691, !692, !693, !694, !695, !696, !703, !708, !712}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !657, file: !51, line: 228, baseType: !660, size: 1216)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !51, line: 89, baseType: !446, size: 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !660, file: !51, line: 91, baseType: !340, size: 32, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !660, file: !51, line: 92, baseType: !340, size: 32, offset: 1056)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !660, file: !51, line: 93, baseType: !340, size: 32, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !660, file: !51, line: 95, baseType: !340, size: 32, offset: 1120)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !660, file: !51, line: 96, baseType: !340, size: 32, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !660, file: !51, line: 97, baseType: !340, size: 32, offset: 1184)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !657, file: !51, line: 230, baseType: !462, size: 64, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !657, file: !51, line: 231, baseType: !468, size: 64, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !657, file: !51, line: 232, baseType: !468, size: 64, offset: 1344)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !657, file: !51, line: 233, baseType: !468, size: 64, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !657, file: !51, line: 234, baseType: !468, size: 64, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !657, file: !51, line: 237, baseType: !468, size: 64, offset: 1536)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !657, file: !51, line: 238, baseType: !676, size: 64, offset: 1600)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!367, !422, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !680, file: !51, line: 115, baseType: !7, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !680, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !680, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !680, file: !51, line: 118, baseType: !686, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !333, line: 23, baseType: !571)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !657, file: !51, line: 240, baseType: !688, size: 64, offset: 1664)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!367, !422, !328}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !657, file: !51, line: 242, baseType: !590, size: 64, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !657, file: !51, line: 243, baseType: !590, size: 64, offset: 1792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !657, file: !51, line: 244, baseType: !590, size: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !657, file: !51, line: 248, baseType: !590, size: 64, offset: 1920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !657, file: !51, line: 249, baseType: !595, size: 64, offset: 1984)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !657, file: !51, line: 250, baseType: !697, size: 64, offset: 2048)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!367, !422, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !333, line: 20, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !335, line: 26, baseType: !367)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !657, file: !51, line: 258, baseType: !704, size: 64, offset: 2112)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!367, !422, !707, !367}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !657, file: !51, line: 267, baseType: !709, size: 64, offset: 2176)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!367, !422, !340}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !657, file: !51, line: 268, baseType: !709, size: 64, offset: 2240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !440, file: !51, line: 493, baseType: !714, size: 576, offset: 5440)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !715)
!715 = !{!716, !720, !724, !725, !726, !727, !728, !729, !730}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !714, file: !51, line: 304, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !51, line: 277, baseType: !373, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !714, file: !51, line: 306, baseType: !721, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !422, !679}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !714, file: !51, line: 308, baseType: !595, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !714, file: !51, line: 309, baseType: !697, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !714, file: !51, line: 310, baseType: !462, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !714, file: !51, line: 311, baseType: !462, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !714, file: !51, line: 312, baseType: !462, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !714, file: !51, line: 313, baseType: !647, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !714, file: !51, line: 316, baseType: !688, size: 64, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !423, file: !51, line: 689, baseType: !732, size: 64, offset: 6080)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !734)
!734 = !{!735, !736, !742, !743, !744, !746, !747, !4280, !4281, !4282, !4301}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !733, file: !272, line: 102, baseType: !367, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !733, file: !272, line: 103, baseType: !737, size: 128, offset: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !330, line: 178, size: 128, elements: !738)
!738 = !{!739, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !330, line: 179, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !737, file: !330, line: 179, baseType: !740, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !733, file: !272, line: 104, baseType: !737, size: 128, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !272, line: 105, baseType: !350, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !733, file: !272, line: 106, baseType: !745, size: 48, offset: 384)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 48, elements: !610)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !733, file: !272, line: 107, baseType: !328, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !733, file: !272, line: 109, baseType: !748, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !750)
!750 = !{!751, !3737, !3738, !3741, !3742, !3793, !3881, !3882, !3883, !3884, !3885, !3894, !3999, !4012, !4207, !4208, !4212, !4214, !4215, !4216, !4220, !4226, !4227, !4230, !4231, !4232, !4233, !4234, !4235, !4236, !4268, !4269, !4270, !4273, !4276, !4277, !4278, !4279}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !749, file: !237, line: 462, baseType: !752, size: 512)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !753, line: 64, size: 512, elements: !754)
!753 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!754 = !{!755, !756, !757, !759, !816, !3592, !3731, !3732, !3733, !3734, !3735, !3736}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !753, line: 65, baseType: !350, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !752, file: !753, line: 66, baseType: !737, size: 128, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !752, file: !753, line: 67, baseType: !758, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !752, file: !753, line: 68, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !753, line: 192, size: 704, elements: !762)
!762 = !{!763, !764, !780, !781}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !761, file: !753, line: 193, baseType: !737, size: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !761, file: !753, line: 194, baseType: !765, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !766, line: 83, baseType: !767)
!766 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !766, line: 71, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !766, line: 72, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !766, line: 72, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !770, file: !766, line: 73, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !766, line: 20, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !773, file: !766, line: 21, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !777, line: 25, baseType: !778)
!777 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !777, line: 25, elements: !779)
!779 = !{}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !761, file: !753, line: 195, baseType: !752, size: 512, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !761, file: !753, line: 196, baseType: !782, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !753, line: 156, size: 192, elements: !785)
!785 = !{!786, !791, !796}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !784, file: !753, line: 157, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!367, !760, !758}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !784, file: !753, line: 158, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!350, !760, !758}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !784, file: !753, line: 159, baseType: !797, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!367, !760, !758, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !753, line: 148, size: 20736, elements: !803)
!803 = !{!804, !806, !810, !811, !815}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !802, file: !753, line: 149, baseType: !805, size: 192)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 192, elements: !538)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !802, file: !753, line: 150, baseType: !807, size: 4096, offset: 192)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 4096, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !802, file: !753, line: 151, baseType: !367, size: 32, offset: 4288)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !802, file: !753, line: 152, baseType: !812, size: 16384, offset: 4320)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 16384, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 2048)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !802, file: !753, line: 153, baseType: !367, size: 32, offset: 20704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !752, file: !753, line: 69, baseType: !817, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !753, line: 138, size: 448, elements: !819)
!819 = !{!820, !824, !851, !853, !3554, !3582, !3586}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !818, file: !753, line: 139, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !758}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !818, file: !753, line: 140, baseType: !825, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !828, line: 230, size: 128, elements: !829)
!828 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!829 = !{!830, !844}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !827, file: !828, line: 231, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !758, !838, !373}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !330, line: 60, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !836, line: 73, baseType: !837)
!836 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !836, line: 15, baseType: !640)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !828, line: 30, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !839, file: !828, line: 31, baseType: !350, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !839, file: !828, line: 32, baseType: !843, size: 16, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !330, line: 19, baseType: !336)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !827, file: !828, line: 232, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!834, !758, !838, !350, !848}
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !330, line: 55, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !836, line: 72, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !836, line: 16, baseType: !645)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !818, file: !753, line: 141, baseType: !852, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !818, file: !753, line: 142, baseType: !854, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !828, line: 84, size: 320, elements: !858)
!858 = !{!859, !860, !864, !3551, !3552}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !857, file: !828, line: 85, baseType: !350, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !857, file: !828, line: 86, baseType: !861, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!843, !758, !838, !367}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !857, file: !828, line: 88, baseType: !865, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!843, !758, !868, !367}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !828, line: 168, size: 448, elements: !870)
!870 = !{!871, !872, !873, !874, !3546, !3547}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !869, file: !828, line: 169, baseType: !839, size: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !869, file: !828, line: 170, baseType: !848, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !869, file: !828, line: 171, baseType: !328, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !869, file: !828, line: 172, baseType: !875, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!834, !878, !758, !868, !373, !1044, !848}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !880)
!880 = !{!881, !899, !3511, !3512, !3513, !3514, !3515, !3516, !3517, !3518, !3519, !3520, !3529, !3530, !3539, !3540, !3541, !3542, !3543, !3544, !3545}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !879, file: !208, line: 920, baseType: !882, size: 128)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !879, file: !208, line: 917, size: 128, elements: !883)
!883 = !{!884, !890}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !882, file: !208, line: 918, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !886, line: 58, size: 64, elements: !887)
!886 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !885, file: !886, line: 59, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !882, file: !208, line: 919, baseType: !891, size: 128, align: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !330, line: 216, size: 128, align: 64, elements: !892)
!892 = !{!893, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !891, file: !330, line: 217, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !891, file: !330, line: 218, baseType: !896, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !894}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !879, file: !208, line: 921, baseType: !900, size: 128, offset: 128)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !901, line: 8, size: 128, elements: !902)
!901 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!902 = !{!903, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !900, file: !901, line: 9, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !906, line: 18, flags: DIFlagFwdDecl)
!906 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!907 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !900, file: !901, line: 10, baseType: !908, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !906, line: 89, size: 1536, elements: !910)
!910 = !{!911, !912, !922, !930, !931, !946, !3480, !3482, !3494, !3495, !3496, !3497, !3498, !3503, !3504, !3505}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !909, file: !906, line: 91, baseType: !7, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !909, file: !906, line: 92, baseType: !913, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !914, line: 277, baseType: !915)
!914 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !914, line: 277, size: 32, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !915, file: !914, line: 277, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !914, line: 70, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !914, line: 65, size: 32, elements: !920)
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !919, file: !914, line: 66, baseType: !7, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !909, file: !906, line: 93, baseType: !923, size: 128, offset: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !924, line: 38, size: 128, elements: !925)
!924 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!925 = !{!926, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !923, file: !924, line: 39, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !923, file: !924, line: 39, baseType: !929, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !909, file: !906, line: 94, baseType: !908, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !909, file: !906, line: 95, baseType: !932, size: 128, offset: 256)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !906, line: 47, size: 128, elements: !933)
!933 = !{!934, !943}
!934 = !DIDerivedType(tag: DW_TAG_member, scope: !932, file: !906, line: 48, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !932, file: !906, line: 48, size: 64, elements: !936)
!936 = !{!937, !942}
!937 = !DIDerivedType(tag: DW_TAG_member, scope: !935, file: !906, line: 49, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !935, file: !906, line: 49, size: 64, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !938, file: !906, line: 50, baseType: !340, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !938, file: !906, line: 50, baseType: !340, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !935, file: !906, line: 52, baseType: !686, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !906, line: 54, baseType: !944, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !909, file: !906, line: 96, baseType: !947, size: 64, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !949)
!949 = !{!950, !951, !952, !960, !967, !968, !1109, !3174, !3175, !3176, !3182, !3183, !3184, !3185, !3186, !3187, !3188, !3189, !3190, !3191, !3192, !3193, !3194, !3195, !3196, !3197, !3198, !3199, !3200, !3201, !3206, !3207, !3208, !3209, !3210, !3211, !3212, !3448, !3456, !3457, !3458, !3476, !3477, !3478, !3479}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !948, file: !208, line: 611, baseType: !843, size: 16)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !948, file: !208, line: 612, baseType: !336, size: 16, offset: 16)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !948, file: !208, line: 613, baseType: !953, size: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !954, line: 23, baseType: !955)
!954 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !954, line: 21, size: 32, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !955, file: !954, line: 22, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !330, line: 32, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !836, line: 49, baseType: !7)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !948, file: !208, line: 614, baseType: !961, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !954, line: 28, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !954, line: 26, size: 32, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !962, file: !954, line: 27, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !330, line: 33, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !836, line: 50, baseType: !7)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !948, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !948, file: !208, line: 622, baseType: !969, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !972)
!972 = !{!973, !977, !987, !991, !997, !1001, !1005, !1009, !1013, !1017, !1021, !1022, !1028, !1032, !1056, !1085, !1089, !1095, !1100, !1104, !1105}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !971, file: !208, line: 1865, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!908, !947, !908, !7}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !971, file: !208, line: 1866, baseType: !978, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!350, !908, !947, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !983, line: 10, size: 128, elements: !984)
!983 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !982, file: !983, line: 11, baseType: !375, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !982, file: !983, line: 12, baseType: !328, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !971, file: !208, line: 1867, baseType: !988, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!367, !947, !367}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !971, file: !208, line: 1868, baseType: !992, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !947, !367}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !971, file: !208, line: 1870, baseType: !998, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!367, !908, !373, !367}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !971, file: !208, line: 1872, baseType: !1002, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!367, !947, !908, !843, !482}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !971, file: !208, line: 1873, baseType: !1006, size: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!367, !908, !947, !908}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !971, file: !208, line: 1874, baseType: !1010, size: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!367, !947, !908}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !971, file: !208, line: 1875, baseType: !1014, size: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!367, !947, !908, !350}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !971, file: !208, line: 1876, baseType: !1018, size: 64, offset: 576)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!367, !947, !908, !843}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !971, file: !208, line: 1877, baseType: !1010, size: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !971, file: !208, line: 1878, baseType: !1023, size: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!367, !947, !908, !843, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !330, line: 16, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !330, line: 13, baseType: !340)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !971, file: !208, line: 1879, baseType: !1029, size: 64, offset: 768)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!367, !947, !908, !947, !908, !7}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !971, file: !208, line: 1881, baseType: !1033, size: 64, offset: 832)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!367, !908, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1046, !1053, !1054, !1055}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1037, file: !208, line: 220, baseType: !7, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1037, file: !208, line: 221, baseType: !843, size: 16, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1037, file: !208, line: 222, baseType: !953, size: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1037, file: !208, line: 223, baseType: !961, size: 32, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1037, file: !208, line: 224, baseType: !1044, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !330, line: 46, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !836, line: 88, baseType: !575)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1037, file: !208, line: 225, baseType: !1047, size: 128, offset: 192)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1048, line: 13, size: 128, elements: !1049)
!1048 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1049 = !{!1050, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1047, file: !1048, line: 14, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1048, line: 8, baseType: !574)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1047, file: !1048, line: 15, baseType: !640, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1037, file: !208, line: 226, baseType: !1047, size: 128, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1037, file: !208, line: 227, baseType: !1047, size: 128, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1037, file: !208, line: 234, baseType: !878, size: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !971, file: !208, line: 1882, baseType: !1057, size: 64, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!367, !1060, !1062, !340, !7}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1064, line: 22, size: 1152, elements: !1065)
!1064 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1065 = !{!1066, !1067, !1068, !1069, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1063, file: !1064, line: 23, baseType: !340, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1063, file: !1064, line: 24, baseType: !843, size: 16, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1063, file: !1064, line: 25, baseType: !7, size: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1063, file: !1064, line: 26, baseType: !1070, size: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !330, line: 104, baseType: !340)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1063, file: !1064, line: 27, baseType: !686, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1063, file: !1064, line: 28, baseType: !686, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1063, file: !1064, line: 37, baseType: !686, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1063, file: !1064, line: 38, baseType: !1026, size: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1063, file: !1064, line: 39, baseType: !1026, size: 32, offset: 352)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1063, file: !1064, line: 40, baseType: !953, size: 32, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1063, file: !1064, line: 41, baseType: !961, size: 32, offset: 416)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1063, file: !1064, line: 42, baseType: !1044, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1063, file: !1064, line: 43, baseType: !1047, size: 128, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1063, file: !1064, line: 44, baseType: !1047, size: 128, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1063, file: !1064, line: 45, baseType: !1047, size: 128, offset: 768)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1063, file: !1064, line: 46, baseType: !1047, size: 128, offset: 896)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1063, file: !1064, line: 47, baseType: !686, size: 64, offset: 1024)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1063, file: !1064, line: 48, baseType: !686, size: 64, offset: 1088)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !971, file: !208, line: 1883, baseType: !1086, size: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!834, !908, !373, !848}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !971, file: !208, line: 1884, baseType: !1090, size: 64, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!367, !947, !1093, !686, !686}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !971, file: !208, line: 1886, baseType: !1096, size: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!367, !947, !1099, !367}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !971, file: !208, line: 1887, baseType: !1101, size: 64, offset: 1152)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!367, !947, !908, !878, !7, !843}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !971, file: !208, line: 1890, baseType: !1018, size: 64, offset: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !971, file: !208, line: 1891, baseType: !1106, size: 64, offset: 1280)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!367, !947, !995, !367}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !948, file: !208, line: 623, baseType: !1110, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1165, !2782, !2864, !2947, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2963, !2967, !2968, !2971, !2972, !2975, !2976, !2977, !3018, !3044, !3045, !3046, !3047, !3048, !3049, !3052, !3054, !3061, !3062, !3064, !3065, !3066, !3125, !3126, !3141, !3142, !3143, !3144, !3145, !3148, !3149, !3150, !3165, !3166, !3167, !3168, !3169, !3170, !3171, !3172, !3173}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1111, file: !208, line: 1417, baseType: !737, size: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1111, file: !208, line: 1418, baseType: !1026, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1111, file: !208, line: 1419, baseType: !339, size: 8, offset: 160)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1111, file: !208, line: 1420, baseType: !645, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1111, file: !208, line: 1421, baseType: !1044, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1111, file: !208, line: 1422, baseType: !1119, size: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1131, !1135, !1139, !1143, !1144, !1145, !1155, !1158, !1159, !1160, !1162, !1163, !1164}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1120, file: !208, line: 2229, baseType: !350, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1120, file: !208, line: 2230, baseType: !367, size: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1120, file: !208, line: 2238, baseType: !1125, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!367, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1130, line: 28, flags: DIFlagFwdDecl)
!1130 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1120, file: !208, line: 2239, baseType: !1132, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1134)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1120, file: !208, line: 2240, baseType: !1136, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!908, !1119, !367, !350, !328}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1120, file: !208, line: 2242, baseType: !1140, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !1110}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1120, file: !208, line: 2243, baseType: !354, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !208, line: 2244, baseType: !1119, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1120, file: !208, line: 2245, baseType: !1146, size: 64, offset: 512)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !330, line: 182, size: 64, elements: !1147)
!1147 = !{!1148}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1146, file: !330, line: 183, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !330, line: 186, size: 128, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1150, file: !330, line: 187, baseType: !1149, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1150, file: !330, line: 187, baseType: !1154, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1120, file: !208, line: 2247, baseType: !1156, offset: 576)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1157, line: 187, elements: !779)
!1157 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1120, file: !208, line: 2248, baseType: !1156, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1120, file: !208, line: 2249, baseType: !1156, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1120, file: !208, line: 2250, baseType: !1161, offset: 576)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, elements: !538)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1120, file: !208, line: 2252, baseType: !1156, offset: 576)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1120, file: !208, line: 2253, baseType: !1156, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1120, file: !208, line: 2254, baseType: !1156, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1111, file: !208, line: 1423, baseType: !1166, size: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1169)
!1169 = !{!1170, !1174, !1178, !1179, !1183, !1189, !1193, !1194, !1195, !1199, !1203, !1204, !1205, !1206, !1212, !1217, !1218, !1225, !1226, !1227, !1228, !2766, !2781}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1168, file: !208, line: 1936, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!947, !1110}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1168, file: !208, line: 1937, baseType: !1175, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !947}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1168, file: !208, line: 1938, baseType: !1175, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1168, file: !208, line: 1940, baseType: !1180, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{null, !947, !367}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1168, file: !208, line: 1941, baseType: !1184, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!367, !947, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1168, file: !208, line: 1942, baseType: !1190, size: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!367, !947}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1168, file: !208, line: 1943, baseType: !1175, size: 64, offset: 384)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1168, file: !208, line: 1944, baseType: !1140, size: 64, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1168, file: !208, line: 1945, baseType: !1196, size: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!367, !1110, !367}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1168, file: !208, line: 1946, baseType: !1200, size: 64, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!367, !1110}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1168, file: !208, line: 1947, baseType: !1200, size: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1168, file: !208, line: 1948, baseType: !1200, size: 64, offset: 704)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1168, file: !208, line: 1949, baseType: !1200, size: 64, offset: 768)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1168, file: !208, line: 1950, baseType: !1207, size: 64, offset: 832)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!367, !908, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1168, file: !208, line: 1951, baseType: !1213, size: 64, offset: 896)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!367, !1110, !1216, !373}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1168, file: !208, line: 1952, baseType: !1140, size: 64, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1168, file: !208, line: 1954, baseType: !1219, size: 64, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!367, !1222, !908}
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1224, line: 539, flags: DIFlagFwdDecl)
!1224 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1168, file: !208, line: 1955, baseType: !1219, size: 64, offset: 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1168, file: !208, line: 1956, baseType: !1219, size: 64, offset: 1152)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1168, file: !208, line: 1957, baseType: !1219, size: 64, offset: 1216)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1168, file: !208, line: 1963, baseType: !1229, size: 64, offset: 1280)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!367, !1110, !1232, !329}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1234, line: 68, size: 512, align: 128, elements: !1235)
!1234 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1235 = !{!1236, !1237, !2758, !2765}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1233, file: !1234, line: 69, baseType: !645, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, scope: !1233, file: !1234, line: 77, baseType: !1238, size: 320, offset: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1233, file: !1234, line: 77, size: 320, elements: !1239)
!1239 = !{!1240, !1421, !1426, !1454, !1462, !1468, !2750, !2757}
!1240 = !DIDerivedType(tag: DW_TAG_member, scope: !1238, file: !1234, line: 78, baseType: !1241, size: 320)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1238, file: !1234, line: 78, size: 320, elements: !1242)
!1242 = !{!1243, !1244, !1419, !1420}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1241, file: !1234, line: 84, baseType: !737, size: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1241, file: !1234, line: 86, baseType: !1245, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1247)
!1247 = !{!1248, !1249, !1256, !1257, !1258, !1273, !1289, !1290, !1291, !1292, !1412, !1413, !1416, !1417, !1418}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1246, file: !208, line: 452, baseType: !947, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1246, file: !208, line: 453, baseType: !1250, size: 128, offset: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1251, line: 292, size: 128, elements: !1252)
!1251 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1250, file: !1251, line: 293, baseType: !765)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1250, file: !1251, line: 295, baseType: !329, size: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1250, file: !1251, line: 296, baseType: !328, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1246, file: !208, line: 454, baseType: !329, size: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1246, file: !208, line: 455, baseType: !435, size: 32, offset: 224)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1246, file: !208, line: 460, baseType: !1259, size: 128, offset: 256)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1260, line: 125, size: 128, elements: !1261)
!1260 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1261 = !{!1262, !1272}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1259, file: !1260, line: 126, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1260, line: 31, size: 64, elements: !1264)
!1264 = !{!1265}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1263, file: !1260, line: 32, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1260, line: 24, size: 192, align: 64, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1267, file: !1260, line: 25, baseType: !645, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1267, file: !1260, line: 26, baseType: !1266, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1267, file: !1260, line: 27, baseType: !1266, size: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1259, file: !1260, line: 127, baseType: !1266, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1246, file: !208, line: 461, baseType: !1274, size: 256, offset: 384)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1275, line: 35, size: 256, elements: !1276)
!1275 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1276 = !{!1277, !1285, !1286, !1288}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1274, file: !1275, line: 36, baseType: !1278, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1279, line: 13, baseType: !1280)
!1279 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !330, line: 175, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 173, size: 64, elements: !1282)
!1282 = !{!1283}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1281, file: !330, line: 174, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !333, line: 22, baseType: !574)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1274, file: !1275, line: 42, baseType: !1278, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1274, file: !1275, line: 46, baseType: !1287, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !766, line: 29, baseType: !773)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1274, file: !1275, line: 47, baseType: !737, size: 128, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1246, file: !208, line: 462, baseType: !645, size: 64, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1246, file: !208, line: 463, baseType: !645, size: 64, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1246, file: !208, line: 464, baseType: !645, size: 64, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1246, file: !208, line: 465, baseType: !1293, size: 64, offset: 832)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !208, line: 367, size: 1408, elements: !1296)
!1296 = !{!1297, !1301, !1305, !1309, !1313, !1317, !1323, !1329, !1333, !1338, !1342, !1346, !1350, !1376, !1380, !1386, !1387, !1388, !1392, !1397, !1401, !1408}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1295, file: !208, line: 368, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!367, !1232, !1187}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1295, file: !208, line: 369, baseType: !1302, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!367, !878, !1232}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1295, file: !208, line: 372, baseType: !1306, size: 64, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!367, !1245, !1187}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1295, file: !208, line: 375, baseType: !1310, size: 64, offset: 192)
