; ModuleID = '../bcout/drivers/media/dvb-frontends/dib7000p.llvm.bc'
source_filename = "drivers/media/dvb-frontends/dib7000p.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.i2c_msg = type { i16, i16, i16, i8* }
%struct.kmem_cache = type opaque

!280 = !DIEnumerator(name: "DVB_DEVICE_VIDEO", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dibx000_i2c_interface", file: !284, line: 5, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "drivers/media/dvb-frontends/dibx000_common.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !287, !288, !289}
!286 = !DIEnumerator(name: "DIBX000_I2C_INTERFACE_TUNER", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "DIBX000_I2C_INTERFACE_GPIO_1_2", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "DIBX000_I2C_INTERFACE_GPIO_3_4", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "DIBX000_I2C_INTERFACE_GPIO_6_7", value: 3, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !291, line: 305, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!292 = !{!293, !294, !295, !296}
!293 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dib7000p_power_mode", file: !3, line: 88, baseType: !7, size: 32, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "DIB7000P_POWER_ALL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "DIB7000P_POWER_ANALOG_ADC", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "DIB7000P_POWER_INTERFACE_ONLY", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dibx000_adc_states", file: !284, line: 139, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309}
!304 = !DIEnumerator(name: "DIBX000_SLOW_ADC_ON", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "DIBX000_SLOW_ADC_OFF", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "DIBX000_ADC_ON", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "DIBX000_ADC_OFF", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "DIBX000_VBG_ENABLE", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "DIBX000_VBG_DISABLE", value: 5, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fecap_scale_params", file: !6, line: 752, baseType: !7, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIEnumerator(name: "FE_SCALE_NOT_AVAILABLE", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "FE_SCALE_DECIBEL", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "FE_SCALE_RELATIVE", value: 2, isUnsigned: true)
!315 = !DIEnumerator(name: "FE_SCALE_COUNTER", value: 3, isUnsigned: true)
!316 = !{!317, !318, !323, !325, !328, !331, !327, !333, !334}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !319, line: 17, baseType: !320)
!319 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !321, line: 21, baseType: !322)
!321 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!322 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !324, line: 148, baseType: !7)
!324 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !319, line: 20, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !321, line: 26, baseType: !327)
!327 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !319, line: 19, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !321, line: 24, baseType: !330)
!330 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !319, line: 21, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !321, line: 27, baseType: !7)
!333 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !324, line: 107, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !319, line: 23, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !321, line: 31, baseType: !337)
!337 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!338 = !{!339, !402, !407, !412, !414, !419, !424, !429, !434, !439, !441, !446, !448, !0, !450, !455, !459, !4558, !4561, !4618, !4623, !4632, !4634, !4639}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 22, type: !341, isLocal: true, isDefinition: true, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !343, line: 69, size: 320, elements: !344)
!343 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!344 = !{!345, !349, !353, !373, !375, !379, !380}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !343, line: 70, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !342, file: !343, line: 71, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !352, line: 76, flags: DIFlagFwdDecl)
!352 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !342, file: !343, line: 72, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !343, line: 47, size: 256, elements: !357)
!357 = !{!358, !359, !364, !369}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !343, line: 49, baseType: !7, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !356, file: !343, line: 51, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!327, !346, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !356, file: !343, line: 53, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!327, !368, !363}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !356, file: !343, line: 55, baseType: !370, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !317}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !342, file: !343, line: 73, baseType: !374, size: 16, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !342, file: !343, line: 74, baseType: !376, size: 8, offset: 208)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !319, line: 16, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !321, line: 20, baseType: !378)
!378 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !342, file: !343, line: 75, baseType: !318, size: 8, offset: 216)
!380 = !DIDerivedType(tag: DW_TAG_member, scope: !342, file: !343, line: 76, baseType: !381, size: 64, offset: 256)
!381 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !343, line: 76, size: 64, elements: !382)
!382 = !{!383, !384, !391}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !381, file: !343, line: 77, baseType: !317, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !381, file: !343, line: 78, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !343, line: 86, size: 128, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !387, file: !343, line: 87, baseType: !7, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !387, file: !343, line: 88, baseType: !368, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !381, file: !343, line: 79, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !343, line: 92, size: 256, elements: !395)
!395 = !{!396, !397, !398, !400, !401}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !394, file: !343, line: 94, baseType: !7, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !394, file: !343, line: 95, baseType: !7, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !394, file: !343, line: 96, baseType: !399, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !394, file: !343, line: 97, baseType: !354, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !394, file: !343, line: 98, baseType: !317, size: 64, offset: 192)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 22, type: !404, isLocal: true, isDefinition: true, align: 8)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 224, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 28)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 23, type: !409, isLocal: true, isDefinition: true, align: 8)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 408, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 51)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__param_buggy_sfn_workaround", scope: !2, file: !3, line: 26, type: !341, isLocal: true, isDefinition: true, align: 64)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_buggy_sfn_workaroundtype222", scope: !2, file: !3, line: 26, type: !416, isLocal: true, isDefinition: true, align: 8)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 344, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 43)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_buggy_sfn_workaround223", scope: !2, file: !3, line: 27, type: !421, isLocal: true, isDefinition: true, align: 8)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 656, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 82)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author224", scope: !2, file: !3, line: 2857, type: !426, isLocal: true, isDefinition: true, align: 8)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 464, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 58)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author225", scope: !2, file: !3, line: 2858, type: !431, isLocal: true, isDefinition: true, align: 8)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 512, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 64)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description226", scope: !2, file: !3, line: 2859, type: !436, isLocal: true, isDefinition: true, align: 8)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 544, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 68)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file227", scope: !2, file: !3, line: 2860, type: !409, isLocal: true, isDefinition: true, align: 8)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license228", scope: !2, file: !3, line: 2860, type: !443, isLocal: true, isDefinition: true, align: 8)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 168, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 21)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 21, type: !327, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "buggy_sfn_workaround", scope: !2, file: !3, line: 25, type: !327, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "__param_str_buggy_sfn_workaround", scope: !2, file: !3, line: 26, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 240, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 30)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "lut_1000ln_mant", scope: !2, file: !3, line: 2143, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 672, elements: !444)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "__key", scope: !461, file: !3, line: 2760, type: !1191, isLocal: true, isDefinition: true)
!461 = distinct !DISubprogram(name: "dib7000p_init", scope: !3, file: !3, line: 2737, type: !462, scopeLine: 2738, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !816)
!462 = !DISubroutineType(types: !463)
!463 = !{!464, !4349, !318, !4471}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !466)
!466 = !{!467, !481, !768, !4337, !4338, !4339, !4340, !4341, !4342, !4343, !4347, !4348}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !465, file: !51, line: 687, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !469, line: 19, size: 32, elements: !470)
!469 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !468, file: !469, line: 20, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !473, line: 113, baseType: !474)
!473 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !473, line: 111, size: 32, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !474, file: !473, line: 112, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !324, line: 168, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 166, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !478, file: !324, line: 167, baseType: !327, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !465, file: !51, line: 688, baseType: !482, size: 6016, offset: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !483)
!483 = !{!484, !499, !503, !507, !508, !509, !513, !514, !520, !527, !531, !532, !542, !625, !629, !634, !639, !640, !641, !642, !654, !665, !669, !673, !677, !681, !686, !690, !691, !692, !696, !750}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !482, file: !51, line: 436, baseType: !485, size: 1280)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !486)
!486 = !{!487, !491, !492, !493, !494, !495, !496, !497, !498}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !51, line: 339, baseType: !488, size: 1024)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 1024, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !485, file: !51, line: 340, baseType: !331, size: 32, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !485, file: !51, line: 341, baseType: !331, size: 32, offset: 1056)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !485, file: !51, line: 342, baseType: !331, size: 32, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !485, file: !51, line: 343, baseType: !331, size: 32, offset: 1120)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !485, file: !51, line: 344, baseType: !331, size: 32, offset: 1152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !485, file: !51, line: 345, baseType: !331, size: 32, offset: 1184)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !485, file: !51, line: 346, baseType: !331, size: 32, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !485, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !482, file: !51, line: 438, baseType: !500, size: 64, offset: 1280)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 64, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !482, file: !51, line: 440, baseType: !504, size: 64, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !464}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !482, file: !51, line: 441, baseType: !504, size: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !482, file: !51, line: 442, baseType: !504, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !482, file: !51, line: 444, baseType: !510, size: 64, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!327, !464}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !482, file: !51, line: 445, baseType: !510, size: 64, offset: 1600)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !482, file: !51, line: 447, baseType: !515, size: 64, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!327, !464, !518, !327}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !482, file: !51, line: 450, baseType: !521, size: 64, offset: 1728)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!327, !464, !524, !7, !399, !526}
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !324, line: 30, baseType: !525)
!525 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !482, file: !51, line: 457, baseType: !528, size: 64, offset: 1792)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!50, !464}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !482, file: !51, line: 460, baseType: !510, size: 64, offset: 1856)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !482, file: !51, line: 461, baseType: !533, size: 64, offset: 1920)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!327, !464, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !537, file: !51, line: 70, baseType: !327, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !537, file: !51, line: 71, baseType: !327, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !537, file: !51, line: 72, baseType: !327, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !482, file: !51, line: 463, baseType: !543, size: 64, offset: 1984)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!327, !464, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !618, !619, !620, !621, !622, !623, !624}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !547, file: !51, line: 587, baseType: !331, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !547, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !547, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !547, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !547, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !547, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !547, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !547, file: !51, line: 595, baseType: !331, size: 32, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !547, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !547, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !547, file: !51, line: 598, baseType: !331, size: 32, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !547, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !547, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !547, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !547, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !547, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !547, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !547, file: !51, line: 610, baseType: !318, size: 8, offset: 544)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !547, file: !51, line: 611, baseType: !318, size: 8, offset: 552)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !547, file: !51, line: 612, baseType: !318, size: 8, offset: 560)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !547, file: !51, line: 613, baseType: !331, size: 32, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !547, file: !51, line: 614, baseType: !331, size: 32, offset: 608)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !547, file: !51, line: 615, baseType: !318, size: 8, offset: 640)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !547, file: !51, line: 621, baseType: !573, size: 384, offset: 672)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 384, elements: !580)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !51, line: 616, size: 128, elements: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !574, file: !51, line: 617, baseType: !318, size: 8)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !574, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !574, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !574, file: !51, line: 620, baseType: !318, size: 8, offset: 96)
!580 = !{!581}
!581 = !DISubrange(count: 3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !547, file: !51, line: 624, baseType: !331, size: 32, offset: 1056)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !547, file: !51, line: 627, baseType: !331, size: 32, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !547, file: !51, line: 630, baseType: !318, size: 8, offset: 1120)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !547, file: !51, line: 631, baseType: !318, size: 8, offset: 1128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !547, file: !51, line: 632, baseType: !318, size: 8, offset: 1136)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !547, file: !51, line: 633, baseType: !318, size: 8, offset: 1144)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !547, file: !51, line: 634, baseType: !318, size: 8, offset: 1152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !547, file: !51, line: 635, baseType: !318, size: 8, offset: 1160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !547, file: !51, line: 637, baseType: !318, size: 8, offset: 1168)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !547, file: !51, line: 638, baseType: !318, size: 8, offset: 1176)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !547, file: !51, line: 639, baseType: !318, size: 8, offset: 1184)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !547, file: !51, line: 640, baseType: !318, size: 8, offset: 1192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !547, file: !51, line: 641, baseType: !318, size: 8, offset: 1200)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !547, file: !51, line: 642, baseType: !318, size: 8, offset: 1208)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !547, file: !51, line: 643, baseType: !318, size: 8, offset: 1216)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !547, file: !51, line: 644, baseType: !318, size: 8, offset: 1224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !547, file: !51, line: 645, baseType: !318, size: 8, offset: 1232)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !547, file: !51, line: 647, baseType: !331, size: 32, offset: 1248)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !547, file: !51, line: 650, baseType: !601, size: 296, offset: 1280)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !601, file: !6, line: 826, baseType: !320, size: 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !601, file: !6, line: 827, baseType: !605, size: 288, offset: 8)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 288, elements: !616)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !606, file: !6, line: 804, baseType: !320, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !606, file: !6, line: 805, baseType: !610, size: 64, offset: 8)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !6, line: 805, size: 64, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !610, file: !6, line: 806, baseType: !336, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !610, file: !6, line: 807, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !321, line: 30, baseType: !615)
!615 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!616 = !{!617}
!617 = !DISubrange(count: 4)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !547, file: !51, line: 651, baseType: !601, size: 296, offset: 1576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !547, file: !51, line: 652, baseType: !601, size: 296, offset: 1872)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !547, file: !51, line: 653, baseType: !601, size: 296, offset: 2168)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !547, file: !51, line: 654, baseType: !601, size: 296, offset: 2464)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !547, file: !51, line: 655, baseType: !601, size: 296, offset: 2760)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !547, file: !51, line: 656, baseType: !601, size: 296, offset: 3056)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !547, file: !51, line: 657, baseType: !601, size: 296, offset: 3352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !482, file: !51, line: 466, baseType: !626, size: 64, offset: 2048)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!327, !464, !526}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !482, file: !51, line: 467, baseType: !630, size: 64, offset: 2112)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!327, !464, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !482, file: !51, line: 468, baseType: !635, size: 64, offset: 2176)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!327, !464, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !482, file: !51, line: 469, baseType: !635, size: 64, offset: 2240)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !482, file: !51, line: 470, baseType: !630, size: 64, offset: 2304)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !482, file: !51, line: 472, baseType: !510, size: 64, offset: 2368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !482, file: !51, line: 473, baseType: !643, size: 64, offset: 2432)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!327, !464, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !648)
!648 = !{!649, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !647, file: !6, line: 174, baseType: !650, size: 48)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 48, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 6)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !647, file: !6, line: 175, baseType: !320, size: 8, offset: 48)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !482, file: !51, line: 474, baseType: !655, size: 64, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!327, !464, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !660)
!660 = !{!661, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !659, file: !6, line: 196, baseType: !662, size: 32)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 32, elements: !616)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !659, file: !6, line: 197, baseType: !320, size: 8, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !659, file: !6, line: 198, baseType: !327, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !482, file: !51, line: 475, baseType: !666, size: 64, offset: 2560)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!327, !464, !171}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !482, file: !51, line: 477, baseType: !670, size: 64, offset: 2624)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!327, !464, !78}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !482, file: !51, line: 478, baseType: !674, size: 64, offset: 2688)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!327, !464, !73}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !482, file: !51, line: 480, baseType: !678, size: 64, offset: 2752)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!327, !464, !333}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !482, file: !51, line: 481, baseType: !682, size: 64, offset: 2816)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!327, !464, !685}
!685 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !482, file: !51, line: 482, baseType: !687, size: 64, offset: 2880)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!327, !464, !327}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !482, file: !51, line: 483, baseType: !687, size: 64, offset: 2944)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !482, file: !51, line: 484, baseType: !510, size: 64, offset: 3008)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !482, file: !51, line: 490, baseType: !693, size: 64, offset: 3072)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!175, !464}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !482, file: !51, line: 492, baseType: !697, size: 2304, offset: 3136)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !698)
!698 = !{!699, !709, !710, !711, !712, !713, !714, !715, !726, !730, !731, !732, !733, !734, !735, !740, !745, !749}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !697, file: !51, line: 228, baseType: !700, size: 1216)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !700, file: !51, line: 89, baseType: !488, size: 1024)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !700, file: !51, line: 91, baseType: !331, size: 32, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !700, file: !51, line: 92, baseType: !331, size: 32, offset: 1056)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !700, file: !51, line: 93, baseType: !331, size: 32, offset: 1088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !700, file: !51, line: 95, baseType: !331, size: 32, offset: 1120)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !700, file: !51, line: 96, baseType: !331, size: 32, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !700, file: !51, line: 97, baseType: !331, size: 32, offset: 1184)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !697, file: !51, line: 230, baseType: !504, size: 64, offset: 1216)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !697, file: !51, line: 231, baseType: !510, size: 64, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !697, file: !51, line: 232, baseType: !510, size: 64, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !697, file: !51, line: 233, baseType: !510, size: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !697, file: !51, line: 234, baseType: !510, size: 64, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !697, file: !51, line: 237, baseType: !510, size: 64, offset: 1536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !697, file: !51, line: 238, baseType: !716, size: 64, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!327, !464, !719}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !720, file: !51, line: 115, baseType: !7, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !720, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !720, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !720, file: !51, line: 118, baseType: !335, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !697, file: !51, line: 240, baseType: !727, size: 64, offset: 1664)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!327, !464, !317}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !697, file: !51, line: 242, baseType: !630, size: 64, offset: 1728)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !697, file: !51, line: 243, baseType: !630, size: 64, offset: 1792)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !697, file: !51, line: 244, baseType: !630, size: 64, offset: 1856)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !697, file: !51, line: 248, baseType: !630, size: 64, offset: 1920)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !697, file: !51, line: 249, baseType: !635, size: 64, offset: 1984)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !697, file: !51, line: 250, baseType: !736, size: 64, offset: 2048)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!327, !464, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !697, file: !51, line: 258, baseType: !741, size: 64, offset: 2112)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!327, !464, !744, !327}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !697, file: !51, line: 267, baseType: !746, size: 64, offset: 2176)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!327, !464, !331}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !697, file: !51, line: 268, baseType: !746, size: 64, offset: 2240)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !482, file: !51, line: 493, baseType: !751, size: 576, offset: 5440)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !752)
!752 = !{!753, !757, !761, !762, !763, !764, !765, !766, !767}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !751, file: !51, line: 304, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !754, file: !51, line: 277, baseType: !368, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !751, file: !51, line: 306, baseType: !758, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !464, !719}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !751, file: !51, line: 308, baseType: !635, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !751, file: !51, line: 309, baseType: !736, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !751, file: !51, line: 310, baseType: !504, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !751, file: !51, line: 311, baseType: !504, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !751, file: !51, line: 312, baseType: !504, size: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !751, file: !51, line: 313, baseType: !687, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !751, file: !51, line: 316, baseType: !727, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !465, file: !51, line: 689, baseType: !769, size: 64, offset: 6080)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !771)
!771 = !{!772, !773, !779, !780, !781, !783, !784, !4315, !4316, !4317, !4336}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !770, file: !272, line: 102, baseType: !327, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !770, file: !272, line: 103, baseType: !774, size: 128, offset: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !324, line: 178, size: 128, elements: !775)
!775 = !{!776, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !774, file: !324, line: 179, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !774, file: !324, line: 179, baseType: !777, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !770, file: !272, line: 104, baseType: !774, size: 128, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !272, line: 105, baseType: !346, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !770, file: !272, line: 106, baseType: !782, size: 48, offset: 384)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 48, elements: !651)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !770, file: !272, line: 107, baseType: !317, size: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !770, file: !272, line: 109, baseType: !785, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !787)
!787 = !{!788, !3772, !3773, !3776, !3777, !3828, !3916, !3917, !3918, !3919, !3920, !3929, !4034, !4047, !4242, !4243, !4247, !4249, !4250, !4251, !4255, !4261, !4262, !4265, !4266, !4267, !4268, !4269, !4270, !4271, !4303, !4304, !4305, !4308, !4311, !4312, !4313, !4314}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !786, file: !237, line: 462, baseType: !789, size: 512)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !790, line: 64, size: 512, elements: !791)
!790 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!791 = !{!792, !793, !794, !796, !851, !3627, !3766, !3767, !3768, !3769, !3770, !3771}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !790, line: 65, baseType: !346, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !789, file: !790, line: 66, baseType: !774, size: 128, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !789, file: !790, line: 67, baseType: !795, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !789, file: !790, line: 68, baseType: !797, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !790, line: 192, size: 704, elements: !799)
!799 = !{!800, !801, !817, !818}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !798, file: !790, line: 193, baseType: !774, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !798, file: !790, line: 194, baseType: !802, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !803, line: 83, baseType: !804)
!803 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !803, line: 71, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, scope: !804, file: !803, line: 72, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !804, file: !803, line: 72, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !807, file: !803, line: 73, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !803, line: 20, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !810, file: !803, line: 21, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !814, line: 25, baseType: !815)
!814 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 25, elements: !816)
!816 = !{}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !798, file: !790, line: 195, baseType: !789, size: 512, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !798, file: !790, line: 196, baseType: !819, size: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !790, line: 156, size: 192, elements: !822)
!822 = !{!823, !828, !833}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !821, file: !790, line: 157, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!327, !797, !795}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !790, line: 158, baseType: !829, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!346, !797, !795}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !821, file: !790, line: 159, baseType: !834, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!327, !797, !795, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !790, line: 148, size: 20736, elements: !840)
!840 = !{!841, !843, !845, !846, !850}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !839, file: !790, line: 149, baseType: !842, size: 192)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 192, elements: !580)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !839, file: !790, line: 150, baseType: !844, size: 4096, offset: 192)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 4096, elements: !432)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !839, file: !790, line: 151, baseType: !327, size: 32, offset: 4288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !839, file: !790, line: 152, baseType: !847, size: 16384, offset: 4320)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 16384, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 2048)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !839, file: !790, line: 153, baseType: !327, size: 32, offset: 20704)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !789, file: !790, line: 69, baseType: !852, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !790, line: 138, size: 448, elements: !854)
!854 = !{!855, !859, !886, !888, !3589, !3617, !3621}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !853, file: !790, line: 139, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !795}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !853, file: !790, line: 140, baseType: !860, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !863, line: 230, size: 128, elements: !864)
!863 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!864 = !{!865, !879}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !862, file: !863, line: 231, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!869, !795, !873, !368}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !324, line: 60, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !871, line: 73, baseType: !872)
!871 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !871, line: 15, baseType: !333)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !863, line: 30, size: 128, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !863, line: 31, baseType: !346, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !874, file: !863, line: 32, baseType: !878, size: 16, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !324, line: 19, baseType: !330)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !862, file: !863, line: 232, baseType: !880, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!869, !795, !873, !346, !883}
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !324, line: 55, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !871, line: 72, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !871, line: 16, baseType: !685)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !853, file: !790, line: 141, baseType: !887, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !853, file: !790, line: 142, baseType: !889, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !863, line: 84, size: 320, elements: !893)
!893 = !{!894, !895, !899, !3586, !3587}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !892, file: !863, line: 85, baseType: !346, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !892, file: !863, line: 86, baseType: !896, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!878, !795, !873, !327}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !892, file: !863, line: 88, baseType: !900, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!878, !795, !903, !327}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !863, line: 168, size: 448, elements: !905)
!905 = !{!906, !907, !908, !909, !3581, !3582}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !904, file: !863, line: 169, baseType: !874, size: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !904, file: !863, line: 170, baseType: !883, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !904, file: !863, line: 171, baseType: !317, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !904, file: !863, line: 172, baseType: !910, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!869, !913, !795, !903, !368, !1079, !883}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !915)
!915 = !{!916, !934, !3546, !3547, !3548, !3549, !3550, !3551, !3552, !3553, !3554, !3555, !3564, !3565, !3574, !3575, !3576, !3577, !3578, !3579, !3580}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !914, file: !208, line: 920, baseType: !917, size: 128)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !914, file: !208, line: 917, size: 128, elements: !918)
!918 = !{!919, !925}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !917, file: !208, line: 918, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !921, line: 58, size: 64, elements: !922)
!921 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !921, line: 59, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !917, file: !208, line: 919, baseType: !926, size: 128, align: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !324, line: 216, size: 128, align: 64, elements: !927)
!927 = !{!928, !930}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !926, file: !324, line: 217, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !926, file: !324, line: 218, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !929}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !914, file: !208, line: 921, baseType: !935, size: 128, offset: 128)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !936, line: 8, size: 128, elements: !937)
!936 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!937 = !{!938, !942}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !935, file: !936, line: 9, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !941, line: 18, flags: DIFlagFwdDecl)
!941 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !935, file: !936, line: 10, baseType: !943, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !941, line: 89, size: 1536, elements: !945)
!945 = !{!946, !947, !957, !965, !966, !981, !3515, !3517, !3529, !3530, !3531, !3532, !3533, !3538, !3539, !3540}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !944, file: !941, line: 91, baseType: !7, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !944, file: !941, line: 92, baseType: !948, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !949, line: 277, baseType: !950)
!949 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !949, line: 277, size: 32, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !950, file: !949, line: 277, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !949, line: 70, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !949, line: 65, size: 32, elements: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !954, file: !949, line: 66, baseType: !7, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !944, file: !941, line: 93, baseType: !958, size: 128, offset: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !959, line: 38, size: 128, elements: !960)
!959 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!960 = !{!961, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !959, line: 39, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !958, file: !959, line: 39, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !944, file: !941, line: 94, baseType: !943, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !944, file: !941, line: 95, baseType: !967, size: 128, offset: 256)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !941, line: 47, size: 128, elements: !968)
!968 = !{!969, !978}
!969 = !DIDerivedType(tag: DW_TAG_member, scope: !967, file: !941, line: 48, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !967, file: !941, line: 48, size: 64, elements: !971)
!971 = !{!972, !977}
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !970, file: !941, line: 49, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !970, file: !941, line: 49, size: 64, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !973, file: !941, line: 50, baseType: !331, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !973, file: !941, line: 50, baseType: !331, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !970, file: !941, line: 52, baseType: !335, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !941, line: 54, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !944, file: !941, line: 96, baseType: !982, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !984)
!984 = !{!985, !986, !987, !995, !1002, !1003, !1144, !3209, !3210, !3211, !3217, !3218, !3219, !3220, !3221, !3222, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3230, !3231, !3232, !3233, !3234, !3235, !3236, !3241, !3242, !3243, !3244, !3245, !3246, !3247, !3483, !3491, !3492, !3493, !3511, !3512, !3513, !3514}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !983, file: !208, line: 611, baseType: !878, size: 16)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !983, file: !208, line: 612, baseType: !330, size: 16, offset: 16)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !983, file: !208, line: 613, baseType: !988, size: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !989, line: 23, baseType: !990)
!989 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !989, line: 21, size: 32, elements: !991)
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !990, file: !989, line: 22, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !324, line: 32, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !871, line: 49, baseType: !7)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !983, file: !208, line: 614, baseType: !996, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !989, line: 28, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !989, line: 26, size: 32, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !997, file: !989, line: 27, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !324, line: 33, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !871, line: 50, baseType: !7)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !983, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !983, file: !208, line: 622, baseType: !1004, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !1007)
!1007 = !{!1008, !1012, !1022, !1026, !1032, !1036, !1040, !1044, !1048, !1052, !1056, !1057, !1063, !1067, !1091, !1120, !1124, !1130, !1135, !1139, !1140}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !1006, file: !208, line: 1865, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!943, !982, !943, !7}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !1006, file: !208, line: 1866, baseType: !1013, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!346, !943, !982, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !1018, line: 10, size: 128, elements: !1019)
!1018 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1017, file: !1018, line: 11, baseType: !370, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1017, file: !1018, line: 12, baseType: !317, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !1006, file: !208, line: 1867, baseType: !1023, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!327, !982, !327}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !1006, file: !208, line: 1868, baseType: !1027, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1030, !982, !327}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !1006, file: !208, line: 1870, baseType: !1033, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!327, !943, !368, !327}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !1006, file: !208, line: 1872, baseType: !1037, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!327, !982, !943, !878, !524}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1006, file: !208, line: 1873, baseType: !1041, size: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!327, !943, !982, !943}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !1006, file: !208, line: 1874, baseType: !1045, size: 64, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!327, !982, !943}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !1006, file: !208, line: 1875, baseType: !1049, size: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!327, !982, !943, !346}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !1006, file: !208, line: 1876, baseType: !1053, size: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!327, !982, !943, !878}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !1006, file: !208, line: 1877, baseType: !1045, size: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !1006, file: !208, line: 1878, baseType: !1058, size: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!327, !982, !943, !878, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !324, line: 16, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !324, line: 13, baseType: !331)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !1006, file: !208, line: 1879, baseType: !1064, size: 64, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!327, !982, !943, !982, !943, !7}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !1006, file: !208, line: 1881, baseType: !1068, size: 64, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!327, !943, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1081, !1088, !1089, !1090}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1072, file: !208, line: 220, baseType: !7, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1072, file: !208, line: 221, baseType: !878, size: 16, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1072, file: !208, line: 222, baseType: !988, size: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1072, file: !208, line: 223, baseType: !996, size: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1072, file: !208, line: 224, baseType: !1079, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !324, line: 46, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !871, line: 88, baseType: !615)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1072, file: !208, line: 225, baseType: !1082, size: 128, offset: 192)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1083, line: 13, size: 128, elements: !1084)
!1083 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1084 = !{!1085, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1082, file: !1083, line: 14, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1083, line: 8, baseType: !614)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1082, file: !1083, line: 15, baseType: !333, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1072, file: !208, line: 226, baseType: !1082, size: 128, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1072, file: !208, line: 227, baseType: !1082, size: 128, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1072, file: !208, line: 234, baseType: !913, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !1006, file: !208, line: 1882, baseType: !1092, size: 64, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!327, !1095, !1097, !331, !7}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1099, line: 22, size: 1152, elements: !1100)
!1099 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1100 = !{!1101, !1102, !1103, !1104, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1098, file: !1099, line: 23, baseType: !331, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1098, file: !1099, line: 24, baseType: !878, size: 16, offset: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1098, file: !1099, line: 25, baseType: !7, size: 32, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1098, file: !1099, line: 26, baseType: !1105, size: 32, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !324, line: 104, baseType: !331)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1098, file: !1099, line: 27, baseType: !335, size: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1098, file: !1099, line: 28, baseType: !335, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1098, file: !1099, line: 37, baseType: !335, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1098, file: !1099, line: 38, baseType: !1061, size: 32, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1098, file: !1099, line: 39, baseType: !1061, size: 32, offset: 352)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1098, file: !1099, line: 40, baseType: !988, size: 32, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1098, file: !1099, line: 41, baseType: !996, size: 32, offset: 416)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !1099, line: 42, baseType: !1079, size: 64, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1098, file: !1099, line: 43, baseType: !1082, size: 128, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1098, file: !1099, line: 44, baseType: !1082, size: 128, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1098, file: !1099, line: 45, baseType: !1082, size: 128, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1098, file: !1099, line: 46, baseType: !1082, size: 128, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1098, file: !1099, line: 47, baseType: !335, size: 64, offset: 1024)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1098, file: !1099, line: 48, baseType: !335, size: 64, offset: 1088)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !1006, file: !208, line: 1883, baseType: !1121, size: 64, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!869, !943, !368, !883}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !1006, file: !208, line: 1884, baseType: !1125, size: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!327, !982, !1128, !335, !335}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !1006, file: !208, line: 1886, baseType: !1131, size: 64, offset: 1088)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!327, !982, !1134, !327}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !1006, file: !208, line: 1887, baseType: !1136, size: 64, offset: 1152)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!327, !982, !943, !913, !7, !878}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1006, file: !208, line: 1890, baseType: !1053, size: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !1006, file: !208, line: 1891, baseType: !1141, size: 64, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!327, !982, !1030, !327}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !983, file: !208, line: 623, baseType: !1145, size: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1200, !2817, !2899, !2982, !2986, !2987, !2988, !2989, !2990, !2991, !2992, !2993, !2998, !3002, !3003, !3006, !3007, !3010, !3011, !3012, !3053, !3079, !3080, !3081, !3082, !3083, !3084, !3087, !3089, !3096, !3097, !3099, !3100, !3101, !3160, !3161, !3176, !3177, !3178, !3179, !3180, !3183, !3184, !3185, !3200, !3201, !3202, !3203, !3204, !3205, !3206, !3207, !3208}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1146, file: !208, line: 1417, baseType: !774, size: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1146, file: !208, line: 1418, baseType: !1061, size: 32, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1146, file: !208, line: 1419, baseType: !322, size: 8, offset: 160)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1146, file: !208, line: 1420, baseType: !685, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1146, file: !208, line: 1421, baseType: !1079, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1146, file: !208, line: 1422, baseType: !1154, size: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1166, !1170, !1174, !1178, !1179, !1180, !1190, !1193, !1194, !1195, !1197, !1198, !1199}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1155, file: !208, line: 2229, baseType: !346, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1155, file: !208, line: 2230, baseType: !327, size: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1155, file: !208, line: 2238, baseType: !1160, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!327, !1163}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1165, line: 28, flags: DIFlagFwdDecl)
!1165 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1155, file: !208, line: 2239, baseType: !1167, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1169 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1155, file: !208, line: 2240, baseType: !1171, size: 64, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!943, !1154, !327, !346, !317}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1155, file: !208, line: 2242, baseType: !1175, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !1145}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1155, file: !208, line: 2243, baseType: !350, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1155, file: !208, line: 2244, baseType: !1154, size: 64, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1155, file: !208, line: 2245, baseType: !1181, size: 64, offset: 512)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !324, line: 182, size: 64, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1181, file: !324, line: 183, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !324, line: 186, size: 128, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1185, file: !324, line: 187, baseType: !1184, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1185, file: !324, line: 187, baseType: !1189, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1155, file: !208, line: 2247, baseType: !1191, offset: 576)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1192, line: 187, elements: !816)
!1192 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1155, file: !208, line: 2248, baseType: !1191, offset: 576)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1155, file: !208, line: 2249, baseType: !1191, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1155, file: !208, line: 2250, baseType: !1196, offset: 576)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, elements: !580)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1155, file: !208, line: 2252, baseType: !1191, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1155, file: !208, line: 2253, baseType: !1191, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1155, file: !208, line: 2254, baseType: !1191, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1146, file: !208, line: 1423, baseType: !1201, size: 64, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1204)
!1204 = !{!1205, !1209, !1213, !1214, !1218, !1224, !1228, !1229, !1230, !1234, !1238, !1239, !1240, !1241, !1247, !1252, !1253, !1260, !1261, !1262, !1263, !2801, !2816}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1203, file: !208, line: 1936, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!982, !1145}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1203, file: !208, line: 1937, baseType: !1210, size: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{null, !982}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1203, file: !208, line: 1938, baseType: !1210, size: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1203, file: !208, line: 1940, baseType: !1215, size: 64, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !982, !327}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1203, file: !208, line: 1941, baseType: !1219, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!327, !982, !1222}
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1203, file: !208, line: 1942, baseType: !1225, size: 64, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!327, !982}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1203, file: !208, line: 1943, baseType: !1210, size: 64, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1203, file: !208, line: 1944, baseType: !1175, size: 64, offset: 448)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1203, file: !208, line: 1945, baseType: !1231, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!327, !1145, !327}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1203, file: !208, line: 1946, baseType: !1235, size: 64, offset: 576)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!327, !1145}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1203, file: !208, line: 1947, baseType: !1235, size: 64, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1203, file: !208, line: 1948, baseType: !1235, size: 64, offset: 704)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1203, file: !208, line: 1949, baseType: !1235, size: 64, offset: 768)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1203, file: !208, line: 1950, baseType: !1242, size: 64, offset: 832)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!327, !943, !1245}
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1203, file: !208, line: 1951, baseType: !1248, size: 64, offset: 896)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!327, !1145, !1251, !368}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1203, file: !208, line: 1952, baseType: !1175, size: 64, offset: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1203, file: !208, line: 1954, baseType: !1254, size: 64, offset: 1024)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!327, !1257, !943}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1259, line: 539, flags: DIFlagFwdDecl)
!1259 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1203, file: !208, line: 1955, baseType: !1254, size: 64, offset: 1088)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1203, file: !208, line: 1956, baseType: !1254, size: 64, offset: 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1203, file: !208, line: 1957, baseType: !1254, size: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1203, file: !208, line: 1963, baseType: !1264, size: 64, offset: 1280)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!327, !1145, !1267, !323}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1269, line: 68, size: 512, align: 128, elements: !1270)
!1269 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1270 = !{!1271, !1272, !2793, !2800}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1268, file: !1269, line: 69, baseType: !685, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, scope: !1268, file: !1269, line: 77, baseType: !1273, size: 320, offset: 64)
!1273 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1268, file: !1269, line: 77, size: 320, elements: !1274)
!1274 = !{!1275, !1456, !1461, !1489, !1497, !1503, !2785, !2792}
!1275 = !DIDerivedType(tag: DW_TAG_member, scope: !1273, file: !1269, line: 78, baseType: !1276, size: 320)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1273, file: !1269, line: 78, size: 320, elements: !1277)
!1277 = !{!1278, !1279, !1454, !1455}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1276, file: !1269, line: 84, baseType: !774, size: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1276, file: !1269, line: 86, baseType: !1280, size: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1291, !1292, !1293, !1308, !1324, !1325, !1326, !1327, !1447, !1448, !1451, !1452, !1453}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1281, file: !208, line: 452, baseType: !982, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1281, file: !208, line: 453, baseType: !1285, size: 128, offset: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1286, line: 292, size: 128, elements: !1287)
!1286 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1285, file: !1286, line: 293, baseType: !802)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1285, file: !1286, line: 295, baseType: !323, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1285, file: !1286, line: 296, baseType: !317, size: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1281, file: !208, line: 454, baseType: !323, size: 32, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1281, file: !208, line: 455, baseType: !477, size: 32, offset: 224)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1281, file: !208, line: 460, baseType: !1294, size: 128, offset: 256)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1295, line: 125, size: 128, elements: !1296)
!1295 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1296 = !{!1297, !1307}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1294, file: !1295, line: 126, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1295, line: 31, size: 64, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1298, file: !1295, line: 32, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1295, line: 24, size: 192, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1302, file: !1295, line: 25, baseType: !685, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1302, file: !1295, line: 26, baseType: !1301, size: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1302, file: !1295, line: 27, baseType: !1301, size: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1294, file: !1295, line: 127, baseType: !1301, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1281, file: !208, line: 461, baseType: !1309, size: 256, offset: 384)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1310, line: 35, size: 256, elements: !1311)
!1310 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1311 = !{!1312, !1320, !1321, !1323}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1309, file: !1310, line: 36, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1314, line: 13, baseType: !1315)
!1314 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !324, line: 175, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 173, size: 64, elements: !1317)
!1317 = !{!1318}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1316, file: !324, line: 174, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !319, line: 22, baseType: !614)
