; ModuleID = '../bcout/drivers/media/dvb-frontends/dvb-pll.llvm.bc'
source_filename = "drivers/media/dvb-frontends/dvb-pll.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_dvb_pll_driver_init6:\09\09\09"
module asm ".long\09dvb_pll_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.kparam_array = type { i32, i32, i32*, %struct.kernel_param_ops*, i8* }
%struct.ida = type { %struct.xarray }
%struct.xarray = type { %struct.spinlock, i32, i8* }
%struct.spinlock = type { %union.anon.6 }
%union.anon.6 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.dvb_pll_desc = type { i8*, i32, i32, i32, void (%struct.dvb_frontend*, i8*)*, i8*, i8*, i8*, i32, [0 x %struct.anon.67] }
%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }
%struct.kref = type { %struct.refcount_struct }

!252 = !{!253, !254, !255, !256}
!253 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !258, line: 76, baseType: !7, size: 32, elements: !259)
!258 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!260 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!265 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!266 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!267 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!268 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!269 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!270 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dvb_device_type", file: !272, line: 57, baseType: !7, size: 32, elements: !273)
!272 = !DIFile(filename: "./include/media/dvbdev.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282}
!274 = !DIEnumerator(name: "DVB_DEVICE_SEC", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "DVB_DEVICE_FRONTEND", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "DVB_DEVICE_DEMUX", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "DVB_DEVICE_DVR", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "DVB_DEVICE_CA", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "DVB_DEVICE_NET", value: 5, isUnsigned: true)
!280 = !DIEnumerator(name: "DVB_DEVICE_VIDEO", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !284, line: 305, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !287, !288, !289}
!286 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "i2c_alert_protocol", file: !291, line: 215, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "./include/linux/i2c.h", directory: "/home/lizy2001/genbc/linux")
!292 = !{!293, !294}
!293 = !DIEnumerator(name: "I2C_PROTOCOL_SMBUS_ALERT", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "I2C_PROTOCOL_SMBUS_HOST_NOTIFY", value: 1, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_prop_type", file: !296, line: 19, baseType: !7, size: 32, elements: !297)
!296 = !DIFile(filename: "./include/linux/property.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIEnumerator(name: "DEV_PROP_U8", value: 0, isUnsigned: true)
!299 = !DIEnumerator(name: "DEV_PROP_U16", value: 1, isUnsigned: true)
!300 = !DIEnumerator(name: "DEV_PROP_U32", value: 2, isUnsigned: true)
!301 = !DIEnumerator(name: "DEV_PROP_U64", value: 3, isUnsigned: true)
!302 = !DIEnumerator(name: "DEV_PROP_STRING", value: 4, isUnsigned: true)
!303 = !DIEnumerator(name: "DEV_PROP_REF", value: 5, isUnsigned: true)
!304 = !{!305, !307, !308, !309, !7}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !306, line: 148, baseType: !7)
!306 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!307 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !311, line: 76, flags: DIFlagFwdDecl)
!311 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!312 = !{!313, !381, !386, !391, !393, !398, !400, !402, !409, !414, !419, !421, !426, !0, !428, !433, !435, !462, !467, !4364, !4366, !4368, !4370, !4372, !4374, !4376, !4378, !4380, !4382, !4384, !4386, !4388, !4390, !4392, !4394, !4396, !4398, !4400, !4402, !4404, !4406, !4409, !4637}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 41, type: !315, isLocal: true, isDefinition: true, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !317, line: 69, size: 320, elements: !318)
!317 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!318 = !{!319, !323, !324, !344, !351, !355, !359}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 70, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !316, file: !317, line: 71, baseType: !309, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !316, file: !317, line: 72, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !317, line: 47, size: 256, elements: !328)
!328 = !{!329, !330, !335, !340}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !327, file: !317, line: 49, baseType: !7, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !327, file: !317, line: 51, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!307, !320, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !327, file: !317, line: 53, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!307, !339, !334}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !327, file: !317, line: 55, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !308}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !316, file: !317, line: 73, baseType: !345, size: 16, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !347, line: 19, baseType: !348)
!347 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !349, line: 24, baseType: !350)
!349 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!350 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !316, file: !317, line: 74, baseType: !352, size: 8, offset: 208)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !347, line: 16, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !349, line: 20, baseType: !354)
!354 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !317, line: 75, baseType: !356, size: 8, offset: 216)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !347, line: 17, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !349, line: 21, baseType: !358)
!358 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!359 = !DIDerivedType(tag: DW_TAG_member, scope: !316, file: !317, line: 76, baseType: !360, size: 64, offset: 256)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !317, line: 76, size: 64, elements: !361)
!361 = !{!362, !363, !370}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !360, file: !317, line: 77, baseType: !308, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !360, file: !317, line: 78, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !317, line: 86, size: 128, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !366, file: !317, line: 87, baseType: !7, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !366, file: !317, line: 88, baseType: !339, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !360, file: !317, line: 79, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !317, line: 92, size: 256, elements: !374)
!374 = !{!375, !376, !377, !379, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !373, file: !317, line: 94, baseType: !7, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !373, file: !317, line: 95, baseType: !7, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !373, file: !317, line: 96, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !373, file: !317, line: 97, baseType: !325, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !373, file: !317, line: 98, baseType: !308, size: 64, offset: 192)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 41, type: !383, isLocal: true, isDefinition: true, align: 8)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 216, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 27)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 42, type: !388, isLocal: true, isDefinition: true, align: 8)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 392, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 49)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__param_id", scope: !2, file: !3, line: 46, type: !315, isLocal: true, isDefinition: true, align: 64)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_idtype222", scope: !2, file: !3, line: 46, type: !395, isLocal: true, isDefinition: true, align: 8)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 264, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 33)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_id223", scope: !2, file: !3, line: 47, type: !388, isLocal: true, isDefinition: true, align: 8)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_dvb_pll_driver_init225", scope: !2, file: !3, line: 950, type: !308, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "__exitcall_dvb_pll_driver_exit", scope: !2, file: !3, line: 950, type: !404, isLocal: true, isDefinition: true)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !405, line: 117, baseType: !406)
!405 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description226", scope: !2, file: !3, line: 952, type: !411, isLocal: true, isDefinition: true, align: 8)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 288, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 36)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author227", scope: !2, file: !3, line: 953, type: !416, isLocal: true, isDefinition: true, align: 8)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 208, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 26)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file228", scope: !2, file: !3, line: 954, type: !388, isLocal: true, isDefinition: true, align: 8)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license229", scope: !2, file: !3, line: 954, type: !423, isLocal: true, isDefinition: true, align: 8)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 160, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 20)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 40, type: !307, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "__param_str_id", scope: !2, file: !3, line: 46, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 88, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 11)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "__param_arr_id", scope: !2, file: !3, line: 46, type: !372, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "pll_ida", scope: !2, file: !3, line: 38, type: !437, isLocal: true, isDefinition: true)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ida", file: !438, line: 244, size: 128, elements: !439)
!438 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "xa", scope: !437, file: !438, line: 245, baseType: !441, size: 128)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !442, line: 292, size: 128, elements: !443)
!442 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!443 = !{!444, !460, !461}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !441, file: !442, line: 293, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !446, line: 83, baseType: !447)
!446 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !446, line: 71, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !447, file: !446, line: 72, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !446, line: 72, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !450, file: !446, line: 73, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !446, line: 20, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !453, file: !446, line: 21, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !457, line: 25, baseType: !458)
!457 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 25, elements: !459)
!459 = !{}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !441, file: !442, line: 295, baseType: !305, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !441, file: !442, line: 296, baseType: !308, size: 64, offset: 64)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "id", scope: !2, file: !3, line: 44, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 64)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "pll_list", scope: !2, file: !3, line: 568, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 1408, elements: !4362)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_pll_desc", file: !3, line: 51, size: 512, elements: !473)
!473 = !{!474, !475, !478, !479, !480, !4350, !4351, !4352, !4353, !4354}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !3, line: 52, baseType: !320, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !472, file: !3, line: 53, baseType: !476, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !347, line: 21, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !349, line: 27, baseType: !7)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !472, file: !3, line: 54, baseType: !476, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "iffreq", scope: !472, file: !3, line: 55, baseType: !476, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !472, file: !3, line: 56, baseType: !481, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !484, !770}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !486)
!486 = !{!487, !501, !794, !4338, !4339, !4340, !4341, !4342, !4343, !4344, !4348, !4349}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !485, file: !51, line: 687, baseType: !488, size: 32)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !489, line: 19, size: 32, elements: !490)
!489 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !488, file: !489, line: 20, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !493, line: 113, baseType: !494)
!493 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !493, line: 111, size: 32, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !494, file: !493, line: 112, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !306, line: 168, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 166, size: 32, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !498, file: !306, line: 167, baseType: !307, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !485, file: !51, line: 688, baseType: !502, size: 6016, offset: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !503)
!503 = !{!504, !519, !523, !527, !528, !529, !533, !534, !540, !547, !551, !552, !562, !647, !651, !656, !661, !662, !663, !664, !676, !687, !691, !695, !699, !704, !709, !713, !714, !715, !719, !776}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !502, file: !51, line: 436, baseType: !505, size: 1280)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !506)
!506 = !{!507, !511, !512, !513, !514, !515, !516, !517, !518}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !51, line: 339, baseType: !508, size: 1024)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 1024, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !505, file: !51, line: 340, baseType: !476, size: 32, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !505, file: !51, line: 341, baseType: !476, size: 32, offset: 1056)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !505, file: !51, line: 342, baseType: !476, size: 32, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !505, file: !51, line: 343, baseType: !476, size: 32, offset: 1120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !505, file: !51, line: 344, baseType: !476, size: 32, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !505, file: !51, line: 345, baseType: !476, size: 32, offset: 1184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !505, file: !51, line: 346, baseType: !476, size: 32, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !505, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !502, file: !51, line: 438, baseType: !520, size: 64, offset: 1280)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 64, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !502, file: !51, line: 440, baseType: !524, size: 64, offset: 1344)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !484}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !502, file: !51, line: 441, baseType: !524, size: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !502, file: !51, line: 442, baseType: !524, size: 64, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !502, file: !51, line: 444, baseType: !530, size: 64, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!307, !484}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !502, file: !51, line: 445, baseType: !530, size: 64, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !502, file: !51, line: 447, baseType: !535, size: 64, offset: 1664)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!307, !484, !538, !307}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !502, file: !51, line: 450, baseType: !541, size: 64, offset: 1728)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!307, !484, !544, !7, !378, !546}
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !306, line: 30, baseType: !545)
!545 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !502, file: !51, line: 457, baseType: !548, size: 64, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!50, !484}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !502, file: !51, line: 460, baseType: !530, size: 64, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !502, file: !51, line: 461, baseType: !553, size: 64, offset: 1920)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!307, !484, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !558)
!558 = !{!559, !560, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !557, file: !51, line: 70, baseType: !307, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !557, file: !51, line: 71, baseType: !307, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !557, file: !51, line: 72, baseType: !307, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !502, file: !51, line: 463, baseType: !563, size: 64, offset: 1984)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!307, !484, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !640, !641, !642, !643, !644, !645, !646}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !567, file: !51, line: 587, baseType: !476, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !567, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !567, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !567, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !567, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !567, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !567, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !567, file: !51, line: 595, baseType: !476, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !567, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !567, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !567, file: !51, line: 598, baseType: !476, size: 32, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !567, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !567, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !567, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !567, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !567, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !567, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !567, file: !51, line: 610, baseType: !356, size: 8, offset: 544)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !567, file: !51, line: 611, baseType: !356, size: 8, offset: 552)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !567, file: !51, line: 612, baseType: !356, size: 8, offset: 560)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !567, file: !51, line: 613, baseType: !476, size: 32, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !567, file: !51, line: 614, baseType: !476, size: 32, offset: 608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !567, file: !51, line: 615, baseType: !356, size: 8, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !567, file: !51, line: 621, baseType: !593, size: 384, offset: 672)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 384, elements: !600)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !567, file: !51, line: 616, size: 128, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !594, file: !51, line: 617, baseType: !356, size: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !594, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !594, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !594, file: !51, line: 620, baseType: !356, size: 8, offset: 96)
!600 = !{!601}
!601 = !DISubrange(count: 3)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !567, file: !51, line: 624, baseType: !476, size: 32, offset: 1056)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !567, file: !51, line: 627, baseType: !476, size: 32, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !567, file: !51, line: 630, baseType: !356, size: 8, offset: 1120)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !567, file: !51, line: 631, baseType: !356, size: 8, offset: 1128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !567, file: !51, line: 632, baseType: !356, size: 8, offset: 1136)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !567, file: !51, line: 633, baseType: !356, size: 8, offset: 1144)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !567, file: !51, line: 634, baseType: !356, size: 8, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !567, file: !51, line: 635, baseType: !356, size: 8, offset: 1160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !567, file: !51, line: 637, baseType: !356, size: 8, offset: 1168)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !567, file: !51, line: 638, baseType: !356, size: 8, offset: 1176)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !567, file: !51, line: 639, baseType: !356, size: 8, offset: 1184)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !567, file: !51, line: 640, baseType: !356, size: 8, offset: 1192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !567, file: !51, line: 641, baseType: !356, size: 8, offset: 1200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !567, file: !51, line: 642, baseType: !356, size: 8, offset: 1208)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !567, file: !51, line: 643, baseType: !356, size: 8, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !567, file: !51, line: 644, baseType: !356, size: 8, offset: 1224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !567, file: !51, line: 645, baseType: !356, size: 8, offset: 1232)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !567, file: !51, line: 647, baseType: !476, size: 32, offset: 1248)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !567, file: !51, line: 650, baseType: !621, size: 296, offset: 1280)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !621, file: !6, line: 826, baseType: !357, size: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !621, file: !6, line: 827, baseType: !625, size: 288, offset: 8)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 288, elements: !638)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !626, file: !6, line: 804, baseType: !357, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, scope: !626, file: !6, line: 805, baseType: !630, size: 64, offset: 8)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !626, file: !6, line: 805, size: 64, elements: !631)
!631 = !{!632, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !630, file: !6, line: 806, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !349, line: 31, baseType: !634)
!634 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !630, file: !6, line: 807, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !349, line: 30, baseType: !637)
!637 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!638 = !{!639}
!639 = !DISubrange(count: 4)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !567, file: !51, line: 651, baseType: !621, size: 296, offset: 1576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !567, file: !51, line: 652, baseType: !621, size: 296, offset: 1872)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !567, file: !51, line: 653, baseType: !621, size: 296, offset: 2168)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !567, file: !51, line: 654, baseType: !621, size: 296, offset: 2464)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !567, file: !51, line: 655, baseType: !621, size: 296, offset: 2760)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !567, file: !51, line: 656, baseType: !621, size: 296, offset: 3056)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !567, file: !51, line: 657, baseType: !621, size: 296, offset: 3352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !502, file: !51, line: 466, baseType: !648, size: 64, offset: 2048)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!307, !484, !546}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !502, file: !51, line: 467, baseType: !652, size: 64, offset: 2112)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!307, !484, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !502, file: !51, line: 468, baseType: !657, size: 64, offset: 2176)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!307, !484, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !502, file: !51, line: 469, baseType: !657, size: 64, offset: 2240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !502, file: !51, line: 470, baseType: !652, size: 64, offset: 2304)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !502, file: !51, line: 472, baseType: !530, size: 64, offset: 2368)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !502, file: !51, line: 473, baseType: !665, size: 64, offset: 2432)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!307, !484, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !670)
!670 = !{!671, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !669, file: !6, line: 174, baseType: !672, size: 48)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 48, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 6)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !669, file: !6, line: 175, baseType: !357, size: 8, offset: 48)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !502, file: !51, line: 474, baseType: !677, size: 64, offset: 2496)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!307, !484, !680}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !682)
!682 = !{!683, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !681, file: !6, line: 196, baseType: !684, size: 32)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 32, elements: !638)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !681, file: !6, line: 197, baseType: !357, size: 8, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !681, file: !6, line: 198, baseType: !307, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !502, file: !51, line: 475, baseType: !688, size: 64, offset: 2560)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!307, !484, !171}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !502, file: !51, line: 477, baseType: !692, size: 64, offset: 2624)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!307, !484, !78}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !502, file: !51, line: 478, baseType: !696, size: 64, offset: 2688)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!307, !484, !73}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !502, file: !51, line: 480, baseType: !700, size: 64, offset: 2752)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!307, !484, !703}
!703 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !502, file: !51, line: 481, baseType: !705, size: 64, offset: 2816)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!307, !484, !708}
!708 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !502, file: !51, line: 482, baseType: !710, size: 64, offset: 2880)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!307, !484, !307}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !502, file: !51, line: 483, baseType: !710, size: 64, offset: 2944)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !502, file: !51, line: 484, baseType: !530, size: 64, offset: 3008)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !502, file: !51, line: 490, baseType: !716, size: 64, offset: 3072)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!175, !484}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !502, file: !51, line: 492, baseType: !720, size: 2304, offset: 3136)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !721)
!721 = !{!722, !732, !733, !734, !735, !736, !737, !738, !750, !754, !755, !756, !757, !758, !759, !766, !771, !775}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !720, file: !51, line: 228, baseType: !723, size: 1216)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !51, line: 89, baseType: !508, size: 1024)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !723, file: !51, line: 91, baseType: !476, size: 32, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !723, file: !51, line: 92, baseType: !476, size: 32, offset: 1056)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !723, file: !51, line: 93, baseType: !476, size: 32, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !723, file: !51, line: 95, baseType: !476, size: 32, offset: 1120)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !723, file: !51, line: 96, baseType: !476, size: 32, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !723, file: !51, line: 97, baseType: !476, size: 32, offset: 1184)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !720, file: !51, line: 230, baseType: !524, size: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !720, file: !51, line: 231, baseType: !530, size: 64, offset: 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !720, file: !51, line: 232, baseType: !530, size: 64, offset: 1344)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !720, file: !51, line: 233, baseType: !530, size: 64, offset: 1408)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !720, file: !51, line: 234, baseType: !530, size: 64, offset: 1472)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !720, file: !51, line: 237, baseType: !530, size: 64, offset: 1536)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !720, file: !51, line: 238, baseType: !739, size: 64, offset: 1600)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!307, !484, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !744)
!744 = !{!745, !746, !747, !748}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !743, file: !51, line: 115, baseType: !7, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !743, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !743, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !743, file: !51, line: 118, baseType: !749, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !347, line: 23, baseType: !633)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !720, file: !51, line: 240, baseType: !751, size: 64, offset: 1664)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!307, !484, !308}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !720, file: !51, line: 242, baseType: !652, size: 64, offset: 1728)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !720, file: !51, line: 243, baseType: !652, size: 64, offset: 1792)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !720, file: !51, line: 244, baseType: !652, size: 64, offset: 1856)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !720, file: !51, line: 248, baseType: !652, size: 64, offset: 1920)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !720, file: !51, line: 249, baseType: !657, size: 64, offset: 1984)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !720, file: !51, line: 250, baseType: !760, size: 64, offset: 2048)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!307, !484, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !347, line: 20, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !349, line: 26, baseType: !307)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !720, file: !51, line: 258, baseType: !767, size: 64, offset: 2112)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!307, !484, !770, !307}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !720, file: !51, line: 267, baseType: !772, size: 64, offset: 2176)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!307, !484, !476}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !720, file: !51, line: 268, baseType: !772, size: 64, offset: 2240)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !502, file: !51, line: 493, baseType: !777, size: 576, offset: 5440)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !778)
!778 = !{!779, !783, !787, !788, !789, !790, !791, !792, !793}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !777, file: !51, line: 304, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !781)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !51, line: 277, baseType: !339, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !777, file: !51, line: 306, baseType: !784, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !484, !742}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !777, file: !51, line: 308, baseType: !657, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !777, file: !51, line: 309, baseType: !760, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !777, file: !51, line: 310, baseType: !524, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !777, file: !51, line: 311, baseType: !524, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !777, file: !51, line: 312, baseType: !524, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !777, file: !51, line: 313, baseType: !710, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !777, file: !51, line: 316, baseType: !751, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !485, file: !51, line: 689, baseType: !795, size: 64, offset: 6080)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !797)
!797 = !{!798, !799, !805, !806, !807, !809, !810, !4316, !4317, !4318, !4337}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !796, file: !272, line: 102, baseType: !307, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !796, file: !272, line: 103, baseType: !800, size: 128, offset: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !306, line: 178, size: 128, elements: !801)
!801 = !{!802, !804}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !306, line: 179, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !800, file: !306, line: 179, baseType: !803, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !796, file: !272, line: 104, baseType: !800, size: 128, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !272, line: 105, baseType: !320, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !796, file: !272, line: 106, baseType: !808, size: 48, offset: 384)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 48, elements: !673)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !796, file: !272, line: 107, baseType: !308, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !796, file: !272, line: 109, baseType: !811, size: 64, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !813)
!813 = !{!814, !3773, !3774, !3777, !3778, !3829, !3917, !3918, !3919, !3920, !3921, !3930, !4035, !4048, !4243, !4244, !4248, !4250, !4251, !4252, !4256, !4262, !4263, !4266, !4267, !4268, !4269, !4270, !4271, !4272, !4304, !4305, !4306, !4309, !4312, !4313, !4314, !4315}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !812, file: !237, line: 462, baseType: !815, size: 512)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !816, line: 64, size: 512, elements: !817)
!816 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!817 = !{!818, !819, !820, !822, !862, !3629, !3767, !3768, !3769, !3770, !3771, !3772}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !816, line: 65, baseType: !320, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !815, file: !816, line: 66, baseType: !800, size: 128, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !815, file: !816, line: 67, baseType: !821, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !815, file: !816, line: 68, baseType: !823, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !816, line: 192, size: 704, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !824, file: !816, line: 193, baseType: !800, size: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !824, file: !816, line: 194, baseType: !445, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !824, file: !816, line: 195, baseType: !815, size: 512, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !824, file: !816, line: 196, baseType: !830, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !816, line: 156, size: 192, elements: !833)
!833 = !{!834, !839, !844}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !832, file: !816, line: 157, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!307, !823, !821}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !832, file: !816, line: 158, baseType: !840, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!320, !823, !821}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !832, file: !816, line: 159, baseType: !845, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!307, !823, !821, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !816, line: 148, size: 20736, elements: !851)
!851 = !{!852, !854, !856, !857, !861}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !850, file: !816, line: 149, baseType: !853, size: 192)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 192, elements: !600)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !850, file: !816, line: 150, baseType: !855, size: 4096, offset: 192)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 4096, elements: !465)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !850, file: !816, line: 151, baseType: !307, size: 32, offset: 4288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !850, file: !816, line: 152, baseType: !858, size: 16384, offset: 4320)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 16384, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 2048)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !850, file: !816, line: 153, baseType: !307, size: 32, offset: 20704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !815, file: !816, line: 69, baseType: !863, size: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !816, line: 138, size: 448, elements: !865)
!865 = !{!866, !870, !897, !899, !3591, !3619, !3623}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !864, file: !816, line: 139, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !821}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !864, file: !816, line: 140, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !874, line: 230, size: 128, elements: !875)
!874 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!875 = !{!876, !890}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !873, file: !874, line: 231, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!880, !821, !884, !339}
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !306, line: 60, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !882, line: 73, baseType: !883)
!882 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !882, line: 15, baseType: !703)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !874, line: 30, size: 128, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !874, line: 31, baseType: !320, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !885, file: !874, line: 32, baseType: !889, size: 16, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !306, line: 19, baseType: !350)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !873, file: !874, line: 232, baseType: !891, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!880, !821, !884, !320, !894}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !306, line: 55, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !882, line: 72, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !882, line: 16, baseType: !708)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !864, file: !816, line: 141, baseType: !898, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !864, file: !816, line: 142, baseType: !900, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !874, line: 84, size: 320, elements: !904)
!904 = !{!905, !906, !910, !3588, !3589}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !903, file: !874, line: 85, baseType: !320, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !903, file: !874, line: 86, baseType: !907, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!889, !821, !884, !307}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !903, file: !874, line: 88, baseType: !911, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!889, !821, !914, !307}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !874, line: 168, size: 448, elements: !916)
!916 = !{!917, !918, !919, !920, !3583, !3584}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !915, file: !874, line: 169, baseType: !885, size: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !915, file: !874, line: 170, baseType: !894, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !915, file: !874, line: 171, baseType: !308, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !915, file: !874, line: 172, baseType: !921, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!880, !924, !821, !914, !339, !1090, !894}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !926)
!926 = !{!927, !945, !3548, !3549, !3550, !3551, !3552, !3553, !3554, !3555, !3556, !3557, !3566, !3567, !3576, !3577, !3578, !3579, !3580, !3581, !3582}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !925, file: !208, line: 920, baseType: !928, size: 128)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !925, file: !208, line: 917, size: 128, elements: !929)
!929 = !{!930, !936}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !928, file: !208, line: 918, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !932, line: 58, size: 64, elements: !933)
!932 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !932, line: 59, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !928, file: !208, line: 919, baseType: !937, size: 128, align: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !306, line: 216, size: 128, align: 64, elements: !938)
!938 = !{!939, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !306, line: 217, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !937, file: !306, line: 218, baseType: !942, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !940}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !925, file: !208, line: 921, baseType: !946, size: 128, offset: 128)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !947, line: 8, size: 128, elements: !948)
!947 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!948 = !{!949, !953}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !946, file: !947, line: 9, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !952, line: 18, flags: DIFlagFwdDecl)
!952 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!953 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !946, file: !947, line: 10, baseType: !954, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !952, line: 89, size: 1536, elements: !956)
!956 = !{!957, !958, !968, !976, !977, !992, !3517, !3519, !3531, !3532, !3533, !3534, !3535, !3540, !3541, !3542}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !955, file: !952, line: 91, baseType: !7, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !955, file: !952, line: 92, baseType: !959, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !960, line: 277, baseType: !961)
!960 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !960, line: 277, size: 32, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !961, file: !960, line: 277, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !960, line: 70, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !960, line: 65, size: 32, elements: !966)
!966 = !{!967}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !965, file: !960, line: 66, baseType: !7, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !955, file: !952, line: 93, baseType: !969, size: 128, offset: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !970, line: 38, size: 128, elements: !971)
!970 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!971 = !{!972, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !969, file: !970, line: 39, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !969, file: !970, line: 39, baseType: !975, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !955, file: !952, line: 94, baseType: !954, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !955, file: !952, line: 95, baseType: !978, size: 128, offset: 256)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !952, line: 47, size: 128, elements: !979)
!979 = !{!980, !989}
!980 = !DIDerivedType(tag: DW_TAG_member, scope: !978, file: !952, line: 48, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !978, file: !952, line: 48, size: 64, elements: !982)
!982 = !{!983, !988}
!983 = !DIDerivedType(tag: DW_TAG_member, scope: !981, file: !952, line: 49, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !981, file: !952, line: 49, size: 64, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !984, file: !952, line: 50, baseType: !476, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !984, file: !952, line: 50, baseType: !476, size: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !981, file: !952, line: 52, baseType: !749, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !978, file: !952, line: 54, baseType: !990, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !955, file: !952, line: 96, baseType: !993, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !995)
!995 = !{!996, !997, !998, !1006, !1013, !1014, !1155, !3211, !3212, !3213, !3219, !3220, !3221, !3222, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3230, !3231, !3232, !3233, !3234, !3235, !3236, !3237, !3238, !3243, !3244, !3245, !3246, !3247, !3248, !3249, !3485, !3493, !3494, !3495, !3513, !3514, !3515, !3516}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !994, file: !208, line: 611, baseType: !889, size: 16)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !994, file: !208, line: 612, baseType: !350, size: 16, offset: 16)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !994, file: !208, line: 613, baseType: !999, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !1000, line: 23, baseType: !1001)
!1000 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1000, line: 21, size: 32, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1001, file: !1000, line: 22, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !306, line: 32, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !882, line: 49, baseType: !7)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !994, file: !208, line: 614, baseType: !1007, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !1000, line: 28, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1000, line: 26, size: 32, elements: !1009)
!1009 = !{!1010}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1008, file: !1000, line: 27, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !306, line: 33, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !882, line: 50, baseType: !7)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !994, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !994, file: !208, line: 622, baseType: !1015, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !1018)
!1018 = !{!1019, !1023, !1033, !1037, !1043, !1047, !1051, !1055, !1059, !1063, !1067, !1068, !1074, !1078, !1102, !1131, !1135, !1141, !1146, !1150, !1151}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !1017, file: !208, line: 1865, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!954, !993, !954, !7}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !1017, file: !208, line: 1866, baseType: !1024, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!320, !954, !993, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !1029, line: 10, size: 128, elements: !1030)
!1029 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1028, file: !1029, line: 11, baseType: !341, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1028, file: !1029, line: 12, baseType: !308, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !1017, file: !208, line: 1867, baseType: !1034, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!307, !993, !307}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !1017, file: !208, line: 1868, baseType: !1038, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !993, !307}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !1017, file: !208, line: 1870, baseType: !1044, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!307, !954, !339, !307}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !1017, file: !208, line: 1872, baseType: !1048, size: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!307, !993, !954, !889, !544}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1017, file: !208, line: 1873, baseType: !1052, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!307, !954, !993, !954}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !1017, file: !208, line: 1874, baseType: !1056, size: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!307, !993, !954}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !1017, file: !208, line: 1875, baseType: !1060, size: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!307, !993, !954, !320}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !1017, file: !208, line: 1876, baseType: !1064, size: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!307, !993, !954, !889}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !1017, file: !208, line: 1877, baseType: !1056, size: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !1017, file: !208, line: 1878, baseType: !1069, size: 64, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!307, !993, !954, !889, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !306, line: 16, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !306, line: 13, baseType: !476)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !1017, file: !208, line: 1879, baseType: !1075, size: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!307, !993, !954, !993, !954, !7}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !1017, file: !208, line: 1881, baseType: !1079, size: 64, offset: 832)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!307, !954, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1092, !1099, !1100, !1101}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1083, file: !208, line: 220, baseType: !7, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1083, file: !208, line: 221, baseType: !889, size: 16, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1083, file: !208, line: 222, baseType: !999, size: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1083, file: !208, line: 223, baseType: !1007, size: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1083, file: !208, line: 224, baseType: !1090, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !306, line: 46, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !882, line: 88, baseType: !637)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1083, file: !208, line: 225, baseType: !1093, size: 128, offset: 192)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1094, line: 13, size: 128, elements: !1095)
!1094 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1095 = !{!1096, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1093, file: !1094, line: 14, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1094, line: 8, baseType: !636)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1093, file: !1094, line: 15, baseType: !703, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1083, file: !208, line: 226, baseType: !1093, size: 128, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1083, file: !208, line: 227, baseType: !1093, size: 128, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1083, file: !208, line: 234, baseType: !924, size: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !1017, file: !208, line: 1882, baseType: !1103, size: 64, offset: 896)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!307, !1106, !1108, !476, !7}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1110, line: 22, size: 1152, elements: !1111)
!1110 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1111 = !{!1112, !1113, !1114, !1115, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1109, file: !1110, line: 23, baseType: !476, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1109, file: !1110, line: 24, baseType: !889, size: 16, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1109, file: !1110, line: 25, baseType: !7, size: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1109, file: !1110, line: 26, baseType: !1116, size: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !306, line: 104, baseType: !476)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1109, file: !1110, line: 27, baseType: !749, size: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1109, file: !1110, line: 28, baseType: !749, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1109, file: !1110, line: 37, baseType: !749, size: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1109, file: !1110, line: 38, baseType: !1072, size: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1109, file: !1110, line: 39, baseType: !1072, size: 32, offset: 352)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1109, file: !1110, line: 40, baseType: !999, size: 32, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1109, file: !1110, line: 41, baseType: !1007, size: 32, offset: 416)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !1110, line: 42, baseType: !1090, size: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1109, file: !1110, line: 43, baseType: !1093, size: 128, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1109, file: !1110, line: 44, baseType: !1093, size: 128, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1109, file: !1110, line: 45, baseType: !1093, size: 128, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1109, file: !1110, line: 46, baseType: !1093, size: 128, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1109, file: !1110, line: 47, baseType: !749, size: 64, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1109, file: !1110, line: 48, baseType: !749, size: 64, offset: 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !1017, file: !208, line: 1883, baseType: !1132, size: 64, offset: 960)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!880, !954, !339, !894}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !1017, file: !208, line: 1884, baseType: !1136, size: 64, offset: 1024)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!307, !993, !1139, !749, !749}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !1017, file: !208, line: 1886, baseType: !1142, size: 64, offset: 1088)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!307, !993, !1145, !307}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !1017, file: !208, line: 1887, baseType: !1147, size: 64, offset: 1152)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!307, !993, !954, !924, !7, !889}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1017, file: !208, line: 1890, baseType: !1064, size: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !1017, file: !208, line: 1891, baseType: !1152, size: 64, offset: 1280)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!307, !993, !1041, !307}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !994, file: !208, line: 623, baseType: !1156, size: 64, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1211, !2819, !2901, !2984, !2988, !2989, !2990, !2991, !2992, !2993, !2994, !2995, !3000, !3004, !3005, !3008, !3009, !3012, !3013, !3014, !3055, !3081, !3082, !3083, !3084, !3085, !3086, !3089, !3091, !3098, !3099, !3101, !3102, !3103, !3162, !3163, !3178, !3179, !3180, !3181, !3182, !3185, !3186, !3187, !3202, !3203, !3204, !3205, !3206, !3207, !3208, !3209, !3210}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1157, file: !208, line: 1417, baseType: !800, size: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1157, file: !208, line: 1418, baseType: !1072, size: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1157, file: !208, line: 1419, baseType: !358, size: 8, offset: 160)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1157, file: !208, line: 1420, baseType: !708, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1157, file: !208, line: 1421, baseType: !1090, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1157, file: !208, line: 1422, baseType: !1165, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1177, !1181, !1185, !1189, !1190, !1191, !1201, !1204, !1205, !1206, !1208, !1209, !1210}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1166, file: !208, line: 2229, baseType: !320, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1166, file: !208, line: 2230, baseType: !307, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1166, file: !208, line: 2238, baseType: !1171, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!307, !1174}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1176, line: 28, flags: DIFlagFwdDecl)
!1176 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1166, file: !208, line: 2239, baseType: !1178, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1166, file: !208, line: 2240, baseType: !1182, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!954, !1165, !307, !320, !308}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1166, file: !208, line: 2242, baseType: !1186, size: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !1156}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1166, file: !208, line: 2243, baseType: !309, size: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1166, file: !208, line: 2244, baseType: !1165, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1166, file: !208, line: 2245, baseType: !1192, size: 64, offset: 512)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !306, line: 182, size: 64, elements: !1193)
!1193 = !{!1194}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1192, file: !306, line: 183, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !306, line: 186, size: 128, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !306, line: 187, baseType: !1195, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1196, file: !306, line: 187, baseType: !1200, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1166, file: !208, line: 2247, baseType: !1202, offset: 576)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1203, line: 187, elements: !459)
!1203 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1166, file: !208, line: 2248, baseType: !1202, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1166, file: !208, line: 2249, baseType: !1202, offset: 576)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1166, file: !208, line: 2250, baseType: !1207, offset: 576)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, elements: !600)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1166, file: !208, line: 2252, baseType: !1202, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1166, file: !208, line: 2253, baseType: !1202, offset: 576)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1166, file: !208, line: 2254, baseType: !1202, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1157, file: !208, line: 1423, baseType: !1212, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1215)
!1215 = !{!1216, !1220, !1224, !1225, !1229, !1235, !1239, !1240, !1241, !1245, !1249, !1250, !1251, !1252, !1258, !1263, !1264, !1271, !1272, !1273, !1274, !2803, !2818}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1214, file: !208, line: 1936, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!993, !1156}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1214, file: !208, line: 1937, baseType: !1221, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null, !993}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1214, file: !208, line: 1938, baseType: !1221, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1214, file: !208, line: 1940, baseType: !1226, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null, !993, !307}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1214, file: !208, line: 1941, baseType: !1230, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!307, !993, !1233}
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1214, file: !208, line: 1942, baseType: !1236, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!307, !993}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1214, file: !208, line: 1943, baseType: !1221, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1214, file: !208, line: 1944, baseType: !1186, size: 64, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1214, file: !208, line: 1945, baseType: !1242, size: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!307, !1156, !307}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1214, file: !208, line: 1946, baseType: !1246, size: 64, offset: 576)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!307, !1156}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1214, file: !208, line: 1947, baseType: !1246, size: 64, offset: 640)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1214, file: !208, line: 1948, baseType: !1246, size: 64, offset: 704)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1214, file: !208, line: 1949, baseType: !1246, size: 64, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1214, file: !208, line: 1950, baseType: !1253, size: 64, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!307, !954, !1256}
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1214, file: !208, line: 1951, baseType: !1259, size: 64, offset: 896)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!307, !1156, !1262, !339}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1214, file: !208, line: 1952, baseType: !1186, size: 64, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1214, file: !208, line: 1954, baseType: !1265, size: 64, offset: 1024)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!307, !1268, !954}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1270, line: 539, flags: DIFlagFwdDecl)
!1270 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1214, file: !208, line: 1955, baseType: !1265, size: 64, offset: 1088)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1214, file: !208, line: 1956, baseType: !1265, size: 64, offset: 1152)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1214, file: !208, line: 1957, baseType: !1265, size: 64, offset: 1216)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1214, file: !208, line: 1963, baseType: !1275, size: 64, offset: 1280)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!307, !1156, !1278, !305}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1280, line: 68, size: 512, align: 128, elements: !1281)
!1280 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1281 = !{!1282, !1283, !2795, !2802}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1279, file: !1280, line: 69, baseType: !708, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, scope: !1279, file: !1280, line: 77, baseType: !1284, size: 320, offset: 64)
!1284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1279, file: !1280, line: 77, size: 320, elements: !1285)
!1285 = !{!1286, !1461, !1466, !1494, !1502, !1508, !2787, !2794}
!1286 = !DIDerivedType(tag: DW_TAG_member, scope: !1284, file: !1280, line: 78, baseType: !1287, size: 320)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1284, file: !1280, line: 78, size: 320, elements: !1288)
!1288 = !{!1289, !1290, !1459, !1460}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1287, file: !1280, line: 84, baseType: !800, size: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1287, file: !1280, line: 86, baseType: !1291, size: 64, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
