; ModuleID = '../bcout/drivers/media/dvb-frontends/itd1000.llvm.bc'
source_filename = "drivers/media/dvb-frontends/itd1000.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.dvb_tuner_ops = type { %struct.dvb_tuner_info, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.analog_parameters*)*, i32 (%struct.dvb_frontend*, i8*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)* }
%struct.dvb_tuner_info = type { [128 x i8], i32, i32, i32, i32, i32, i32 }
%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }
%struct.kref = type { %struct.refcount_struct }

!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "itd1000_register", file: !291, line: 23, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "drivers/media/dvb-frontends/itd1000_priv.h", directory: "/home/lizy2001/genbc/linux")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!293 = !DIEnumerator(name: "VCO_CHP1", value: 101, isUnsigned: true)
!294 = !DIEnumerator(name: "VCO_CHP2", value: 102, isUnsigned: true)
!295 = !DIEnumerator(name: "PLLCON1", value: 103, isUnsigned: true)
!296 = !DIEnumerator(name: "PLLNH", value: 104, isUnsigned: true)
!297 = !DIEnumerator(name: "PLLNL", value: 105, isUnsigned: true)
!298 = !DIEnumerator(name: "PLLFH", value: 106, isUnsigned: true)
!299 = !DIEnumerator(name: "PLLFM", value: 107, isUnsigned: true)
!300 = !DIEnumerator(name: "PLLFL", value: 108, isUnsigned: true)
!301 = !DIEnumerator(name: "RESERVED_0X6D", value: 109, isUnsigned: true)
!302 = !DIEnumerator(name: "PLLLOCK", value: 110, isUnsigned: true)
!303 = !DIEnumerator(name: "VCO_CHP2_I2C", value: 111, isUnsigned: true)
!304 = !DIEnumerator(name: "VCO_CHP1_I2C", value: 112, isUnsigned: true)
!305 = !DIEnumerator(name: "BW", value: 113, isUnsigned: true)
!306 = !DIEnumerator(name: "RESERVED_0X73", value: 115, isUnsigned: true)
!307 = !DIEnumerator(name: "RESERVED_0X74", value: 116, isUnsigned: true)
!308 = !DIEnumerator(name: "RESERVED_0X75", value: 117, isUnsigned: true)
!309 = !DIEnumerator(name: "GVBB", value: 118, isUnsigned: true)
!310 = !DIEnumerator(name: "GVRF", value: 119, isUnsigned: true)
!311 = !DIEnumerator(name: "GVBB_I2C", value: 120, isUnsigned: true)
!312 = !DIEnumerator(name: "EXTGVBBRF", value: 121, isUnsigned: true)
!313 = !DIEnumerator(name: "DIVAGCCK", value: 122, isUnsigned: true)
!314 = !DIEnumerator(name: "BBTR", value: 123, isUnsigned: true)
!315 = !DIEnumerator(name: "RFTR", value: 124, isUnsigned: true)
!316 = !DIEnumerator(name: "BBGVMIN", value: 125, isUnsigned: true)
!317 = !DIEnumerator(name: "RESERVED_0X7E", value: 126, isUnsigned: true)
!318 = !DIEnumerator(name: "RESERVED_0X85", value: 133, isUnsigned: true)
!319 = !DIEnumerator(name: "RESERVED_0X86", value: 134, isUnsigned: true)
!320 = !DIEnumerator(name: "CON1", value: 135, isUnsigned: true)
!321 = !DIEnumerator(name: "RESERVED_0X88", value: 136, isUnsigned: true)
!322 = !DIEnumerator(name: "RESERVED_0X89", value: 137, isUnsigned: true)
!323 = !DIEnumerator(name: "RFST0", value: 138, isUnsigned: true)
!324 = !DIEnumerator(name: "RFST1", value: 139, isUnsigned: true)
!325 = !DIEnumerator(name: "RFST2", value: 140, isUnsigned: true)
!326 = !DIEnumerator(name: "RFST3", value: 141, isUnsigned: true)
!327 = !DIEnumerator(name: "RFST4", value: 142, isUnsigned: true)
!328 = !DIEnumerator(name: "RFST5", value: 143, isUnsigned: true)
!329 = !DIEnumerator(name: "RFST6", value: 144, isUnsigned: true)
!330 = !DIEnumerator(name: "RFST7", value: 145, isUnsigned: true)
!331 = !DIEnumerator(name: "RFST8", value: 146, isUnsigned: true)
!332 = !DIEnumerator(name: "RFST9", value: 147, isUnsigned: true)
!333 = !DIEnumerator(name: "RESERVED_0X94", value: 148, isUnsigned: true)
!334 = !DIEnumerator(name: "RESERVED_0X95", value: 149, isUnsigned: true)
!335 = !DIEnumerator(name: "RESERVED_0X96", value: 150, isUnsigned: true)
!336 = !DIEnumerator(name: "RESERVED_0X97", value: 151, isUnsigned: true)
!337 = !DIEnumerator(name: "RESERVED_0X98", value: 152, isUnsigned: true)
!338 = !DIEnumerator(name: "RESERVED_0X99", value: 153, isUnsigned: true)
!339 = !DIEnumerator(name: "RESERVED_0X9A", value: 154, isUnsigned: true)
!340 = !DIEnumerator(name: "RESERVED_0X9B", value: 155, isUnsigned: true)
!341 = !{!342, !344, !345, !346, !352}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !343, line: 148, baseType: !7)
!343 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!345 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !343, line: 107, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !348, line: 23, baseType: !349)
!348 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !350, line: 31, baseType: !351)
!350 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!351 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !348, line: 21, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !350, line: 27, baseType: !7)
!354 = !{!355, !424, !429, !434, !439, !444, !449, !454, !0, !456, !4348, !4353, !4358, !4369, !4378}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 24, type: !357, isLocal: true, isDefinition: true, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !359, line: 69, size: 320, elements: !360)
!359 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!360 = !{!361, !365, !369, !389, !394, !398, !402}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !358, file: !359, line: 70, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !358, file: !359, line: 71, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !368, line: 76, flags: DIFlagFwdDecl)
!368 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !358, file: !359, line: 72, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !359, line: 47, size: 256, elements: !373)
!373 = !{!374, !375, !380, !385}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !359, line: 49, baseType: !7, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !372, file: !359, line: 51, baseType: !376, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!345, !362, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !372, file: !359, line: 53, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!345, !384, !379}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !372, file: !359, line: 55, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !344}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !358, file: !359, line: 73, baseType: !390, size: 16, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !348, line: 19, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !350, line: 24, baseType: !393)
!393 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !358, file: !359, line: 74, baseType: !395, size: 8, offset: 208)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !348, line: 16, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !350, line: 20, baseType: !397)
!397 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !358, file: !359, line: 75, baseType: !399, size: 8, offset: 216)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !348, line: 17, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !350, line: 21, baseType: !401)
!401 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !358, file: !359, line: 76, baseType: !403, size: 64, offset: 256)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !358, file: !359, line: 76, size: 64, elements: !404)
!404 = !{!405, !406, !413}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !403, file: !359, line: 77, baseType: !344, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !403, file: !359, line: 78, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !359, line: 86, size: 128, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !409, file: !359, line: 87, baseType: !7, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !409, file: !359, line: 88, baseType: !384, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !403, file: !359, line: 79, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !359, line: 92, size: 256, elements: !417)
!417 = !{!418, !419, !420, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !416, file: !359, line: 94, baseType: !7, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !416, file: !359, line: 95, baseType: !7, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !416, file: !359, line: 96, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !416, file: !359, line: 97, baseType: !370, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !416, file: !359, line: 98, baseType: !344, size: 64, offset: 192)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 24, type: !426, isLocal: true, isDefinition: true, align: 8)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 216, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 27)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 25, type: !431, isLocal: true, isDefinition: true, align: 8)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 448, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 56)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author222", scope: !2, file: !3, line: 394, type: !436, isLocal: true, isDefinition: true, align: 8)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 400, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 50)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description223", scope: !2, file: !3, line: 395, type: !441, isLocal: true, isDefinition: true, align: 8)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 360, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 45)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file224", scope: !2, file: !3, line: 396, type: !446, isLocal: true, isDefinition: true, align: 8)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 392, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 49)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license225", scope: !2, file: !3, line: 396, type: !451, isLocal: true, isDefinition: true, align: 8)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 160, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 20)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 23, type: !345, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "itd1000_tuner_ops", scope: !2, file: !3, line: 344, type: !458, isLocal: true, isDefinition: true)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !460)
!460 = !{!461, !474, !4322, !4323, !4324, !4325, !4326, !4327, !4331, !4332, !4333, !4334, !4335, !4336, !4337, !4338, !4343, !4347}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !459, file: !51, line: 228, baseType: !462, size: 1216)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !463)
!463 = !{!464, !468, !469, !470, !471, !472, !473}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !462, file: !51, line: 89, baseType: !465, size: 1024)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 1024, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !462, file: !51, line: 91, baseType: !352, size: 32, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !462, file: !51, line: 92, baseType: !352, size: 32, offset: 1056)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !462, file: !51, line: 93, baseType: !352, size: 32, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !462, file: !51, line: 95, baseType: !352, size: 32, offset: 1120)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !462, file: !51, line: 96, baseType: !352, size: 32, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !462, file: !51, line: 97, baseType: !352, size: 32, offset: 1184)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !459, file: !51, line: 230, baseType: !475, size: 64, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !480)
!480 = !{!481, !495, !740, !4310, !4311, !4312, !4313, !4314, !4315, !4316, !4320, !4321}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !479, file: !51, line: 687, baseType: !482, size: 32)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !483, line: 19, size: 32, elements: !484)
!483 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !482, file: !483, line: 20, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !487, line: 113, baseType: !488)
!487 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !487, line: 111, size: 32, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !488, file: !487, line: 112, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !343, line: 168, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 166, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !492, file: !343, line: 167, baseType: !345, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !479, file: !51, line: 688, baseType: !496, size: 6016, offset: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !497)
!497 = !{!498, !510, !514, !515, !516, !517, !521, !522, !528, !535, !539, !540, !550, !633, !637, !642, !647, !648, !649, !650, !662, !673, !677, !681, !685, !690, !695, !699, !700, !701, !705, !706}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !496, file: !51, line: 436, baseType: !499, size: 1280)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !499, file: !51, line: 339, baseType: !465, size: 1024)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !499, file: !51, line: 340, baseType: !352, size: 32, offset: 1024)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !499, file: !51, line: 341, baseType: !352, size: 32, offset: 1056)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !499, file: !51, line: 342, baseType: !352, size: 32, offset: 1088)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !499, file: !51, line: 343, baseType: !352, size: 32, offset: 1120)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !499, file: !51, line: 344, baseType: !352, size: 32, offset: 1152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !499, file: !51, line: 345, baseType: !352, size: 32, offset: 1184)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !499, file: !51, line: 346, baseType: !352, size: 32, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !499, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !496, file: !51, line: 438, baseType: !511, size: 64, offset: 1280)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 64, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !496, file: !51, line: 440, baseType: !475, size: 64, offset: 1344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !496, file: !51, line: 441, baseType: !475, size: 64, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !496, file: !51, line: 442, baseType: !475, size: 64, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !496, file: !51, line: 444, baseType: !518, size: 64, offset: 1536)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!345, !478}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !496, file: !51, line: 445, baseType: !518, size: 64, offset: 1600)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !496, file: !51, line: 447, baseType: !523, size: 64, offset: 1664)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!345, !478, !526, !345}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !496, file: !51, line: 450, baseType: !529, size: 64, offset: 1728)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!345, !478, !532, !7, !421, !534}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !343, line: 30, baseType: !533)
!533 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !496, file: !51, line: 457, baseType: !536, size: 64, offset: 1792)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!50, !478}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !496, file: !51, line: 460, baseType: !518, size: 64, offset: 1856)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !496, file: !51, line: 461, baseType: !541, size: 64, offset: 1920)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!345, !478, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !545, file: !51, line: 70, baseType: !345, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !545, file: !51, line: 71, baseType: !345, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !545, file: !51, line: 72, baseType: !345, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !496, file: !51, line: 463, baseType: !551, size: 64, offset: 1984)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!345, !478, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !626, !627, !628, !629, !630, !631, !632}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !555, file: !51, line: 587, baseType: !352, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !555, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !555, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !555, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !555, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !555, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !555, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !555, file: !51, line: 595, baseType: !352, size: 32, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !555, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !555, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !555, file: !51, line: 598, baseType: !352, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !555, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !555, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !555, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !555, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !555, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !555, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !555, file: !51, line: 610, baseType: !399, size: 8, offset: 544)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !555, file: !51, line: 611, baseType: !399, size: 8, offset: 552)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !555, file: !51, line: 612, baseType: !399, size: 8, offset: 560)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !555, file: !51, line: 613, baseType: !352, size: 32, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !555, file: !51, line: 614, baseType: !352, size: 32, offset: 608)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !555, file: !51, line: 615, baseType: !399, size: 8, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !555, file: !51, line: 621, baseType: !581, size: 384, offset: 672)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 384, elements: !588)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !555, file: !51, line: 616, size: 128, elements: !583)
!583 = !{!584, !585, !586, !587}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !582, file: !51, line: 617, baseType: !399, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !582, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !582, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !582, file: !51, line: 620, baseType: !399, size: 8, offset: 96)
!588 = !{!589}
!589 = !DISubrange(count: 3)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !555, file: !51, line: 624, baseType: !352, size: 32, offset: 1056)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !555, file: !51, line: 627, baseType: !352, size: 32, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !555, file: !51, line: 630, baseType: !399, size: 8, offset: 1120)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !555, file: !51, line: 631, baseType: !399, size: 8, offset: 1128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !555, file: !51, line: 632, baseType: !399, size: 8, offset: 1136)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !555, file: !51, line: 633, baseType: !399, size: 8, offset: 1144)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !555, file: !51, line: 634, baseType: !399, size: 8, offset: 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !555, file: !51, line: 635, baseType: !399, size: 8, offset: 1160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !555, file: !51, line: 637, baseType: !399, size: 8, offset: 1168)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !555, file: !51, line: 638, baseType: !399, size: 8, offset: 1176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !555, file: !51, line: 639, baseType: !399, size: 8, offset: 1184)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !555, file: !51, line: 640, baseType: !399, size: 8, offset: 1192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !555, file: !51, line: 641, baseType: !399, size: 8, offset: 1200)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !555, file: !51, line: 642, baseType: !399, size: 8, offset: 1208)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !555, file: !51, line: 643, baseType: !399, size: 8, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !555, file: !51, line: 644, baseType: !399, size: 8, offset: 1224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !555, file: !51, line: 645, baseType: !399, size: 8, offset: 1232)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !555, file: !51, line: 647, baseType: !352, size: 32, offset: 1248)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !555, file: !51, line: 650, baseType: !609, size: 296, offset: 1280)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !609, file: !6, line: 826, baseType: !400, size: 8)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !609, file: !6, line: 827, baseType: !613, size: 288, offset: 8)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 288, elements: !624)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !614, file: !6, line: 804, baseType: !400, size: 8)
!617 = !DIDerivedType(tag: DW_TAG_member, scope: !614, file: !6, line: 805, baseType: !618, size: 64, offset: 8)
!618 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !614, file: !6, line: 805, size: 64, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !618, file: !6, line: 806, baseType: !349, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !618, file: !6, line: 807, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !350, line: 30, baseType: !623)
!623 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!624 = !{!625}
!625 = !DISubrange(count: 4)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !555, file: !51, line: 651, baseType: !609, size: 296, offset: 1576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !555, file: !51, line: 652, baseType: !609, size: 296, offset: 1872)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !555, file: !51, line: 653, baseType: !609, size: 296, offset: 2168)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !555, file: !51, line: 654, baseType: !609, size: 296, offset: 2464)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !555, file: !51, line: 655, baseType: !609, size: 296, offset: 2760)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !555, file: !51, line: 656, baseType: !609, size: 296, offset: 3056)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !555, file: !51, line: 657, baseType: !609, size: 296, offset: 3352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !496, file: !51, line: 466, baseType: !634, size: 64, offset: 2048)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!345, !478, !534}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !496, file: !51, line: 467, baseType: !638, size: 64, offset: 2112)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!345, !478, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !496, file: !51, line: 468, baseType: !643, size: 64, offset: 2176)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!345, !478, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !496, file: !51, line: 469, baseType: !643, size: 64, offset: 2240)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !496, file: !51, line: 470, baseType: !638, size: 64, offset: 2304)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !496, file: !51, line: 472, baseType: !518, size: 64, offset: 2368)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !496, file: !51, line: 473, baseType: !651, size: 64, offset: 2432)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!345, !478, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !656)
!656 = !{!657, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !655, file: !6, line: 174, baseType: !658, size: 48)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 48, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 6)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !655, file: !6, line: 175, baseType: !400, size: 8, offset: 48)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !496, file: !51, line: 474, baseType: !663, size: 64, offset: 2496)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!345, !478, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !668)
!668 = !{!669, !671, !672}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !667, file: !6, line: 196, baseType: !670, size: 32)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 32, elements: !624)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !667, file: !6, line: 197, baseType: !400, size: 8, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !667, file: !6, line: 198, baseType: !345, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !496, file: !51, line: 475, baseType: !674, size: 64, offset: 2560)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!345, !478, !171}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !496, file: !51, line: 477, baseType: !678, size: 64, offset: 2624)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!345, !478, !78}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !496, file: !51, line: 478, baseType: !682, size: 64, offset: 2688)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!345, !478, !73}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !496, file: !51, line: 480, baseType: !686, size: 64, offset: 2752)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!345, !478, !689}
!689 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !496, file: !51, line: 481, baseType: !691, size: 64, offset: 2816)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!345, !478, !694}
!694 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !496, file: !51, line: 482, baseType: !696, size: 64, offset: 2880)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!345, !478, !345}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !496, file: !51, line: 483, baseType: !696, size: 64, offset: 2944)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !496, file: !51, line: 484, baseType: !518, size: 64, offset: 3008)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !496, file: !51, line: 490, baseType: !702, size: 64, offset: 3072)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!175, !478}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !496, file: !51, line: 492, baseType: !459, size: 2304, offset: 3136)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !496, file: !51, line: 493, baseType: !707, size: 576, offset: 5440)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !708)
!708 = !{!709, !713, !724, !725, !732, !733, !734, !735, !736}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !707, file: !51, line: 304, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !51, line: 277, baseType: !384, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !707, file: !51, line: 306, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !478, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !718, file: !51, line: 115, baseType: !7, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !718, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !718, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !718, file: !51, line: 118, baseType: !347, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !707, file: !51, line: 308, baseType: !643, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !707, file: !51, line: 309, baseType: !726, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!345, !478, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !348, line: 20, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !350, line: 26, baseType: !345)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !707, file: !51, line: 310, baseType: !475, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !707, file: !51, line: 311, baseType: !475, size: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !707, file: !51, line: 312, baseType: !475, size: 64, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !707, file: !51, line: 313, baseType: !696, size: 64, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !707, file: !51, line: 316, baseType: !737, size: 64, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!345, !478, !344}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !479, file: !51, line: 689, baseType: !741, size: 64, offset: 6080)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !743)
!743 = !{!744, !745, !751, !752, !753, !755, !756, !4288, !4289, !4290, !4309}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !742, file: !272, line: 102, baseType: !345, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !742, file: !272, line: 103, baseType: !746, size: 128, offset: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !343, line: 178, size: 128, elements: !747)
!747 = !{!748, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !746, file: !343, line: 179, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !746, file: !343, line: 179, baseType: !749, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !742, file: !272, line: 104, baseType: !746, size: 128, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !272, line: 105, baseType: !362, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !742, file: !272, line: 106, baseType: !754, size: 48, offset: 384)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 48, elements: !659)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !742, file: !272, line: 107, baseType: !344, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !742, file: !272, line: 109, baseType: !757, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !759)
!759 = !{!760, !3745, !3746, !3749, !3750, !3801, !3889, !3890, !3891, !3892, !3893, !3902, !4007, !4020, !4215, !4216, !4220, !4222, !4223, !4224, !4228, !4234, !4235, !4238, !4239, !4240, !4241, !4242, !4243, !4244, !4276, !4277, !4278, !4281, !4284, !4285, !4286, !4287}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !758, file: !237, line: 462, baseType: !761, size: 512)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !762, line: 64, size: 512, elements: !763)
!762 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!763 = !{!764, !765, !766, !768, !825, !3600, !3739, !3740, !3741, !3742, !3743, !3744}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !762, line: 65, baseType: !362, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !761, file: !762, line: 66, baseType: !746, size: 128, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !761, file: !762, line: 67, baseType: !767, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !761, file: !762, line: 68, baseType: !769, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !762, line: 192, size: 704, elements: !771)
!771 = !{!772, !773, !789, !790}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !770, file: !762, line: 193, baseType: !746, size: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !770, file: !762, line: 194, baseType: !774, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !775, line: 83, baseType: !776)
!775 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !775, line: 71, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, scope: !776, file: !775, line: 72, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !776, file: !775, line: 72, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !779, file: !775, line: 73, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !775, line: 20, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !782, file: !775, line: 21, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !786, line: 25, baseType: !787)
!786 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !786, line: 25, elements: !788)
!788 = !{}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !770, file: !762, line: 195, baseType: !761, size: 512, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !770, file: !762, line: 196, baseType: !791, size: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !762, line: 156, size: 192, elements: !794)
!794 = !{!795, !800, !805}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !793, file: !762, line: 157, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!345, !769, !767}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !762, line: 158, baseType: !801, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!362, !769, !767}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !793, file: !762, line: 159, baseType: !806, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!345, !769, !767, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !762, line: 148, size: 20736, elements: !812)
!812 = !{!813, !815, !819, !820, !824}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !811, file: !762, line: 149, baseType: !814, size: 192)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 192, elements: !588)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !811, file: !762, line: 150, baseType: !816, size: 4096, offset: 192)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 4096, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !811, file: !762, line: 151, baseType: !345, size: 32, offset: 4288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !811, file: !762, line: 152, baseType: !821, size: 16384, offset: 4320)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 16384, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 2048)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !811, file: !762, line: 153, baseType: !345, size: 32, offset: 20704)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !761, file: !762, line: 69, baseType: !826, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !762, line: 138, size: 448, elements: !828)
!828 = !{!829, !833, !860, !862, !3562, !3590, !3594}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !827, file: !762, line: 139, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !767}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !827, file: !762, line: 140, baseType: !834, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !837, line: 230, size: 128, elements: !838)
!837 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!838 = !{!839, !853}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !836, file: !837, line: 231, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!843, !767, !847, !384}
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !343, line: 60, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !845, line: 73, baseType: !846)
!845 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !845, line: 15, baseType: !689)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !837, line: 30, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !837, line: 31, baseType: !362, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !848, file: !837, line: 32, baseType: !852, size: 16, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !343, line: 19, baseType: !393)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !836, file: !837, line: 232, baseType: !854, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!843, !767, !847, !362, !857}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !343, line: 55, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !845, line: 72, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !845, line: 16, baseType: !694)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !827, file: !762, line: 141, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !827, file: !762, line: 142, baseType: !863, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !837, line: 84, size: 320, elements: !867)
!867 = !{!868, !869, !873, !3559, !3560}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !837, line: 85, baseType: !362, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !866, file: !837, line: 86, baseType: !870, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!852, !767, !847, !345}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !866, file: !837, line: 88, baseType: !874, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!852, !767, !877, !345}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !837, line: 168, size: 448, elements: !879)
!879 = !{!880, !881, !882, !883, !3554, !3555}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !878, file: !837, line: 169, baseType: !848, size: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !878, file: !837, line: 170, baseType: !857, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !878, file: !837, line: 171, baseType: !344, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !878, file: !837, line: 172, baseType: !884, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!843, !887, !767, !877, !384, !1053, !857}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !889)
!889 = !{!890, !908, !3519, !3520, !3521, !3522, !3523, !3524, !3525, !3526, !3527, !3528, !3537, !3538, !3547, !3548, !3549, !3550, !3551, !3552, !3553}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !888, file: !208, line: 920, baseType: !891, size: 128)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !208, line: 917, size: 128, elements: !892)
!892 = !{!893, !899}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !891, file: !208, line: 918, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !895, line: 58, size: 64, elements: !896)
!895 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !894, file: !895, line: 59, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !891, file: !208, line: 919, baseType: !900, size: 128, align: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !343, line: 216, size: 128, align: 64, elements: !901)
!901 = !{!902, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !343, line: 217, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !900, file: !343, line: 218, baseType: !905, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !903}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !888, file: !208, line: 921, baseType: !909, size: 128, offset: 128)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !910, line: 8, size: 128, elements: !911)
!910 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!911 = !{!912, !916}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !909, file: !910, line: 9, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !915, line: 18, flags: DIFlagFwdDecl)
!915 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!916 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !909, file: !910, line: 10, baseType: !917, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !915, line: 89, size: 1536, elements: !919)
!919 = !{!920, !921, !931, !939, !940, !955, !3488, !3490, !3502, !3503, !3504, !3505, !3506, !3511, !3512, !3513}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !918, file: !915, line: 91, baseType: !7, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !918, file: !915, line: 92, baseType: !922, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !923, line: 277, baseType: !924)
!923 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !923, line: 277, size: 32, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !924, file: !923, line: 277, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !923, line: 70, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !923, line: 65, size: 32, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !928, file: !923, line: 66, baseType: !7, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !918, file: !915, line: 93, baseType: !932, size: 128, offset: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !933, line: 38, size: 128, elements: !934)
!933 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!934 = !{!935, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !932, file: !933, line: 39, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !932, file: !933, line: 39, baseType: !938, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !918, file: !915, line: 94, baseType: !917, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !918, file: !915, line: 95, baseType: !941, size: 128, offset: 256)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !915, line: 47, size: 128, elements: !942)
!942 = !{!943, !952}
!943 = !DIDerivedType(tag: DW_TAG_member, scope: !941, file: !915, line: 48, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !941, file: !915, line: 48, size: 64, elements: !945)
!945 = !{!946, !951}
!946 = !DIDerivedType(tag: DW_TAG_member, scope: !944, file: !915, line: 49, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !944, file: !915, line: 49, size: 64, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !947, file: !915, line: 50, baseType: !352, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !947, file: !915, line: 50, baseType: !352, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !944, file: !915, line: 52, baseType: !347, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !941, file: !915, line: 54, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !918, file: !915, line: 96, baseType: !956, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !958)
!958 = !{!959, !960, !961, !969, !976, !977, !1118, !3182, !3183, !3184, !3190, !3191, !3192, !3193, !3194, !3195, !3196, !3197, !3198, !3199, !3200, !3201, !3202, !3203, !3204, !3205, !3206, !3207, !3208, !3209, !3214, !3215, !3216, !3217, !3218, !3219, !3220, !3456, !3464, !3465, !3466, !3484, !3485, !3486, !3487}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !957, file: !208, line: 611, baseType: !852, size: 16)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !957, file: !208, line: 612, baseType: !393, size: 16, offset: 16)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !957, file: !208, line: 613, baseType: !962, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !963, line: 23, baseType: !964)
!963 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 21, size: 32, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !964, file: !963, line: 22, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !343, line: 32, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !845, line: 49, baseType: !7)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !957, file: !208, line: 614, baseType: !970, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !963, line: 28, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 26, size: 32, elements: !972)
!972 = !{!973}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !971, file: !963, line: 27, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !343, line: 33, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !845, line: 50, baseType: !7)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !957, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !957, file: !208, line: 622, baseType: !978, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !981)
!981 = !{!982, !986, !996, !1000, !1006, !1010, !1014, !1018, !1022, !1026, !1030, !1031, !1037, !1041, !1065, !1094, !1098, !1104, !1109, !1113, !1114}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !980, file: !208, line: 1865, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!917, !956, !917, !7}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !980, file: !208, line: 1866, baseType: !987, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!362, !917, !956, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !992, line: 10, size: 128, elements: !993)
!992 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !991, file: !992, line: 11, baseType: !386, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !991, file: !992, line: 12, baseType: !344, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !980, file: !208, line: 1867, baseType: !997, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!345, !956, !345}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !980, file: !208, line: 1868, baseType: !1001, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !956, !345}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !980, file: !208, line: 1870, baseType: !1007, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!345, !917, !384, !345}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !980, file: !208, line: 1872, baseType: !1011, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!345, !956, !917, !852, !532}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !980, file: !208, line: 1873, baseType: !1015, size: 64, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!345, !917, !956, !917}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !980, file: !208, line: 1874, baseType: !1019, size: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!345, !956, !917}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !980, file: !208, line: 1875, baseType: !1023, size: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!345, !956, !917, !362}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !980, file: !208, line: 1876, baseType: !1027, size: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!345, !956, !917, !852}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !980, file: !208, line: 1877, baseType: !1019, size: 64, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !980, file: !208, line: 1878, baseType: !1032, size: 64, offset: 704)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!345, !956, !917, !852, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !343, line: 16, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !343, line: 13, baseType: !352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !980, file: !208, line: 1879, baseType: !1038, size: 64, offset: 768)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!345, !956, !917, !956, !917, !7}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !980, file: !208, line: 1881, baseType: !1042, size: 64, offset: 832)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!345, !917, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1055, !1062, !1063, !1064}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1046, file: !208, line: 220, baseType: !7, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1046, file: !208, line: 221, baseType: !852, size: 16, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1046, file: !208, line: 222, baseType: !962, size: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1046, file: !208, line: 223, baseType: !970, size: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1046, file: !208, line: 224, baseType: !1053, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !343, line: 46, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !845, line: 88, baseType: !623)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1046, file: !208, line: 225, baseType: !1056, size: 128, offset: 192)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1057, line: 13, size: 128, elements: !1058)
!1057 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1058 = !{!1059, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1056, file: !1057, line: 14, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1057, line: 8, baseType: !622)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1056, file: !1057, line: 15, baseType: !689, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1046, file: !208, line: 226, baseType: !1056, size: 128, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1046, file: !208, line: 227, baseType: !1056, size: 128, offset: 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1046, file: !208, line: 234, baseType: !887, size: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !980, file: !208, line: 1882, baseType: !1066, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!345, !1069, !1071, !352, !7}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1073, line: 22, size: 1152, elements: !1074)
!1073 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1074 = !{!1075, !1076, !1077, !1078, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1072, file: !1073, line: 23, baseType: !352, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1072, file: !1073, line: 24, baseType: !852, size: 16, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1072, file: !1073, line: 25, baseType: !7, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1072, file: !1073, line: 26, baseType: !1079, size: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !343, line: 104, baseType: !352)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1072, file: !1073, line: 27, baseType: !347, size: 64, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1072, file: !1073, line: 28, baseType: !347, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1072, file: !1073, line: 37, baseType: !347, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1072, file: !1073, line: 38, baseType: !1035, size: 32, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1072, file: !1073, line: 39, baseType: !1035, size: 32, offset: 352)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1072, file: !1073, line: 40, baseType: !962, size: 32, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1072, file: !1073, line: 41, baseType: !970, size: 32, offset: 416)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !1073, line: 42, baseType: !1053, size: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1072, file: !1073, line: 43, baseType: !1056, size: 128, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1072, file: !1073, line: 44, baseType: !1056, size: 128, offset: 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1072, file: !1073, line: 45, baseType: !1056, size: 128, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1072, file: !1073, line: 46, baseType: !1056, size: 128, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1072, file: !1073, line: 47, baseType: !347, size: 64, offset: 1024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1072, file: !1073, line: 48, baseType: !347, size: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !980, file: !208, line: 1883, baseType: !1095, size: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!843, !917, !384, !857}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !980, file: !208, line: 1884, baseType: !1099, size: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!345, !956, !1102, !347, !347}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !980, file: !208, line: 1886, baseType: !1105, size: 64, offset: 1088)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!345, !956, !1108, !345}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !980, file: !208, line: 1887, baseType: !1110, size: 64, offset: 1152)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!345, !956, !917, !887, !7, !852}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !980, file: !208, line: 1890, baseType: !1027, size: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !980, file: !208, line: 1891, baseType: !1115, size: 64, offset: 1280)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!345, !956, !1004, !345}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !957, file: !208, line: 623, baseType: !1119, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1174, !2790, !2872, !2955, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2971, !2975, !2976, !2979, !2980, !2983, !2984, !2985, !3026, !3052, !3053, !3054, !3055, !3056, !3057, !3060, !3062, !3069, !3070, !3072, !3073, !3074, !3133, !3134, !3149, !3150, !3151, !3152, !3153, !3156, !3157, !3158, !3173, !3174, !3175, !3176, !3177, !3178, !3179, !3180, !3181}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1120, file: !208, line: 1417, baseType: !746, size: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1120, file: !208, line: 1418, baseType: !1035, size: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1120, file: !208, line: 1419, baseType: !401, size: 8, offset: 160)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1120, file: !208, line: 1420, baseType: !694, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1120, file: !208, line: 1421, baseType: !1053, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1120, file: !208, line: 1422, baseType: !1128, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1140, !1144, !1148, !1152, !1153, !1154, !1164, !1167, !1168, !1169, !1171, !1172, !1173}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1129, file: !208, line: 2229, baseType: !362, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1129, file: !208, line: 2230, baseType: !345, size: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1129, file: !208, line: 2238, baseType: !1134, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!345, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1139, line: 28, flags: DIFlagFwdDecl)
!1139 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1129, file: !208, line: 2239, baseType: !1141, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1129, file: !208, line: 2240, baseType: !1145, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!917, !1128, !345, !362, !344}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1129, file: !208, line: 2242, baseType: !1149, size: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null, !1119}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1129, file: !208, line: 2243, baseType: !366, size: 64, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1129, file: !208, line: 2244, baseType: !1128, size: 64, offset: 448)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1129, file: !208, line: 2245, baseType: !1155, size: 64, offset: 512)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !343, line: 182, size: 64, elements: !1156)
!1156 = !{!1157}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1155, file: !343, line: 183, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !343, line: 186, size: 128, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1159, file: !343, line: 187, baseType: !1158, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1159, file: !343, line: 187, baseType: !1163, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1129, file: !208, line: 2247, baseType: !1165, offset: 576)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1166, line: 187, elements: !788)
!1166 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1129, file: !208, line: 2248, baseType: !1165, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1129, file: !208, line: 2249, baseType: !1165, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1129, file: !208, line: 2250, baseType: !1170, offset: 576)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, elements: !588)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1129, file: !208, line: 2252, baseType: !1165, offset: 576)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1129, file: !208, line: 2253, baseType: !1165, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1129, file: !208, line: 2254, baseType: !1165, offset: 576)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1120, file: !208, line: 1423, baseType: !1175, size: 64, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1178)
!1178 = !{!1179, !1183, !1187, !1188, !1192, !1198, !1202, !1203, !1204, !1208, !1212, !1213, !1214, !1215, !1221, !1226, !1227, !1234, !1235, !1236, !1237, !2774, !2789}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1177, file: !208, line: 1936, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!956, !1119}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1177, file: !208, line: 1937, baseType: !1184, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !956}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1177, file: !208, line: 1938, baseType: !1184, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1177, file: !208, line: 1940, baseType: !1189, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{null, !956, !345}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1177, file: !208, line: 1941, baseType: !1193, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!345, !956, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1177, file: !208, line: 1942, baseType: !1199, size: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!345, !956}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1177, file: !208, line: 1943, baseType: !1184, size: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1177, file: !208, line: 1944, baseType: !1149, size: 64, offset: 448)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1177, file: !208, line: 1945, baseType: !1205, size: 64, offset: 512)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!345, !1119, !345}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1177, file: !208, line: 1946, baseType: !1209, size: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!345, !1119}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1177, file: !208, line: 1947, baseType: !1209, size: 64, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1177, file: !208, line: 1948, baseType: !1209, size: 64, offset: 704)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1177, file: !208, line: 1949, baseType: !1209, size: 64, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1177, file: !208, line: 1950, baseType: !1216, size: 64, offset: 832)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!345, !917, !1219}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1177, file: !208, line: 1951, baseType: !1222, size: 64, offset: 896)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!345, !1119, !1225, !384}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1177, file: !208, line: 1952, baseType: !1149, size: 64, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1177, file: !208, line: 1954, baseType: !1228, size: 64, offset: 1024)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!345, !1231, !917}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1233, line: 539, flags: DIFlagFwdDecl)
!1233 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1177, file: !208, line: 1955, baseType: !1228, size: 64, offset: 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1177, file: !208, line: 1956, baseType: !1228, size: 64, offset: 1152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1177, file: !208, line: 1957, baseType: !1228, size: 64, offset: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1177, file: !208, line: 1963, baseType: !1238, size: 64, offset: 1280)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!345, !1119, !1241, !342}
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1243, line: 68, size: 512, align: 128, elements: !1244)
!1243 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1244 = !{!1245, !1246, !2766, !2773}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1242, file: !1243, line: 69, baseType: !694, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, scope: !1242, file: !1243, line: 77, baseType: !1247, size: 320, offset: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1242, file: !1243, line: 77, size: 320, elements: !1248)
!1248 = !{!1249, !1430, !1435, !1463, !1471, !1477, !2758, !2765}
!1249 = !DIDerivedType(tag: DW_TAG_member, scope: !1247, file: !1243, line: 78, baseType: !1250, size: 320)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1247, file: !1243, line: 78, size: 320, elements: !1251)
!1251 = !{!1252, !1253, !1428, !1429}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1250, file: !1243, line: 84, baseType: !746, size: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1250, file: !1243, line: 86, baseType: !1254, size: 64, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1256)
!1256 = !{!1257, !1258, !1265, !1266, !1267, !1282, !1298, !1299, !1300, !1301, !1421, !1422, !1425, !1426, !1427}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1255, file: !208, line: 452, baseType: !956, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1255, file: !208, line: 453, baseType: !1259, size: 128, offset: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1260, line: 292, size: 128, elements: !1261)
!1260 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1261 = !{!1262, !1263, !1264}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1259, file: !1260, line: 293, baseType: !774)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1259, file: !1260, line: 295, baseType: !342, size: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1259, file: !1260, line: 296, baseType: !344, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1255, file: !208, line: 454, baseType: !342, size: 32, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1255, file: !208, line: 455, baseType: !491, size: 32, offset: 224)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1255, file: !208, line: 460, baseType: !1268, size: 128, offset: 256)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1269, line: 125, size: 128, elements: !1270)
!1269 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1270 = !{!1271, !1281}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1268, file: !1269, line: 126, baseType: !1272, size: 64)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1269, line: 31, size: 64, elements: !1273)
!1273 = !{!1274}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1272, file: !1269, line: 32, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1269, line: 24, size: 192, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1280}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1276, file: !1269, line: 25, baseType: !694, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1276, file: !1269, line: 26, baseType: !1275, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1276, file: !1269, line: 27, baseType: !1275, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1268, file: !1269, line: 127, baseType: !1275, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1255, file: !208, line: 461, baseType: !1283, size: 256, offset: 384)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1284, line: 35, size: 256, elements: !1285)
!1284 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1285 = !{!1286, !1294, !1295, !1297}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1283, file: !1284, line: 36, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1288, line: 13, baseType: !1289)
!1288 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !343, line: 175, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 173, size: 64, elements: !1291)
!1291 = !{!1292}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1290, file: !343, line: 174, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !348, line: 22, baseType: !622)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1283, file: !1284, line: 42, baseType: !1287, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1283, file: !1284, line: 46, baseType: !1296, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !775, line: 29, baseType: !782)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1283, file: !1284, line: 47, baseType: !746, size: 128, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1255, file: !208, line: 462, baseType: !694, size: 64, offset: 640)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1255, file: !208, line: 463, baseType: !694, size: 64, offset: 704)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1255, file: !208, line: 464, baseType: !694, size: 64, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1255, file: !208, line: 465, baseType: !1302, size: 64, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !208, line: 367, size: 1408, elements: !1305)
!1305 = !{!1306, !1310, !1314, !1318, !1322, !1326, !1332, !1338, !1342, !1347, !1351, !1355, !1359, !1385, !1389, !1395, !1396, !1397, !1401, !1406, !1410, !1417}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1304, file: !208, line: 368, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!345, !1241, !1196}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1304, file: !208, line: 369, baseType: !1311, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!345, !887, !1241}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1304, file: !208, line: 372, baseType: !1315, size: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!345, !1254, !1196}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1304, file: !208, line: 375, baseType: !1319, size: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!345, !1241}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !1304, file: !208, line: 381, baseType: !1323, size: 64, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!345, !887, !1254, !749, !7}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !1304, file: !208, line: 383, baseType: !1327, size: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{null, !1330}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !208, line: 290, flags: DIFlagFwdDecl)
