; ModuleID = '../bcout/drivers/media/dvb-frontends/mt352.llvm.bc'
source_filename = "drivers/media/dvb-frontends/mt352.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dvb_frontend_ops = type { %struct.dvb_frontend_internal_info, [8 x i8], void (%struct.dvb_frontend*)*, void (%struct.dvb_frontend*)*, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i1, i32, i32*, i32*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.dvb_frontend_tune_settings*)*, i32 (%struct.dvb_frontend*, %struct.dtv_frontend_properties*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.dvb_diseqc_master_cmd*)*, i32 (%struct.dvb_frontend*, %struct.dvb_diseqc_slave_reply*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i64)*, i32 (%struct.dvb_frontend*, i64)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, %struct.dvb_tuner_ops, %struct.analog_demod_ops }

!308 = !DIEnumerator(name: "FREQ_OFFSET_2", value: 23, isUnsigned: true)
!309 = !DIEnumerator(name: "FREQ_OFFSET_1", value: 24, isUnsigned: true)
!310 = !DIEnumerator(name: "FREQ_OFFSET_0", value: 25, isUnsigned: true)
!311 = !DIEnumerator(name: "TIMING_OFFSET_1", value: 26, isUnsigned: true)
!312 = !DIEnumerator(name: "TIMING_OFFSET_0", value: 27, isUnsigned: true)
!313 = !DIEnumerator(name: "CHAN_FREQ_1", value: 28, isUnsigned: true)
!314 = !DIEnumerator(name: "CHAN_FREQ_0", value: 29, isUnsigned: true)
!315 = !DIEnumerator(name: "TPS_RECEIVED_1", value: 30, isUnsigned: true)
!316 = !DIEnumerator(name: "TPS_RECEIVED_0", value: 31, isUnsigned: true)
!317 = !DIEnumerator(name: "TPS_CURRENT_1", value: 32, isUnsigned: true)
!318 = !DIEnumerator(name: "TPS_CURRENT_0", value: 33, isUnsigned: true)
!319 = !DIEnumerator(name: "TPS_CELL_ID_1", value: 34, isUnsigned: true)
!320 = !DIEnumerator(name: "TPS_CELL_ID_0", value: 35, isUnsigned: true)
!321 = !DIEnumerator(name: "TPS_MISC_DATA_2", value: 36, isUnsigned: true)
!322 = !DIEnumerator(name: "TPS_MISC_DATA_1", value: 37, isUnsigned: true)
!323 = !DIEnumerator(name: "TPS_MISC_DATA_0", value: 38, isUnsigned: true)
!324 = !DIEnumerator(name: "RESET", value: 80, isUnsigned: true)
!325 = !DIEnumerator(name: "TPS_GIVEN_1", value: 81, isUnsigned: true)
!326 = !DIEnumerator(name: "TPS_GIVEN_0", value: 82, isUnsigned: true)
!327 = !DIEnumerator(name: "ACQ_CTL", value: 83, isUnsigned: true)
!328 = !DIEnumerator(name: "TRL_NOMINAL_RATE_1", value: 84, isUnsigned: true)
!329 = !DIEnumerator(name: "TRL_NOMINAL_RATE_0", value: 85, isUnsigned: true)
!330 = !DIEnumerator(name: "INPUT_FREQ_1", value: 86, isUnsigned: true)
!331 = !DIEnumerator(name: "INPUT_FREQ_0", value: 87, isUnsigned: true)
!332 = !DIEnumerator(name: "TUNER_ADDR", value: 88, isUnsigned: true)
!333 = !DIEnumerator(name: "CHAN_START_1", value: 89, isUnsigned: true)
!334 = !DIEnumerator(name: "CHAN_START_0", value: 90, isUnsigned: true)
!335 = !DIEnumerator(name: "CONT_1", value: 91, isUnsigned: true)
!336 = !DIEnumerator(name: "CONT_0", value: 92, isUnsigned: true)
!337 = !DIEnumerator(name: "TUNER_GO", value: 93, isUnsigned: true)
!338 = !DIEnumerator(name: "STATUS_EN_0", value: 95, isUnsigned: true)
!339 = !DIEnumerator(name: "STATUS_EN_1", value: 96, isUnsigned: true)
!340 = !DIEnumerator(name: "INTERRUPT_EN_0", value: 97, isUnsigned: true)
!341 = !DIEnumerator(name: "INTERRUPT_EN_1", value: 98, isUnsigned: true)
!342 = !DIEnumerator(name: "INTERRUPT_EN_2", value: 99, isUnsigned: true)
!343 = !DIEnumerator(name: "INTERRUPT_EN_3", value: 100, isUnsigned: true)
!344 = !DIEnumerator(name: "AGC_TARGET", value: 103, isUnsigned: true)
!345 = !DIEnumerator(name: "AGC_CTL", value: 104, isUnsigned: true)
!346 = !DIEnumerator(name: "CAPT_RANGE", value: 117, isUnsigned: true)
!347 = !DIEnumerator(name: "SNR_SELECT_1", value: 121, isUnsigned: true)
!348 = !DIEnumerator(name: "SNR_SELECT_0", value: 122, isUnsigned: true)
!349 = !DIEnumerator(name: "RS_ERR_PER_1", value: 124, isUnsigned: true)
!350 = !DIEnumerator(name: "RS_ERR_PER_0", value: 125, isUnsigned: true)
!351 = !DIEnumerator(name: "CHIP_ID", value: 127, isUnsigned: true)
!352 = !DIEnumerator(name: "CHAN_STOP_1", value: 128, isUnsigned: true)
!353 = !DIEnumerator(name: "CHAN_STOP_0", value: 129, isUnsigned: true)
!354 = !DIEnumerator(name: "CHAN_STEP_1", value: 130, isUnsigned: true)
!355 = !DIEnumerator(name: "CHAN_STEP_0", value: 131, isUnsigned: true)
!356 = !DIEnumerator(name: "FEC_LOCK_TIME", value: 133, isUnsigned: true)
!357 = !DIEnumerator(name: "OFDM_LOCK_TIME", value: 134, isUnsigned: true)
!358 = !DIEnumerator(name: "ACQ_DELAY", value: 135, isUnsigned: true)
!359 = !DIEnumerator(name: "SCAN_CTL", value: 136, isUnsigned: true)
!360 = !DIEnumerator(name: "CLOCK_CTL", value: 137, isUnsigned: true)
!361 = !DIEnumerator(name: "CONFIG", value: 138, isUnsigned: true)
!362 = !DIEnumerator(name: "MCLK_RATIO", value: 139, isUnsigned: true)
!363 = !DIEnumerator(name: "GPP_CTL", value: 140, isUnsigned: true)
!364 = !DIEnumerator(name: "ADC_CTL_1", value: 142, isUnsigned: true)
!365 = !DIEnumerator(name: "ADC_CTL_0", value: 143, isUnsigned: true)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !367, line: 305, baseType: !7, size: 32, elements: !368)
!367 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!368 = !{!369, !370, !371, !372}
!369 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!370 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!371 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!372 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!373 = !{!374, !376}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !375, line: 148, baseType: !7)
!375 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!377 = !{!378, !450, !455, !460, !465, !470, !475, !480, !0, !482, !4382, !4386, !4390, !4392, !4396}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 589, type: !380, isLocal: true, isDefinition: true, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !382, line: 69, size: 320, elements: !383)
!382 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!383 = !{!384, !388, !392, !413, !420, !424, !428}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !382, line: 70, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !381, file: !382, line: 71, baseType: !389, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !391, line: 76, flags: DIFlagFwdDecl)
!391 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !381, file: !382, line: 72, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !382, line: 47, size: 256, elements: !396)
!396 = !{!397, !398, !404, !409}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !395, file: !382, line: 49, baseType: !7, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !395, file: !382, line: 51, baseType: !399, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !385, !403}
!402 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !395, file: !382, line: 53, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!402, !408, !403}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !395, file: !382, line: 55, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !376}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !381, file: !382, line: 73, baseType: !414, size: 16, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !416, line: 19, baseType: !417)
!416 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !418, line: 24, baseType: !419)
!418 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!419 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !381, file: !382, line: 74, baseType: !421, size: 8, offset: 208)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !416, line: 16, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !418, line: 20, baseType: !423)
!423 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !381, file: !382, line: 75, baseType: !425, size: 8, offset: 216)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !416, line: 17, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !418, line: 21, baseType: !427)
!427 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!428 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !382, line: 76, baseType: !429, size: 64, offset: 256)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !382, line: 76, size: 64, elements: !430)
!430 = !{!431, !432, !439}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !429, file: !382, line: 77, baseType: !376, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !429, file: !382, line: 78, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !382, line: 86, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !435, file: !382, line: 87, baseType: !7, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !435, file: !382, line: 88, baseType: !408, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !429, file: !382, line: 79, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !382, line: 92, size: 256, elements: !443)
!443 = !{!444, !445, !446, !448, !449}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !442, file: !382, line: 94, baseType: !7, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !442, file: !382, line: 95, baseType: !7, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !442, file: !382, line: 96, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !442, file: !382, line: 97, baseType: !393, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !442, file: !382, line: 98, baseType: !376, size: 64, offset: 192)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 589, type: !452, isLocal: true, isDefinition: true, align: 8)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 200, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 25)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 590, type: !457, isLocal: true, isDefinition: true, align: 8)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 504, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 63)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description222", scope: !2, file: !3, line: 592, type: !462, isLocal: true, isDefinition: true, align: 8)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 456, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 57)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author223", scope: !2, file: !3, line: 593, type: !467, isLocal: true, isDefinition: true, align: 8)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 480, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 60)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file224", scope: !2, file: !3, line: 594, type: !472, isLocal: true, isDefinition: true, align: 8)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 360, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 45)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license225", scope: !2, file: !3, line: 594, type: !477, isLocal: true, isDefinition: true, align: 8)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 144, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 18)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 38, type: !402, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "mt352_reset_attach", scope: !484, file: !3, line: 507, type: !4381, isLocal: true, isDefinition: true)
!484 = distinct !DISubprogram(name: "mt352_init", scope: !3, file: !3, line: 503, type: !485, scopeLine: 504, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !845)
!485 = !DISubroutineType(types: !486)
!486 = !{!402, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !489)
!489 = !{!490, !504, !797, !4369, !4370, !4371, !4372, !4373, !4374, !4375, !4379, !4380}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !488, file: !51, line: 687, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !492, line: 19, size: 32, elements: !493)
!492 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !491, file: !492, line: 20, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !496, line: 113, baseType: !497)
!496 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !496, line: 111, size: 32, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !497, file: !496, line: 112, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !375, line: 168, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 166, size: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !501, file: !375, line: 167, baseType: !402, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !488, file: !51, line: 688, baseType: !505, size: 6016, offset: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !506)
!506 = !{!507, !524, !528, !532, !533, !534, !536, !537, !543, !550, !554, !555, !565, !650, !654, !659, !664, !665, !666, !667, !679, !690, !694, !698, !702, !707, !712, !716, !717, !718, !722, !779}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !505, file: !51, line: 436, baseType: !508, size: 1280)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !509)
!509 = !{!510, !514, !517, !518, !519, !520, !521, !522, !523}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !51, line: 339, baseType: !511, size: 1024)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1024, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !508, file: !51, line: 340, baseType: !515, size: 32, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !416, line: 21, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !418, line: 27, baseType: !7)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !508, file: !51, line: 341, baseType: !515, size: 32, offset: 1056)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !508, file: !51, line: 342, baseType: !515, size: 32, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !508, file: !51, line: 343, baseType: !515, size: 32, offset: 1120)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !508, file: !51, line: 344, baseType: !515, size: 32, offset: 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !508, file: !51, line: 345, baseType: !515, size: 32, offset: 1184)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !508, file: !51, line: 346, baseType: !515, size: 32, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !508, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !505, file: !51, line: 438, baseType: !525, size: 64, offset: 1280)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 64, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !505, file: !51, line: 440, baseType: !529, size: 64, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !487}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !505, file: !51, line: 441, baseType: !529, size: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !505, file: !51, line: 442, baseType: !529, size: 64, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !505, file: !51, line: 444, baseType: !535, size: 64, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !505, file: !51, line: 445, baseType: !535, size: 64, offset: 1600)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !505, file: !51, line: 447, baseType: !538, size: 64, offset: 1664)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!402, !487, !541, !402}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !505, file: !51, line: 450, baseType: !544, size: 64, offset: 1728)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!402, !487, !547, !7, !447, !549}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !375, line: 30, baseType: !548)
!548 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !505, file: !51, line: 457, baseType: !551, size: 64, offset: 1792)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!50, !487}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !505, file: !51, line: 460, baseType: !535, size: 64, offset: 1856)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !505, file: !51, line: 461, baseType: !556, size: 64, offset: 1920)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!402, !487, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !560, file: !51, line: 70, baseType: !402, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !560, file: !51, line: 71, baseType: !402, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !560, file: !51, line: 72, baseType: !402, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !505, file: !51, line: 463, baseType: !566, size: 64, offset: 1984)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!402, !487, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !643, !644, !645, !646, !647, !648, !649}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !570, file: !51, line: 587, baseType: !515, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !570, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !570, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !570, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !570, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !570, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !570, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !570, file: !51, line: 595, baseType: !515, size: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !570, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !570, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !570, file: !51, line: 598, baseType: !515, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !570, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !570, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !570, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !570, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !570, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !570, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !570, file: !51, line: 610, baseType: !425, size: 8, offset: 544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !570, file: !51, line: 611, baseType: !425, size: 8, offset: 552)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !570, file: !51, line: 612, baseType: !425, size: 8, offset: 560)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !570, file: !51, line: 613, baseType: !515, size: 32, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !570, file: !51, line: 614, baseType: !515, size: 32, offset: 608)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !570, file: !51, line: 615, baseType: !425, size: 8, offset: 640)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !570, file: !51, line: 621, baseType: !596, size: 384, offset: 672)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 384, elements: !603)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !51, line: 616, size: 128, elements: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !597, file: !51, line: 617, baseType: !425, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !597, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !597, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !597, file: !51, line: 620, baseType: !425, size: 8, offset: 96)
!603 = !{!604}
!604 = !DISubrange(count: 3)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !570, file: !51, line: 624, baseType: !515, size: 32, offset: 1056)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !570, file: !51, line: 627, baseType: !515, size: 32, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !570, file: !51, line: 630, baseType: !425, size: 8, offset: 1120)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !570, file: !51, line: 631, baseType: !425, size: 8, offset: 1128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !570, file: !51, line: 632, baseType: !425, size: 8, offset: 1136)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !570, file: !51, line: 633, baseType: !425, size: 8, offset: 1144)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !570, file: !51, line: 634, baseType: !425, size: 8, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !570, file: !51, line: 635, baseType: !425, size: 8, offset: 1160)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !570, file: !51, line: 637, baseType: !425, size: 8, offset: 1168)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !570, file: !51, line: 638, baseType: !425, size: 8, offset: 1176)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !570, file: !51, line: 639, baseType: !425, size: 8, offset: 1184)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !570, file: !51, line: 640, baseType: !425, size: 8, offset: 1192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !570, file: !51, line: 641, baseType: !425, size: 8, offset: 1200)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !570, file: !51, line: 642, baseType: !425, size: 8, offset: 1208)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !570, file: !51, line: 643, baseType: !425, size: 8, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !570, file: !51, line: 644, baseType: !425, size: 8, offset: 1224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !570, file: !51, line: 645, baseType: !425, size: 8, offset: 1232)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !570, file: !51, line: 647, baseType: !515, size: 32, offset: 1248)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !570, file: !51, line: 650, baseType: !624, size: 296, offset: 1280)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !624, file: !6, line: 826, baseType: !426, size: 8)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !624, file: !6, line: 827, baseType: !628, size: 288, offset: 8)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 288, elements: !641)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !629, file: !6, line: 804, baseType: !426, size: 8)
!632 = !DIDerivedType(tag: DW_TAG_member, scope: !629, file: !6, line: 805, baseType: !633, size: 64, offset: 8)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !629, file: !6, line: 805, size: 64, elements: !634)
!634 = !{!635, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !633, file: !6, line: 806, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !418, line: 31, baseType: !637)
!637 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !633, file: !6, line: 807, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !418, line: 30, baseType: !640)
!640 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!641 = !{!642}
!642 = !DISubrange(count: 4)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !570, file: !51, line: 651, baseType: !624, size: 296, offset: 1576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !570, file: !51, line: 652, baseType: !624, size: 296, offset: 1872)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !570, file: !51, line: 653, baseType: !624, size: 296, offset: 2168)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !570, file: !51, line: 654, baseType: !624, size: 296, offset: 2464)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !570, file: !51, line: 655, baseType: !624, size: 296, offset: 2760)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !570, file: !51, line: 656, baseType: !624, size: 296, offset: 3056)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !570, file: !51, line: 657, baseType: !624, size: 296, offset: 3352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !505, file: !51, line: 466, baseType: !651, size: 64, offset: 2048)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!402, !487, !549}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !505, file: !51, line: 467, baseType: !655, size: 64, offset: 2112)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!402, !487, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !505, file: !51, line: 468, baseType: !660, size: 64, offset: 2176)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!402, !487, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !505, file: !51, line: 469, baseType: !660, size: 64, offset: 2240)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !505, file: !51, line: 470, baseType: !655, size: 64, offset: 2304)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !505, file: !51, line: 472, baseType: !535, size: 64, offset: 2368)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !505, file: !51, line: 473, baseType: !668, size: 64, offset: 2432)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!402, !487, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !673)
!673 = !{!674, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !672, file: !6, line: 174, baseType: !675, size: 48)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 48, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 6)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !672, file: !6, line: 175, baseType: !426, size: 8, offset: 48)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !505, file: !51, line: 474, baseType: !680, size: 64, offset: 2496)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!402, !487, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !685)
!685 = !{!686, !688, !689}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !684, file: !6, line: 196, baseType: !687, size: 32)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 32, elements: !641)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !684, file: !6, line: 197, baseType: !426, size: 8, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !684, file: !6, line: 198, baseType: !402, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !505, file: !51, line: 475, baseType: !691, size: 64, offset: 2560)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!402, !487, !171}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !505, file: !51, line: 477, baseType: !695, size: 64, offset: 2624)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!402, !487, !78}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !505, file: !51, line: 478, baseType: !699, size: 64, offset: 2688)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!402, !487, !73}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !505, file: !51, line: 480, baseType: !703, size: 64, offset: 2752)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!402, !487, !706}
!706 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !505, file: !51, line: 481, baseType: !708, size: 64, offset: 2816)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!402, !487, !711}
!711 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !505, file: !51, line: 482, baseType: !713, size: 64, offset: 2880)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!402, !487, !402}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !505, file: !51, line: 483, baseType: !713, size: 64, offset: 2944)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !505, file: !51, line: 484, baseType: !535, size: 64, offset: 3008)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !505, file: !51, line: 490, baseType: !719, size: 64, offset: 3072)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!175, !487}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !505, file: !51, line: 492, baseType: !723, size: 2304, offset: 3136)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !724)
!724 = !{!725, !735, !736, !737, !738, !739, !740, !741, !753, !757, !758, !759, !760, !761, !762, !769, !774, !778}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !723, file: !51, line: 228, baseType: !726, size: 1216)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !51, line: 89, baseType: !511, size: 1024)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !726, file: !51, line: 91, baseType: !515, size: 32, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !726, file: !51, line: 92, baseType: !515, size: 32, offset: 1056)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !726, file: !51, line: 93, baseType: !515, size: 32, offset: 1088)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !726, file: !51, line: 95, baseType: !515, size: 32, offset: 1120)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !726, file: !51, line: 96, baseType: !515, size: 32, offset: 1152)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !726, file: !51, line: 97, baseType: !515, size: 32, offset: 1184)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !723, file: !51, line: 230, baseType: !529, size: 64, offset: 1216)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !723, file: !51, line: 231, baseType: !535, size: 64, offset: 1280)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !723, file: !51, line: 232, baseType: !535, size: 64, offset: 1344)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !723, file: !51, line: 233, baseType: !535, size: 64, offset: 1408)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !723, file: !51, line: 234, baseType: !535, size: 64, offset: 1472)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !723, file: !51, line: 237, baseType: !535, size: 64, offset: 1536)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !723, file: !51, line: 238, baseType: !742, size: 64, offset: 1600)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!402, !487, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !746, file: !51, line: 115, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !746, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !746, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !746, file: !51, line: 118, baseType: !752, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !416, line: 23, baseType: !636)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !723, file: !51, line: 240, baseType: !754, size: 64, offset: 1664)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!402, !487, !376}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !723, file: !51, line: 242, baseType: !655, size: 64, offset: 1728)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !723, file: !51, line: 243, baseType: !655, size: 64, offset: 1792)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !723, file: !51, line: 244, baseType: !655, size: 64, offset: 1856)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !723, file: !51, line: 248, baseType: !655, size: 64, offset: 1920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !723, file: !51, line: 249, baseType: !660, size: 64, offset: 1984)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !723, file: !51, line: 250, baseType: !763, size: 64, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!402, !487, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !416, line: 20, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !418, line: 26, baseType: !402)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !723, file: !51, line: 258, baseType: !770, size: 64, offset: 2112)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!402, !487, !773, !402}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !723, file: !51, line: 267, baseType: !775, size: 64, offset: 2176)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!402, !487, !515}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !723, file: !51, line: 268, baseType: !775, size: 64, offset: 2240)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !505, file: !51, line: 493, baseType: !780, size: 576, offset: 5440)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !781)
!781 = !{!782, !786, !790, !791, !792, !793, !794, !795, !796}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !780, file: !51, line: 304, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !51, line: 277, baseType: !408, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !780, file: !51, line: 306, baseType: !787, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !487, !745}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !780, file: !51, line: 308, baseType: !660, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !780, file: !51, line: 309, baseType: !763, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !780, file: !51, line: 310, baseType: !529, size: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !780, file: !51, line: 311, baseType: !529, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !780, file: !51, line: 312, baseType: !529, size: 64, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !780, file: !51, line: 313, baseType: !713, size: 64, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !780, file: !51, line: 316, baseType: !754, size: 64, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !488, file: !51, line: 689, baseType: !798, size: 64, offset: 6080)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !800)
!800 = !{!801, !802, !808, !809, !810, !812, !813, !4347, !4348, !4349, !4368}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !799, file: !272, line: 102, baseType: !402, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !799, file: !272, line: 103, baseType: !803, size: 128, offset: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !375, line: 178, size: 128, elements: !804)
!804 = !{!805, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !375, line: 179, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !803, file: !375, line: 179, baseType: !806, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !799, file: !272, line: 104, baseType: !803, size: 128, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !272, line: 105, baseType: !385, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !799, file: !272, line: 106, baseType: !811, size: 48, offset: 384)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 48, elements: !676)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !799, file: !272, line: 107, baseType: !376, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !799, file: !272, line: 109, baseType: !814, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !816)
!816 = !{!817, !3804, !3805, !3808, !3809, !3860, !3948, !3949, !3950, !3951, !3952, !3961, !4066, !4079, !4274, !4275, !4279, !4281, !4282, !4283, !4287, !4293, !4294, !4297, !4298, !4299, !4300, !4301, !4302, !4303, !4335, !4336, !4337, !4340, !4343, !4344, !4345, !4346}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !815, file: !237, line: 462, baseType: !818, size: 512)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !819, line: 64, size: 512, elements: !820)
!819 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!820 = !{!821, !822, !823, !825, !882, !3659, !3798, !3799, !3800, !3801, !3802, !3803}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !819, line: 65, baseType: !385, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !818, file: !819, line: 66, baseType: !803, size: 128, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !818, file: !819, line: 67, baseType: !824, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !818, file: !819, line: 68, baseType: !826, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !819, line: 192, size: 704, elements: !828)
!828 = !{!829, !830, !846, !847}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !827, file: !819, line: 193, baseType: !803, size: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !827, file: !819, line: 194, baseType: !831, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !832, line: 83, baseType: !833)
!832 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !832, line: 71, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, scope: !833, file: !832, line: 72, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !833, file: !832, line: 72, elements: !837)
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !836, file: !832, line: 73, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !832, line: 20, elements: !840)
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !839, file: !832, line: 21, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !843, line: 25, baseType: !844)
!843 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !843, line: 25, elements: !845)
!845 = !{}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !827, file: !819, line: 195, baseType: !818, size: 512, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !827, file: !819, line: 196, baseType: !848, size: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !819, line: 156, size: 192, elements: !851)
!851 = !{!852, !857, !862}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !850, file: !819, line: 157, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!402, !826, !824}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !819, line: 158, baseType: !858, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!385, !826, !824}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !850, file: !819, line: 159, baseType: !863, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!402, !826, !824, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !819, line: 148, size: 20736, elements: !869)
!869 = !{!870, !872, !876, !877, !881}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !868, file: !819, line: 149, baseType: !871, size: 192)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 192, elements: !603)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !868, file: !819, line: 150, baseType: !873, size: 4096, offset: 192)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 4096, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !868, file: !819, line: 151, baseType: !402, size: 32, offset: 4288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !868, file: !819, line: 152, baseType: !878, size: 16384, offset: 4320)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 16384, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 2048)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !868, file: !819, line: 153, baseType: !402, size: 32, offset: 20704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !818, file: !819, line: 69, baseType: !883, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !819, line: 138, size: 448, elements: !885)
!885 = !{!886, !890, !917, !919, !3621, !3649, !3653}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !884, file: !819, line: 139, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !824}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !884, file: !819, line: 140, baseType: !891, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !894, line: 230, size: 128, elements: !895)
!894 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!895 = !{!896, !910}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !893, file: !894, line: 231, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!900, !824, !904, !408}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !375, line: 60, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !902, line: 73, baseType: !903)
!902 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !902, line: 15, baseType: !706)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !894, line: 30, size: 128, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !905, file: !894, line: 31, baseType: !385, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !905, file: !894, line: 32, baseType: !909, size: 16, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !375, line: 19, baseType: !419)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !893, file: !894, line: 232, baseType: !911, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!900, !824, !904, !385, !914}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !375, line: 55, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !902, line: 72, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !902, line: 16, baseType: !711)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !884, file: !819, line: 141, baseType: !918, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !884, file: !819, line: 142, baseType: !920, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !894, line: 84, size: 320, elements: !924)
!924 = !{!925, !926, !930, !3618, !3619}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !894, line: 85, baseType: !385, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !923, file: !894, line: 86, baseType: !927, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!909, !824, !904, !402}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !923, file: !894, line: 88, baseType: !931, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!909, !824, !934, !402}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !894, line: 168, size: 448, elements: !936)
!936 = !{!937, !938, !939, !940, !3613, !3614}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !935, file: !894, line: 169, baseType: !905, size: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !935, file: !894, line: 170, baseType: !914, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !935, file: !894, line: 171, baseType: !376, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !935, file: !894, line: 172, baseType: !941, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!900, !944, !824, !934, !408, !1110, !914}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !946)
!946 = !{!947, !965, !3578, !3579, !3580, !3581, !3582, !3583, !3584, !3585, !3586, !3587, !3596, !3597, !3606, !3607, !3608, !3609, !3610, !3611, !3612}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !945, file: !208, line: 920, baseType: !948, size: 128)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !945, file: !208, line: 917, size: 128, elements: !949)
!949 = !{!950, !956}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !948, file: !208, line: 918, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !952, line: 58, size: 64, elements: !953)
!952 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !951, file: !952, line: 59, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !948, file: !208, line: 919, baseType: !957, size: 128, align: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !375, line: 216, size: 128, align: 64, elements: !958)
!958 = !{!959, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !957, file: !375, line: 217, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !957, file: !375, line: 218, baseType: !962, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !960}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !945, file: !208, line: 921, baseType: !966, size: 128, offset: 128)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !967, line: 8, size: 128, elements: !968)
!967 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!968 = !{!969, !973}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !966, file: !967, line: 9, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !972, line: 18, flags: DIFlagFwdDecl)
!972 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !966, file: !967, line: 10, baseType: !974, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !972, line: 89, size: 1536, elements: !976)
!976 = !{!977, !978, !988, !996, !997, !1012, !3547, !3549, !3561, !3562, !3563, !3564, !3565, !3570, !3571, !3572}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !975, file: !972, line: 91, baseType: !7, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !975, file: !972, line: 92, baseType: !979, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !980, line: 277, baseType: !981)
!980 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !980, line: 277, size: 32, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !981, file: !980, line: 277, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !980, line: 70, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !980, line: 65, size: 32, elements: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !985, file: !980, line: 66, baseType: !7, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !975, file: !972, line: 93, baseType: !989, size: 128, offset: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !990, line: 38, size: 128, elements: !991)
!990 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!991 = !{!992, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !990, line: 39, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !989, file: !990, line: 39, baseType: !995, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !975, file: !972, line: 94, baseType: !974, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !975, file: !972, line: 95, baseType: !998, size: 128, offset: 256)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !972, line: 47, size: 128, elements: !999)
!999 = !{!1000, !1009}
!1000 = !DIDerivedType(tag: DW_TAG_member, scope: !998, file: !972, line: 48, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !998, file: !972, line: 48, size: 64, elements: !1002)
!1002 = !{!1003, !1008}
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !1001, file: !972, line: 49, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1001, file: !972, line: 49, size: 64, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1004, file: !972, line: 50, baseType: !515, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1004, file: !972, line: 50, baseType: !515, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !1001, file: !972, line: 52, baseType: !752, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !972, line: 54, baseType: !1010, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !975, file: !972, line: 96, baseType: !1013, size: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1026, !1033, !1034, !1175, !3241, !3242, !3243, !3249, !3250, !3251, !3252, !3253, !3254, !3255, !3256, !3257, !3258, !3259, !3260, !3261, !3262, !3263, !3264, !3265, !3266, !3267, !3268, !3273, !3274, !3275, !3276, !3277, !3278, !3279, !3515, !3523, !3524, !3525, !3543, !3544, !3545, !3546}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !1014, file: !208, line: 611, baseType: !909, size: 16)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !1014, file: !208, line: 612, baseType: !419, size: 16, offset: 16)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !1014, file: !208, line: 613, baseType: !1019, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !1020, line: 23, baseType: !1021)
!1020 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1020, line: 21, size: 32, elements: !1022)
!1022 = !{!1023}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1021, file: !1020, line: 22, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !375, line: 32, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !902, line: 49, baseType: !7)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !1014, file: !208, line: 614, baseType: !1027, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !1020, line: 28, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1020, line: 26, size: 32, elements: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1028, file: !1020, line: 27, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !375, line: 33, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !902, line: 50, baseType: !7)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !1014, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !1014, file: !208, line: 622, baseType: !1035, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !1038)
!1038 = !{!1039, !1043, !1053, !1057, !1063, !1067, !1071, !1075, !1079, !1083, !1087, !1088, !1094, !1098, !1122, !1151, !1155, !1161, !1166, !1170, !1171}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !1037, file: !208, line: 1865, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!974, !1013, !974, !7}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !1037, file: !208, line: 1866, baseType: !1044, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!385, !974, !1013, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !1049, line: 10, size: 128, elements: !1050)
!1049 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1048, file: !1049, line: 11, baseType: !410, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1048, file: !1049, line: 12, baseType: !376, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !1037, file: !208, line: 1867, baseType: !1054, size: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!402, !1013, !402}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !1037, file: !208, line: 1868, baseType: !1058, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1061, !1013, !402}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !1037, file: !208, line: 1870, baseType: !1064, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!402, !974, !408, !402}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !1037, file: !208, line: 1872, baseType: !1068, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!402, !1013, !974, !909, !547}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1037, file: !208, line: 1873, baseType: !1072, size: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!402, !974, !1013, !974}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !1037, file: !208, line: 1874, baseType: !1076, size: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!402, !1013, !974}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !1037, file: !208, line: 1875, baseType: !1080, size: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!402, !1013, !974, !385}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !1037, file: !208, line: 1876, baseType: !1084, size: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!402, !1013, !974, !909}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !1037, file: !208, line: 1877, baseType: !1076, size: 64, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !1037, file: !208, line: 1878, baseType: !1089, size: 64, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!402, !1013, !974, !909, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !375, line: 16, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !375, line: 13, baseType: !515)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !1037, file: !208, line: 1879, baseType: !1095, size: 64, offset: 768)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!402, !1013, !974, !1013, !974, !7}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !1037, file: !208, line: 1881, baseType: !1099, size: 64, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!402, !974, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1112, !1119, !1120, !1121}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1103, file: !208, line: 220, baseType: !7, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1103, file: !208, line: 221, baseType: !909, size: 16, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1103, file: !208, line: 222, baseType: !1019, size: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1103, file: !208, line: 223, baseType: !1027, size: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1103, file: !208, line: 224, baseType: !1110, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !375, line: 46, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !902, line: 88, baseType: !640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1103, file: !208, line: 225, baseType: !1113, size: 128, offset: 192)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1114, line: 13, size: 128, elements: !1115)
!1114 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1115 = !{!1116, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1113, file: !1114, line: 14, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1114, line: 8, baseType: !639)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1113, file: !1114, line: 15, baseType: !706, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1103, file: !208, line: 226, baseType: !1113, size: 128, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1103, file: !208, line: 227, baseType: !1113, size: 128, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1103, file: !208, line: 234, baseType: !944, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !1037, file: !208, line: 1882, baseType: !1123, size: 64, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!402, !1126, !1128, !515, !7}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1130, line: 22, size: 1152, elements: !1131)
!1130 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1131 = !{!1132, !1133, !1134, !1135, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1129, file: !1130, line: 23, baseType: !515, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1129, file: !1130, line: 24, baseType: !909, size: 16, offset: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1129, file: !1130, line: 25, baseType: !7, size: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1129, file: !1130, line: 26, baseType: !1136, size: 32, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !375, line: 104, baseType: !515)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1129, file: !1130, line: 27, baseType: !752, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1129, file: !1130, line: 28, baseType: !752, size: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1129, file: !1130, line: 37, baseType: !752, size: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1129, file: !1130, line: 38, baseType: !1092, size: 32, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1129, file: !1130, line: 39, baseType: !1092, size: 32, offset: 352)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1129, file: !1130, line: 40, baseType: !1019, size: 32, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1129, file: !1130, line: 41, baseType: !1027, size: 32, offset: 416)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !1130, line: 42, baseType: !1110, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1129, file: !1130, line: 43, baseType: !1113, size: 128, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1129, file: !1130, line: 44, baseType: !1113, size: 128, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1129, file: !1130, line: 45, baseType: !1113, size: 128, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1129, file: !1130, line: 46, baseType: !1113, size: 128, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1129, file: !1130, line: 47, baseType: !752, size: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1129, file: !1130, line: 48, baseType: !752, size: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !1037, file: !208, line: 1883, baseType: !1152, size: 64, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!900, !974, !408, !914}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !1037, file: !208, line: 1884, baseType: !1156, size: 64, offset: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!402, !1013, !1159, !752, !752}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !1037, file: !208, line: 1886, baseType: !1162, size: 64, offset: 1088)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!402, !1013, !1165, !402}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !1037, file: !208, line: 1887, baseType: !1167, size: 64, offset: 1152)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!402, !1013, !974, !944, !7, !909}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1037, file: !208, line: 1890, baseType: !1084, size: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !1037, file: !208, line: 1891, baseType: !1172, size: 64, offset: 1280)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!402, !1013, !1061, !402}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !1014, file: !208, line: 623, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1231, !2849, !2931, !3014, !3018, !3019, !3020, !3021, !3022, !3023, !3024, !3025, !3030, !3034, !3035, !3038, !3039, !3042, !3043, !3044, !3085, !3111, !3112, !3113, !3114, !3115, !3116, !3119, !3121, !3128, !3129, !3131, !3132, !3133, !3192, !3193, !3208, !3209, !3210, !3211, !3212, !3215, !3216, !3217, !3232, !3233, !3234, !3235, !3236, !3237, !3238, !3239, !3240}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1177, file: !208, line: 1417, baseType: !803, size: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1177, file: !208, line: 1418, baseType: !1092, size: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1177, file: !208, line: 1419, baseType: !427, size: 8, offset: 160)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1177, file: !208, line: 1420, baseType: !711, size: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1177, file: !208, line: 1421, baseType: !1110, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1177, file: !208, line: 1422, baseType: !1185, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1197, !1201, !1205, !1209, !1210, !1211, !1221, !1224, !1225, !1226, !1228, !1229, !1230}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1186, file: !208, line: 2229, baseType: !385, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1186, file: !208, line: 2230, baseType: !402, size: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1186, file: !208, line: 2238, baseType: !1191, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!402, !1194}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1196, line: 28, flags: DIFlagFwdDecl)
!1196 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1186, file: !208, line: 2239, baseType: !1198, size: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1186, file: !208, line: 2240, baseType: !1202, size: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!974, !1185, !402, !385, !376}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1186, file: !208, line: 2242, baseType: !1206, size: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !1176}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1186, file: !208, line: 2243, baseType: !389, size: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1186, file: !208, line: 2244, baseType: !1185, size: 64, offset: 448)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1186, file: !208, line: 2245, baseType: !1212, size: 64, offset: 512)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !375, line: 182, size: 64, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1212, file: !375, line: 183, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !375, line: 186, size: 128, elements: !1217)
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1216, file: !375, line: 187, baseType: !1215, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1216, file: !375, line: 187, baseType: !1220, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1186, file: !208, line: 2247, baseType: !1222, offset: 576)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1223, line: 187, elements: !845)
!1223 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1186, file: !208, line: 2248, baseType: !1222, offset: 576)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1186, file: !208, line: 2249, baseType: !1222, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1186, file: !208, line: 2250, baseType: !1227, offset: 576)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, elements: !603)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1186, file: !208, line: 2252, baseType: !1222, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1186, file: !208, line: 2253, baseType: !1222, offset: 576)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1186, file: !208, line: 2254, baseType: !1222, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1177, file: !208, line: 1423, baseType: !1232, size: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1235)
!1235 = !{!1236, !1240, !1244, !1245, !1249, !1255, !1259, !1260, !1261, !1265, !1269, !1270, !1271, !1272, !1278, !1283, !1284, !1291, !1292, !1293, !1294, !2833, !2848}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1234, file: !208, line: 1936, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!1013, !1176}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1234, file: !208, line: 1937, baseType: !1241, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !1013}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1234, file: !208, line: 1938, baseType: !1241, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1234, file: !208, line: 1940, baseType: !1246, size: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !1013, !402}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1234, file: !208, line: 1941, baseType: !1250, size: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!402, !1013, !1253}
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1234, file: !208, line: 1942, baseType: !1256, size: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!402, !1013}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1234, file: !208, line: 1943, baseType: !1241, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1234, file: !208, line: 1944, baseType: !1206, size: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1234, file: !208, line: 1945, baseType: !1262, size: 64, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!402, !1176, !402}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1234, file: !208, line: 1946, baseType: !1266, size: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!402, !1176}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1234, file: !208, line: 1947, baseType: !1266, size: 64, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1234, file: !208, line: 1948, baseType: !1266, size: 64, offset: 704)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1234, file: !208, line: 1949, baseType: !1266, size: 64, offset: 768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1234, file: !208, line: 1950, baseType: !1273, size: 64, offset: 832)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!402, !974, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1234, file: !208, line: 1951, baseType: !1279, size: 64, offset: 896)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!402, !1176, !1282, !408}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1234, file: !208, line: 1952, baseType: !1206, size: 64, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1234, file: !208, line: 1954, baseType: !1285, size: 64, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!402, !1288, !974}
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1290, line: 539, flags: DIFlagFwdDecl)
!1290 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1234, file: !208, line: 1955, baseType: !1285, size: 64, offset: 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1234, file: !208, line: 1956, baseType: !1285, size: 64, offset: 1152)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1234, file: !208, line: 1957, baseType: !1285, size: 64, offset: 1216)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1234, file: !208, line: 1963, baseType: !1295, size: 64, offset: 1280)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!402, !1176, !1298, !374}
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1300, line: 68, size: 512, align: 128, elements: !1301)
!1300 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1301 = !{!1302, !1303, !2825, !2832}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1299, file: !1300, line: 69, baseType: !711, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, scope: !1299, file: !1300, line: 77, baseType: !1304, size: 320, offset: 64)
!1304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1299, file: !1300, line: 77, size: 320, elements: !1305)
!1305 = !{!1306, !1487, !1492, !1520, !1528, !1534, !2817, !2824}
!1306 = !DIDerivedType(tag: DW_TAG_member, scope: !1304, file: !1300, line: 78, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1304, file: !1300, line: 78, size: 320, elements: !1308)
!1308 = !{!1309, !1310, !1485, !1486}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1307, file: !1300, line: 84, baseType: !803, size: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1307, file: !1300, line: 86, baseType: !1311, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1322, !1323, !1324, !1339, !1355, !1356, !1357, !1358, !1478, !1479, !1482, !1483, !1484}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1312, file: !208, line: 452, baseType: !1013, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1312, file: !208, line: 453, baseType: !1316, size: 128, offset: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1317, line: 292, size: 128, elements: !1318)
!1317 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1318 = !{!1319, !1320, !1321}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1316, file: !1317, line: 293, baseType: !831)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1316, file: !1317, line: 295, baseType: !374, size: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1316, file: !1317, line: 296, baseType: !376, size: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1312, file: !208, line: 454, baseType: !374, size: 32, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1312, file: !208, line: 455, baseType: !500, size: 32, offset: 224)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1312, file: !208, line: 460, baseType: !1325, size: 128, offset: 256)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1326, line: 125, size: 128, elements: !1327)
!1326 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1327 = !{!1328, !1338}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1325, file: !1326, line: 126, baseType: !1329, size: 64)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1326, line: 31, size: 64, elements: !1330)
!1330 = !{!1331}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1329, file: !1326, line: 32, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1326, line: 24, size: 192, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1333, file: !1326, line: 25, baseType: !711, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1333, file: !1326, line: 26, baseType: !1332, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1333, file: !1326, line: 27, baseType: !1332, size: 64, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1325, file: !1326, line: 127, baseType: !1332, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1312, file: !208, line: 461, baseType: !1340, size: 256, offset: 384)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1341, line: 35, size: 256, elements: !1342)
!1341 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1342 = !{!1343, !1351, !1352, !1354}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1340, file: !1341, line: 36, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1345, line: 13, baseType: !1346)
!1345 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !375, line: 175, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 173, size: 64, elements: !1348)
!1348 = !{!1349}
