; ModuleID = '../bcout/drivers/media/dvb-frontends/stv6110x.llvm.bc'
source_filename = "drivers/media/dvb-frontends/stv6110x.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_stv6110x_driver_init6:\09\09\09"
module asm ".long\09stv6110x_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.stv6110x_devctl = type { i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32*)* }
%struct.dvb_frontend = type { %struct.kref, %struct.dvb_frontend_ops, %struct.dvb_adapter*, i8*, i8*, i8*, i8*, i8*, %struct.dtv_frontend_properties, i32 (i8*, i32, i32, i32)*, i32, i32 }
%struct.kref = type { %struct.refcount_struct }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.atomic_t = type { i32 }

!262 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!265 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!266 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!267 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!268 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!269 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!270 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dvb_device_type", file: !272, line: 57, baseType: !7, size: 32, elements: !273)
!272 = !DIFile(filename: "./include/media/dvbdev.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282}
!274 = !DIEnumerator(name: "DVB_DEVICE_SEC", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "DVB_DEVICE_FRONTEND", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "DVB_DEVICE_DEMUX", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "DVB_DEVICE_DVR", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "DVB_DEVICE_CA", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "DVB_DEVICE_NET", value: 5, isUnsigned: true)
!280 = !DIEnumerator(name: "DVB_DEVICE_VIDEO", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "DVB_DEVICE_AUDIO", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "DVB_DEVICE_OSD", value: 8, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tuner_mode", file: !284, line: 23, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "drivers/media/dvb-frontends/stv6110x.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !287}
!286 = !DIEnumerator(name: "TUNER_SLEEP", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "TUNER_WAKE", value: 2, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !289, line: 305, baseType: !7, size: 32, elements: !290)
!289 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!290 = !{!291, !292, !293, !294}
!291 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tuner_status", file: !284, line: 28, baseType: !7, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIEnumerator(name: "TUNER_PHASELOCKED", value: 1, isUnsigned: true)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "i2c_alert_protocol", file: !299, line: 215, baseType: !7, size: 32, elements: !300)
!299 = !DIFile(filename: "./include/linux/i2c.h", directory: "/home/lizy2001/genbc/linux")
!300 = !{!301, !302}
!301 = !DIEnumerator(name: "I2C_PROTOCOL_SMBUS_ALERT", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "I2C_PROTOCOL_SMBUS_HOST_NOTIFY", value: 1, isUnsigned: true)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_prop_type", file: !304, line: 19, baseType: !7, size: 32, elements: !305)
!304 = !DIFile(filename: "./include/linux/property.h", directory: "/home/lizy2001/genbc/linux")
!305 = !{!306, !307, !308, !309, !310, !311}
!306 = !DIEnumerator(name: "DEV_PROP_U8", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "DEV_PROP_U16", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "DEV_PROP_U32", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "DEV_PROP_U64", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "DEV_PROP_STRING", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "DEV_PROP_REF", value: 5, isUnsigned: true)
!312 = !{!313, !315, !316, !317, !321}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !314, line: 148, baseType: !7)
!314 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!316 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !318, line: 20, baseType: !319)
!318 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !320, line: 26, baseType: !316)
!320 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !323, line: 76, flags: DIFlagFwdDecl)
!323 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!324 = !{!325, !391, !396, !401, !403, !410, !415, !420, !425, !430, !0, !432, !4340, !4343, !4571}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "__param_verbose", scope: !2, file: !3, line: 27, type: !327, isLocal: true, isDefinition: true, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !329, line: 69, size: 320, elements: !330)
!329 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!330 = !{!331, !335, !336, !356, !361, !365, !369}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 70, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !328, file: !329, line: 71, baseType: !321, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !328, file: !329, line: 72, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !329, line: 47, size: 256, elements: !340)
!340 = !{!341, !342, !347, !352}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !329, line: 49, baseType: !7, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !339, file: !329, line: 51, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!316, !332, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !339, file: !329, line: 53, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!316, !351, !346}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !339, file: !329, line: 55, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !315}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !328, file: !329, line: 73, baseType: !357, size: 16, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !318, line: 19, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !320, line: 24, baseType: !360)
!360 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !328, file: !329, line: 74, baseType: !362, size: 8, offset: 208)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !318, line: 16, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !320, line: 20, baseType: !364)
!364 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !328, file: !329, line: 75, baseType: !366, size: 8, offset: 216)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !318, line: 17, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !320, line: 21, baseType: !368)
!368 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !329, line: 76, baseType: !370, size: 64, offset: 256)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !329, line: 76, size: 64, elements: !371)
!371 = !{!372, !373, !380}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !370, file: !329, line: 77, baseType: !315, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !370, file: !329, line: 78, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !329, line: 86, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !376, file: !329, line: 87, baseType: !7, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !376, file: !329, line: 88, baseType: !351, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !370, file: !329, line: 79, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !329, line: 92, size: 256, elements: !384)
!384 = !{!385, !386, !387, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !383, file: !329, line: 94, baseType: !7, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !383, file: !329, line: 95, baseType: !7, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !383, file: !329, line: 96, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !383, file: !329, line: 97, baseType: !337, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !383, file: !329, line: 98, baseType: !315, size: 64, offset: 192)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_verbosetype220", scope: !2, file: !3, line: 27, type: !393, isLocal: true, isDefinition: true, align: 8)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 240, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 30)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_verbose221", scope: !2, file: !3, line: 28, type: !398, isLocal: true, isDefinition: true, align: 8)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 336, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 42)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_stv6110x_driver_init222", scope: !2, file: !3, line: 490, type: !315, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "__exitcall_stv6110x_driver_exit", scope: !2, file: !3, line: 490, type: !405, isLocal: true, isDefinition: true)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !406, line: 117, baseType: !407)
!406 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author223", scope: !2, file: !3, line: 492, type: !412, isLocal: true, isDefinition: true, align: 8)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 232, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 29)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description224", scope: !2, file: !3, line: 493, type: !417, isLocal: true, isDefinition: true, align: 8)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 352, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 44)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file225", scope: !2, file: !3, line: 494, type: !422, isLocal: true, isDefinition: true, align: 8)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 408, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 51)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license226", scope: !2, file: !3, line: 494, type: !427, isLocal: true, isDefinition: true, align: 8)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 168, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 21)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 26, type: !7, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "stv6110x_ctl", scope: !2, file: !3, line: 380, type: !434, isLocal: true, isDefinition: true)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stv6110x_devctl", file: !284, line: 32, size: 704, elements: !435)
!435 = !{!436, !4327, !4328, !4332, !4333, !4334, !4335, !4336, !4337, !4338, !4339}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_init", scope: !434, file: !284, line: 33, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!316, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !442)
!442 = !{!443, !457, !747, !4315, !4316, !4317, !4318, !4319, !4320, !4321, !4325, !4326}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !441, file: !51, line: 687, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !445, line: 19, size: 32, elements: !446)
!445 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !444, file: !445, line: 20, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !449, line: 113, baseType: !450)
!449 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !449, line: 111, size: 32, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !450, file: !449, line: 112, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !314, line: 168, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 166, size: 32, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !454, file: !314, line: 167, baseType: !316, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !441, file: !51, line: 688, baseType: !458, size: 6016, offset: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !459)
!459 = !{!460, !477, !481, !485, !486, !487, !488, !489, !495, !502, !506, !507, !517, !602, !606, !611, !616, !617, !618, !619, !631, !642, !646, !650, !654, !659, !664, !668, !669, !670, !674, !729}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !458, file: !51, line: 436, baseType: !461, size: 1280)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !462)
!462 = !{!463, !467, !470, !471, !472, !473, !474, !475, !476}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !51, line: 339, baseType: !464, size: 1024)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 1024, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !461, file: !51, line: 340, baseType: !468, size: 32, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !318, line: 21, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !320, line: 27, baseType: !7)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !461, file: !51, line: 341, baseType: !468, size: 32, offset: 1056)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !461, file: !51, line: 342, baseType: !468, size: 32, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !461, file: !51, line: 343, baseType: !468, size: 32, offset: 1120)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !461, file: !51, line: 344, baseType: !468, size: 32, offset: 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !461, file: !51, line: 345, baseType: !468, size: 32, offset: 1184)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !461, file: !51, line: 346, baseType: !468, size: 32, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !461, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !458, file: !51, line: 438, baseType: !478, size: 64, offset: 1280)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 64, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !458, file: !51, line: 440, baseType: !482, size: 64, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !440}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !458, file: !51, line: 441, baseType: !482, size: 64, offset: 1408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !458, file: !51, line: 442, baseType: !482, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !458, file: !51, line: 444, baseType: !437, size: 64, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !458, file: !51, line: 445, baseType: !437, size: 64, offset: 1600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !458, file: !51, line: 447, baseType: !490, size: 64, offset: 1664)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!316, !440, !493, !316}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !458, file: !51, line: 450, baseType: !496, size: 64, offset: 1728)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!316, !440, !499, !7, !388, !501}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !314, line: 30, baseType: !500)
!500 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !458, file: !51, line: 457, baseType: !503, size: 64, offset: 1792)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!50, !440}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !458, file: !51, line: 460, baseType: !437, size: 64, offset: 1856)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !458, file: !51, line: 461, baseType: !508, size: 64, offset: 1920)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!316, !440, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !512, file: !51, line: 70, baseType: !316, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !512, file: !51, line: 71, baseType: !316, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !512, file: !51, line: 72, baseType: !316, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !458, file: !51, line: 463, baseType: !518, size: 64, offset: 1984)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!316, !440, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !595, !596, !597, !598, !599, !600, !601}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !522, file: !51, line: 587, baseType: !468, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !522, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !522, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !522, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !522, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !522, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !522, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !522, file: !51, line: 595, baseType: !468, size: 32, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !522, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !522, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !522, file: !51, line: 598, baseType: !468, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !522, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !522, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !522, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !522, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !522, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !522, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !522, file: !51, line: 610, baseType: !366, size: 8, offset: 544)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !522, file: !51, line: 611, baseType: !366, size: 8, offset: 552)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !522, file: !51, line: 612, baseType: !366, size: 8, offset: 560)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !522, file: !51, line: 613, baseType: !468, size: 32, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !522, file: !51, line: 614, baseType: !468, size: 32, offset: 608)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !522, file: !51, line: 615, baseType: !366, size: 8, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !522, file: !51, line: 621, baseType: !548, size: 384, offset: 672)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 384, elements: !555)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !522, file: !51, line: 616, size: 128, elements: !550)
!550 = !{!551, !552, !553, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !549, file: !51, line: 617, baseType: !366, size: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !549, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !549, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !549, file: !51, line: 620, baseType: !366, size: 8, offset: 96)
!555 = !{!556}
!556 = !DISubrange(count: 3)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !522, file: !51, line: 624, baseType: !468, size: 32, offset: 1056)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !522, file: !51, line: 627, baseType: !468, size: 32, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !522, file: !51, line: 630, baseType: !366, size: 8, offset: 1120)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !522, file: !51, line: 631, baseType: !366, size: 8, offset: 1128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !522, file: !51, line: 632, baseType: !366, size: 8, offset: 1136)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !522, file: !51, line: 633, baseType: !366, size: 8, offset: 1144)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !522, file: !51, line: 634, baseType: !366, size: 8, offset: 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !522, file: !51, line: 635, baseType: !366, size: 8, offset: 1160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !522, file: !51, line: 637, baseType: !366, size: 8, offset: 1168)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !522, file: !51, line: 638, baseType: !366, size: 8, offset: 1176)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !522, file: !51, line: 639, baseType: !366, size: 8, offset: 1184)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !522, file: !51, line: 640, baseType: !366, size: 8, offset: 1192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !522, file: !51, line: 641, baseType: !366, size: 8, offset: 1200)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !522, file: !51, line: 642, baseType: !366, size: 8, offset: 1208)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !522, file: !51, line: 643, baseType: !366, size: 8, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !522, file: !51, line: 644, baseType: !366, size: 8, offset: 1224)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !522, file: !51, line: 645, baseType: !366, size: 8, offset: 1232)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !522, file: !51, line: 647, baseType: !468, size: 32, offset: 1248)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !522, file: !51, line: 650, baseType: !576, size: 296, offset: 1280)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !576, file: !6, line: 826, baseType: !367, size: 8)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !576, file: !6, line: 827, baseType: !580, size: 288, offset: 8)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 288, elements: !593)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !581, file: !6, line: 804, baseType: !367, size: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, scope: !581, file: !6, line: 805, baseType: !585, size: 64, offset: 8)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !581, file: !6, line: 805, size: 64, elements: !586)
!586 = !{!587, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !585, file: !6, line: 806, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !320, line: 31, baseType: !589)
!589 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !585, file: !6, line: 807, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !320, line: 30, baseType: !592)
!592 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!593 = !{!594}
!594 = !DISubrange(count: 4)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !522, file: !51, line: 651, baseType: !576, size: 296, offset: 1576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !522, file: !51, line: 652, baseType: !576, size: 296, offset: 1872)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !522, file: !51, line: 653, baseType: !576, size: 296, offset: 2168)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !522, file: !51, line: 654, baseType: !576, size: 296, offset: 2464)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !522, file: !51, line: 655, baseType: !576, size: 296, offset: 2760)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !522, file: !51, line: 656, baseType: !576, size: 296, offset: 3056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !522, file: !51, line: 657, baseType: !576, size: 296, offset: 3352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !458, file: !51, line: 466, baseType: !603, size: 64, offset: 2048)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!316, !440, !501}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !458, file: !51, line: 467, baseType: !607, size: 64, offset: 2112)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!316, !440, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !458, file: !51, line: 468, baseType: !612, size: 64, offset: 2176)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!316, !440, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !458, file: !51, line: 469, baseType: !612, size: 64, offset: 2240)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !458, file: !51, line: 470, baseType: !607, size: 64, offset: 2304)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !458, file: !51, line: 472, baseType: !437, size: 64, offset: 2368)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !458, file: !51, line: 473, baseType: !620, size: 64, offset: 2432)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!316, !440, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !625)
!625 = !{!626, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !624, file: !6, line: 174, baseType: !627, size: 48)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 48, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 6)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !624, file: !6, line: 175, baseType: !367, size: 8, offset: 48)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !458, file: !51, line: 474, baseType: !632, size: 64, offset: 2496)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!316, !440, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !637)
!637 = !{!638, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !636, file: !6, line: 196, baseType: !639, size: 32)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, elements: !593)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !636, file: !6, line: 197, baseType: !367, size: 8, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !636, file: !6, line: 198, baseType: !316, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !458, file: !51, line: 475, baseType: !643, size: 64, offset: 2560)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!316, !440, !171}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !458, file: !51, line: 477, baseType: !647, size: 64, offset: 2624)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!316, !440, !78}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !458, file: !51, line: 478, baseType: !651, size: 64, offset: 2688)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!316, !440, !73}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !458, file: !51, line: 480, baseType: !655, size: 64, offset: 2752)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!316, !440, !658}
!658 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !458, file: !51, line: 481, baseType: !660, size: 64, offset: 2816)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!316, !440, !663}
!663 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !458, file: !51, line: 482, baseType: !665, size: 64, offset: 2880)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!316, !440, !316}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !458, file: !51, line: 483, baseType: !665, size: 64, offset: 2944)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !458, file: !51, line: 484, baseType: !437, size: 64, offset: 3008)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !458, file: !51, line: 490, baseType: !671, size: 64, offset: 3072)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!175, !440}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !458, file: !51, line: 492, baseType: !675, size: 2304, offset: 3136)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !676)
!676 = !{!677, !687, !688, !689, !690, !691, !692, !693, !705, !709, !710, !711, !712, !713, !714, !719, !724, !728}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !675, file: !51, line: 228, baseType: !678, size: 1216)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !51, line: 89, baseType: !464, size: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !678, file: !51, line: 91, baseType: !468, size: 32, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !678, file: !51, line: 92, baseType: !468, size: 32, offset: 1056)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !678, file: !51, line: 93, baseType: !468, size: 32, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !678, file: !51, line: 95, baseType: !468, size: 32, offset: 1120)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !678, file: !51, line: 96, baseType: !468, size: 32, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !678, file: !51, line: 97, baseType: !468, size: 32, offset: 1184)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !675, file: !51, line: 230, baseType: !482, size: 64, offset: 1216)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !675, file: !51, line: 231, baseType: !437, size: 64, offset: 1280)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !675, file: !51, line: 232, baseType: !437, size: 64, offset: 1344)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !675, file: !51, line: 233, baseType: !437, size: 64, offset: 1408)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !675, file: !51, line: 234, baseType: !437, size: 64, offset: 1472)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !675, file: !51, line: 237, baseType: !437, size: 64, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !675, file: !51, line: 238, baseType: !694, size: 64, offset: 1600)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!316, !440, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !699)
!699 = !{!700, !701, !702, !703}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !698, file: !51, line: 115, baseType: !7, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !698, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !698, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !698, file: !51, line: 118, baseType: !704, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !318, line: 23, baseType: !588)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !675, file: !51, line: 240, baseType: !706, size: 64, offset: 1664)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!316, !440, !315}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !675, file: !51, line: 242, baseType: !607, size: 64, offset: 1728)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !675, file: !51, line: 243, baseType: !607, size: 64, offset: 1792)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !675, file: !51, line: 244, baseType: !607, size: 64, offset: 1856)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !675, file: !51, line: 248, baseType: !607, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !675, file: !51, line: 249, baseType: !612, size: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !675, file: !51, line: 250, baseType: !715, size: 64, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!316, !440, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !675, file: !51, line: 258, baseType: !720, size: 64, offset: 2112)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!316, !440, !723, !316}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !675, file: !51, line: 267, baseType: !725, size: 64, offset: 2176)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!316, !440, !468}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !675, file: !51, line: 268, baseType: !725, size: 64, offset: 2240)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !458, file: !51, line: 493, baseType: !730, size: 576, offset: 5440)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !731)
!731 = !{!732, !736, !740, !741, !742, !743, !744, !745, !746}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !730, file: !51, line: 304, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !51, line: 277, baseType: !351, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !730, file: !51, line: 306, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !440, !697}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !730, file: !51, line: 308, baseType: !612, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !730, file: !51, line: 309, baseType: !715, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !730, file: !51, line: 310, baseType: !482, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !730, file: !51, line: 311, baseType: !482, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !730, file: !51, line: 312, baseType: !482, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !730, file: !51, line: 313, baseType: !665, size: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !730, file: !51, line: 316, baseType: !706, size: 64, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !441, file: !51, line: 689, baseType: !748, size: 64, offset: 6080)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !750)
!750 = !{!751, !752, !758, !759, !760, !762, !763, !4293, !4294, !4295, !4314}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !749, file: !272, line: 102, baseType: !316, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !749, file: !272, line: 103, baseType: !753, size: 128, offset: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !314, line: 178, size: 128, elements: !754)
!754 = !{!755, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !314, line: 179, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !753, file: !314, line: 179, baseType: !756, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !749, file: !272, line: 104, baseType: !753, size: 128, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !272, line: 105, baseType: !332, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !749, file: !272, line: 106, baseType: !761, size: 48, offset: 384)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 48, elements: !628)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !749, file: !272, line: 107, baseType: !315, size: 64, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !749, file: !272, line: 109, baseType: !764, size: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !766)
!766 = !{!767, !3750, !3751, !3754, !3755, !3806, !3894, !3895, !3896, !3897, !3898, !3907, !4012, !4025, !4220, !4221, !4225, !4227, !4228, !4229, !4233, !4239, !4240, !4243, !4244, !4245, !4246, !4247, !4248, !4249, !4281, !4282, !4283, !4286, !4289, !4290, !4291, !4292}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !765, file: !237, line: 462, baseType: !768, size: 512)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !769, line: 64, size: 512, elements: !770)
!769 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!770 = !{!771, !772, !773, !775, !832, !3605, !3744, !3745, !3746, !3747, !3748, !3749}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !769, line: 65, baseType: !332, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !768, file: !769, line: 66, baseType: !753, size: 128, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !768, file: !769, line: 67, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !768, file: !769, line: 68, baseType: !776, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !769, line: 192, size: 704, elements: !778)
!778 = !{!779, !780, !796, !797}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !777, file: !769, line: 193, baseType: !753, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !777, file: !769, line: 194, baseType: !781, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !782, line: 83, baseType: !783)
!782 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !782, line: 71, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, scope: !783, file: !782, line: 72, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !783, file: !782, line: 72, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !786, file: !782, line: 73, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !782, line: 20, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !789, file: !782, line: 21, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !793, line: 25, baseType: !794)
!793 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 25, elements: !795)
!795 = !{}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !777, file: !769, line: 195, baseType: !768, size: 512, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !777, file: !769, line: 196, baseType: !798, size: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !769, line: 156, size: 192, elements: !801)
!801 = !{!802, !807, !812}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !800, file: !769, line: 157, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!316, !776, !774}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !800, file: !769, line: 158, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!332, !776, !774}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !800, file: !769, line: 159, baseType: !813, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!316, !776, !774, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !769, line: 148, size: 20736, elements: !819)
!819 = !{!820, !822, !826, !827, !831}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !818, file: !769, line: 149, baseType: !821, size: 192)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 192, elements: !555)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !818, file: !769, line: 150, baseType: !823, size: 4096, offset: 192)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 4096, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !818, file: !769, line: 151, baseType: !316, size: 32, offset: 4288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !818, file: !769, line: 152, baseType: !828, size: 16384, offset: 4320)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 16384, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 2048)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !818, file: !769, line: 153, baseType: !316, size: 32, offset: 20704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !768, file: !769, line: 69, baseType: !833, size: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !769, line: 138, size: 448, elements: !835)
!835 = !{!836, !840, !867, !869, !3567, !3595, !3599}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !834, file: !769, line: 139, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !774}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !834, file: !769, line: 140, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !844, line: 230, size: 128, elements: !845)
!844 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!845 = !{!846, !860}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !843, file: !844, line: 231, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!850, !774, !854, !351}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !314, line: 60, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !852, line: 73, baseType: !853)
!852 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !852, line: 15, baseType: !658)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !844, line: 30, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !855, file: !844, line: 31, baseType: !332, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !855, file: !844, line: 32, baseType: !859, size: 16, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !314, line: 19, baseType: !360)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !843, file: !844, line: 232, baseType: !861, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!850, !774, !854, !332, !864}
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !314, line: 55, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !852, line: 72, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !852, line: 16, baseType: !663)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !834, file: !769, line: 141, baseType: !868, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !834, file: !769, line: 142, baseType: !870, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !844, line: 84, size: 320, elements: !874)
!874 = !{!875, !876, !880, !3564, !3565}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !844, line: 85, baseType: !332, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !873, file: !844, line: 86, baseType: !877, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!859, !774, !854, !316}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !873, file: !844, line: 88, baseType: !881, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!859, !774, !884, !316}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !844, line: 168, size: 448, elements: !886)
!886 = !{!887, !888, !889, !890, !3559, !3560}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !885, file: !844, line: 169, baseType: !855, size: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !885, file: !844, line: 170, baseType: !864, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !885, file: !844, line: 171, baseType: !315, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !885, file: !844, line: 172, baseType: !891, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!850, !894, !774, !884, !351, !1060, !864}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !896)
!896 = !{!897, !915, !3524, !3525, !3526, !3527, !3528, !3529, !3530, !3531, !3532, !3533, !3542, !3543, !3552, !3553, !3554, !3555, !3556, !3557, !3558}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !895, file: !208, line: 920, baseType: !898, size: 128)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !895, file: !208, line: 917, size: 128, elements: !899)
!899 = !{!900, !906}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !898, file: !208, line: 918, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !902, line: 58, size: 64, elements: !903)
!902 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !902, line: 59, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !898, file: !208, line: 919, baseType: !907, size: 128, align: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !314, line: 216, size: 128, align: 64, elements: !908)
!908 = !{!909, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !907, file: !314, line: 217, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !907, file: !314, line: 218, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !910}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !895, file: !208, line: 921, baseType: !916, size: 128, offset: 128)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !917, line: 8, size: 128, elements: !918)
!917 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!918 = !{!919, !923}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !916, file: !917, line: 9, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !922, line: 18, flags: DIFlagFwdDecl)
!922 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !916, file: !917, line: 10, baseType: !924, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !922, line: 89, size: 1536, elements: !926)
!926 = !{!927, !928, !938, !946, !947, !962, !3493, !3495, !3507, !3508, !3509, !3510, !3511, !3516, !3517, !3518}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !925, file: !922, line: 91, baseType: !7, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !925, file: !922, line: 92, baseType: !929, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !930, line: 277, baseType: !931)
!930 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !930, line: 277, size: 32, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !931, file: !930, line: 277, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !930, line: 70, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !930, line: 65, size: 32, elements: !936)
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !935, file: !930, line: 66, baseType: !7, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !925, file: !922, line: 93, baseType: !939, size: 128, offset: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !940, line: 38, size: 128, elements: !941)
!940 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!941 = !{!942, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !939, file: !940, line: 39, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !939, file: !940, line: 39, baseType: !945, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !925, file: !922, line: 94, baseType: !924, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !925, file: !922, line: 95, baseType: !948, size: 128, offset: 256)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !922, line: 47, size: 128, elements: !949)
!949 = !{!950, !959}
!950 = !DIDerivedType(tag: DW_TAG_member, scope: !948, file: !922, line: 48, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !948, file: !922, line: 48, size: 64, elements: !952)
!952 = !{!953, !958}
!953 = !DIDerivedType(tag: DW_TAG_member, scope: !951, file: !922, line: 49, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !951, file: !922, line: 49, size: 64, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !954, file: !922, line: 50, baseType: !468, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !954, file: !922, line: 50, baseType: !468, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !951, file: !922, line: 52, baseType: !704, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !922, line: 54, baseType: !960, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !925, file: !922, line: 96, baseType: !963, size: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !965)
!965 = !{!966, !967, !968, !976, !983, !984, !1125, !3187, !3188, !3189, !3195, !3196, !3197, !3198, !3199, !3200, !3201, !3202, !3203, !3204, !3205, !3206, !3207, !3208, !3209, !3210, !3211, !3212, !3213, !3214, !3219, !3220, !3221, !3222, !3223, !3224, !3225, !3461, !3469, !3470, !3471, !3489, !3490, !3491, !3492}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !964, file: !208, line: 611, baseType: !859, size: 16)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !964, file: !208, line: 612, baseType: !360, size: 16, offset: 16)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !964, file: !208, line: 613, baseType: !969, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !970, line: 23, baseType: !971)
!970 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !970, line: 21, size: 32, elements: !972)
!972 = !{!973}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !971, file: !970, line: 22, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !314, line: 32, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !852, line: 49, baseType: !7)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !964, file: !208, line: 614, baseType: !977, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !970, line: 28, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !970, line: 26, size: 32, elements: !979)
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !978, file: !970, line: 27, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !314, line: 33, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !852, line: 50, baseType: !7)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !964, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !964, file: !208, line: 622, baseType: !985, size: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !988)
!988 = !{!989, !993, !1003, !1007, !1013, !1017, !1021, !1025, !1029, !1033, !1037, !1038, !1044, !1048, !1072, !1101, !1105, !1111, !1116, !1120, !1121}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !987, file: !208, line: 1865, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!924, !963, !924, !7}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !987, file: !208, line: 1866, baseType: !994, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!332, !924, !963, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !999, line: 10, size: 128, elements: !1000)
!999 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !998, file: !999, line: 11, baseType: !353, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !998, file: !999, line: 12, baseType: !315, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !987, file: !208, line: 1867, baseType: !1004, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!316, !963, !316}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !987, file: !208, line: 1868, baseType: !1008, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1011, !963, !316}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !987, file: !208, line: 1870, baseType: !1014, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!316, !924, !351, !316}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !987, file: !208, line: 1872, baseType: !1018, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!316, !963, !924, !859, !499}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !987, file: !208, line: 1873, baseType: !1022, size: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!316, !924, !963, !924}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !987, file: !208, line: 1874, baseType: !1026, size: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!316, !963, !924}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !987, file: !208, line: 1875, baseType: !1030, size: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!316, !963, !924, !332}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !987, file: !208, line: 1876, baseType: !1034, size: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!316, !963, !924, !859}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !987, file: !208, line: 1877, baseType: !1026, size: 64, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !987, file: !208, line: 1878, baseType: !1039, size: 64, offset: 704)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!316, !963, !924, !859, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !314, line: 16, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !314, line: 13, baseType: !468)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !987, file: !208, line: 1879, baseType: !1045, size: 64, offset: 768)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!316, !963, !924, !963, !924, !7}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !987, file: !208, line: 1881, baseType: !1049, size: 64, offset: 832)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!316, !924, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1062, !1069, !1070, !1071}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1053, file: !208, line: 220, baseType: !7, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1053, file: !208, line: 221, baseType: !859, size: 16, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1053, file: !208, line: 222, baseType: !969, size: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1053, file: !208, line: 223, baseType: !977, size: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1053, file: !208, line: 224, baseType: !1060, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !314, line: 46, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !852, line: 88, baseType: !592)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1053, file: !208, line: 225, baseType: !1063, size: 128, offset: 192)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1064, line: 13, size: 128, elements: !1065)
!1064 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1065 = !{!1066, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1063, file: !1064, line: 14, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1064, line: 8, baseType: !591)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1063, file: !1064, line: 15, baseType: !658, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1053, file: !208, line: 226, baseType: !1063, size: 128, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1053, file: !208, line: 227, baseType: !1063, size: 128, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1053, file: !208, line: 234, baseType: !894, size: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !987, file: !208, line: 1882, baseType: !1073, size: 64, offset: 896)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!316, !1076, !1078, !468, !7}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1080, line: 22, size: 1152, elements: !1081)
!1080 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1081 = !{!1082, !1083, !1084, !1085, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1079, file: !1080, line: 23, baseType: !468, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1079, file: !1080, line: 24, baseType: !859, size: 16, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1079, file: !1080, line: 25, baseType: !7, size: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1079, file: !1080, line: 26, baseType: !1086, size: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !314, line: 104, baseType: !468)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1079, file: !1080, line: 27, baseType: !704, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1079, file: !1080, line: 28, baseType: !704, size: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1079, file: !1080, line: 37, baseType: !704, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1079, file: !1080, line: 38, baseType: !1042, size: 32, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1079, file: !1080, line: 39, baseType: !1042, size: 32, offset: 352)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1079, file: !1080, line: 40, baseType: !969, size: 32, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1079, file: !1080, line: 41, baseType: !977, size: 32, offset: 416)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !1080, line: 42, baseType: !1060, size: 64, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1079, file: !1080, line: 43, baseType: !1063, size: 128, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1079, file: !1080, line: 44, baseType: !1063, size: 128, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1079, file: !1080, line: 45, baseType: !1063, size: 128, offset: 768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1079, file: !1080, line: 46, baseType: !1063, size: 128, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1079, file: !1080, line: 47, baseType: !704, size: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1079, file: !1080, line: 48, baseType: !704, size: 64, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !987, file: !208, line: 1883, baseType: !1102, size: 64, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!850, !924, !351, !864}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !987, file: !208, line: 1884, baseType: !1106, size: 64, offset: 1024)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!316, !963, !1109, !704, !704}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !987, file: !208, line: 1886, baseType: !1112, size: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!316, !963, !1115, !316}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !987, file: !208, line: 1887, baseType: !1117, size: 64, offset: 1152)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!316, !963, !924, !894, !7, !859}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !987, file: !208, line: 1890, baseType: !1034, size: 64, offset: 1216)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !987, file: !208, line: 1891, baseType: !1122, size: 64, offset: 1280)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!316, !963, !1011, !316}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !964, file: !208, line: 623, baseType: !1126, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1181, !2795, !2877, !2960, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2976, !2980, !2981, !2984, !2985, !2988, !2989, !2990, !3031, !3057, !3058, !3059, !3060, !3061, !3062, !3065, !3067, !3074, !3075, !3077, !3078, !3079, !3138, !3139, !3154, !3155, !3156, !3157, !3158, !3161, !3162, !3163, !3178, !3179, !3180, !3181, !3182, !3183, !3184, !3185, !3186}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1127, file: !208, line: 1417, baseType: !753, size: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1127, file: !208, line: 1418, baseType: !1042, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1127, file: !208, line: 1419, baseType: !368, size: 8, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1127, file: !208, line: 1420, baseType: !663, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1127, file: !208, line: 1421, baseType: !1060, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1127, file: !208, line: 1422, baseType: !1135, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1147, !1151, !1155, !1159, !1160, !1161, !1171, !1174, !1175, !1176, !1178, !1179, !1180}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1136, file: !208, line: 2229, baseType: !332, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1136, file: !208, line: 2230, baseType: !316, size: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1136, file: !208, line: 2238, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!316, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1146, line: 28, flags: DIFlagFwdDecl)
!1146 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1136, file: !208, line: 2239, baseType: !1148, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1136, file: !208, line: 2240, baseType: !1152, size: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!924, !1135, !316, !332, !315}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1136, file: !208, line: 2242, baseType: !1156, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !1126}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1136, file: !208, line: 2243, baseType: !321, size: 64, offset: 384)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1136, file: !208, line: 2244, baseType: !1135, size: 64, offset: 448)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1136, file: !208, line: 2245, baseType: !1162, size: 64, offset: 512)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !314, line: 182, size: 64, elements: !1163)
!1163 = !{!1164}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1162, file: !314, line: 183, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !314, line: 186, size: 128, elements: !1167)
!1167 = !{!1168, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1166, file: !314, line: 187, baseType: !1165, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1166, file: !314, line: 187, baseType: !1170, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1136, file: !208, line: 2247, baseType: !1172, offset: 576)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1173, line: 187, elements: !795)
!1173 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1136, file: !208, line: 2248, baseType: !1172, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1136, file: !208, line: 2249, baseType: !1172, offset: 576)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1136, file: !208, line: 2250, baseType: !1177, offset: 576)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, elements: !555)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1136, file: !208, line: 2252, baseType: !1172, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1136, file: !208, line: 2253, baseType: !1172, offset: 576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1136, file: !208, line: 2254, baseType: !1172, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1127, file: !208, line: 1423, baseType: !1182, size: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1185)
!1185 = !{!1186, !1190, !1194, !1195, !1199, !1205, !1209, !1210, !1211, !1215, !1219, !1220, !1221, !1222, !1228, !1233, !1234, !1241, !1242, !1243, !1244, !2779, !2794}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1184, file: !208, line: 1936, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!963, !1126}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1184, file: !208, line: 1937, baseType: !1191, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{null, !963}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1184, file: !208, line: 1938, baseType: !1191, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1184, file: !208, line: 1940, baseType: !1196, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !963, !316}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1184, file: !208, line: 1941, baseType: !1200, size: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!316, !963, !1203}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1184, file: !208, line: 1942, baseType: !1206, size: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!316, !963}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1184, file: !208, line: 1943, baseType: !1191, size: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1184, file: !208, line: 1944, baseType: !1156, size: 64, offset: 448)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1184, file: !208, line: 1945, baseType: !1212, size: 64, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!316, !1126, !316}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1184, file: !208, line: 1946, baseType: !1216, size: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!316, !1126}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1184, file: !208, line: 1947, baseType: !1216, size: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1184, file: !208, line: 1948, baseType: !1216, size: 64, offset: 704)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1184, file: !208, line: 1949, baseType: !1216, size: 64, offset: 768)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1184, file: !208, line: 1950, baseType: !1223, size: 64, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!316, !924, !1226}
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1184, file: !208, line: 1951, baseType: !1229, size: 64, offset: 896)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!316, !1126, !1232, !351}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1184, file: !208, line: 1952, baseType: !1156, size: 64, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1184, file: !208, line: 1954, baseType: !1235, size: 64, offset: 1024)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!316, !1238, !924}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1240, line: 539, flags: DIFlagFwdDecl)
!1240 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1184, file: !208, line: 1955, baseType: !1235, size: 64, offset: 1088)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1184, file: !208, line: 1956, baseType: !1235, size: 64, offset: 1152)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1184, file: !208, line: 1957, baseType: !1235, size: 64, offset: 1216)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1184, file: !208, line: 1963, baseType: !1245, size: 64, offset: 1280)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!316, !1126, !1248, !313}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1250, line: 68, size: 512, align: 128, elements: !1251)
!1250 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1251 = !{!1252, !1253, !2771, !2778}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1249, file: !1250, line: 69, baseType: !663, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, scope: !1249, file: !1250, line: 77, baseType: !1254, size: 320, offset: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1249, file: !1250, line: 77, size: 320, elements: !1255)
!1255 = !{!1256, !1437, !1442, !1470, !1478, !1484, !2763, !2770}
!1256 = !DIDerivedType(tag: DW_TAG_member, scope: !1254, file: !1250, line: 78, baseType: !1257, size: 320)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1254, file: !1250, line: 78, size: 320, elements: !1258)
!1258 = !{!1259, !1260, !1435, !1436}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1257, file: !1250, line: 84, baseType: !753, size: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1257, file: !1250, line: 86, baseType: !1261, size: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1263)
!1263 = !{!1264, !1265, !1272, !1273, !1274, !1289, !1305, !1306, !1307, !1308, !1428, !1429, !1432, !1433, !1434}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1262, file: !208, line: 452, baseType: !963, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1262, file: !208, line: 453, baseType: !1266, size: 128, offset: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1267, line: 292, size: 128, elements: !1268)
!1267 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1266, file: !1267, line: 293, baseType: !781)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1266, file: !1267, line: 295, baseType: !313, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1266, file: !1267, line: 296, baseType: !315, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1262, file: !208, line: 454, baseType: !313, size: 32, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1262, file: !208, line: 455, baseType: !453, size: 32, offset: 224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1262, file: !208, line: 460, baseType: !1275, size: 128, offset: 256)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1276, line: 125, size: 128, elements: !1277)
!1276 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1277 = !{!1278, !1288}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1275, file: !1276, line: 126, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1276, line: 31, size: 64, elements: !1280)
!1280 = !{!1281}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1279, file: !1276, line: 32, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1276, line: 24, size: 192, align: 64, elements: !1284)
!1284 = !{!1285, !1286, !1287}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1283, file: !1276, line: 25, baseType: !663, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1283, file: !1276, line: 26, baseType: !1282, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1283, file: !1276, line: 27, baseType: !1282, size: 64, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1275, file: !1276, line: 127, baseType: !1282, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1262, file: !208, line: 461, baseType: !1290, size: 256, offset: 384)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1291, line: 35, size: 256, elements: !1292)
!1291 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1292 = !{!1293, !1301, !1302, !1304}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1290, file: !1291, line: 36, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1295, line: 13, baseType: !1296)
!1295 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !314, line: 175, baseType: !1297)
