; ModuleID = '../bcout/drivers/media/dvb-frontends/zl10353.llvm.bc'
source_filename = "drivers/media/dvb-frontends/zl10353.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dvb_frontend_ops = type { %struct.dvb_frontend_internal_info, [8 x i8], void (%struct.dvb_frontend*)*, void (%struct.dvb_frontend*)*, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i1, i32, i32*, i32*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.dvb_frontend_tune_settings*)*, i32 (%struct.dvb_frontend*, %struct.dtv_frontend_properties*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.dvb_diseqc_master_cmd*)*, i32 (%struct.dvb_frontend*, %struct.dvb_diseqc_slave_reply*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i64)*, i32 (%struct.dvb_frontend*, i64)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, %struct.dvb_tuner_ops, %struct.analog_demod_ops }

!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!286 = !DIEnumerator(name: "INTERRUPT_0", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "INTERRUPT_1", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "INTERRUPT_2", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "INTERRUPT_3", value: 3, isUnsigned: true)
!290 = !DIEnumerator(name: "INTERRUPT_4", value: 4, isUnsigned: true)
!291 = !DIEnumerator(name: "INTERRUPT_5", value: 5, isUnsigned: true)
!292 = !DIEnumerator(name: "STATUS_6", value: 6, isUnsigned: true)
!293 = !DIEnumerator(name: "STATUS_7", value: 7, isUnsigned: true)
!294 = !DIEnumerator(name: "STATUS_8", value: 8, isUnsigned: true)
!295 = !DIEnumerator(name: "STATUS_9", value: 9, isUnsigned: true)
!296 = !DIEnumerator(name: "AGC_GAIN_1", value: 10, isUnsigned: true)
!297 = !DIEnumerator(name: "AGC_GAIN_0", value: 11, isUnsigned: true)
!298 = !DIEnumerator(name: "SNR", value: 16, isUnsigned: true)
!299 = !DIEnumerator(name: "RS_ERR_CNT_2", value: 17, isUnsigned: true)
!300 = !DIEnumerator(name: "RS_ERR_CNT_1", value: 18, isUnsigned: true)
!301 = !DIEnumerator(name: "RS_ERR_CNT_0", value: 19, isUnsigned: true)
!302 = !DIEnumerator(name: "RS_UBC_1", value: 20, isUnsigned: true)
!303 = !DIEnumerator(name: "RS_UBC_0", value: 21, isUnsigned: true)
!304 = !DIEnumerator(name: "TPS_RECEIVED_1", value: 29, isUnsigned: true)
!305 = !DIEnumerator(name: "TPS_RECEIVED_0", value: 30, isUnsigned: true)
!306 = !DIEnumerator(name: "TPS_CURRENT_1", value: 31, isUnsigned: true)
!307 = !DIEnumerator(name: "TPS_CURRENT_0", value: 32, isUnsigned: true)
!308 = !DIEnumerator(name: "CLOCK_CTL_0", value: 81, isUnsigned: true)
!309 = !DIEnumerator(name: "CLOCK_CTL_1", value: 82, isUnsigned: true)
!310 = !DIEnumerator(name: "PLL_0", value: 83, isUnsigned: true)
!311 = !DIEnumerator(name: "PLL_1", value: 84, isUnsigned: true)
!312 = !DIEnumerator(name: "RESET", value: 85, isUnsigned: true)
!313 = !DIEnumerator(name: "AGC_TARGET", value: 86, isUnsigned: true)
!314 = !DIEnumerator(name: "MCLK_RATIO", value: 92, isUnsigned: true)
!315 = !DIEnumerator(name: "ACQ_CTL", value: 94, isUnsigned: true)
!316 = !DIEnumerator(name: "TRL_NOMINAL_RATE_1", value: 101, isUnsigned: true)
!317 = !DIEnumerator(name: "TRL_NOMINAL_RATE_0", value: 102, isUnsigned: true)
!318 = !DIEnumerator(name: "INPUT_FREQ_1", value: 108, isUnsigned: true)
!319 = !DIEnumerator(name: "INPUT_FREQ_0", value: 109, isUnsigned: true)
!320 = !DIEnumerator(name: "TPS_GIVEN_1", value: 110, isUnsigned: true)
!321 = !DIEnumerator(name: "TPS_GIVEN_0", value: 111, isUnsigned: true)
!322 = !DIEnumerator(name: "TUNER_GO", value: 112, isUnsigned: true)
!323 = !DIEnumerator(name: "FSM_GO", value: 113, isUnsigned: true)
!324 = !DIEnumerator(name: "CHIP_ID", value: 127, isUnsigned: true)
!325 = !DIEnumerator(name: "CHAN_STEP_1", value: 228, isUnsigned: true)
!326 = !DIEnumerator(name: "CHAN_STEP_0", value: 229, isUnsigned: true)
!327 = !DIEnumerator(name: "OFDM_LOCK_TIME", value: 231, isUnsigned: true)
!328 = !DIEnumerator(name: "FEC_LOCK_TIME", value: 232, isUnsigned: true)
!329 = !DIEnumerator(name: "ACQ_DELAY", value: 233, isUnsigned: true)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !331, line: 305, baseType: !7, size: 32, elements: !332)
!331 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!332 = !{!333, !334, !335, !336}
!333 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!334 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!336 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!337 = !{!338, !340, !341, !346, !349}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !339, line: 148, baseType: !7)
!339 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !342, line: 17, baseType: !343)
!342 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !344, line: 21, baseType: !345)
!344 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!345 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !342, line: 23, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !344, line: 31, baseType: !348)
!348 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!350 = !{!351, !417, !422, !427, !429, !434, !439, !444, !449, !454, !459, !461, !0, !463, !4356, !4360, !4365}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "__param_debug", scope: !2, file: !3, line: 658, type: !353, isLocal: true, isDefinition: true, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !355, line: 69, size: 320, elements: !356)
!355 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!356 = !{!357, !361, !365, !385, !390, !394, !395}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !355, line: 70, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !354, file: !355, line: 71, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !364, line: 76, flags: DIFlagFwdDecl)
!364 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !354, file: !355, line: 72, baseType: !366, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !355, line: 47, size: 256, elements: !369)
!369 = !{!370, !371, !376, !381}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !368, file: !355, line: 49, baseType: !7, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !368, file: !355, line: 51, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!349, !358, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !368, file: !355, line: 53, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!349, !380, !375}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !368, file: !355, line: 55, baseType: !382, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !340}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !354, file: !355, line: 73, baseType: !386, size: 16, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !342, line: 19, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !344, line: 24, baseType: !389)
!389 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !354, file: !355, line: 74, baseType: !391, size: 8, offset: 208)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !342, line: 16, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !344, line: 20, baseType: !393)
!393 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !354, file: !355, line: 75, baseType: !341, size: 8, offset: 216)
!395 = !DIDerivedType(tag: DW_TAG_member, scope: !354, file: !355, line: 76, baseType: !396, size: 64, offset: 256)
!396 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !354, file: !355, line: 76, size: 64, elements: !397)
!397 = !{!398, !399, !406}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !396, file: !355, line: 77, baseType: !340, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !396, file: !355, line: 78, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !355, line: 86, size: 128, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !402, file: !355, line: 87, baseType: !7, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !402, file: !355, line: 88, baseType: !380, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !396, file: !355, line: 79, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !355, line: 92, size: 256, elements: !410)
!410 = !{!411, !412, !413, !415, !416}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !409, file: !355, line: 94, baseType: !7, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !409, file: !355, line: 95, baseType: !7, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !409, file: !355, line: 96, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !409, file: !355, line: 97, baseType: !366, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !409, file: !355, line: 98, baseType: !340, size: 64, offset: 192)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debugtype220", scope: !2, file: !3, line: 658, type: !419, isLocal: true, isDefinition: true, align: 8)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 216, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 27)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug221", scope: !2, file: !3, line: 659, type: !424, isLocal: true, isDefinition: true, align: 8)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 520, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 65)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "__param_debug_regs", scope: !2, file: !3, line: 661, type: !353, isLocal: true, isDefinition: true, align: 64)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug_regstype222", scope: !2, file: !3, line: 661, type: !431, isLocal: true, isDefinition: true, align: 8)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 256, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 32)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_debug_regs223", scope: !2, file: !3, line: 662, type: !436, isLocal: true, isDefinition: true, align: 8)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 600, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 75)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description224", scope: !2, file: !3, line: 664, type: !441, isLocal: true, isDefinition: true, align: 8)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 488, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 61)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author225", scope: !2, file: !3, line: 665, type: !446, isLocal: true, isDefinition: true, align: 8)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 224, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 28)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file226", scope: !2, file: !3, line: 666, type: !451, isLocal: true, isDefinition: true, align: 8)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 392, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 49)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license227", scope: !2, file: !3, line: 666, type: !456, isLocal: true, isDefinition: true, align: 8)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 160, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 20)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 31, type: !349, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "debug_regs", scope: !2, file: !3, line: 37, type: !349, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "zl10353_softdown", scope: !465, file: !3, line: 160, type: !4355, isLocal: true, isDefinition: true)
!465 = distinct !DISubprogram(name: "zl10353_sleep", scope: !3, file: !3, line: 158, type: !466, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !823)
!466 = !DISubroutineType(types: !467)
!467 = !{!349, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend", file: !51, line: 686, size: 10240, elements: !470)
!470 = !{!471, !485, !775, !4343, !4344, !4345, !4346, !4347, !4348, !4349, !4353, !4354}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !469, file: !51, line: 687, baseType: !472, size: 32)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !473, line: 19, size: 32, elements: !474)
!473 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !472, file: !473, line: 20, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !477, line: 113, baseType: !478)
!477 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !477, line: 111, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !478, file: !477, line: 112, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !339, line: 168, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 166, size: 32, elements: !483)
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !482, file: !339, line: 167, baseType: !349, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !469, file: !51, line: 688, baseType: !486, size: 6016, offset: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_ops", file: !51, line: 435, size: 6016, elements: !487)
!487 = !{!488, !505, !509, !513, !514, !515, !517, !518, !524, !531, !535, !536, !546, !629, !633, !638, !643, !644, !645, !646, !658, !669, !673, !677, !681, !686, !691, !695, !696, !697, !701, !757}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !486, file: !51, line: 436, baseType: !489, size: 1280)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_internal_info", file: !51, line: 338, size: 1280, elements: !490)
!490 = !{!491, !495, !498, !499, !500, !501, !502, !503, !504}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !51, line: 339, baseType: !492, size: 1024)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 1024, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !489, file: !51, line: 340, baseType: !496, size: 32, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !342, line: 21, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !344, line: 27, baseType: !7)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !489, file: !51, line: 341, baseType: !496, size: 32, offset: 1056)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_stepsize_hz", scope: !489, file: !51, line: 342, baseType: !496, size: 32, offset: 1088)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_tolerance_hz", scope: !489, file: !51, line: 343, baseType: !496, size: 32, offset: 1120)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_min", scope: !489, file: !51, line: 344, baseType: !496, size: 32, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_max", scope: !489, file: !51, line: 345, baseType: !496, size: 32, offset: 1184)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate_tolerance", scope: !489, file: !51, line: 346, baseType: !496, size: 32, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !489, file: !51, line: 347, baseType: !5, size: 32, offset: 1248)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "delsys", scope: !486, file: !51, line: 438, baseType: !506, size: 64, offset: 1280)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 64, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !486, file: !51, line: 440, baseType: !510, size: 64, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !468}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !486, file: !51, line: 441, baseType: !510, size: 64, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "release_sec", scope: !486, file: !51, line: 442, baseType: !510, size: 64, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !486, file: !51, line: 444, baseType: !516, size: 64, offset: 1536)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !486, file: !51, line: 445, baseType: !516, size: 64, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !486, file: !51, line: 447, baseType: !519, size: 64, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!349, !468, !522, !349}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !486, file: !51, line: 450, baseType: !525, size: 64, offset: 1728)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!349, !468, !528, !7, !414, !530}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !339, line: 30, baseType: !529)
!529 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend_algo", scope: !486, file: !51, line: 457, baseType: !532, size: 64, offset: 1792)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!50, !468}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "set_frontend", scope: !486, file: !51, line: 460, baseType: !516, size: 64, offset: 1856)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "get_tune_settings", scope: !486, file: !51, line: 461, baseType: !537, size: 64, offset: 1920)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!349, !468, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_frontend_tune_settings", file: !51, line: 69, size: 96, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "min_delay_ms", scope: !541, file: !51, line: 70, baseType: !349, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "step_size", scope: !541, file: !51, line: 71, baseType: !349, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "max_drift", scope: !541, file: !51, line: 72, baseType: !349, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "get_frontend", scope: !486, file: !51, line: 463, baseType: !547, size: 64, offset: 1984)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!349, !468, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_frontend_properties", file: !51, line: 586, size: 3648, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !622, !623, !624, !625, !626, !627, !628}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !551, file: !51, line: 587, baseType: !496, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !551, file: !51, line: 588, baseType: !57, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "voltage", scope: !551, file: !51, line: 590, baseType: !73, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sectone", scope: !551, file: !51, line: 591, baseType: !78, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "inversion", scope: !551, file: !51, line: 592, baseType: !82, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fec_inner", scope: !551, file: !51, line: 593, baseType: !87, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_mode", scope: !551, file: !51, line: 594, baseType: !102, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_hz", scope: !551, file: !51, line: 595, baseType: !496, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "guard_interval", scope: !551, file: !51, line: 596, baseType: !113, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy", scope: !551, file: !51, line: 597, baseType: !126, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_rate", scope: !551, file: !51, line: 598, baseType: !496, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_HP", scope: !551, file: !51, line: 599, baseType: !87, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "code_rate_LP", scope: !551, file: !51, line: 600, baseType: !87, size: 32, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pilot", scope: !551, file: !51, line: 602, baseType: !133, size: 32, offset: 416)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff", scope: !551, file: !51, line: 603, baseType: !138, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "delivery_system", scope: !551, file: !51, line: 605, baseType: !144, size: 32, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !551, file: !51, line: 607, baseType: !165, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_partial_reception", scope: !551, file: !51, line: 610, baseType: !341, size: 8, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_mode", scope: !551, file: !51, line: 611, baseType: !341, size: 8, offset: 552)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_subchannel", scope: !551, file: !51, line: 612, baseType: !341, size: 8, offset: 560)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_idx", scope: !551, file: !51, line: 613, baseType: !496, size: 32, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_sb_segment_count", scope: !551, file: !51, line: 614, baseType: !496, size: 32, offset: 608)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "isdbt_layer_enabled", scope: !551, file: !51, line: 615, baseType: !341, size: 8, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !551, file: !51, line: 621, baseType: !577, size: 384, offset: 672)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 384, elements: !584)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !51, line: 616, size: 128, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "segment_count", scope: !578, file: !51, line: 617, baseType: !341, size: 8)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fec", scope: !578, file: !51, line: 618, baseType: !87, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "modulation", scope: !578, file: !51, line: 619, baseType: !57, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "interleaving", scope: !578, file: !51, line: 620, baseType: !341, size: 8, offset: 96)
!584 = !{!585}
!585 = !DISubrange(count: 3)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stream_id", scope: !551, file: !51, line: 624, baseType: !496, size: 32, offset: 1056)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "scrambling_sequence_index", scope: !551, file: !51, line: 627, baseType: !496, size: 32, offset: 1088)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_fic_ver", scope: !551, file: !51, line: 630, baseType: !341, size: 8, offset: 1120)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_parade_id", scope: !551, file: !51, line: 631, baseType: !341, size: 8, offset: 1128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_nog", scope: !551, file: !51, line: 632, baseType: !341, size: 8, offset: 1136)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_tnog", scope: !551, file: !51, line: 633, baseType: !341, size: 8, offset: 1144)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sgn", scope: !551, file: !51, line: 634, baseType: !341, size: 8, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_prc", scope: !551, file: !51, line: 635, baseType: !341, size: 8, offset: 1160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_mode", scope: !551, file: !51, line: 637, baseType: !341, size: 8, offset: 1168)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_frame_ensemble", scope: !551, file: !51, line: 638, baseType: !341, size: 8, offset: 1176)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_pri", scope: !551, file: !51, line: 639, baseType: !341, size: 8, offset: 1184)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_rs_code_mode_sec", scope: !551, file: !51, line: 640, baseType: !341, size: 8, offset: 1192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_block_mode", scope: !551, file: !51, line: 641, baseType: !341, size: 8, offset: 1200)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_a", scope: !551, file: !51, line: 642, baseType: !341, size: 8, offset: 1208)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_b", scope: !551, file: !51, line: 643, baseType: !341, size: 8, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_c", scope: !551, file: !51, line: 644, baseType: !341, size: 8, offset: 1224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "atscmh_sccc_code_mode_d", scope: !551, file: !51, line: 645, baseType: !341, size: 8, offset: 1232)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lna", scope: !551, file: !51, line: 647, baseType: !496, size: 32, offset: 1248)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !551, file: !51, line: 650, baseType: !605, size: 296, offset: 1280)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_fe_stats", file: !6, line: 825, size: 296, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !605, file: !6, line: 826, baseType: !343, size: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !605, file: !6, line: 827, baseType: !609, size: 288, offset: 8)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 288, elements: !620)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtv_stats", file: !6, line: 803, size: 72, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !610, file: !6, line: 804, baseType: !343, size: 8)
!613 = !DIDerivedType(tag: DW_TAG_member, scope: !610, file: !6, line: 805, baseType: !614, size: 64, offset: 8)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !6, line: 805, size: 64, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "uvalue", scope: !614, file: !6, line: 806, baseType: !347, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "svalue", scope: !614, file: !6, line: 807, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !344, line: 30, baseType: !619)
!619 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!620 = !{!621}
!621 = !DISubrange(count: 4)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cnr", scope: !551, file: !51, line: 651, baseType: !605, size: 296, offset: 1576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_error", scope: !551, file: !51, line: 652, baseType: !605, size: 296, offset: 1872)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pre_bit_count", scope: !551, file: !51, line: 653, baseType: !605, size: 296, offset: 2168)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_error", scope: !551, file: !51, line: 654, baseType: !605, size: 296, offset: 2464)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "post_bit_count", scope: !551, file: !51, line: 655, baseType: !605, size: 296, offset: 2760)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "block_error", scope: !551, file: !51, line: 656, baseType: !605, size: 296, offset: 3056)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !551, file: !51, line: 657, baseType: !605, size: 296, offset: 3352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "read_status", scope: !486, file: !51, line: 466, baseType: !630, size: 64, offset: 2048)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!349, !468, !530}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "read_ber", scope: !486, file: !51, line: 467, baseType: !634, size: 64, offset: 2112)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!349, !468, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "read_signal_strength", scope: !486, file: !51, line: 468, baseType: !639, size: 64, offset: 2176)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!349, !468, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "read_snr", scope: !486, file: !51, line: 469, baseType: !639, size: 64, offset: 2240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "read_ucblocks", scope: !486, file: !51, line: 470, baseType: !634, size: 64, offset: 2304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_reset_overload", scope: !486, file: !51, line: 472, baseType: !516, size: 64, offset: 2368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_master_cmd", scope: !486, file: !51, line: 473, baseType: !647, size: 64, offset: 2432)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!349, !468, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_master_cmd", file: !6, line: 173, size: 56, elements: !652)
!652 = !{!653, !657}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !651, file: !6, line: 174, baseType: !654, size: 48)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 48, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 6)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !651, file: !6, line: 175, baseType: !343, size: 8, offset: 48)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_recv_slave_reply", scope: !486, file: !51, line: 474, baseType: !659, size: 64, offset: 2496)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!349, !468, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_diseqc_slave_reply", file: !6, line: 195, size: 96, elements: !664)
!664 = !{!665, !667, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !663, file: !6, line: 196, baseType: !666, size: 32)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 32, elements: !620)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !663, file: !6, line: 197, baseType: !343, size: 8, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !663, file: !6, line: 198, baseType: !349, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "diseqc_send_burst", scope: !486, file: !51, line: 475, baseType: !670, size: 64, offset: 2560)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!349, !468, !171}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "set_tone", scope: !486, file: !51, line: 477, baseType: !674, size: 64, offset: 2624)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!349, !468, !78}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "set_voltage", scope: !486, file: !51, line: 478, baseType: !678, size: 64, offset: 2688)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!349, !468, !73}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "enable_high_lnb_voltage", scope: !486, file: !51, line: 480, baseType: !682, size: 64, offset: 2752)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!349, !468, !685}
!685 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dishnetwork_send_legacy_command", scope: !486, file: !51, line: 481, baseType: !687, size: 64, offset: 2816)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!349, !468, !690}
!690 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !486, file: !51, line: 482, baseType: !692, size: 64, offset: 2880)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!349, !468, !349}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ts_bus_ctrl", scope: !486, file: !51, line: 483, baseType: !692, size: 64, offset: 2944)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "set_lna", scope: !486, file: !51, line: 484, baseType: !516, size: 64, offset: 3008)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !486, file: !51, line: 490, baseType: !698, size: 64, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!175, !468}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_ops", scope: !486, file: !51, line: 492, baseType: !702, size: 2304, offset: 3136)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_ops", file: !51, line: 226, size: 2304, elements: !703)
!703 = !{!704, !714, !715, !716, !717, !718, !719, !720, !731, !735, !736, !737, !738, !739, !740, !747, !752, !756}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !702, file: !51, line: 228, baseType: !705, size: 1216)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_tuner_info", file: !51, line: 88, size: 1216, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !51, line: 89, baseType: !492, size: 1024)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_min_hz", scope: !705, file: !51, line: 91, baseType: !496, size: 32, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_max_hz", scope: !705, file: !51, line: 92, baseType: !496, size: 32, offset: 1056)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "frequency_step_hz", scope: !705, file: !51, line: 93, baseType: !496, size: 32, offset: 1088)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_min", scope: !705, file: !51, line: 95, baseType: !496, size: 32, offset: 1120)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_max", scope: !705, file: !51, line: 96, baseType: !496, size: 32, offset: 1152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth_step", scope: !705, file: !51, line: 97, baseType: !496, size: 32, offset: 1184)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !702, file: !51, line: 230, baseType: !510, size: 64, offset: 1216)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !702, file: !51, line: 231, baseType: !516, size: 64, offset: 1280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !702, file: !51, line: 232, baseType: !516, size: 64, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !702, file: !51, line: 233, baseType: !516, size: 64, offset: 1408)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !702, file: !51, line: 234, baseType: !516, size: 64, offset: 1472)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !702, file: !51, line: 237, baseType: !516, size: 64, offset: 1536)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "set_analog_params", scope: !702, file: !51, line: 238, baseType: !721, size: 64, offset: 1600)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!349, !468, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_parameters", file: !51, line: 114, size: 192, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !725, file: !51, line: 115, baseType: !7, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !725, file: !51, line: 116, baseType: !7, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "audmode", scope: !725, file: !51, line: 117, baseType: !7, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !725, file: !51, line: 118, baseType: !346, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !702, file: !51, line: 240, baseType: !732, size: 64, offset: 1664)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!349, !468, !340}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "get_frequency", scope: !702, file: !51, line: 242, baseType: !634, size: 64, offset: 1728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "get_bandwidth", scope: !702, file: !51, line: 243, baseType: !634, size: 64, offset: 1792)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "get_if_frequency", scope: !702, file: !51, line: 244, baseType: !634, size: 64, offset: 1856)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !702, file: !51, line: 248, baseType: !634, size: 64, offset: 1920)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "get_rf_strength", scope: !702, file: !51, line: 249, baseType: !639, size: 64, offset: 1984)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !702, file: !51, line: 250, baseType: !741, size: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!349, !468, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !342, line: 20, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !344, line: 26, baseType: !349)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "calc_regs", scope: !702, file: !51, line: 258, baseType: !748, size: 64, offset: 2112)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!349, !468, !751, !349}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "set_frequency", scope: !702, file: !51, line: 267, baseType: !753, size: 64, offset: 2176)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!349, !468, !496}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "set_bandwidth", scope: !702, file: !51, line: 268, baseType: !753, size: 64, offset: 2240)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "analog_ops", scope: !486, file: !51, line: 493, baseType: !758, size: 576, offset: 5440)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_ops", file: !51, line: 302, size: 576, elements: !759)
!759 = !{!760, !764, !768, !769, !770, !771, !772, !773, !774}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !758, file: !51, line: 304, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "analog_demod_info", file: !51, line: 276, size: 64, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !51, line: 277, baseType: !380, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "set_params", scope: !758, file: !51, line: 306, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !468, !724}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "has_signal", scope: !758, file: !51, line: 308, baseType: !639, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "get_afc", scope: !758, file: !51, line: 309, baseType: !741, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tuner_status", scope: !758, file: !51, line: 310, baseType: !510, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "standby", scope: !758, file: !51, line: 311, baseType: !510, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !758, file: !51, line: 312, baseType: !510, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_gate_ctrl", scope: !758, file: !51, line: 313, baseType: !692, size: 64, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "set_config", scope: !758, file: !51, line: 316, baseType: !732, size: 64, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dvb", scope: !469, file: !51, line: 689, baseType: !776, size: 64, offset: 6080)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvb_adapter", file: !272, line: 101, size: 960, elements: !778)
!778 = !{!779, !780, !786, !787, !788, !790, !791, !4321, !4322, !4323, !4342}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !777, file: !272, line: 102, baseType: !349, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !777, file: !272, line: 103, baseType: !781, size: 128, offset: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !339, line: 178, size: 128, elements: !782)
!782 = !{!783, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !339, line: 179, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !339, line: 179, baseType: !784, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !777, file: !272, line: 104, baseType: !781, size: 128, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !272, line: 105, baseType: !358, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "proposed_mac", scope: !777, file: !272, line: 106, baseType: !789, size: 48, offset: 384)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 48, elements: !655)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !777, file: !272, line: 107, baseType: !340, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !777, file: !272, line: 109, baseType: !792, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !237, line: 461, size: 5568, elements: !794)
!794 = !{!795, !3778, !3779, !3782, !3783, !3834, !3922, !3923, !3924, !3925, !3926, !3935, !4040, !4053, !4248, !4249, !4253, !4255, !4256, !4257, !4261, !4267, !4268, !4271, !4272, !4273, !4274, !4275, !4276, !4277, !4309, !4310, !4311, !4314, !4317, !4318, !4319, !4320}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !793, file: !237, line: 462, baseType: !796, size: 512)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !797, line: 64, size: 512, elements: !798)
!797 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!798 = !{!799, !800, !801, !803, !860, !3633, !3772, !3773, !3774, !3775, !3776, !3777}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !797, line: 65, baseType: !358, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !796, file: !797, line: 66, baseType: !781, size: 128, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !796, file: !797, line: 67, baseType: !802, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !796, file: !797, line: 68, baseType: !804, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !797, line: 192, size: 704, elements: !806)
!806 = !{!807, !808, !824, !825}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !805, file: !797, line: 193, baseType: !781, size: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !805, file: !797, line: 194, baseType: !809, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !810, line: 83, baseType: !811)
!810 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !810, line: 71, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !810, line: 72, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !811, file: !810, line: 72, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !814, file: !810, line: 73, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !810, line: 20, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !817, file: !810, line: 21, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !821, line: 25, baseType: !822)
!821 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !821, line: 25, elements: !823)
!823 = !{}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !805, file: !797, line: 195, baseType: !796, size: 512, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !805, file: !797, line: 196, baseType: !826, size: 64, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !797, line: 156, size: 192, elements: !829)
!829 = !{!830, !835, !840}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !828, file: !797, line: 157, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!349, !804, !802}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !797, line: 158, baseType: !836, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!358, !804, !802}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !828, file: !797, line: 159, baseType: !841, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!349, !804, !802, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !797, line: 148, size: 20736, elements: !847)
!847 = !{!848, !850, !854, !855, !859}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !846, file: !797, line: 149, baseType: !849, size: 192)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 192, elements: !584)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !846, file: !797, line: 150, baseType: !851, size: 4096, offset: 192)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 4096, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !846, file: !797, line: 151, baseType: !349, size: 32, offset: 4288)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !846, file: !797, line: 152, baseType: !856, size: 16384, offset: 4320)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 16384, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 2048)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !846, file: !797, line: 153, baseType: !349, size: 32, offset: 20704)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !796, file: !797, line: 69, baseType: !861, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !797, line: 138, size: 448, elements: !863)
!863 = !{!864, !868, !895, !897, !3595, !3623, !3627}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !862, file: !797, line: 139, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !802}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !862, file: !797, line: 140, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !872, line: 230, size: 128, elements: !873)
!872 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!873 = !{!874, !888}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !871, file: !872, line: 231, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!878, !802, !882, !380}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !339, line: 60, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !880, line: 73, baseType: !881)
!880 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !880, line: 15, baseType: !685)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !872, line: 30, size: 128, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !872, line: 31, baseType: !358, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !883, file: !872, line: 32, baseType: !887, size: 16, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !339, line: 19, baseType: !389)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !871, file: !872, line: 232, baseType: !889, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!878, !802, !882, !358, !892}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !339, line: 55, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !880, line: 72, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !880, line: 16, baseType: !690)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !862, file: !797, line: 141, baseType: !896, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !862, file: !797, line: 142, baseType: !898, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !872, line: 84, size: 320, elements: !902)
!902 = !{!903, !904, !908, !3592, !3593}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !901, file: !872, line: 85, baseType: !358, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !901, file: !872, line: 86, baseType: !905, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!887, !802, !882, !349}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !901, file: !872, line: 88, baseType: !909, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!887, !802, !912, !349}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !872, line: 168, size: 448, elements: !914)
!914 = !{!915, !916, !917, !918, !3587, !3588}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !913, file: !872, line: 169, baseType: !883, size: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !913, file: !872, line: 170, baseType: !892, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !913, file: !872, line: 171, baseType: !340, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !913, file: !872, line: 172, baseType: !919, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!878, !922, !802, !912, !380, !1088, !892}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !208, line: 916, size: 1856, align: 32, elements: !924)
!924 = !{!925, !943, !3552, !3553, !3554, !3555, !3556, !3557, !3558, !3559, !3560, !3561, !3570, !3571, !3580, !3581, !3582, !3583, !3584, !3585, !3586}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !923, file: !208, line: 920, baseType: !926, size: 128)
!926 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !923, file: !208, line: 917, size: 128, elements: !927)
!927 = !{!928, !934}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !926, file: !208, line: 918, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !930, line: 58, size: 64, elements: !931)
!930 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !929, file: !930, line: 59, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !926, file: !208, line: 919, baseType: !935, size: 128, align: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !339, line: 216, size: 128, align: 64, elements: !936)
!936 = !{!937, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !339, line: 217, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !935, file: !339, line: 218, baseType: !940, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !938}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !923, file: !208, line: 921, baseType: !944, size: 128, offset: 128)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !945, line: 8, size: 128, elements: !946)
!945 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!946 = !{!947, !951}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !944, file: !945, line: 9, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !950, line: 18, flags: DIFlagFwdDecl)
!950 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !944, file: !945, line: 10, baseType: !952, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !950, line: 89, size: 1536, elements: !954)
!954 = !{!955, !956, !966, !974, !975, !990, !3521, !3523, !3535, !3536, !3537, !3538, !3539, !3544, !3545, !3546}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !953, file: !950, line: 91, baseType: !7, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !953, file: !950, line: 92, baseType: !957, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !958, line: 277, baseType: !959)
!958 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !958, line: 277, size: 32, elements: !960)
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !959, file: !958, line: 277, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !958, line: 70, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !958, line: 65, size: 32, elements: !964)
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !963, file: !958, line: 66, baseType: !7, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !953, file: !950, line: 93, baseType: !967, size: 128, offset: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !968, line: 38, size: 128, elements: !969)
!968 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!969 = !{!970, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !968, line: 39, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !967, file: !968, line: 39, baseType: !973, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !953, file: !950, line: 94, baseType: !952, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !953, file: !950, line: 95, baseType: !976, size: 128, offset: 256)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !950, line: 47, size: 128, elements: !977)
!977 = !{!978, !987}
!978 = !DIDerivedType(tag: DW_TAG_member, scope: !976, file: !950, line: 48, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !976, file: !950, line: 48, size: 64, elements: !980)
!980 = !{!981, !986}
!981 = !DIDerivedType(tag: DW_TAG_member, scope: !979, file: !950, line: 49, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !979, file: !950, line: 49, size: 64, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !982, file: !950, line: 50, baseType: !496, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !982, file: !950, line: 50, baseType: !496, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !979, file: !950, line: 52, baseType: !346, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !950, line: 54, baseType: !988, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !953, file: !950, line: 96, baseType: !991, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !208, line: 610, size: 4224, elements: !993)
!993 = !{!994, !995, !996, !1004, !1011, !1012, !1153, !3215, !3216, !3217, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3230, !3231, !3232, !3233, !3234, !3235, !3236, !3237, !3238, !3239, !3240, !3241, !3242, !3247, !3248, !3249, !3250, !3251, !3252, !3253, !3489, !3497, !3498, !3499, !3517, !3518, !3519, !3520}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !992, file: !208, line: 611, baseType: !887, size: 16)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !992, file: !208, line: 612, baseType: !389, size: 16, offset: 16)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !992, file: !208, line: 613, baseType: !997, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !998, line: 23, baseType: !999)
!998 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !998, line: 21, size: 32, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !999, file: !998, line: 22, baseType: !1002, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !339, line: 32, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !880, line: 49, baseType: !7)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !992, file: !208, line: 614, baseType: !1005, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !998, line: 28, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !998, line: 26, size: 32, elements: !1007)
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1006, file: !998, line: 27, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !339, line: 33, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !880, line: 50, baseType: !7)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !992, file: !208, line: 615, baseType: !7, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !992, file: !208, line: 622, baseType: !1013, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !208, line: 1864, size: 1536, align: 512, elements: !1016)
!1016 = !{!1017, !1021, !1031, !1035, !1041, !1045, !1049, !1053, !1057, !1061, !1065, !1066, !1072, !1076, !1100, !1129, !1133, !1139, !1144, !1148, !1149}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !1015, file: !208, line: 1865, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!952, !991, !952, !7}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !1015, file: !208, line: 1866, baseType: !1022, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!358, !952, !991, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !1027, line: 10, size: 128, elements: !1028)
!1027 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1026, file: !1027, line: 11, baseType: !382, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1026, file: !1027, line: 12, baseType: !340, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !1015, file: !208, line: 1867, baseType: !1032, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!349, !991, !349}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !1015, file: !208, line: 1868, baseType: !1036, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1039, !991, !349}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !208, line: 581, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !1015, file: !208, line: 1870, baseType: !1042, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!349, !952, !380, !349}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !1015, file: !208, line: 1872, baseType: !1046, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!349, !991, !952, !887, !528}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1015, file: !208, line: 1873, baseType: !1050, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!349, !952, !991, !952}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !1015, file: !208, line: 1874, baseType: !1054, size: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!349, !991, !952}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !1015, file: !208, line: 1875, baseType: !1058, size: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!349, !991, !952, !358}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !1015, file: !208, line: 1876, baseType: !1062, size: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!349, !991, !952, !887}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !1015, file: !208, line: 1877, baseType: !1054, size: 64, offset: 640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !1015, file: !208, line: 1878, baseType: !1067, size: 64, offset: 704)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!349, !991, !952, !887, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !339, line: 16, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !339, line: 13, baseType: !496)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !1015, file: !208, line: 1879, baseType: !1073, size: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!349, !991, !952, !991, !952, !7}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !1015, file: !208, line: 1881, baseType: !1077, size: 64, offset: 832)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!349, !952, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !208, line: 219, size: 640, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1090, !1097, !1098, !1099}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1081, file: !208, line: 220, baseType: !7, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1081, file: !208, line: 221, baseType: !887, size: 16, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1081, file: !208, line: 222, baseType: !997, size: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1081, file: !208, line: 223, baseType: !1005, size: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1081, file: !208, line: 224, baseType: !1088, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !339, line: 46, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !880, line: 88, baseType: !619)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1081, file: !208, line: 225, baseType: !1091, size: 128, offset: 192)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1092, line: 13, size: 128, elements: !1093)
!1092 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1093 = !{!1094, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1091, file: !1092, line: 14, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1092, line: 8, baseType: !618)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1091, file: !1092, line: 15, baseType: !685, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1081, file: !208, line: 226, baseType: !1091, size: 128, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1081, file: !208, line: 227, baseType: !1091, size: 128, offset: 448)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1081, file: !208, line: 234, baseType: !922, size: 64, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !1015, file: !208, line: 1882, baseType: !1101, size: 64, offset: 896)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!349, !1104, !1106, !496, !7}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1108, line: 22, size: 1152, elements: !1109)
!1108 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1109 = !{!1110, !1111, !1112, !1113, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1107, file: !1108, line: 23, baseType: !496, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1107, file: !1108, line: 24, baseType: !887, size: 16, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1107, file: !1108, line: 25, baseType: !7, size: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1107, file: !1108, line: 26, baseType: !1114, size: 32, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !339, line: 104, baseType: !496)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1107, file: !1108, line: 27, baseType: !346, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1107, file: !1108, line: 28, baseType: !346, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1107, file: !1108, line: 37, baseType: !346, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1107, file: !1108, line: 38, baseType: !1070, size: 32, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1107, file: !1108, line: 39, baseType: !1070, size: 32, offset: 352)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1107, file: !1108, line: 40, baseType: !997, size: 32, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1107, file: !1108, line: 41, baseType: !1005, size: 32, offset: 416)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !1108, line: 42, baseType: !1088, size: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1107, file: !1108, line: 43, baseType: !1091, size: 128, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1107, file: !1108, line: 44, baseType: !1091, size: 128, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1107, file: !1108, line: 45, baseType: !1091, size: 128, offset: 768)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1107, file: !1108, line: 46, baseType: !1091, size: 128, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1107, file: !1108, line: 47, baseType: !346, size: 64, offset: 1024)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1107, file: !1108, line: 48, baseType: !346, size: 64, offset: 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !1015, file: !208, line: 1883, baseType: !1130, size: 64, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!878, !952, !380, !892}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !1015, file: !208, line: 1884, baseType: !1134, size: 64, offset: 1024)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!349, !991, !1137, !346, !346}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !208, line: 50, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !1015, file: !208, line: 1886, baseType: !1140, size: 64, offset: 1088)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!349, !991, !1143, !349}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !1015, file: !208, line: 1887, baseType: !1145, size: 64, offset: 1152)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!349, !991, !952, !922, !7, !887}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1015, file: !208, line: 1890, baseType: !1062, size: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !1015, file: !208, line: 1891, baseType: !1150, size: 64, offset: 1280)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!349, !991, !1039, !349}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !992, file: !208, line: 623, baseType: !1154, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !208, line: 1416, size: 9472, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1209, !2823, !2905, !2988, !2992, !2993, !2994, !2995, !2996, !2997, !2998, !2999, !3004, !3008, !3009, !3012, !3013, !3016, !3017, !3018, !3059, !3085, !3086, !3087, !3088, !3089, !3090, !3093, !3095, !3102, !3103, !3105, !3106, !3107, !3166, !3167, !3182, !3183, !3184, !3185, !3186, !3189, !3190, !3191, !3206, !3207, !3208, !3209, !3210, !3211, !3212, !3213, !3214}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1155, file: !208, line: 1417, baseType: !781, size: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1155, file: !208, line: 1418, baseType: !1070, size: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1155, file: !208, line: 1419, baseType: !345, size: 8, offset: 160)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1155, file: !208, line: 1420, baseType: !690, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1155, file: !208, line: 1421, baseType: !1088, size: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1155, file: !208, line: 1422, baseType: !1163, size: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !208, line: 2228, size: 576, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1175, !1179, !1183, !1187, !1188, !1189, !1199, !1202, !1203, !1204, !1206, !1207, !1208}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1164, file: !208, line: 2229, baseType: !358, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1164, file: !208, line: 2230, baseType: !349, size: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1164, file: !208, line: 2238, baseType: !1169, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!349, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1174, line: 28, flags: DIFlagFwdDecl)
!1174 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1164, file: !208, line: 2239, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1178)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !208, line: 70, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1164, file: !208, line: 2240, baseType: !1180, size: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!952, !1163, !349, !358, !340}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1164, file: !208, line: 2242, baseType: !1184, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !1154}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1164, file: !208, line: 2243, baseType: !362, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1164, file: !208, line: 2244, baseType: !1163, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !1164, file: !208, line: 2245, baseType: !1190, size: 64, offset: 512)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !339, line: 182, size: 64, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1190, file: !339, line: 183, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !339, line: 186, size: 128, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1194, file: !339, line: 187, baseType: !1193, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1194, file: !339, line: 187, baseType: !1198, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !1164, file: !208, line: 2247, baseType: !1200, offset: 576)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1201, line: 187, elements: !823)
!1201 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !1164, file: !208, line: 2248, baseType: !1200, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !1164, file: !208, line: 2249, baseType: !1200, offset: 576)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !1164, file: !208, line: 2250, baseType: !1205, offset: 576)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, elements: !584)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !1164, file: !208, line: 2252, baseType: !1200, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !1164, file: !208, line: 2253, baseType: !1200, offset: 576)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !1164, file: !208, line: 2254, baseType: !1200, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !1155, file: !208, line: 1423, baseType: !1210, size: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !208, line: 1935, size: 1472, elements: !1213)
!1213 = !{!1214, !1218, !1222, !1223, !1227, !1233, !1237, !1238, !1239, !1243, !1247, !1248, !1249, !1250, !1256, !1261, !1262, !1269, !1270, !1271, !1272, !2807, !2822}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1212, file: !208, line: 1936, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!991, !1154}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1212, file: !208, line: 1937, baseType: !1219, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{null, !991}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !1212, file: !208, line: 1938, baseType: !1219, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1212, file: !208, line: 1940, baseType: !1224, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !991, !349}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1212, file: !208, line: 1941, baseType: !1228, size: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!349, !991, !1231}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !208, line: 289, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1212, file: !208, line: 1942, baseType: !1234, size: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!349, !991}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1212, file: !208, line: 1943, baseType: !1219, size: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1212, file: !208, line: 1944, baseType: !1184, size: 64, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1212, file: !208, line: 1945, baseType: !1240, size: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!349, !1154, !349}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1212, file: !208, line: 1946, baseType: !1244, size: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!349, !1154}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1212, file: !208, line: 1947, baseType: !1244, size: 64, offset: 640)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1212, file: !208, line: 1948, baseType: !1244, size: 64, offset: 704)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1212, file: !208, line: 1949, baseType: !1244, size: 64, offset: 768)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1212, file: !208, line: 1950, baseType: !1251, size: 64, offset: 832)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!349, !952, !1254}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !208, line: 57, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1212, file: !208, line: 1951, baseType: !1257, size: 64, offset: 896)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!349, !1154, !1260, !380}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1212, file: !208, line: 1952, baseType: !1184, size: 64, offset: 960)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1212, file: !208, line: 1954, baseType: !1263, size: 64, offset: 1024)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!349, !1266, !952}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1268, line: 539, flags: DIFlagFwdDecl)
!1268 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1212, file: !208, line: 1955, baseType: !1263, size: 64, offset: 1088)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1212, file: !208, line: 1956, baseType: !1263, size: 64, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1212, file: !208, line: 1957, baseType: !1263, size: 64, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !1212, file: !208, line: 1963, baseType: !1273, size: 64, offset: 1280)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!349, !1154, !1276, !338}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1278, line: 68, size: 512, align: 128, elements: !1279)
!1278 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1279 = !{!1280, !1281, !2799, !2806}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1277, file: !1278, line: 69, baseType: !690, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, scope: !1277, file: !1278, line: 77, baseType: !1282, size: 320, offset: 64)
!1282 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1277, file: !1278, line: 77, size: 320, elements: !1283)
!1283 = !{!1284, !1465, !1470, !1498, !1506, !1512, !2791, !2798}
!1284 = !DIDerivedType(tag: DW_TAG_member, scope: !1282, file: !1278, line: 78, baseType: !1285, size: 320)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1282, file: !1278, line: 78, size: 320, elements: !1286)
!1286 = !{!1287, !1288, !1463, !1464}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1285, file: !1278, line: 84, baseType: !781, size: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1285, file: !1278, line: 86, baseType: !1289, size: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !208, line: 451, size: 1216, align: 64, elements: !1291)
!1291 = !{!1292, !1293, !1300, !1301, !1302, !1317, !1333, !1334, !1335, !1336, !1456, !1457, !1460, !1461, !1462}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1290, file: !208, line: 452, baseType: !991, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1290, file: !208, line: 453, baseType: !1294, size: 128, offset: 64)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1295, line: 292, size: 128, elements: !1296)
!1295 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1296 = !{!1297, !1298, !1299}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1294, file: !1295, line: 293, baseType: !809)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1294, file: !1295, line: 295, baseType: !338, size: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1294, file: !1295, line: 296, baseType: !340, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1290, file: !208, line: 454, baseType: !338, size: 32, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1290, file: !208, line: 455, baseType: !481, size: 32, offset: 224)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1290, file: !208, line: 460, baseType: !1303, size: 128, offset: 256)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1304, line: 125, size: 128, elements: !1305)
!1304 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1305 = !{!1306, !1316}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1303, file: !1304, line: 126, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1304, line: 31, size: 64, elements: !1308)
!1308 = !{!1309}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1307, file: !1304, line: 32, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1304, line: 24, size: 192, align: 64, elements: !1312)
!1312 = !{!1313, !1314, !1315}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1311, file: !1304, line: 25, baseType: !690, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1311, file: !1304, line: 26, baseType: !1310, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1311, file: !1304, line: 27, baseType: !1310, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1303, file: !1304, line: 127, baseType: !1310, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1290, file: !208, line: 461, baseType: !1318, size: 256, offset: 384)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1319, line: 35, size: 256, elements: !1320)
!1319 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1320 = !{!1321, !1329, !1330, !1332}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1318, file: !1319, line: 36, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !1323, line: 13, baseType: !1324)
