; ModuleID = '../bcout/drivers/net/ethernet/marvell/prestera/prestera_main.llvm.bc'
source_filename = "drivers/net/ethernet/marvell/prestera/prestera_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_prestera_module_init6:\09\09\09"
module asm ".long\09prestera_module_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"


!335 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!336 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!337 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!338 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !327, line: 602, baseType: !13, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346}
!341 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!342 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!343 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!344 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!345 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!346 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !327, line: 615, baseType: !13, size: 32, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!350 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!351 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!352 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !327, line: 626, baseType: !13, size: 32, elements: !354)
!354 = !{!355, !356, !357, !358, !359}
!355 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!356 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!357 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!358 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!359 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !327, line: 638, baseType: !13, size: 32, elements: !361)
!361 = !{!362, !363}
!362 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!363 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !327, line: 647, baseType: !13, size: 32, elements: !365)
!365 = !{!366, !367}
!366 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !369, line: 54, baseType: !13, size: 32, elements: !370)
!369 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!370 = !{!371, !372, !373, !374}
!371 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!373 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!374 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !6, line: 423, baseType: !13, size: 32, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!378 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!379 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!380 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !382, file: !6, line: 2085, baseType: !13, size: 32, elements: !7755)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !6, line: 1858, size: 15808, elements: !383)
!383 = !{!384, !389, !412, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !446, !454, !455, !456, !457, !458, !459, !460, !461, !462, !488, !498, !499, !500, !505, !506, !510, !513, !6638, !7152, !7156, !7196, !7197, !7198, !7199, !7200, !7201, !7202, !7203, !7204, !7205, !7206, !7207, !7208, !7209, !7210, !7211, !7212, !7213, !7214, !7215, !7216, !7217, !7218, !7219, !7220, !7221, !7222, !7227, !7228, !7229, !7230, !7231, !7232, !7233, !7236, !7239, !7242, !7245, !7248, !7249, !7262, !7263, !7264, !7265, !7266, !7267, !7274, !7275, !7309, !7310, !7311, !7312, !7313, !7314, !7315, !7316, !7317, !7320, !7321, !7322, !7323, !7324, !7325, !7326, !7327, !7328, !7333, !7334, !7335, !7336, !7373, !7374, !7376, !7377, !7381, !7382, !7383, !7384, !7390, !7392, !7733, !7734, !7736, !7737, !7738, !7739, !7740, !7744, !7747}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !6, line: 1859, baseType: !385, size: 128)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 128, elements: !387)
!386 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!387 = !{!388}
!388 = !DISubrange(count: 16)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !382, file: !6, line: 1860, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !6, line: 938, size: 384, elements: !392)
!392 = !{!393, !401, !407, !409}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !391, file: !6, line: 939, baseType: !394, size: 128)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !395, line: 186, size: 128, elements: !396)
!395 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!396 = !{!397, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !395, line: 187, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !394, file: !395, line: 187, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !391, file: !6, line: 940, baseType: !402, size: 128, offset: 128)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !395, line: 178, size: 128, elements: !403)
!403 = !{!404, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !395, line: 179, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !402, file: !395, line: 179, baseType: !405, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !391, file: !6, line: 941, baseType: !408, size: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !6, line: 942, baseType: !410, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !382, file: !6, line: 1861, baseType: !413, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !6, line: 930, size: 128, elements: !415)
!415 = !{!416, !425}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !414, file: !6, line: 931, baseType: !417, size: 128, align: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !395, line: 216, size: 128, align: 64, elements: !418)
!418 = !{!419, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !395, line: 217, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !417, file: !395, line: 218, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !420}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !414, file: !6, line: 932, baseType: !426, offset: 128)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: -1)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !382, file: !6, line: 1866, baseType: !430, size: 64, offset: 256)
!430 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !382, file: !6, line: 1867, baseType: !430, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !382, file: !6, line: 1868, baseType: !430, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !382, file: !6, line: 1869, baseType: !7, size: 32, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !382, file: !6, line: 1877, baseType: !430, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !382, file: !6, line: 1879, baseType: !402, size: 128, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !382, file: !6, line: 1880, baseType: !402, size: 128, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !382, file: !6, line: 1881, baseType: !402, size: 128, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !382, file: !6, line: 1882, baseType: !402, size: 128, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !382, file: !6, line: 1883, baseType: !402, size: 128, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !382, file: !6, line: 1884, baseType: !402, size: 128, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !382, file: !6, line: 1889, baseType: !442, size: 256, offset: 1344)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !6, line: 1886, size: 256, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !442, file: !6, line: 1887, baseType: !402, size: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !442, file: !6, line: 1888, baseType: !402, size: 128, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !382, file: !6, line: 1891, baseType: !447, size: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !448, line: 12, baseType: !449)
!448 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !450, line: 23, baseType: !451)
!450 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !452, line: 31, baseType: !453)
!452 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!453 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !382, file: !6, line: 1892, baseType: !447, size: 64, offset: 1664)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !382, file: !6, line: 1893, baseType: !447, size: 64, offset: 1728)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !382, file: !6, line: 1894, baseType: !447, size: 64, offset: 1792)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !382, file: !6, line: 1895, baseType: !447, size: 64, offset: 1856)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !382, file: !6, line: 1896, baseType: !447, size: 64, offset: 1920)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !382, file: !6, line: 1897, baseType: !447, size: 64, offset: 1984)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !382, file: !6, line: 1899, baseType: !7, size: 32, offset: 2048)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !382, file: !6, line: 1900, baseType: !7, size: 32, offset: 2080)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !382, file: !6, line: 1902, baseType: !463, size: 1472, offset: 2112)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !6, line: 169, size: 1472, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !463, file: !6, line: 170, baseType: !430, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !463, file: !6, line: 171, baseType: !430, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !463, file: !6, line: 172, baseType: !430, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !463, file: !6, line: 173, baseType: !430, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !463, file: !6, line: 174, baseType: !430, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !463, file: !6, line: 175, baseType: !430, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !463, file: !6, line: 176, baseType: !430, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !463, file: !6, line: 177, baseType: !430, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !463, file: !6, line: 178, baseType: !430, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !463, file: !6, line: 179, baseType: !430, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !463, file: !6, line: 180, baseType: !430, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !463, file: !6, line: 181, baseType: !430, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !463, file: !6, line: 182, baseType: !430, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !463, file: !6, line: 183, baseType: !430, size: 64, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !463, file: !6, line: 184, baseType: !430, size: 64, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !463, file: !6, line: 185, baseType: !430, size: 64, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !463, file: !6, line: 186, baseType: !430, size: 64, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !463, file: !6, line: 187, baseType: !430, size: 64, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !463, file: !6, line: 188, baseType: !430, size: 64, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !463, file: !6, line: 189, baseType: !430, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !463, file: !6, line: 190, baseType: !430, size: 64, offset: 1280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !463, file: !6, line: 191, baseType: !430, size: 64, offset: 1344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !463, file: !6, line: 192, baseType: !430, size: 64, offset: 1408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !382, file: !6, line: 1904, baseType: !489, size: 64, offset: 3584)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !490, line: 13, baseType: !491)
!490 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !395, line: 175, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 173, size: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !492, file: !395, line: 174, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !450, line: 22, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !452, line: 30, baseType: !497)
!497 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !382, file: !6, line: 1905, baseType: !489, size: 64, offset: 3648)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !382, file: !6, line: 1906, baseType: !489, size: 64, offset: 3712)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !382, file: !6, line: 1909, baseType: !501, size: 32, offset: 3776)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !395, line: 168, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 166, size: 32, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !502, file: !395, line: 167, baseType: !7, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !382, file: !6, line: 1910, baseType: !501, size: 32, offset: 3808)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !382, file: !6, line: 1913, baseType: !507, size: 64, offset: 3840)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !6, line: 1913, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !382, file: !6, line: 1914, baseType: !511, size: 64, offset: 3904)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !6, line: 1914, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !382, file: !6, line: 1916, baseType: !514, size: 64, offset: 3968)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !6, line: 1283, size: 4416, elements: !517)
!517 = !{!518, !522, !526, !527, !528, !691, !695, !700, !704, !705, !710, !711, !834, !839, !843, !849, !853, !885, !893, !897, !902, !906, !907, !913, !917, !921, !925, !926, !948, !952, !967, !978, !982, !991, !995, !996, !1000, !1021, !1025, !1029, !1033, !1037, !1044, !1048, !1066, !1070, !1120, !1124, !1129, !1133, !1137, !1141, !1151, !1152, !1161, !1167, !1168, !1172, !1176, !1180, !1184, !1185, !1189, !1190, !5565, !5585, !5589, !6628, !6634}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !516, file: !6, line: 1284, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!7, !408}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !516, file: !6, line: 1285, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !408}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !516, file: !6, line: 1286, baseType: !519, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !516, file: !6, line: 1287, baseType: !519, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !516, file: !6, line: 1288, baseType: !529, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!532, !533, !408}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !6, line: 120, baseType: !5)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !535, line: 713, size: 1600, elements: !536)
!535 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!536 = !{!537, !559, !567, !574, !578, !590, !591, !592, !595, !596, !597, !603, !604, !605, !606, !607, !608, !609, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !649, !650, !651, !652, !654, !655, !660, !665, !670, !671, !672, !673, !674, !675, !676, !677, !678, !680, !681, !683, !684, !685}
!537 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 714, baseType: !538, size: 192)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 714, size: 192, elements: !539)
!539 = !{!540, !550, !558}
!540 = !DIDerivedType(tag: DW_TAG_member, scope: !538, file: !535, line: 715, baseType: !541, size: 192)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !535, line: 715, size: 192, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !535, line: 717, baseType: !533, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !541, file: !535, line: 718, baseType: !533, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !541, file: !535, line: 720, baseType: !546, size: 64, offset: 128)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !541, file: !535, line: 720, size: 64, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !546, file: !535, line: 721, baseType: !408, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !546, file: !535, line: 726, baseType: !430, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !538, file: !535, line: 729, baseType: !551, size: 192, align: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !552, line: 24, size: 192, align: 64, elements: !553)
!552 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!553 = !{!554, !555, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !551, file: !552, line: 25, baseType: !430, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !551, file: !552, line: 26, baseType: !556, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !551, file: !552, line: 27, baseType: !556, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !538, file: !535, line: 730, baseType: !402, size: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 733, baseType: !560, size: 64, offset: 192)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 733, size: 64, elements: !561)
!561 = !{!562, !566}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !560, file: !535, line: 734, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !565, line: 124, flags: DIFlagFwdDecl)
!565 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !560, file: !535, line: 735, baseType: !7, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 738, baseType: !568, size: 64, offset: 256)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 738, size: 64, elements: !569)
!569 = !{!570, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !568, file: !535, line: 739, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !572, line: 29, baseType: !495)
!572 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!573 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !568, file: !535, line: 740, baseType: !449, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !534, file: !535, line: 748, baseType: !575, size: 384, align: 64, offset: 320)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 384, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 48)
!578 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 750, baseType: !579, size: 128, offset: 704)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 750, size: 128, elements: !580)
!580 = !{!581, !589}
!581 = !DIDerivedType(tag: DW_TAG_member, scope: !579, file: !535, line: 751, baseType: !582, size: 128)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !579, file: !535, line: 751, size: 128, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !582, file: !535, line: 752, baseType: !430, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !582, file: !535, line: 753, baseType: !586, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !533}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !579, file: !535, line: 755, baseType: !402, size: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !534, file: !535, line: 761, baseType: !13, size: 32, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !534, file: !535, line: 762, baseType: !13, size: 32, offset: 864)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !534, file: !535, line: 763, baseType: !593, size: 16, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !452, line: 24, baseType: !594)
!594 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !534, file: !535, line: 764, baseType: !593, size: 16, offset: 912)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !534, file: !535, line: 769, baseType: !593, size: 16, offset: 928)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !534, file: !535, line: 780, baseType: !598, offset: 944)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, elements: !601)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !452, line: 21, baseType: !600)
!600 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!601 = !{!602}
!602 = !DISubrange(count: 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !534, file: !535, line: 782, baseType: !599, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !534, file: !535, line: 783, baseType: !599, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !534, file: !535, line: 784, baseType: !599, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !534, file: !535, line: 785, baseType: !599, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !534, file: !535, line: 786, baseType: !599, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !534, file: !535, line: 787, baseType: !599, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !534, file: !535, line: 795, baseType: !610, offset: 960)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, elements: !601)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !452, line: 27, baseType: !13)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !534, file: !535, line: 807, baseType: !598, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !534, file: !535, line: 809, baseType: !599, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !534, file: !535, line: 810, baseType: !599, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !534, file: !535, line: 811, baseType: !599, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !534, file: !535, line: 812, baseType: !599, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !534, file: !535, line: 813, baseType: !599, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !534, file: !535, line: 815, baseType: !599, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !534, file: !535, line: 816, baseType: !599, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !534, file: !535, line: 817, baseType: !599, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !534, file: !535, line: 818, baseType: !599, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !534, file: !535, line: 819, baseType: !599, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !534, file: !535, line: 821, baseType: !599, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !534, file: !535, line: 822, baseType: !599, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !534, file: !535, line: 823, baseType: !599, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !534, file: !535, line: 832, baseType: !598, offset: 976)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !534, file: !535, line: 834, baseType: !599, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !534, file: !535, line: 835, baseType: !599, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !534, file: !535, line: 836, baseType: !599, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !534, file: !535, line: 837, baseType: !599, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !534, file: !535, line: 838, baseType: !599, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !534, file: !535, line: 840, baseType: !599, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !534, file: !535, line: 843, baseType: !599, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !534, file: !535, line: 844, baseType: !599, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !534, file: !535, line: 845, baseType: !599, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !534, file: !535, line: 847, baseType: !599, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !534, file: !535, line: 848, baseType: !599, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!638 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 866, baseType: !639, size: 32, offset: 992)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 866, size: 32, elements: !640)
!640 = !{!641, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !639, file: !535, line: 867, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !643, line: 37, baseType: !611)
!643 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!644 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !535, line: 868, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !639, file: !535, line: 868, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !645, file: !535, line: 869, baseType: !593, size: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !645, file: !535, line: 870, baseType: !593, size: 16, offset: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !534, file: !535, line: 873, baseType: !611, size: 32, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !534, file: !535, line: 874, baseType: !7, size: 32, offset: 1056)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !534, file: !535, line: 875, baseType: !611, size: 32, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !534, file: !535, line: 876, baseType: !653, size: 16, offset: 1120)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !643, line: 30, baseType: !593)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !534, file: !535, line: 877, baseType: !593, size: 16, offset: 1136)
!655 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 879, baseType: !656, size: 32, offset: 1152)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 879, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !656, file: !535, line: 880, baseType: !13, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !656, file: !535, line: 881, baseType: !13, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 888, baseType: !661, size: 32, offset: 1184)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 888, size: 32, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !661, file: !535, line: 889, baseType: !611, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !661, file: !535, line: 890, baseType: !611, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 893, baseType: !666, size: 16, offset: 1216)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 893, size: 16, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !666, file: !535, line: 894, baseType: !653, size: 16)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !666, file: !535, line: 895, baseType: !599, size: 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !534, file: !535, line: 898, baseType: !593, size: 16, offset: 1232)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !534, file: !535, line: 899, baseType: !593, size: 16, offset: 1248)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !534, file: !535, line: 900, baseType: !593, size: 16, offset: 1264)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !534, file: !535, line: 902, baseType: !653, size: 16, offset: 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !534, file: !535, line: 903, baseType: !593, size: 16, offset: 1296)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !534, file: !535, line: 904, baseType: !593, size: 16, offset: 1312)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !534, file: !535, line: 905, baseType: !593, size: 16, offset: 1328)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !534, file: !535, line: 908, baseType: !610, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !534, file: !535, line: 912, baseType: !679, size: 32, offset: 1344)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !535, line: 606, baseType: !13)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !534, file: !535, line: 913, baseType: !679, size: 32, offset: 1376)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !534, file: !535, line: 914, baseType: !682, size: 64, offset: 1408)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !535, line: 915, baseType: !682, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !534, file: !535, line: 916, baseType: !13, size: 32, offset: 1536)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !534, file: !535, line: 917, baseType: !686, size: 32, offset: 1568)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !687, line: 113, baseType: !688)
!687 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !687, line: 111, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !688, file: !687, line: 112, baseType: !501, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !516, file: !6, line: 1290, baseType: !692, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!447, !533, !408, !447}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !516, file: !6, line: 1293, baseType: !696, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!699, !408, !533, !408}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !450, line: 19, baseType: !593)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !516, file: !6, line: 1296, baseType: !701, size: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !408, !7}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !516, file: !6, line: 1298, baseType: !523, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !516, file: !6, line: 1299, baseType: !706, size: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!7, !408, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !516, file: !6, line: 1301, baseType: !519, size: 64, offset: 640)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !516, file: !6, line: 1302, baseType: !712, size: 64, offset: 704)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!7, !408, !715, !7}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !717, line: 234, size: 320, elements: !718)
!717 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!718 = !{!719, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !716, file: !717, line: 239, baseType: !720, size: 128)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !716, file: !717, line: 236, size: 128, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !720, file: !717, line: 238, baseType: !385, size: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !716, file: !717, line: 255, baseType: !724, size: 192, offset: 128)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !716, file: !717, line: 241, size: 192, elements: !725)
!725 = !{!726, !738, !739, !740, !741, !742, !744, !745, !746, !755, !756, !757, !758}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !724, file: !717, line: 242, baseType: !727, size: 128)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !728, line: 32, size: 128, elements: !729)
!728 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!729 = !{!730, !734}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !727, file: !728, line: 33, baseType: !731, size: 16)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !728, line: 26, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !733, line: 10, baseType: !594)
!733 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !727, file: !728, line: 34, baseType: !735, size: 112, offset: 16)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 112, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 14)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !724, file: !717, line: 243, baseType: !727, size: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !724, file: !717, line: 244, baseType: !727, size: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !724, file: !717, line: 245, baseType: !727, size: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !724, file: !717, line: 246, baseType: !727, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !724, file: !717, line: 247, baseType: !743, size: 16)
!743 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !724, file: !717, line: 248, baseType: !7, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !724, file: !717, line: 249, baseType: !7, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !724, file: !717, line: 250, baseType: !747, size: 192)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !717, line: 196, size: 192, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !747, file: !717, line: 197, baseType: !430, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !747, file: !717, line: 198, baseType: !430, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !747, file: !717, line: 199, baseType: !594, size: 16, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !747, file: !717, line: 200, baseType: !600, size: 8, offset: 144)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !747, file: !717, line: 201, baseType: !600, size: 8, offset: 152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !747, file: !717, line: 202, baseType: !600, size: 8, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !724, file: !717, line: 251, baseType: !385, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !724, file: !717, line: 252, baseType: !385, size: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !724, file: !717, line: 253, baseType: !709, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !724, file: !717, line: 254, baseType: !759, size: 128)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !717, line: 207, size: 128, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !717, line: 208, baseType: !13, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !717, line: 209, baseType: !13, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !759, file: !717, line: 222, baseType: !764, size: 64, offset: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !759, file: !717, line: 210, size: 64, elements: !765)
!765 = !{!766, !774, !781, !793, !799, !806, !817, !825}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !764, file: !717, line: 212, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !769, line: 56, baseType: !770)
!769 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 53, size: 32, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !770, file: !769, line: 54, baseType: !594, size: 16)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !770, file: !769, line: 55, baseType: !594, size: 16, offset: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !764, file: !717, line: 213, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !769, line: 80, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 77, size: 64, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !777, file: !769, line: 78, baseType: !13, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !777, file: !769, line: 79, baseType: !13, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !764, file: !717, line: 214, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !769, line: 66, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 58, size: 192, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !784, file: !769, line: 59, baseType: !13, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !784, file: !769, line: 60, baseType: !13, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !784, file: !769, line: 61, baseType: !13, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !784, file: !769, line: 62, baseType: !13, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !784, file: !769, line: 63, baseType: !13, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !784, file: !769, line: 64, baseType: !594, size: 16, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !784, file: !769, line: 65, baseType: !594, size: 16, offset: 176)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !764, file: !717, line: 215, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !769, line: 70, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 68, size: 32, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !796, file: !769, line: 69, baseType: !13, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !764, file: !717, line: 216, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !769, line: 75, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 72, size: 160, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !802, file: !769, line: 73, baseType: !13, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !802, file: !769, line: 74, baseType: !385, size: 128, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !764, file: !717, line: 217, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !769, line: 89, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 82, size: 192, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !809, file: !769, line: 83, baseType: !594, size: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !809, file: !769, line: 84, baseType: !13, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !809, file: !769, line: 85, baseType: !13, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !809, file: !769, line: 86, baseType: !13, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !809, file: !769, line: 87, baseType: !13, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !809, file: !769, line: 88, baseType: !13, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !764, file: !717, line: 220, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !769, line: 44, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 40, size: 96, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !820, file: !769, line: 41, baseType: !13, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !820, file: !769, line: 42, baseType: !13, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !820, file: !769, line: 43, baseType: !594, size: 16, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !764, file: !717, line: 221, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !769, line: 51, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 46, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !828, file: !769, line: 47, baseType: !13, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !828, file: !769, line: 48, baseType: !13, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !828, file: !769, line: 49, baseType: !594, size: 16, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !828, file: !769, line: 50, baseType: !13, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !516, file: !6, line: 1304, baseType: !835, size: 64, offset: 768)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!7, !408, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !516, file: !6, line: 1306, baseType: !840, size: 64, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!7, !408, !7}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !516, file: !6, line: 1308, baseType: !844, size: 64, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!7, !408, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !6, line: 206, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !516, file: !6, line: 1310, baseType: !850, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !408, !13}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !516, file: !6, line: 1313, baseType: !854, size: 64, offset: 1024)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !408, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !859, line: 214, size: 1536, elements: !860)
!859 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !858, file: !859, line: 215, baseType: !451, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !858, file: !859, line: 216, baseType: !451, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !858, file: !859, line: 217, baseType: !451, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !858, file: !859, line: 218, baseType: !451, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !858, file: !859, line: 219, baseType: !451, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !858, file: !859, line: 220, baseType: !451, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !858, file: !859, line: 221, baseType: !451, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !858, file: !859, line: 222, baseType: !451, size: 64, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !858, file: !859, line: 223, baseType: !451, size: 64, offset: 512)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !858, file: !859, line: 224, baseType: !451, size: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !858, file: !859, line: 227, baseType: !451, size: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !858, file: !859, line: 228, baseType: !451, size: 64, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !858, file: !859, line: 229, baseType: !451, size: 64, offset: 768)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !858, file: !859, line: 230, baseType: !451, size: 64, offset: 832)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !858, file: !859, line: 231, baseType: !451, size: 64, offset: 896)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !858, file: !859, line: 232, baseType: !451, size: 64, offset: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !858, file: !859, line: 235, baseType: !451, size: 64, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !858, file: !859, line: 236, baseType: !451, size: 64, offset: 1088)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !858, file: !859, line: 237, baseType: !451, size: 64, offset: 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !858, file: !859, line: 238, baseType: !451, size: 64, offset: 1216)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !858, file: !859, line: 239, baseType: !451, size: 64, offset: 1280)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !858, file: !859, line: 242, baseType: !451, size: 64, offset: 1344)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !858, file: !859, line: 243, baseType: !451, size: 64, offset: 1408)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !858, file: !859, line: 244, baseType: !451, size: 64, offset: 1472)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !516, file: !6, line: 1315, baseType: !886, size: 64, offset: 1088)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!889, !891, !7}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !395, line: 30, baseType: !890)
!890 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !516, file: !6, line: 1316, baseType: !894, size: 64, offset: 1152)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!7, !7, !891, !709}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !516, file: !6, line: 1319, baseType: !898, size: 64, offset: 1216)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!901, !408}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !516, file: !6, line: 1321, baseType: !903, size: 64, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!7, !408, !653, !699}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !516, file: !6, line: 1323, baseType: !903, size: 64, offset: 1344)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !516, file: !6, line: 1331, baseType: !908, size: 64, offset: 1408)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!7, !408, !7, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !450, line: 17, baseType: !599)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !516, file: !6, line: 1333, baseType: !914, size: 64, offset: 1472)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!7, !408, !7, !699, !912, !653}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !516, file: !6, line: 1336, baseType: !918, size: 64, offset: 1536)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!7, !408, !7, !7, !7}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !516, file: !6, line: 1339, baseType: !922, size: 64, offset: 1600)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!7, !408, !7, !889}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !516, file: !6, line: 1341, baseType: !922, size: 64, offset: 1664)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !516, file: !6, line: 1343, baseType: !927, size: 64, offset: 1728)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!7, !408, !7, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !932, line: 20, size: 576, elements: !933)
!932 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!933 = !{!934, !935, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !931, file: !932, line: 21, baseType: !611, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !931, file: !932, line: 22, baseType: !936, size: 256, offset: 32)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 256, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !931, file: !932, line: 23, baseType: !611, size: 32, offset: 288)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !931, file: !932, line: 24, baseType: !611, size: 32, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !931, file: !932, line: 25, baseType: !611, size: 32, offset: 352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !931, file: !932, line: 26, baseType: !611, size: 32, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !931, file: !932, line: 27, baseType: !611, size: 32, offset: 416)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !931, file: !932, line: 28, baseType: !611, size: 32, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !931, file: !932, line: 29, baseType: !611, size: 32, offset: 480)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !931, file: !932, line: 30, baseType: !611, size: 32, offset: 512)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !931, file: !932, line: 31, baseType: !653, size: 16, offset: 544)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !516, file: !6, line: 1346, baseType: !949, size: 64, offset: 1792)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!7, !408, !7, !7}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !516, file: !6, line: 1348, baseType: !953, size: 64, offset: 1856)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!7, !408, !7, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !932, line: 9, size: 512, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !957, file: !932, line: 10, baseType: !451, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !957, file: !932, line: 11, baseType: !451, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !957, file: !932, line: 12, baseType: !451, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !957, file: !932, line: 13, baseType: !451, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !957, file: !932, line: 14, baseType: !451, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !957, file: !932, line: 15, baseType: !451, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !957, file: !932, line: 16, baseType: !451, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !957, file: !932, line: 17, baseType: !451, size: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !516, file: !6, line: 1352, baseType: !968, size: 64, offset: 1920)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!7, !408, !7, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !974, line: 213, size: 32, elements: !975)
!974 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !973, file: !974, line: 214, baseType: !593, size: 16)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !973, file: !974, line: 215, baseType: !593, size: 16, offset: 16)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !516, file: !6, line: 1355, baseType: !979, size: 64, offset: 1984)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!7, !408, !7, !533}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !516, file: !6, line: 1357, baseType: !983, size: 64, offset: 2048)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!7, !408, !7, !986, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !859, line: 956, size: 128, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !987, file: !859, line: 957, baseType: !611, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !987, file: !859, line: 958, baseType: !451, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !516, file: !6, line: 1361, baseType: !992, size: 64, offset: 2112)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!7, !408, !7, !449, !7}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !516, file: !6, line: 1364, baseType: !922, size: 64, offset: 2176)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !516, file: !6, line: 1367, baseType: !997, size: 64, offset: 2240)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!7, !408, !12, !709}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !516, file: !6, line: 1400, baseType: !1001, size: 64, offset: 2304)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!7, !408, !408, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1006, line: 75, size: 384, elements: !1007)
!1006 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1007 = !{!1008, !1009, !1012, !1016, !1020}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1005, file: !1006, line: 76, baseType: !410, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1005, file: !1006, line: 77, baseType: !1010, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1005, file: !1006, line: 78, baseType: !1013, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1006, line: 78, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1005, file: !1006, line: 79, baseType: !1017, size: 160, offset: 192)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 160, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 20)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1005, file: !1006, line: 80, baseType: !912, size: 8, offset: 352)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !516, file: !6, line: 1403, baseType: !1022, size: 64, offset: 2368)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!7, !408, !408}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !516, file: !6, line: 1405, baseType: !1026, size: 64, offset: 2432)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!408, !408, !533, !889}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !516, file: !6, line: 1408, baseType: !1030, size: 64, offset: 2496)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!447, !408, !447}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !516, file: !6, line: 1410, baseType: !1034, size: 64, offset: 2560)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!7, !408, !447}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !516, file: !6, line: 1412, baseType: !1038, size: 64, offset: 2624)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!7, !408, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1043, line: 35, flags: DIFlagFwdDecl)
!1043 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !516, file: !6, line: 1414, baseType: !1045, size: 64, offset: 2688)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !408, !1041}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !516, file: !6, line: 1417, baseType: !1049, size: 64, offset: 2752)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!7, !1052, !971, !408, !1064, !699, !699, !1004}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1054, line: 8, size: 96, elements: !1055)
!1054 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1055 = !{!1056, !1057, !1058, !1059, !1061, !1062, !1063}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1053, file: !1054, line: 9, baseType: !599, size: 8)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1053, file: !1054, line: 10, baseType: !599, size: 8, offset: 8)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1053, file: !1054, line: 11, baseType: !593, size: 16, offset: 16)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1053, file: !1054, line: 12, baseType: !1060, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !452, line: 26, baseType: !7)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1053, file: !1054, line: 13, baseType: !593, size: 16, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1053, file: !1054, line: 14, baseType: !599, size: 8, offset: 80)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1053, file: !1054, line: 15, baseType: !599, size: 8, offset: 88)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !516, file: !6, line: 1424, baseType: !1067, size: 64, offset: 2816)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!7, !1052, !971, !408, !1064, !699}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !516, file: !6, line: 1429, baseType: !1071, size: 64, offset: 2880)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!7, !533, !1074, !408, !408, !1119}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1006, line: 203, size: 1024, elements: !1076)
!1076 = !{!1077, !1078, !1088, !1092, !1096, !1097, !1101, !1102, !1103, !1104, !1106, !1107, !1108, !1109}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1075, file: !1006, line: 204, baseType: !533, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1075, file: !1006, line: 205, baseType: !1079, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !974, line: 44, size: 128, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1081, file: !974, line: 45, baseType: !611, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1081, file: !974, line: 46, baseType: !593, size: 16, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1081, file: !974, line: 47, baseType: !593, size: 16, offset: 48)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1081, file: !974, line: 48, baseType: !611, size: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1081, file: !974, line: 49, baseType: !611, size: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1075, file: !1006, line: 206, baseType: !1089, size: 64, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!7, !533, !1074}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1075, file: !1006, line: 208, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!7, !1074}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !1006, line: 209, baseType: !709, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1075, file: !1006, line: 211, baseType: !1098, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1100, line: 76, flags: DIFlagFwdDecl)
!1100 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1075, file: !1006, line: 212, baseType: !1004, size: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1075, file: !1006, line: 213, baseType: !699, size: 16, offset: 448)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1075, file: !1006, line: 214, baseType: !699, size: 16, offset: 464)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1075, file: !1006, line: 215, baseType: !1105, size: 32, offset: 480)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !450, line: 21, baseType: !611)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1075, file: !1006, line: 216, baseType: !13, size: 32, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1075, file: !1006, line: 216, baseType: !13, size: 32, offset: 544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1075, file: !1006, line: 217, baseType: !889, size: 8, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_member, scope: !1075, file: !1006, line: 218, baseType: !1110, size: 384, offset: 640)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1075, file: !1006, line: 218, size: 384, elements: !1111)
!1111 = !{!1112, !1114}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1110, file: !1006, line: 219, baseType: !1113, size: 384)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 384, elements: !576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1110, file: !1006, line: 224, baseType: !1115, size: 384)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 384, elements: !1117)
!1116 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1117 = !{!1118}
!1118 = !DISubrange(count: 6)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !516, file: !6, line: 1434, baseType: !1121, size: 64, offset: 2944)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!7, !533, !971, !408, !1064, !699, !1105, !1105, !1004}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !516, file: !6, line: 1440, baseType: !1125, size: 64, offset: 3008)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!7, !408, !1128, !699, !1004}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !516, file: !6, line: 1444, baseType: !1130, size: 64, offset: 3072)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!7, !533, !1105, !1105, !408, !1105, !7}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !516, file: !6, line: 1449, baseType: !1134, size: 64, offset: 3136)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!7, !408, !1128, !699}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !516, file: !6, line: 1452, baseType: !1138, size: 64, offset: 3200)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!7, !408, !889}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !516, file: !6, line: 1454, baseType: !1142, size: 64, offset: 3264)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!7, !408, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !6, line: 820, size: 264, elements: !1147)
!1147 = !{!1148, !1150}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1146, file: !6, line: 821, baseType: !1149, size: 256)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 256, elements: !937)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1146, file: !6, line: 822, baseType: !600, size: 8, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !516, file: !6, line: 1456, baseType: !1142, size: 64, offset: 3328)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !516, file: !6, line: 1458, baseType: !1153, size: 64, offset: 3392)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!7, !408, !1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !395, line: 55, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1159, line: 72, baseType: !1160)
!1159 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1159, line: 16, baseType: !430)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !516, file: !6, line: 1460, baseType: !1162, size: 64, offset: 3456)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{null, !408, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !6, line: 67, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !516, file: !6, line: 1462, baseType: !1162, size: 64, offset: 3520)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !516, file: !6, line: 1464, baseType: !1169, size: 64, offset: 3584)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!709, !408, !408}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !516, file: !6, line: 1466, baseType: !1173, size: 64, offset: 3648)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null, !408, !709}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !516, file: !6, line: 1469, baseType: !1177, size: 64, offset: 3712)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!7, !408, !7, !1105}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !516, file: !6, line: 1472, baseType: !1181, size: 64, offset: 3776)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!7, !891}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !516, file: !6, line: 1473, baseType: !1138, size: 64, offset: 3840)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !516, file: !6, line: 1475, baseType: !1186, size: 64, offset: 3904)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!7, !408, !533}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !516, file: !6, line: 1477, baseType: !701, size: 64, offset: 3968)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !516, file: !6, line: 1479, baseType: !1191, size: 64, offset: 4032)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!7, !408, !1194}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !6, line: 894, size: 256, elements: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1195, file: !6, line: 895, baseType: !33, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, scope: !1195, file: !6, line: 896, baseType: !1199, size: 192, offset: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1195, file: !6, line: 896, size: 192, elements: !1200)
!1200 = !{!1201, !1210, !5558}
!1201 = !DIDerivedType(tag: DW_TAG_member, scope: !1199, file: !6, line: 898, baseType: !1202, size: 192)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1199, file: !6, line: 898, size: 192, elements: !1203)
!1203 = !{!1204, !1205, !1209}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1202, file: !6, line: 899, baseType: !1105, size: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1202, file: !6, line: 900, baseType: !1206, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1208, line: 11, flags: DIFlagFwdDecl)
!1208 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1202, file: !6, line: 901, baseType: !1004, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, scope: !1199, file: !6, line: 904, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1199, file: !6, line: 904, size: 64, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1211, file: !6, line: 905, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !95, line: 222, size: 2560, elements: !1216)
!1216 = !{!1217, !5537, !5538, !5556, !5557}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1215, file: !95, line: 223, baseType: !1218, size: 2048)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !95, line: 141, size: 2048, elements: !1219)
!1219 = !{!1220, !5511, !5512, !5513, !5514, !5515, !5516, !5517, !5518, !5519, !5520, !5521, !5522, !5523, !5528, !5529, !5530, !5531, !5532, !5533, !5534, !5535, !5536}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1218, file: !95, line: 145, baseType: !1221, size: 64, align: 512)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !95, line: 54, size: 2368, elements: !1224)
!1224 = !{!1225, !1424, !1429, !5183, !5187, !5191, !5192, !5196, !5202, !5203, !5204, !5205, !5206, !5210, !5214, !5218, !5219, !5220, !5224, !5225, !5237, !5241, !5245, !5257, !5446, !5450, !5454, !5459, !5463, !5467, !5471, !5477, !5481, !5488, !5492, !5494, !5495}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1223, file: !95, line: 56, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!7, !1229}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !126, line: 483, size: 960, align: 64, elements: !1231)
!1231 = !{!1232, !1248, !1259, !1270, !1294, !1300, !1308, !1325, !1338, !1344, !1353, !1358, !1366, !1378, !1398, !1405, !1409, !1413, !1418}
!1232 = !DIDerivedType(tag: DW_TAG_member, scope: !1230, file: !126, line: 484, baseType: !1233, size: 512)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1230, file: !126, line: 484, size: 512, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1233, file: !126, line: 485, baseType: !611, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1233, file: !126, line: 486, baseType: !611, size: 32, offset: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1233, file: !126, line: 487, baseType: !611, size: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1233, file: !126, line: 488, baseType: !611, size: 32, offset: 96)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1233, file: !126, line: 489, baseType: !611, size: 32, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1233, file: !126, line: 492, baseType: !611, size: 32, offset: 160)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1233, file: !126, line: 493, baseType: !611, size: 32, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1233, file: !126, line: 496, baseType: !385, size: 128, offset: 224)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1233, file: !126, line: 497, baseType: !611, size: 32, offset: 352)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1233, file: !126, line: 498, baseType: !611, size: 32, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1233, file: !126, line: 499, baseType: !611, size: 32, offset: 416)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1233, file: !126, line: 500, baseType: !611, size: 32, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1233, file: !126, line: 501, baseType: !611, size: 32, offset: 480)
!1248 = !DIDerivedType(tag: DW_TAG_member, scope: !1230, file: !126, line: 507, baseType: !1249, size: 256)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1230, file: !126, line: 507, size: 256, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1258}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1249, file: !126, line: 508, baseType: !611, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1249, file: !126, line: 509, baseType: !451, size: 64, align: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, scope: !1249, file: !126, line: 510, baseType: !1254, size: 64, offset: 128)
!1254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1249, file: !126, line: 510, size: 64, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1254, file: !126, line: 511, baseType: !451, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1254, file: !126, line: 512, baseType: !451, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1249, file: !126, line: 514, baseType: !451, size: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1230, file: !126, line: 532, baseType: !1260, size: 448)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1230, file: !126, line: 517, size: 448, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1260, file: !126, line: 518, baseType: !451, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1260, file: !126, line: 521, baseType: !451, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1260, file: !126, line: 522, baseType: !451, size: 64, align: 64, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1260, file: !126, line: 523, baseType: !451, size: 64, align: 64, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1260, file: !126, line: 524, baseType: !611, size: 32, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1260, file: !126, line: 529, baseType: !611, size: 32, offset: 288)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1260, file: !126, line: 530, baseType: !451, size: 64, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1260, file: !126, line: 531, baseType: !451, size: 64, offset: 384)
!1270 = !DIDerivedType(tag: DW_TAG_member, scope: !1230, file: !126, line: 534, baseType: !1271, size: 960)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1230, file: !126, line: 534, size: 960, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1271, file: !126, line: 535, baseType: !611, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1271, file: !126, line: 536, baseType: !611, size: 32, offset: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1271, file: !126, line: 537, baseType: !451, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1271, file: !126, line: 538, baseType: !451, size: 64, align: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1271, file: !126, line: 539, baseType: !611, size: 32, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1271, file: !126, line: 540, baseType: !611, size: 32, offset: 224)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1271, file: !126, line: 541, baseType: !451, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1271, file: !126, line: 542, baseType: !611, size: 32, offset: 320)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1271, file: !126, line: 543, baseType: !611, size: 32, offset: 352)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1271, file: !126, line: 544, baseType: !385, size: 128, offset: 384)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1271, file: !126, line: 545, baseType: !611, size: 32, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1271, file: !126, line: 550, baseType: !611, size: 32, offset: 544)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1271, file: !126, line: 551, baseType: !611, size: 32, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1271, file: !126, line: 552, baseType: !611, size: 32, offset: 608)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1271, file: !126, line: 553, baseType: !451, size: 64, align: 64, offset: 640)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1271, file: !126, line: 554, baseType: !611, size: 32, offset: 704)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !1271, file: !126, line: 555, baseType: !611, size: 32, offset: 736)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !1271, file: !126, line: 556, baseType: !451, size: 64, align: 64, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_cnt", scope: !1271, file: !126, line: 557, baseType: !611, size: 32, offset: 832)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "attach_btf_id", scope: !1271, file: !126, line: 558, baseType: !611, size: 32, offset: 864)
