; ModuleID = '../bcout/drivers/net/ethernet/3com/3c59x.llvm.bc'
source_filename = "drivers/net/ethernet/3com/3c59x.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_vortex_init6:\09\09\09"
module asm ".long\09vortex_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.kparam_array = type { i32, i32, i32*, %struct.kernel_param_ops*, i8* }

!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !269, line: 602, baseType: !6, size: 32, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288}
!283 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !269, line: 615, baseType: !6, size: 32, elements: !290)
!290 = !{!291, !292, !293, !294}
!291 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!293 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!294 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !269, line: 626, baseType: !6, size: 32, elements: !296)
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!300 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!301 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !269, line: 638, baseType: !6, size: 32, elements: !303)
!303 = !{!304, !305}
!304 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !269, line: 647, baseType: !6, size: 32, elements: !307)
!307 = !{!308, !309}
!308 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!309 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !311, line: 54, baseType: !6, size: 32, elements: !312)
!311 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!312 = !{!313, !314, !315, !316}
!313 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!314 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!316 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !318, line: 26, baseType: !6, size: 32, elements: !319)
!318 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!319 = !{!320, !321, !322}
!320 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!321 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!322 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!323 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !37, line: 423, baseType: !6, size: 32, elements: !324)
!324 = !{!325, !326, !327, !328}
!325 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !330, file: !37, line: 2085, baseType: !6, size: 32, elements: !7075)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !37, line: 1858, size: 15808, elements: !331)
!331 = !{!332, !337, !360, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !394, !402, !403, !404, !405, !406, !407, !408, !409, !410, !436, !446, !447, !448, !453, !454, !458, !461, !5554, !6070, !6074, !6114, !6115, !6116, !6117, !6118, !6119, !6120, !6121, !6122, !6123, !6124, !6125, !6126, !6127, !6128, !6129, !6130, !6131, !6132, !6133, !6134, !6135, !6136, !6137, !6138, !6139, !6140, !6145, !6146, !6147, !6422, !6423, !6424, !6425, !6428, !6431, !6434, !6437, !6440, !6441, !6454, !6455, !6456, !6457, !6458, !6459, !6466, !6467, !6501, !6502, !6503, !6504, !6505, !6506, !6507, !6508, !6509, !6512, !6513, !6514, !6515, !6516, !6517, !6518, !6519, !6520, !6525, !6526, !6527, !6532, !6569, !7030, !7032, !7033, !7037, !7038, !7039, !7040, !7046, !7048, !7051, !7054, !7056, !7057, !7058, !7059, !7060, !7064, !7067}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !37, line: 1859, baseType: !333, size: 128)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 128, elements: !335)
!334 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!335 = !{!336}
!336 = !DISubrange(count: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !330, file: !37, line: 1860, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !37, line: 938, size: 384, elements: !340)
!340 = !{!341, !349, !355, !357}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !339, file: !37, line: 939, baseType: !342, size: 128)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !343, line: 186, size: 128, elements: !344)
!343 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!344 = !{!345, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !343, line: 187, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !342, file: !343, line: 187, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !339, file: !37, line: 940, baseType: !350, size: 128, offset: 128)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !343, line: 178, size: 128, elements: !351)
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !343, line: 179, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !343, line: 179, baseType: !353, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !339, file: !37, line: 941, baseType: !356, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !37, line: 942, baseType: !358, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !330, file: !37, line: 1861, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !37, line: 930, size: 128, elements: !363)
!363 = !{!364, !373}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !362, file: !37, line: 931, baseType: !365, size: 128, align: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !343, line: 216, size: 128, align: 64, elements: !366)
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !343, line: 217, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !365, file: !343, line: 218, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !368}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !362, file: !37, line: 932, baseType: !374, offset: 128)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: -1)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !330, file: !37, line: 1866, baseType: !378, size: 64, offset: 256)
!378 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !330, file: !37, line: 1867, baseType: !378, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !330, file: !37, line: 1868, baseType: !378, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !330, file: !37, line: 1869, baseType: !38, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !330, file: !37, line: 1877, baseType: !378, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !330, file: !37, line: 1879, baseType: !350, size: 128, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !330, file: !37, line: 1880, baseType: !350, size: 128, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !330, file: !37, line: 1881, baseType: !350, size: 128, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !330, file: !37, line: 1882, baseType: !350, size: 128, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !330, file: !37, line: 1883, baseType: !350, size: 128, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !330, file: !37, line: 1884, baseType: !350, size: 128, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !330, file: !37, line: 1889, baseType: !390, size: 256, offset: 1344)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !37, line: 1886, size: 256, elements: !391)
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !390, file: !37, line: 1887, baseType: !350, size: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !390, file: !37, line: 1888, baseType: !350, size: 128, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !330, file: !37, line: 1891, baseType: !395, size: 64, offset: 1600)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !396, line: 12, baseType: !397)
!396 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !398, line: 23, baseType: !399)
!398 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !400, line: 31, baseType: !401)
!400 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!401 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !330, file: !37, line: 1892, baseType: !395, size: 64, offset: 1664)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !330, file: !37, line: 1893, baseType: !395, size: 64, offset: 1728)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !330, file: !37, line: 1894, baseType: !395, size: 64, offset: 1792)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !330, file: !37, line: 1895, baseType: !395, size: 64, offset: 1856)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !330, file: !37, line: 1896, baseType: !395, size: 64, offset: 1920)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !330, file: !37, line: 1897, baseType: !395, size: 64, offset: 1984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !330, file: !37, line: 1899, baseType: !38, size: 32, offset: 2048)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !330, file: !37, line: 1900, baseType: !38, size: 32, offset: 2080)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !330, file: !37, line: 1902, baseType: !411, size: 1472, offset: 2112)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !37, line: 169, size: 1472, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !411, file: !37, line: 170, baseType: !378, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !411, file: !37, line: 171, baseType: !378, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !411, file: !37, line: 172, baseType: !378, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !411, file: !37, line: 173, baseType: !378, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !411, file: !37, line: 174, baseType: !378, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !411, file: !37, line: 175, baseType: !378, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !411, file: !37, line: 176, baseType: !378, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !411, file: !37, line: 177, baseType: !378, size: 64, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !411, file: !37, line: 178, baseType: !378, size: 64, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !411, file: !37, line: 179, baseType: !378, size: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !411, file: !37, line: 180, baseType: !378, size: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !411, file: !37, line: 181, baseType: !378, size: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !411, file: !37, line: 182, baseType: !378, size: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !411, file: !37, line: 183, baseType: !378, size: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !411, file: !37, line: 184, baseType: !378, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !411, file: !37, line: 185, baseType: !378, size: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !411, file: !37, line: 186, baseType: !378, size: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !411, file: !37, line: 187, baseType: !378, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !411, file: !37, line: 188, baseType: !378, size: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !411, file: !37, line: 189, baseType: !378, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !411, file: !37, line: 190, baseType: !378, size: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !411, file: !37, line: 191, baseType: !378, size: 64, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !411, file: !37, line: 192, baseType: !378, size: 64, offset: 1408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !330, file: !37, line: 1904, baseType: !437, size: 64, offset: 3584)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !438, line: 13, baseType: !439)
!438 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !343, line: 175, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 173, size: 64, elements: !441)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !440, file: !343, line: 174, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !398, line: 22, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !400, line: 30, baseType: !445)
!445 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !330, file: !37, line: 1905, baseType: !437, size: 64, offset: 3648)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !330, file: !37, line: 1906, baseType: !437, size: 64, offset: 3712)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !330, file: !37, line: 1909, baseType: !449, size: 32, offset: 3776)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !343, line: 168, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 166, size: 32, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !450, file: !343, line: 167, baseType: !38, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !330, file: !37, line: 1910, baseType: !449, size: 32, offset: 3808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !330, file: !37, line: 1913, baseType: !455, size: 64, offset: 3840)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !37, line: 1913, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !330, file: !37, line: 1914, baseType: !459, size: 64, offset: 3904)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !37, line: 1914, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !330, file: !37, line: 1916, baseType: !462, size: 64, offset: 3968)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !37, line: 1283, size: 4416, elements: !465)
!465 = !{!466, !470, !474, !475, !476, !638, !642, !647, !651, !652, !657, !658, !781, !786, !790, !796, !800, !832, !840, !844, !849, !853, !854, !860, !864, !868, !872, !873, !895, !899, !914, !925, !929, !938, !942, !943, !947, !968, !972, !976, !980, !984, !991, !995, !1013, !1017, !1067, !1071, !1076, !1080, !1084, !1088, !1098, !1099, !1108, !1114, !1115, !1119, !1123, !1127, !1131, !1132, !1136, !1137, !5514, !5534, !5538, !5544, !5550}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !464, file: !37, line: 1284, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!38, !356}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !464, file: !37, line: 1285, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !356}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !464, file: !37, line: 1286, baseType: !467, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !464, file: !37, line: 1287, baseType: !467, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !464, file: !37, line: 1288, baseType: !477, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!480, !481, !356}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !37, line: 120, baseType: !36)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !483, line: 713, size: 1600, elements: !484)
!483 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!484 = !{!485, !507, !514, !521, !525, !537, !538, !539, !542, !543, !544, !550, !551, !552, !553, !554, !555, !556, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !596, !597, !598, !599, !601, !602, !607, !612, !617, !618, !619, !620, !621, !622, !623, !624, !625, !627, !628, !630, !631, !632}
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 714, baseType: !486, size: 192)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 714, size: 192, elements: !487)
!487 = !{!488, !498, !506}
!488 = !DIDerivedType(tag: DW_TAG_member, scope: !486, file: !483, line: 715, baseType: !489, size: 192)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !486, file: !483, line: 715, size: 192, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !483, line: 717, baseType: !481, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !489, file: !483, line: 718, baseType: !481, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !489, file: !483, line: 720, baseType: !494, size: 64, offset: 128)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !489, file: !483, line: 720, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !494, file: !483, line: 721, baseType: !356, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !494, file: !483, line: 726, baseType: !378, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !486, file: !483, line: 729, baseType: !499, size: 192, align: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !500, line: 24, size: 192, align: 64, elements: !501)
!500 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!501 = !{!502, !503, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !499, file: !500, line: 25, baseType: !378, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !499, file: !500, line: 26, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !499, file: !500, line: 27, baseType: !504, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !486, file: !483, line: 730, baseType: !350, size: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 733, baseType: !508, size: 64, offset: 192)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 733, size: 64, elements: !509)
!509 = !{!510, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !508, file: !483, line: 734, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !318, line: 19, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !508, file: !483, line: 735, baseType: !38, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 738, baseType: !515, size: 64, offset: 256)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 738, size: 64, elements: !516)
!516 = !{!517, !520}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !515, file: !483, line: 739, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !519, line: 29, baseType: !443)
!519 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!520 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !515, file: !483, line: 740, baseType: !397, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !482, file: !483, line: 748, baseType: !522, size: 384, align: 64, offset: 320)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 384, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 48)
!525 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 750, baseType: !526, size: 128, offset: 704)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 750, size: 128, elements: !527)
!527 = !{!528, !536}
!528 = !DIDerivedType(tag: DW_TAG_member, scope: !526, file: !483, line: 751, baseType: !529, size: 128)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !483, line: 751, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !529, file: !483, line: 752, baseType: !378, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !529, file: !483, line: 753, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !481}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !526, file: !483, line: 755, baseType: !350, size: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !482, file: !483, line: 761, baseType: !6, size: 32, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !482, file: !483, line: 762, baseType: !6, size: 32, offset: 864)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !482, file: !483, line: 763, baseType: !540, size: 16, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !400, line: 24, baseType: !541)
!541 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !482, file: !483, line: 764, baseType: !540, size: 16, offset: 912)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !482, file: !483, line: 769, baseType: !540, size: 16, offset: 928)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !482, file: !483, line: 780, baseType: !545, offset: 944)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, elements: !548)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !400, line: 21, baseType: !547)
!547 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!548 = !{!549}
!549 = !DISubrange(count: 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !482, file: !483, line: 782, baseType: !546, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !482, file: !483, line: 783, baseType: !546, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !482, file: !483, line: 784, baseType: !546, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !482, file: !483, line: 785, baseType: !546, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !482, file: !483, line: 786, baseType: !546, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !482, file: !483, line: 787, baseType: !546, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !482, file: !483, line: 795, baseType: !557, offset: 960)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, elements: !548)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !400, line: 27, baseType: !6)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !482, file: !483, line: 807, baseType: !545, offset: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !482, file: !483, line: 809, baseType: !546, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !482, file: !483, line: 810, baseType: !546, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !482, file: !483, line: 811, baseType: !546, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !482, file: !483, line: 812, baseType: !546, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !482, file: !483, line: 813, baseType: !546, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !482, file: !483, line: 815, baseType: !546, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !482, file: !483, line: 816, baseType: !546, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !482, file: !483, line: 817, baseType: !546, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !482, file: !483, line: 818, baseType: !546, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !482, file: !483, line: 819, baseType: !546, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !482, file: !483, line: 821, baseType: !546, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !482, file: !483, line: 822, baseType: !546, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !482, file: !483, line: 823, baseType: !546, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !482, file: !483, line: 832, baseType: !545, offset: 976)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !482, file: !483, line: 834, baseType: !546, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !482, file: !483, line: 835, baseType: !546, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !482, file: !483, line: 836, baseType: !546, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !482, file: !483, line: 837, baseType: !546, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !482, file: !483, line: 838, baseType: !546, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !482, file: !483, line: 840, baseType: !546, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !482, file: !483, line: 843, baseType: !546, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !482, file: !483, line: 844, baseType: !546, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !482, file: !483, line: 845, baseType: !546, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !482, file: !483, line: 847, baseType: !546, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !482, file: !483, line: 848, baseType: !546, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!585 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 866, baseType: !586, size: 32, offset: 992)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 866, size: 32, elements: !587)
!587 = !{!588, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !586, file: !483, line: 867, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !590, line: 37, baseType: !558)
!590 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!591 = !DIDerivedType(tag: DW_TAG_member, scope: !586, file: !483, line: 868, baseType: !592, size: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !483, line: 868, size: 32, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !592, file: !483, line: 869, baseType: !540, size: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !592, file: !483, line: 870, baseType: !540, size: 16, offset: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !482, file: !483, line: 873, baseType: !558, size: 32, offset: 1024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !482, file: !483, line: 874, baseType: !38, size: 32, offset: 1056)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !482, file: !483, line: 875, baseType: !558, size: 32, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !482, file: !483, line: 876, baseType: !600, size: 16, offset: 1120)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !590, line: 30, baseType: !540)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !482, file: !483, line: 877, baseType: !540, size: 16, offset: 1136)
!602 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 879, baseType: !603, size: 32, offset: 1152)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 879, size: 32, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !603, file: !483, line: 880, baseType: !6, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !603, file: !483, line: 881, baseType: !6, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 888, baseType: !608, size: 32, offset: 1184)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 888, size: 32, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !608, file: !483, line: 889, baseType: !558, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !608, file: !483, line: 890, baseType: !558, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !483, line: 893, baseType: !613, size: 16, offset: 1216)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !483, line: 893, size: 16, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !613, file: !483, line: 894, baseType: !600, size: 16)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !613, file: !483, line: 895, baseType: !546, size: 8)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !482, file: !483, line: 898, baseType: !540, size: 16, offset: 1232)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !482, file: !483, line: 899, baseType: !540, size: 16, offset: 1248)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !482, file: !483, line: 900, baseType: !540, size: 16, offset: 1264)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !482, file: !483, line: 902, baseType: !600, size: 16, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !482, file: !483, line: 903, baseType: !540, size: 16, offset: 1296)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !482, file: !483, line: 904, baseType: !540, size: 16, offset: 1312)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !482, file: !483, line: 905, baseType: !540, size: 16, offset: 1328)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !482, file: !483, line: 908, baseType: !557, offset: 1344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !482, file: !483, line: 912, baseType: !626, size: 32, offset: 1344)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !483, line: 606, baseType: !6)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !482, file: !483, line: 913, baseType: !626, size: 32, offset: 1376)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !482, file: !483, line: 914, baseType: !629, size: 64, offset: 1408)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !482, file: !483, line: 915, baseType: !629, size: 64, offset: 1472)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !482, file: !483, line: 916, baseType: !6, size: 32, offset: 1536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !482, file: !483, line: 917, baseType: !633, size: 32, offset: 1568)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !634, line: 113, baseType: !635)
!634 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !634, line: 111, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !635, file: !634, line: 112, baseType: !449, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !464, file: !37, line: 1290, baseType: !639, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!395, !481, !356, !395}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !464, file: !37, line: 1293, baseType: !643, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !356, !481, !356}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !398, line: 19, baseType: !540)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !464, file: !37, line: 1296, baseType: !648, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !356, !38}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !464, file: !37, line: 1298, baseType: !471, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !464, file: !37, line: 1299, baseType: !653, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!38, !356, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !464, file: !37, line: 1301, baseType: !467, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !464, file: !37, line: 1302, baseType: !659, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!38, !356, !662, !38}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !664, line: 234, size: 320, elements: !665)
!664 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!665 = !{!666, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !663, file: !664, line: 239, baseType: !667, size: 128)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !664, line: 236, size: 128, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !667, file: !664, line: 238, baseType: !333, size: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !663, file: !664, line: 255, baseType: !671, size: 192, offset: 128)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !664, line: 241, size: 192, elements: !672)
!672 = !{!673, !685, !686, !687, !688, !689, !691, !692, !693, !702, !703, !704, !705}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !671, file: !664, line: 242, baseType: !674, size: 128)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !675, line: 32, size: 128, elements: !676)
!675 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!676 = !{!677, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !674, file: !675, line: 33, baseType: !678, size: 16)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !675, line: 26, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !680, line: 10, baseType: !541)
!680 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !674, file: !675, line: 34, baseType: !682, size: 112, offset: 16)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 112, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 14)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !671, file: !664, line: 243, baseType: !674, size: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !671, file: !664, line: 244, baseType: !674, size: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !671, file: !664, line: 245, baseType: !674, size: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !671, file: !664, line: 246, baseType: !674, size: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !671, file: !664, line: 247, baseType: !690, size: 16)
!690 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !671, file: !664, line: 248, baseType: !38, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !671, file: !664, line: 249, baseType: !38, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !671, file: !664, line: 250, baseType: !694, size: 192)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !664, line: 196, size: 192, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !694, file: !664, line: 197, baseType: !378, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !694, file: !664, line: 198, baseType: !378, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !694, file: !664, line: 199, baseType: !541, size: 16, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !694, file: !664, line: 200, baseType: !547, size: 8, offset: 144)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !694, file: !664, line: 201, baseType: !547, size: 8, offset: 152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !694, file: !664, line: 202, baseType: !547, size: 8, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !671, file: !664, line: 251, baseType: !333, size: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !671, file: !664, line: 252, baseType: !333, size: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !671, file: !664, line: 253, baseType: !656, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !671, file: !664, line: 254, baseType: !706, size: 128)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !664, line: 207, size: 128, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !664, line: 208, baseType: !6, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !706, file: !664, line: 209, baseType: !6, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !706, file: !664, line: 222, baseType: !711, size: 64, offset: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !706, file: !664, line: 210, size: 64, elements: !712)
!712 = !{!713, !721, !728, !740, !746, !753, !764, !772}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !711, file: !664, line: 212, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !716, line: 56, baseType: !717)
!716 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 53, size: 32, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !717, file: !716, line: 54, baseType: !541, size: 16)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !717, file: !716, line: 55, baseType: !541, size: 16, offset: 16)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !711, file: !664, line: 213, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !716, line: 80, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 77, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !724, file: !716, line: 78, baseType: !6, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !724, file: !716, line: 79, baseType: !6, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !711, file: !664, line: 214, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !716, line: 66, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 58, size: 192, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !731, file: !716, line: 59, baseType: !6, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !731, file: !716, line: 60, baseType: !6, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !731, file: !716, line: 61, baseType: !6, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !731, file: !716, line: 62, baseType: !6, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !731, file: !716, line: 63, baseType: !6, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !731, file: !716, line: 64, baseType: !541, size: 16, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !731, file: !716, line: 65, baseType: !541, size: 16, offset: 176)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !711, file: !664, line: 215, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !716, line: 70, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 68, size: 32, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !743, file: !716, line: 69, baseType: !6, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !711, file: !664, line: 216, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !716, line: 75, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 72, size: 160, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !749, file: !716, line: 73, baseType: !6, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !749, file: !716, line: 74, baseType: !333, size: 128, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !711, file: !664, line: 217, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !716, line: 89, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 82, size: 192, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !756, file: !716, line: 83, baseType: !541, size: 16)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !756, file: !716, line: 84, baseType: !6, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !756, file: !716, line: 85, baseType: !6, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !756, file: !716, line: 86, baseType: !6, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !756, file: !716, line: 87, baseType: !6, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !756, file: !716, line: 88, baseType: !6, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !711, file: !664, line: 220, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !716, line: 44, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 40, size: 96, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !767, file: !716, line: 41, baseType: !6, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !767, file: !716, line: 42, baseType: !6, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !767, file: !716, line: 43, baseType: !541, size: 16, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !711, file: !664, line: 221, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !716, line: 51, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 46, size: 128, elements: !776)
!776 = !{!777, !778, !779, !780}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !775, file: !716, line: 47, baseType: !6, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !775, file: !716, line: 48, baseType: !6, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !775, file: !716, line: 49, baseType: !541, size: 16, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !775, file: !716, line: 50, baseType: !6, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !464, file: !37, line: 1304, baseType: !782, size: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!38, !356, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !464, file: !37, line: 1306, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!38, !356, !38}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !464, file: !37, line: 1308, baseType: !791, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!38, !356, !794}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !37, line: 206, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !464, file: !37, line: 1310, baseType: !797, size: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !356, !6}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !464, file: !37, line: 1313, baseType: !801, size: 64, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !356, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !806, line: 214, size: 1536, elements: !807)
!806 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !805, file: !806, line: 215, baseType: !399, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !805, file: !806, line: 216, baseType: !399, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !805, file: !806, line: 217, baseType: !399, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !805, file: !806, line: 218, baseType: !399, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !805, file: !806, line: 219, baseType: !399, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !805, file: !806, line: 220, baseType: !399, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !805, file: !806, line: 221, baseType: !399, size: 64, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !805, file: !806, line: 222, baseType: !399, size: 64, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !805, file: !806, line: 223, baseType: !399, size: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !805, file: !806, line: 224, baseType: !399, size: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !805, file: !806, line: 227, baseType: !399, size: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !805, file: !806, line: 228, baseType: !399, size: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !805, file: !806, line: 229, baseType: !399, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !805, file: !806, line: 230, baseType: !399, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !805, file: !806, line: 231, baseType: !399, size: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !805, file: !806, line: 232, baseType: !399, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !805, file: !806, line: 235, baseType: !399, size: 64, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !805, file: !806, line: 236, baseType: !399, size: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !805, file: !806, line: 237, baseType: !399, size: 64, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !805, file: !806, line: 238, baseType: !399, size: 64, offset: 1216)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !805, file: !806, line: 239, baseType: !399, size: 64, offset: 1280)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !805, file: !806, line: 242, baseType: !399, size: 64, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !805, file: !806, line: 243, baseType: !399, size: 64, offset: 1408)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !805, file: !806, line: 244, baseType: !399, size: 64, offset: 1472)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !464, file: !37, line: 1315, baseType: !833, size: 64, offset: 1088)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!836, !838, !38}
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !343, line: 30, baseType: !837)
!837 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !464, file: !37, line: 1316, baseType: !841, size: 64, offset: 1152)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!38, !38, !838, !656}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !464, file: !37, line: 1319, baseType: !845, size: 64, offset: 1216)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !356}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !464, file: !37, line: 1321, baseType: !850, size: 64, offset: 1280)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!38, !356, !600, !646}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !464, file: !37, line: 1323, baseType: !850, size: 64, offset: 1344)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !464, file: !37, line: 1331, baseType: !855, size: 64, offset: 1408)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!38, !356, !38, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !398, line: 17, baseType: !546)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !464, file: !37, line: 1333, baseType: !861, size: 64, offset: 1472)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!38, !356, !38, !646, !859, !600}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !464, file: !37, line: 1336, baseType: !865, size: 64, offset: 1536)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!38, !356, !38, !38, !38}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !464, file: !37, line: 1339, baseType: !869, size: 64, offset: 1600)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!38, !356, !38, !836}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !464, file: !37, line: 1341, baseType: !869, size: 64, offset: 1664)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !464, file: !37, line: 1343, baseType: !874, size: 64, offset: 1728)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!38, !356, !38, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !879, line: 20, size: 576, elements: !880)
!879 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!880 = !{!881, !882, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !878, file: !879, line: 21, baseType: !558, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !878, file: !879, line: 22, baseType: !883, size: 256, offset: 32)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 256, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !878, file: !879, line: 23, baseType: !558, size: 32, offset: 288)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !878, file: !879, line: 24, baseType: !558, size: 32, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !878, file: !879, line: 25, baseType: !558, size: 32, offset: 352)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !878, file: !879, line: 26, baseType: !558, size: 32, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !878, file: !879, line: 27, baseType: !558, size: 32, offset: 416)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !878, file: !879, line: 28, baseType: !558, size: 32, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !878, file: !879, line: 29, baseType: !558, size: 32, offset: 480)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !878, file: !879, line: 30, baseType: !558, size: 32, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !878, file: !879, line: 31, baseType: !600, size: 16, offset: 544)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !464, file: !37, line: 1346, baseType: !896, size: 64, offset: 1792)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!38, !356, !38, !38}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !464, file: !37, line: 1348, baseType: !900, size: 64, offset: 1856)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!38, !356, !38, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !879, line: 9, size: 512, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !904, file: !879, line: 10, baseType: !399, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !904, file: !879, line: 11, baseType: !399, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !904, file: !879, line: 12, baseType: !399, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !904, file: !879, line: 13, baseType: !399, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !904, file: !879, line: 14, baseType: !399, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !904, file: !879, line: 15, baseType: !399, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !904, file: !879, line: 16, baseType: !399, size: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !904, file: !879, line: 17, baseType: !399, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !464, file: !37, line: 1352, baseType: !915, size: 64, offset: 1920)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!38, !356, !38, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !921, line: 213, size: 32, elements: !922)
!921 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !920, file: !921, line: 214, baseType: !540, size: 16)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !920, file: !921, line: 215, baseType: !540, size: 16, offset: 16)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !464, file: !37, line: 1355, baseType: !926, size: 64, offset: 1984)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!38, !356, !38, !481}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !464, file: !37, line: 1357, baseType: !930, size: 64, offset: 2048)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!38, !356, !38, !933, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !806, line: 956, size: 128, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !934, file: !806, line: 957, baseType: !558, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !934, file: !806, line: 958, baseType: !399, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !464, file: !37, line: 1361, baseType: !939, size: 64, offset: 2112)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!38, !356, !38, !397, !38}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !464, file: !37, line: 1364, baseType: !869, size: 64, offset: 2176)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !464, file: !37, line: 1367, baseType: !944, size: 64, offset: 2240)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!38, !356, !43, !656}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !464, file: !37, line: 1400, baseType: !948, size: 64, offset: 2304)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!38, !356, !356, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !953, line: 75, size: 384, elements: !954)
!953 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!954 = !{!955, !956, !959, !963, !967}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !952, file: !953, line: 76, baseType: !358, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !952, file: !953, line: 77, baseType: !957, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !952, file: !953, line: 78, baseType: !960, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !953, line: 78, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !952, file: !953, line: 79, baseType: !964, size: 160, offset: 192)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 160, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 20)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !952, file: !953, line: 80, baseType: !859, size: 8, offset: 352)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !464, file: !37, line: 1403, baseType: !969, size: 64, offset: 2368)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!38, !356, !356}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !464, file: !37, line: 1405, baseType: !973, size: 64, offset: 2432)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!356, !356, !481, !836}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !464, file: !37, line: 1408, baseType: !977, size: 64, offset: 2496)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!395, !356, !395}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !464, file: !37, line: 1410, baseType: !981, size: 64, offset: 2560)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!38, !356, !395}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !464, file: !37, line: 1412, baseType: !985, size: 64, offset: 2624)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!38, !356, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !990, line: 35, flags: DIFlagFwdDecl)
!990 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !464, file: !37, line: 1414, baseType: !992, size: 64, offset: 2688)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !356, !988}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !464, file: !37, line: 1417, baseType: !996, size: 64, offset: 2752)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!38, !999, !918, !356, !1011, !646, !646, !951}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1001, line: 8, size: 96, elements: !1002)
!1001 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1002 = !{!1003, !1004, !1005, !1006, !1008, !1009, !1010}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1000, file: !1001, line: 9, baseType: !546, size: 8)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1000, file: !1001, line: 10, baseType: !546, size: 8, offset: 8)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1000, file: !1001, line: 11, baseType: !540, size: 16, offset: 16)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1000, file: !1001, line: 12, baseType: !1007, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !400, line: 26, baseType: !38)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1000, file: !1001, line: 13, baseType: !540, size: 16, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1000, file: !1001, line: 14, baseType: !546, size: 8, offset: 80)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1000, file: !1001, line: 15, baseType: !546, size: 8, offset: 88)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !464, file: !37, line: 1424, baseType: !1014, size: 64, offset: 2816)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!38, !999, !918, !356, !1011, !646}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !464, file: !37, line: 1429, baseType: !1018, size: 64, offset: 2880)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!38, !481, !1021, !356, !356, !1066}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !953, line: 203, size: 1024, elements: !1023)
!1023 = !{!1024, !1025, !1035, !1039, !1043, !1044, !1048, !1049, !1050, !1051, !1053, !1054, !1055, !1056}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1022, file: !953, line: 204, baseType: !481, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1022, file: !953, line: 205, baseType: !1026, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !921, line: 44, size: 128, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1028, file: !921, line: 45, baseType: !558, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1028, file: !921, line: 46, baseType: !540, size: 16, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1028, file: !921, line: 47, baseType: !540, size: 16, offset: 48)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1028, file: !921, line: 48, baseType: !558, size: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1028, file: !921, line: 49, baseType: !558, size: 32, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1022, file: !953, line: 206, baseType: !1036, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!38, !481, !1021}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1022, file: !953, line: 208, baseType: !1040, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!38, !1021}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1022, file: !953, line: 209, baseType: !656, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1022, file: !953, line: 211, baseType: !1045, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1047, line: 76, flags: DIFlagFwdDecl)
!1047 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1022, file: !953, line: 212, baseType: !951, size: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1022, file: !953, line: 213, baseType: !646, size: 16, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1022, file: !953, line: 214, baseType: !646, size: 16, offset: 464)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1022, file: !953, line: 215, baseType: !1052, size: 32, offset: 480)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !398, line: 21, baseType: !558)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1022, file: !953, line: 216, baseType: !6, size: 32, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1022, file: !953, line: 216, baseType: !6, size: 32, offset: 544)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1022, file: !953, line: 217, baseType: !836, size: 8, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, scope: !1022, file: !953, line: 218, baseType: !1057, size: 384, offset: 640)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1022, file: !953, line: 218, size: 384, elements: !1058)
!1058 = !{!1059, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1057, file: !953, line: 219, baseType: !1060, size: 384)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 384, elements: !523)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1057, file: !953, line: 224, baseType: !1062, size: 384)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 384, elements: !1064)
!1063 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1064 = !{!1065}
!1065 = !DISubrange(count: 6)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !464, file: !37, line: 1434, baseType: !1068, size: 64, offset: 2944)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!38, !481, !918, !356, !1011, !646, !1052, !1052, !951}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !464, file: !37, line: 1440, baseType: !1072, size: 64, offset: 3008)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!38, !356, !1075, !646, !951}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !464, file: !37, line: 1444, baseType: !1077, size: 64, offset: 3072)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!38, !481, !1052, !1052, !356, !1052, !38}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !464, file: !37, line: 1449, baseType: !1081, size: 64, offset: 3136)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!38, !356, !1075, !646}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !464, file: !37, line: 1452, baseType: !1085, size: 64, offset: 3200)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!38, !356, !836}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !464, file: !37, line: 1454, baseType: !1089, size: 64, offset: 3264)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!38, !356, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !37, line: 820, size: 264, elements: !1094)
!1094 = !{!1095, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1093, file: !37, line: 821, baseType: !1096, size: 256)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 256, elements: !884)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1093, file: !37, line: 822, baseType: !547, size: 8, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !464, file: !37, line: 1456, baseType: !1089, size: 64, offset: 3328)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !464, file: !37, line: 1458, baseType: !1100, size: 64, offset: 3392)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!38, !356, !1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !343, line: 55, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1106, line: 72, baseType: !1107)
!1106 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1106, line: 16, baseType: !378)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !464, file: !37, line: 1460, baseType: !1109, size: 64, offset: 3456)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !356, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !37, line: 67, flags: DIFlagFwdDecl)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !464, file: !37, line: 1462, baseType: !1109, size: 64, offset: 3520)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !464, file: !37, line: 1464, baseType: !1116, size: 64, offset: 3584)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!656, !356, !356}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !464, file: !37, line: 1466, baseType: !1120, size: 64, offset: 3648)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !356, !656}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !464, file: !37, line: 1469, baseType: !1124, size: 64, offset: 3712)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!38, !356, !38, !1052}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !464, file: !37, line: 1472, baseType: !1128, size: 64, offset: 3776)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!38, !838}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !464, file: !37, line: 1473, baseType: !1085, size: 64, offset: 3840)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !464, file: !37, line: 1475, baseType: !1133, size: 64, offset: 3904)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!38, !356, !481}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !464, file: !37, line: 1477, baseType: !648, size: 64, offset: 3968)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !464, file: !37, line: 1479, baseType: !1138, size: 64, offset: 4032)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!38, !356, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !37, line: 894, size: 256, elements: !1143)
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1142, file: !37, line: 895, baseType: !63, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, scope: !1142, file: !37, line: 896, baseType: !1146, size: 192, offset: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1142, file: !37, line: 896, size: 192, elements: !1147)
!1147 = !{!1148, !1157, !5507}
!1148 = !DIDerivedType(tag: DW_TAG_member, scope: !1146, file: !37, line: 898, baseType: !1149, size: 192)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1146, file: !37, line: 898, size: 192, elements: !1150)
!1150 = !{!1151, !1152, !1156}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1149, file: !37, line: 899, baseType: !1052, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1149, file: !37, line: 900, baseType: !1153, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1155, line: 11, flags: DIFlagFwdDecl)
!1155 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1149, file: !37, line: 901, baseType: !951, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, scope: !1146, file: !37, line: 904, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1146, file: !37, line: 904, size: 64, elements: !1159)
!1159 = !{!1160}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1158, file: !37, line: 905, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !125, line: 222, size: 2560, elements: !1163)
!1163 = !{!1164, !5486, !5487, !5505, !5506}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1162, file: !125, line: 223, baseType: !1165, size: 2048)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !125, line: 141, size: 2048, elements: !1166)
!1166 = !{!1167, !5460, !5461, !5462, !5463, !5464, !5465, !5466, !5467, !5468, !5469, !5470, !5471, !5472, !5477, !5478, !5479, !5480, !5481, !5482, !5483, !5484, !5485}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1165, file: !125, line: 145, baseType: !1168, size: 64, align: 512)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !125, line: 54, size: 2368, elements: !1171)
!1171 = !{!1172, !1371, !1376, !5132, !5136, !5140, !5141, !5145, !5151, !5152, !5153, !5154, !5155, !5159, !5163, !5167, !5168, !5169, !5173, !5174, !5186, !5190, !5194, !5206, !5395, !5399, !5403, !5408, !5412, !5416, !5420, !5426, !5430, !5437, !5441, !5443, !5444}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1170, file: !125, line: 56, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!38, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !156, line: 483, size: 960, align: 64, elements: !1178)
!1178 = !{!1179, !1195, !1206, !1217, !1241, !1247, !1255, !1272, !1285, !1291, !1300, !1305, !1313, !1325, !1345, !1352, !1356, !1360, !1365}
!1179 = !DIDerivedType(tag: DW_TAG_member, scope: !1177, file: !156, line: 484, baseType: !1180, size: 512)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1177, file: !156, line: 484, size: 512, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1180, file: !156, line: 485, baseType: !558, size: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1180, file: !156, line: 486, baseType: !558, size: 32, offset: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1180, file: !156, line: 487, baseType: !558, size: 32, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1180, file: !156, line: 488, baseType: !558, size: 32, offset: 96)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1180, file: !156, line: 489, baseType: !558, size: 32, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1180, file: !156, line: 492, baseType: !558, size: 32, offset: 160)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1180, file: !156, line: 493, baseType: !558, size: 32, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1180, file: !156, line: 496, baseType: !333, size: 128, offset: 224)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1180, file: !156, line: 497, baseType: !558, size: 32, offset: 352)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1180, file: !156, line: 498, baseType: !558, size: 32, offset: 384)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1180, file: !156, line: 499, baseType: !558, size: 32, offset: 416)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1180, file: !156, line: 500, baseType: !558, size: 32, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1180, file: !156, line: 501, baseType: !558, size: 32, offset: 480)
!1195 = !DIDerivedType(tag: DW_TAG_member, scope: !1177, file: !156, line: 507, baseType: !1196, size: 256)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1177, file: !156, line: 507, size: 256, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1205}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1196, file: !156, line: 508, baseType: !558, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1196, file: !156, line: 509, baseType: !399, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, scope: !1196, file: !156, line: 510, baseType: !1201, size: 64, offset: 128)
!1201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1196, file: !156, line: 510, size: 64, elements: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1201, file: !156, line: 511, baseType: !399, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1201, file: !156, line: 512, baseType: !399, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1196, file: !156, line: 514, baseType: !399, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1177, file: !156, line: 532, baseType: !1207, size: 448)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1177, file: !156, line: 517, size: 448, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1207, file: !156, line: 518, baseType: !399, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1207, file: !156, line: 521, baseType: !399, size: 64, align: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1207, file: !156, line: 522, baseType: !399, size: 64, align: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1207, file: !156, line: 523, baseType: !399, size: 64, align: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1207, file: !156, line: 524, baseType: !558, size: 32, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1207, file: !156, line: 529, baseType: !558, size: 32, offset: 288)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1207, file: !156, line: 530, baseType: !399, size: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1207, file: !156, line: 531, baseType: !399, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, scope: !1177, file: !156, line: 534, baseType: !1218, size: 960)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1177, file: !156, line: 534, size: 960, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1218, file: !156, line: 535, baseType: !558, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1218, file: !156, line: 536, baseType: !558, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1218, file: !156, line: 537, baseType: !399, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1218, file: !156, line: 538, baseType: !399, size: 64, align: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1218, file: !156, line: 539, baseType: !558, size: 32, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1218, file: !156, line: 540, baseType: !558, size: 32, offset: 224)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1218, file: !156, line: 541, baseType: !399, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1218, file: !156, line: 542, baseType: !558, size: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1218, file: !156, line: 543, baseType: !558, size: 32, offset: 352)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1218, file: !156, line: 544, baseType: !333, size: 128, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1218, file: !156, line: 545, baseType: !558, size: 32, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1218, file: !156, line: 550, baseType: !558, size: 32, offset: 544)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1218, file: !156, line: 551, baseType: !558, size: 32, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1218, file: !156, line: 552, baseType: !558, size: 32, offset: 608)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1218, file: !156, line: 553, baseType: !399, size: 64, align: 64, offset: 640)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1218, file: !156, line: 554, baseType: !558, size: 32, offset: 704)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !1218, file: !156, line: 555, baseType: !558, size: 32, offset: 736)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !1218, file: !156, line: 556, baseType: !399, size: 64, align: 64, offset: 768)
