; ModuleID = '../bcout/drivers/video/vgastate.llvm.bc'
source_filename = "drivers/video/vgastate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author239", scope: !2, file: !3, line: 487, type: !56, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !38, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/video/vgastate.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !16, !17, !33, !35}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !15, line: 148, baseType: !7)
!15 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regstate", file: !3, line: 22, size: 576, elements: !19)
!19 = !{!20, !25, !26, !27, !28, !29, !30, !31, !32}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "vga_font0", scope: !18, file: !3, line: 23, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "vga_font1", scope: !18, file: !3, line: 24, baseType: !21, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "vga_text", scope: !18, file: !3, line: 25, baseType: !21, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "vga_cmap", scope: !18, file: !3, line: 26, baseType: !21, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !18, file: !3, line: 27, baseType: !21, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "crtc", scope: !18, file: !3, line: 28, baseType: !21, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "gfx", scope: !18, file: !3, line: 29, baseType: !21, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !18, file: !3, line: 30, baseType: !21, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !18, file: !3, line: 31, baseType: !22, size: 8, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !{!0, !39, !46, !51}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description240", scope: !2, file: !3, line: 488, type: !41, isLocal: true, isDefinition: true, align: 8)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 352, elements: !44)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !{!45}
!45 = !DISubrange(count: 44)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file241", scope: !2, file: !3, line: 489, type: !48, isLocal: true, isDefinition: true, align: 8)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 296, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 37)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license242", scope: !2, file: !3, line: 489, type: !53, isLocal: true, isDefinition: true, align: 8)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 168, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 21)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 432, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 54)
!59 = !{i32 7, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 2}
!62 = !{i32 1, !"Code Model", i32 2}
!63 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!64 = distinct !DISubprogram(name: "save_vga", scope: !3, file: !3, line: 350, type: !65, scopeLine: 351, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !84)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !68}
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vgastate", file: !70, line: 182, size: 448, elements: !71)
!70 = !DIFile(filename: "./include/video/vga.h", directory: "/home/lizy2001/genbc/linux")
!71 = !{!72, !73, !75, !77, !78, !79, !80, !81, !82, !83}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vgabase", scope: !69, file: !70, line: 183, baseType: !16, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !69, file: !70, line: 184, baseType: !74, size: 64, offset: 64)
!74 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "memsize", scope: !69, file: !70, line: 185, baseType: !76, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !23, line: 27, baseType: !7)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !70, line: 186, baseType: !76, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !69, file: !70, line: 187, baseType: !76, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "num_attr", scope: !69, file: !70, line: 188, baseType: !76, size: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "num_crtc", scope: !69, file: !70, line: 189, baseType: !76, size: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "num_gfx", scope: !69, file: !70, line: 190, baseType: !76, size: 32, offset: 288)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "num_seq", scope: !69, file: !70, line: 191, baseType: !76, size: 32, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vidstate", scope: !69, file: !70, line: 192, baseType: !16, size: 64, offset: 384)
!84 = !{}
!85 = !DILocalVariable(name: "state", arg: 1, scope: !64, file: !3, line: 350, type: !68)
!86 = !DILocation(line: 350, column: 31, scope: !64)
!87 = !DILocalVariable(name: "saved", scope: !64, file: !3, line: 352, type: !17)
!88 = !DILocation(line: 352, column: 19, scope: !64)
!89 = !DILocation(line: 354, column: 10, scope: !64)
!90 = !DILocation(line: 354, column: 8, scope: !64)
!91 = !DILocation(line: 356, column: 6, scope: !92)
!92 = distinct !DILexicalBlock(scope: !64, file: !3, line: 356, column: 6)
!93 = !DILocation(line: 356, column: 12, scope: !92)
!94 = !DILocation(line: 356, column: 6, scope: !64)
!95 = !DILocation(line: 357, column: 3, scope: !92)
!96 = !DILocation(line: 359, column: 28, scope: !64)
!97 = !DILocation(line: 359, column: 20, scope: !64)
!98 = !DILocation(line: 359, column: 2, scope: !64)
!99 = !DILocation(line: 359, column: 9, scope: !64)
!100 = !DILocation(line: 359, column: 18, scope: !64)
!101 = !DILocation(line: 361, column: 6, scope: !102)
!102 = distinct !DILexicalBlock(scope: !64, file: !3, line: 361, column: 6)
!103 = !DILocation(line: 361, column: 13, scope: !102)
!104 = !DILocation(line: 361, column: 19, scope: !102)
!105 = !DILocation(line: 361, column: 6, scope: !64)
!106 = !DILocation(line: 362, column: 21, scope: !107)
!107 = distinct !DILexicalBlock(scope: !102, file: !3, line: 361, column: 36)
!108 = !DILocation(line: 362, column: 3, scope: !107)
!109 = !DILocation(line: 362, column: 10, scope: !107)
!110 = !DILocation(line: 362, column: 19, scope: !107)
!111 = !DILocation(line: 363, column: 8, scope: !112)
!112 = distinct !DILexicalBlock(scope: !107, file: !3, line: 363, column: 7)
!113 = !DILocation(line: 363, column: 15, scope: !112)
!114 = !DILocation(line: 363, column: 7, scope: !107)
!115 = !DILocation(line: 364, column: 16, scope: !116)
!116 = distinct !DILexicalBlock(scope: !112, file: !3, line: 363, column: 25)
!117 = !DILocation(line: 364, column: 4, scope: !116)
!118 = !DILocation(line: 365, column: 4, scope: !116)
!119 = !DILocation(line: 367, column: 17, scope: !107)
!120 = !DILocation(line: 367, column: 3, scope: !107)
!121 = !DILocation(line: 368, column: 2, scope: !107)
!122 = !DILocation(line: 370, column: 6, scope: !123)
!123 = distinct !DILexicalBlock(scope: !64, file: !3, line: 370, column: 6)
!124 = !DILocation(line: 370, column: 13, scope: !123)
!125 = !DILocation(line: 370, column: 19, scope: !123)
!126 = !DILocation(line: 370, column: 6, scope: !64)
!127 = !DILocalVariable(name: "total", scope: !128, file: !3, line: 371, type: !67)
!128 = distinct !DILexicalBlock(scope: !123, file: !3, line: 370, column: 36)
!129 = !DILocation(line: 371, column: 7, scope: !128)
!130 = !DILocation(line: 373, column: 7, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !3, line: 373, column: 7)
!132 = !DILocation(line: 373, column: 14, scope: !131)
!133 = !DILocation(line: 373, column: 23, scope: !131)
!134 = !DILocation(line: 373, column: 7, scope: !128)
!135 = !DILocation(line: 374, column: 4, scope: !131)
!136 = !DILocation(line: 374, column: 11, scope: !131)
!137 = !DILocation(line: 374, column: 20, scope: !131)
!138 = !DILocation(line: 375, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !128, file: !3, line: 375, column: 7)
!140 = !DILocation(line: 375, column: 14, scope: !139)
!141 = !DILocation(line: 375, column: 23, scope: !139)
!142 = !DILocation(line: 375, column: 7, scope: !128)
!143 = !DILocation(line: 376, column: 4, scope: !139)
!144 = !DILocation(line: 376, column: 11, scope: !139)
!145 = !DILocation(line: 376, column: 20, scope: !139)
!146 = !DILocation(line: 377, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !128, file: !3, line: 377, column: 7)
!148 = !DILocation(line: 377, column: 14, scope: !147)
!149 = !DILocation(line: 377, column: 22, scope: !147)
