; ModuleID = '../bcout/drivers/ptp/ptp_kvm.llvm.bc'
source_filename = "drivers/ptp/ptp_kvm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_ptp_kvm_init6:\09\09\09"
module asm ".long\09ptp_kvm_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kvm_ptp_clock = type { %struct.ptp_clock*, %struct.ptp_clock_info }
%struct.ptp_clock = type opaque
%struct.ptp_clock_info = type { %struct.module*, [16 x i8], i32, i32, i32, i32, i32, i32, %struct.ptp_pin_desc*, i32 (%struct.ptp_clock_info*, i64)*, i32 (%struct.ptp_clock_info*, i32)*, i32 (%struct.ptp_clock_info*, i32)*, i32 (%struct.ptp_clock_info*, i64)*, i32 (%struct.ptp_clock_info*, %struct.timespec64*)*, i32 (%struct.ptp_clock_info*, %struct.timespec64*, %struct.ptp_system_timestamp*)*, i32 (%struct.ptp_clock_info*, %struct.system_device_crosststamp*)*, i32 (%struct.ptp_clock_info*, %struct.timespec64*)*, i32 (%struct.ptp_clock_info*, %struct.ptp_clock_request*, i32)*, i32 (%struct.ptp_clock_info*, i32, i32, i32)*, i64 (%struct.ptp_clock_info*)* }
%struct.module = type opaque
%struct.ptp_pin_desc = type { [64 x i8], i32, i32, i32, [5 x i32] }
%struct.timespec64 = type { i64, i64 }
%struct.ptp_system_timestamp = type { %struct.timespec64, %struct.timespec64 }
%struct.system_device_crosststamp = type { i64, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "kvm_ptp_clock", scope: !2, file: !3, line: 160, type: !293, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !62, globals: !71, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/ptp/ptp_kvm.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !56}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !7, file: !6, line: 17, baseType: !18, size: 32, elements: !52)
!6 = !DIFile(filename: "./include/linux/ptp_clock_kernel.h", directory: "/home/lizy2001/genbc/linux")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_clock_request", file: !6, line: 16, size: 512, elements: !8)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !6, line: 21, baseType: !5, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_member, scope: !7, file: !6, line: 22, baseType: !11, size: 448, offset: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !6, line: 22, size: 448, elements: !12)
!12 = !{!13, !24}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "extts", scope: !11, file: !6, line: 23, baseType: !14, size: 128)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_extts_request", file: !15, line: 101, size: 128, elements: !16)
!15 = !DIFile(filename: "./include/uapi/linux/ptp_clock.h", directory: "/home/lizy2001/genbc/linux")
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !14, file: !15, line: 102, baseType: !18, size: 32)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !14, file: !15, line: 103, baseType: !18, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "rsv", scope: !14, file: !15, line: 104, baseType: !21, size: 64, offset: 64)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 2)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "perout", scope: !11, file: !6, line: 24, baseType: !25, size: 448)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_perout_request", file: !15, line: 107, size: 448, elements: !26)
!26 = !{!27, !41, !42, !43, !44}
!27 = !DIDerivedType(tag: DW_TAG_member, scope: !25, file: !15, line: 108, baseType: !28, size: 128)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !15, line: 108, size: 128, elements: !29)
!29 = !{!30, !40}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !28, file: !15, line: 113, baseType: !31, size: 128)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_clock_time", file: !15, line: 81, size: 128, elements: !32)
!32 = !{!33, !37, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !31, file: !15, line: 82, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !35, line: 30, baseType: !36)
!35 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!36 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nsec", scope: !31, file: !15, line: 83, baseType: !38, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !35, line: 27, baseType: !18)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !31, file: !15, line: 84, baseType: !38, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !28, file: !15, line: 120, baseType: !31, size: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !25, file: !15, line: 122, baseType: !31, size: 128, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !25, file: !15, line: 123, baseType: !18, size: 32, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !25, file: !15, line: 124, baseType: !18, size: 32, offset: 288)
!44 = !DIDerivedType(tag: DW_TAG_member, scope: !25, file: !15, line: 125, baseType: !45, size: 128, offset: 320)
!45 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !15, line: 125, size: 128, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !45, file: !15, line: 131, baseType: !31, size: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "rsv", scope: !45, file: !15, line: 133, baseType: !49, size: 128)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 4)
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PTP_CLK_REQ_EXTTS", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PTP_CLK_REQ_PEROUT", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PTP_CLK_REQ_PPS", value: 2, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ptp_pin_function", file: !15, line: 167, baseType: !18, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "PTP_PF_NONE", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "PTP_PF_EXTTS", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "PTP_PF_PEROUT", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "PTP_PF_PHYSYNC", value: 3, isUnsigned: true)
!62 = !{!63, !64, !68, !69, !70}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !65, line: 23, baseType: !66)
!65 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !35, line: 31, baseType: !67)
!67 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !65, line: 22, baseType: !34)
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!71 = !{!72, !74, !81, !88, !93, !98, !0, !103, !116, !120, !146, !249, !271, !280}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_ptp_kvm_init162", scope: !2, file: !3, line: 192, type: !63, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "__exitcall_ptp_kvm_exit", scope: !2, file: !3, line: 193, type: !76, isLocal: true, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !77, line: 117, baseType: !78)
!77 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author163", scope: !2, file: !3, line: 195, type: !83, isLocal: true, isDefinition: true, align: 8)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 424, elements: !86)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!86 = !{!87}
!87 = !DISubrange(count: 53)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description164", scope: !2, file: !3, line: 196, type: !90, isLocal: true, isDefinition: true, align: 8)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 360, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 45)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file165", scope: !2, file: !3, line: 197, type: !95, isLocal: true, isDefinition: true, align: 8)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 264, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 33)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license166", scope: !2, file: !3, line: 197, type: !100, isLocal: true, isDefinition: true, align: 8)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 160, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 20)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "clock_pair", scope: !2, file: !3, line: 29, type: !105, isLocal: true, isDefinition: true)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvm_clock_pairing", file: !106, line: 71, size: 512, elements: !107)
!106 = !DIFile(filename: "./arch/x86/include/uapi/asm/kvm_para.h", directory: "/home/lizy2001/genbc/linux")
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !105, file: !106, line: 72, baseType: !34, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nsec", scope: !105, file: !106, line: 73, baseType: !34, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !105, file: !106, line: 74, baseType: !66, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !106, line: 75, baseType: !38, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !105, file: !106, line: 76, baseType: !113, size: 288, offset: 224)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 288, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 9)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "clock_pair_gpa", scope: !2, file: !3, line: 30, type: !118, isLocal: true, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !119, line: 153, baseType: !64)
!119 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "hv_clock", scope: !2, file: !3, line: 27, type: !122, isLocal: true, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pvclock_vsyscall_time_info", file: !124, line: 90, size: 512, align: 512, elements: !125)
!124 = !DIFile(filename: "./arch/x86/include/asm/pvclock.h", directory: "/home/lizy2001/genbc/linux")
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pvti", scope: !123, file: !124, line: 91, baseType: !127, size: 256)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pvclock_vcpu_time_info", file: !128, line: 26, size: 256, elements: !129)
!128 = !DIFile(filename: "./arch/x86/include/asm/pvclock-abi.h", directory: "/home/lizy2001/genbc/linux")
!129 = !{!130, !132, !133, !134, !135, !136, !140, !144}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !127, file: !128, line: 27, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !65, line: 21, baseType: !38)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !127, file: !128, line: 28, baseType: !131, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_timestamp", scope: !127, file: !128, line: 29, baseType: !64, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "system_time", scope: !127, file: !128, line: 30, baseType: !64, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_to_system_mul", scope: !127, file: !128, line: 31, baseType: !131, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_shift", scope: !127, file: !128, line: 32, baseType: !137, size: 8, offset: 224)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !65, line: 16, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !35, line: 20, baseType: !139)
!139 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !128, line: 33, baseType: !141, size: 8, offset: 232)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !65, line: 17, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !35, line: 21, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !127, file: !128, line: 34, baseType: !145, size: 16, offset: 240)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 16, elements: !22)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "ptp_kvm_caps", scope: !2, file: !3, line: 143, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_clock_info", file: !6, line: 122, size: 1152, elements: !150)
!150 = !{!151, !155, !159, !163, !164, !165, !166, !167, !168, !183, !188, !192, !193, !197, !208, !217, !230, !236, !241, !245}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !149, file: !6, line: 123, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !154, line: 76, flags: DIFlagFwdDecl)
!154 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !6, line: 124, baseType: !156, size: 128, offset: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_adj", scope: !149, file: !6, line: 125, baseType: !160, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !65, line: 20, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !35, line: 26, baseType: !162)
!162 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "n_alarm", scope: !149, file: !6, line: 126, baseType: !162, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "n_ext_ts", scope: !149, file: !6, line: 127, baseType: !162, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n_per_out", scope: !149, file: !6, line: 128, baseType: !162, size: 32, offset: 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "n_pins", scope: !149, file: !6, line: 129, baseType: !162, size: 32, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !149, file: !6, line: 130, baseType: !162, size: 32, offset: 352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !149, file: !6, line: 131, baseType: !169, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_pin_desc", file: !15, line: 174, size: 768, elements: !171)
!171 = !{!172, !176, !177, !178, !179}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !15, line: 180, baseType: !173, size: 512)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !170, file: !15, line: 184, baseType: !18, size: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !170, file: !15, line: 188, baseType: !18, size: 32, offset: 544)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !170, file: !15, line: 194, baseType: !18, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "rsv", scope: !170, file: !15, line: 198, baseType: !180, size: 160, offset: 608)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 5)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "adjfine", scope: !149, file: !6, line: 132, baseType: !184, size: 64, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!162, !187, !70}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "adjfreq", scope: !149, file: !6, line: 133, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!162, !187, !160}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "adjphase", scope: !149, file: !6, line: 134, baseType: !189, size: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "adjtime", scope: !149, file: !6, line: 135, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!162, !187, !68}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gettime64", scope: !149, file: !6, line: 136, baseType: !198, size: 64, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!162, !187, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !203, line: 13, size: 128, elements: !204)
!203 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !202, file: !203, line: 14, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !203, line: 8, baseType: !34)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !202, file: !203, line: 15, baseType: !70, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gettimex64", scope: !149, file: !6, line: 137, baseType: !209, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!162, !187, !201, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_system_timestamp", file: !6, line: 33, size: 256, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pre_ts", scope: !213, file: !6, line: 34, baseType: !202, size: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "post_ts", scope: !213, file: !6, line: 35, baseType: !202, size: 128, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "getcrosststamp", scope: !149, file: !6, line: 139, baseType: !218, size: 64, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!162, !187, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "system_device_crosststamp", file: !223, line: 261, size: 192, elements: !224)
!223 = !DIFile(filename: "./include/linux/timekeeping.h", directory: "/home/lizy2001/genbc/linux")
!224 = !{!225, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !222, file: !223, line: 262, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !227, line: 29, baseType: !68)
!227 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sys_realtime", scope: !222, file: !223, line: 263, baseType: !226, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sys_monoraw", scope: !222, file: !223, line: 264, baseType: !226, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "settime64", scope: !149, file: !6, line: 141, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!162, !187, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !149, file: !6, line: 142, baseType: !237, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!162, !187, !240, !162}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !149, file: !6, line: 144, baseType: !242, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!162, !187, !18, !56, !18}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "do_aux_work", scope: !149, file: !6, line: 146, baseType: !246, size: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!70, !187}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "_rs", scope: !251, file: !3, line: 123, type: !253, isLocal: true, isDefinition: true)
!251 = distinct !DISubprogram(name: "ptp_kvm_gettime", scope: !3, file: !3, line: 112, type: !199, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !252)
!252 = !{}
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ratelimit_state", file: !254, line: 15, size: 256, elements: !255)
!254 = !DIFile(filename: "./include/linux/ratelimit_types.h", directory: "/home/lizy2001/genbc/linux")
!255 = !{!256, !265, !266, !267, !268, !269, !270}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !253, file: !254, line: 16, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !258, line: 29, baseType: !259)
!258 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !258, line: 20, elements: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !259, file: !258, line: 21, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !263, line: 25, baseType: !264)
!263 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !263, line: 25, elements: !252)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !253, file: !254, line: 18, baseType: !162, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "burst", scope: !253, file: !254, line: 19, baseType: !162, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !253, file: !254, line: 20, baseType: !162, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !253, file: !254, line: 21, baseType: !162, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !253, file: !254, line: 22, baseType: !69, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !253, file: !254, line: 23, baseType: !69, size: 64, offset: 192)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "kvm_ptp_lock", scope: !2, file: !3, line: 25, type: !273, isLocal: true, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !258, line: 83, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !258, line: 71, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !258, line: 72, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !258, line: 72, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !277, file: !258, line: 73, baseType: !259)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "_rs", scope: !282, file: !3, line: 62, type: !253, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "ptp_kvm_get_time_fn", scope: !3, file: !3, line: 32, type: !283, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !252)
!283 = !DISubroutineType(types: !284)
!284 = !{!162, !285, !286, !63}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "system_counterval_t", file: !223, line: 274, size: 128, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !287, file: !223, line: 275, baseType: !64, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !287, file: !223, line: 276, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "clocksource", file: !223, line: 276, flags: DIFlagFwdDecl)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvm_ptp_clock", file: !3, line: 20, size: 1216, elements: !294)
!294 = !{!295, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_clock", scope: !293, file: !3, line: 21, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptp_clock", file: !6, line: 149, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !293, file: !3, line: 22, baseType: !149, size: 1152, offset: 64)
!299 = !{i32 7, !"Dwarf Version", i32 4}
!300 = !{i32 2, !"Debug Info Version", i32 3}
!301 = !{i32 1, !"wchar_size", i32 2}
!302 = !{i32 1, !"Code Model", i32 2}
!303 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!304 = distinct !DISubprogram(name: "ptp_kvm_exit", scope: !3, file: !3, line: 162, type: !79, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !252)
!305 = !DILocation(line: 164, column: 37, scope: !304)
!306 = !DILocation(line: 164, column: 2, scope: !304)
!307 = !DILocation(line: 165, column: 1, scope: !304)
!308 = distinct !DISubprogram(name: "ptp_kvm_init", scope: !3, file: !3, line: 167, type: !309, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !252)
!309 = !DISubroutineType(types: !310)
!310 = !{!162}
!311 = !DILocalVariable(name: "ret", scope: !308, file: !3, line: 169, type: !70)
!312 = !DILocation(line: 169, column: 7, scope: !308)
!313 = !DILocation(line: 171, column: 7, scope: !314)
!314 = distinct !DILexicalBlock(scope: !308, file: !3, line: 171, column: 6)
!315 = !DILocation(line: 171, column: 6, scope: !308)
!316 = !DILocation(line: 172, column: 3, scope: !314)
!317 = !DILocation(line: 174, column: 19, scope: !308)
!318 = !DILocation(line: 174, column: 17, scope: !308)
!319 = !DILocation(line: 175, column: 13, scope: !308)
!320 = !DILocation(line: 175, column: 11, scope: !308)
!321 = !DILocation(line: 177, column: 7, scope: !322)
!322 = distinct !DILexicalBlock(scope: !308, file: !3, line: 177, column: 6)
!323 = !DILocation(line: 177, column: 6, scope: !308)
!324 = !DILocation(line: 178, column: 3, scope: !322)
!325 = !DILocation(line: 180, column: 45, scope: !308)
!326 = !DILocation(line: 180, column: 8, scope: !308)
!327 = !DILocation(line: 180, column: 6, scope: !308)
!328 = !DILocation(line: 182, column: 6, scope: !329)
!329 = distinct !DILexicalBlock(scope: !308, file: !3, line: 182, column: 6)
!330 = !DILocation(line: 182, column: 10, scope: !329)
!331 = !DILocation(line: 182, column: 25, scope: !329)
!332 = !DILocation(line: 182, column: 28, scope: !329)
!333 = !DILocation(line: 182, column: 32, scope: !329)
!334 = !DILocation(line: 182, column: 6, scope: !308)
!335 = !DILocation(line: 183, column: 3, scope: !329)
!336 = !DILocation(line: 185, column: 23, scope: !308)
!337 = !DILocation(line: 187, column: 28, scope: !308)
!338 = !DILocation(line: 187, column: 26, scope: !308)
!339 = !DILocation(line: 189, column: 39, scope: !308)
!340 = !DILocation(line: 189, column: 25, scope: !308)
!341 = !DILocation(line: 189, column: 9, scope: !308)
!342 = !DILocation(line: 189, column: 2, scope: !308)
!343 = !DILocation(line: 190, column: 1, scope: !308)
!344 = distinct !DISubprogram(name: "kvm_hypercall2", scope: !345, file: !345, line: 54, type: !346, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !252)
!345 = !DIFile(filename: "./arch/x86/include/asm/kvm_para.h", directory: "/home/lizy2001/genbc/linux")
!346 = !DISubroutineType(types: !347)
!347 = !{!70, !18, !69, !69}
!348 = !DILocalVariable(name: "nr", arg: 1, scope: !344, file: !345, line: 54, type: !18)
!349 = !DILocation(line: 54, column: 48, scope: !344)
!350 = !DILocalVariable(name: "p1", arg: 2, scope: !344, file: !345, line: 54, type: !69)
!351 = !DILocation(line: 54, column: 66, scope: !344)
!352 = !DILocalVariable(name: "p2", arg: 3, scope: !344, file: !345, line: 55, type: !69)
!353 = !DILocation(line: 55, column: 21, scope: !344)
!354 = !DILocalVariable(name: "ret", scope: !344, file: !345, line: 57, type: !70)
!355 = !DILocation(line: 57, column: 7, scope: !344)
!356 = !DILocation(line: 60, column: 14, scope: !344)
!357 = !DILocation(line: 60, column: 23, scope: !344)
