; ModuleID = '../bcout/drivers/net/wimax/i2400m/op-rfkill.llvm.bc'
source_filename = "drivers/net/wimax/i2400m/op-rfkill.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.d_level = type { i8, i8* }
%struct.kmem_cache = type opaque
%struct.wimax_dev = type { %struct.net_device*, %struct.list_head, %struct.mutex, %struct.mutex, i32, i32 (%struct.wimax_dev*, i8*, i8*, i64, %struct.genl_info*)*, {}*, i32 (%struct.wimax_dev*)*, %struct.rfkill*, i32, i32, [32 x i8], %struct.dentry* }

!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !237, line: 602, baseType: !11, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256}
!251 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!252 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!255 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!256 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !237, line: 615, baseType: !11, size: 32, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!260 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!261 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!262 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !237, line: 626, baseType: !11, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269}
!265 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!267 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!268 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!269 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !237, line: 638, baseType: !11, size: 32, elements: !271)
!271 = !{!272, !273}
!272 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !237, line: 647, baseType: !11, size: 32, elements: !275)
!275 = !{!276, !277}
!276 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !279, line: 54, baseType: !11, size: 32, elements: !280)
!279 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!280 = !{!281, !282, !283, !284}
!281 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !286, line: 26, baseType: !11, size: 32, elements: !287)
!286 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!287 = !{!288, !289, !290}
!288 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!290 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !4, line: 423, baseType: !11, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !298, file: !4, line: 2085, baseType: !11, size: 32, elements: !7077)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !4, line: 1858, size: 15808, elements: !299)
!299 = !{!300, !305, !328, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !362, !370, !371, !372, !373, !374, !375, !376, !377, !378, !404, !414, !415, !416, !421, !422, !426, !429, !5557, !6072, !6076, !6116, !6117, !6118, !6119, !6120, !6121, !6122, !6123, !6124, !6125, !6126, !6127, !6128, !6129, !6130, !6131, !6132, !6133, !6134, !6135, !6136, !6137, !6138, !6139, !6140, !6141, !6142, !6147, !6148, !6149, !6424, !6425, !6426, !6427, !6430, !6433, !6436, !6439, !6442, !6443, !6456, !6457, !6458, !6459, !6460, !6461, !6468, !6469, !6503, !6504, !6505, !6506, !6507, !6508, !6509, !6510, !6511, !6514, !6515, !6516, !6517, !6518, !6519, !6520, !6521, !6522, !6527, !6528, !6529, !6534, !6571, !7032, !7034, !7035, !7039, !7040, !7041, !7042, !7048, !7050, !7053, !7056, !7058, !7059, !7060, !7061, !7062, !7066, !7069}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !4, line: 1859, baseType: !301, size: 128)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !303)
!302 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!303 = !{!304}
!304 = !DISubrange(count: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !298, file: !4, line: 1860, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !4, line: 938, size: 384, elements: !308)
!308 = !{!309, !317, !323, !325}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !307, file: !4, line: 939, baseType: !310, size: 128)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !311, line: 186, size: 128, elements: !312)
!311 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !311, line: 187, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !310, file: !311, line: 187, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !4, line: 940, baseType: !318, size: 128, offset: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !311, line: 178, size: 128, elements: !319)
!319 = !{!320, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !311, line: 179, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !311, line: 179, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !307, file: !4, line: 941, baseType: !324, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !4, line: 942, baseType: !326, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !298, file: !4, line: 1861, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !4, line: 930, size: 128, elements: !331)
!331 = !{!332, !341}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !330, file: !4, line: 931, baseType: !333, size: 128, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !311, line: 216, size: 128, align: 64, elements: !334)
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !311, line: 217, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !333, file: !311, line: 218, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !336}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !330, file: !4, line: 932, baseType: !342, offset: 128)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: -1)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !298, file: !4, line: 1866, baseType: !346, size: 64, offset: 256)
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !298, file: !4, line: 1867, baseType: !346, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !298, file: !4, line: 1868, baseType: !346, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !298, file: !4, line: 1869, baseType: !5, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !298, file: !4, line: 1877, baseType: !346, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !298, file: !4, line: 1879, baseType: !318, size: 128, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !298, file: !4, line: 1880, baseType: !318, size: 128, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !298, file: !4, line: 1881, baseType: !318, size: 128, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !298, file: !4, line: 1882, baseType: !318, size: 128, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !298, file: !4, line: 1883, baseType: !318, size: 128, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !298, file: !4, line: 1884, baseType: !318, size: 128, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !298, file: !4, line: 1889, baseType: !358, size: 256, offset: 1344)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !298, file: !4, line: 1886, size: 256, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !358, file: !4, line: 1887, baseType: !318, size: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !358, file: !4, line: 1888, baseType: !318, size: 128, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !298, file: !4, line: 1891, baseType: !363, size: 64, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !364, line: 12, baseType: !365)
!364 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !366, line: 23, baseType: !367)
!366 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !368, line: 31, baseType: !369)
!368 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!369 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !298, file: !4, line: 1892, baseType: !363, size: 64, offset: 1664)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !298, file: !4, line: 1893, baseType: !363, size: 64, offset: 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !298, file: !4, line: 1894, baseType: !363, size: 64, offset: 1792)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !298, file: !4, line: 1895, baseType: !363, size: 64, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !298, file: !4, line: 1896, baseType: !363, size: 64, offset: 1920)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !298, file: !4, line: 1897, baseType: !363, size: 64, offset: 1984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !298, file: !4, line: 1899, baseType: !5, size: 32, offset: 2048)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !298, file: !4, line: 1900, baseType: !5, size: 32, offset: 2080)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !298, file: !4, line: 1902, baseType: !379, size: 1472, offset: 2112)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !4, line: 169, size: 1472, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !379, file: !4, line: 170, baseType: !346, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !379, file: !4, line: 171, baseType: !346, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !379, file: !4, line: 172, baseType: !346, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !379, file: !4, line: 173, baseType: !346, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !379, file: !4, line: 174, baseType: !346, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !379, file: !4, line: 175, baseType: !346, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !379, file: !4, line: 176, baseType: !346, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !379, file: !4, line: 177, baseType: !346, size: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !379, file: !4, line: 178, baseType: !346, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !379, file: !4, line: 179, baseType: !346, size: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !379, file: !4, line: 180, baseType: !346, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !379, file: !4, line: 181, baseType: !346, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !379, file: !4, line: 182, baseType: !346, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !379, file: !4, line: 183, baseType: !346, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !379, file: !4, line: 184, baseType: !346, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !379, file: !4, line: 185, baseType: !346, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !379, file: !4, line: 186, baseType: !346, size: 64, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !379, file: !4, line: 187, baseType: !346, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !379, file: !4, line: 188, baseType: !346, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !379, file: !4, line: 189, baseType: !346, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !379, file: !4, line: 190, baseType: !346, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !379, file: !4, line: 191, baseType: !346, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !379, file: !4, line: 192, baseType: !346, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !298, file: !4, line: 1904, baseType: !405, size: 64, offset: 3584)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !406, line: 13, baseType: !407)
!406 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !311, line: 175, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 173, size: 64, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !408, file: !311, line: 174, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !366, line: 22, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !368, line: 30, baseType: !413)
!413 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !298, file: !4, line: 1905, baseType: !405, size: 64, offset: 3648)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !298, file: !4, line: 1906, baseType: !405, size: 64, offset: 3712)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !298, file: !4, line: 1909, baseType: !417, size: 32, offset: 3776)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !311, line: 168, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 166, size: 32, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !418, file: !311, line: 167, baseType: !5, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !298, file: !4, line: 1910, baseType: !417, size: 32, offset: 3808)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !298, file: !4, line: 1913, baseType: !423, size: 64, offset: 3840)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !4, line: 1913, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !298, file: !4, line: 1914, baseType: !427, size: 64, offset: 3904)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !4, line: 1914, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !298, file: !4, line: 1916, baseType: !430, size: 64, offset: 3968)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !4, line: 1283, size: 4416, elements: !433)
!433 = !{!434, !438, !442, !443, !444, !606, !610, !615, !619, !620, !625, !626, !749, !754, !758, !764, !768, !800, !808, !812, !817, !821, !822, !828, !832, !836, !840, !841, !863, !867, !882, !893, !897, !906, !910, !911, !915, !974, !978, !982, !986, !990, !997, !1001, !1019, !1023, !1072, !1076, !1081, !1085, !1089, !1093, !1103, !1104, !1113, !1119, !1120, !1124, !1128, !1132, !1136, !1137, !1141, !1142, !5517, !5537, !5541, !5547, !5553}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !432, file: !4, line: 1284, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!5, !324}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !432, file: !4, line: 1285, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !324}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !432, file: !4, line: 1286, baseType: !435, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !432, file: !4, line: 1287, baseType: !435, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !432, file: !4, line: 1288, baseType: !445, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !449, !324}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !4, line: 120, baseType: !3)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !451, line: 713, size: 1600, elements: !452)
!451 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!452 = !{!453, !475, !482, !489, !493, !505, !506, !507, !510, !511, !512, !518, !519, !520, !521, !522, !523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !564, !565, !566, !567, !569, !570, !575, !580, !585, !586, !587, !588, !589, !590, !591, !592, !593, !595, !596, !598, !599, !600}
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 714, baseType: !454, size: 192)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 714, size: 192, elements: !455)
!455 = !{!456, !466, !474}
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !454, file: !451, line: 715, baseType: !457, size: 192)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !454, file: !451, line: 715, size: 192, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !451, line: 717, baseType: !449, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !451, line: 718, baseType: !449, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !457, file: !451, line: 720, baseType: !462, size: 64, offset: 128)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !457, file: !451, line: 720, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !462, file: !451, line: 721, baseType: !324, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !462, file: !451, line: 726, baseType: !346, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !454, file: !451, line: 729, baseType: !467, size: 192, align: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !468, line: 24, size: 192, align: 64, elements: !469)
!468 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!469 = !{!470, !471, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !467, file: !468, line: 25, baseType: !346, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !467, file: !468, line: 26, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !467, file: !468, line: 27, baseType: !472, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !454, file: !451, line: 730, baseType: !318, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 733, baseType: !476, size: 64, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 733, size: 64, elements: !477)
!477 = !{!478, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !476, file: !451, line: 734, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !286, line: 19, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !476, file: !451, line: 735, baseType: !5, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 738, baseType: !483, size: 64, offset: 256)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 738, size: 64, elements: !484)
!484 = !{!485, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !483, file: !451, line: 739, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !487, line: 29, baseType: !411)
!487 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!488 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !483, file: !451, line: 740, baseType: !365, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !450, file: !451, line: 748, baseType: !490, size: 384, align: 64, offset: 320)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 384, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 48)
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 750, baseType: !494, size: 128, offset: 704)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 750, size: 128, elements: !495)
!495 = !{!496, !504}
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !494, file: !451, line: 751, baseType: !497, size: 128)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !451, line: 751, size: 128, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !497, file: !451, line: 752, baseType: !346, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !497, file: !451, line: 753, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !449}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !494, file: !451, line: 755, baseType: !318, size: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !450, file: !451, line: 761, baseType: !11, size: 32, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !450, file: !451, line: 762, baseType: !11, size: 32, offset: 864)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !450, file: !451, line: 763, baseType: !508, size: 16, offset: 896)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !368, line: 24, baseType: !509)
!509 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !450, file: !451, line: 764, baseType: !508, size: 16, offset: 912)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !450, file: !451, line: 769, baseType: !508, size: 16, offset: 928)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !450, file: !451, line: 780, baseType: !513, offset: 944)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, elements: !516)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !368, line: 21, baseType: !515)
!515 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!516 = !{!517}
!517 = !DISubrange(count: 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !450, file: !451, line: 782, baseType: !514, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !450, file: !451, line: 783, baseType: !514, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !450, file: !451, line: 784, baseType: !514, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !450, file: !451, line: 785, baseType: !514, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !450, file: !451, line: 786, baseType: !514, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !450, file: !451, line: 787, baseType: !514, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !450, file: !451, line: 795, baseType: !525, offset: 960)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, elements: !516)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !368, line: 27, baseType: !11)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !450, file: !451, line: 807, baseType: !513, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !450, file: !451, line: 809, baseType: !514, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !450, file: !451, line: 810, baseType: !514, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !450, file: !451, line: 811, baseType: !514, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !450, file: !451, line: 812, baseType: !514, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !450, file: !451, line: 813, baseType: !514, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !450, file: !451, line: 815, baseType: !514, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !450, file: !451, line: 816, baseType: !514, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !450, file: !451, line: 817, baseType: !514, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !450, file: !451, line: 818, baseType: !514, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !450, file: !451, line: 819, baseType: !514, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !450, file: !451, line: 821, baseType: !514, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !450, file: !451, line: 822, baseType: !514, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !450, file: !451, line: 823, baseType: !514, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !450, file: !451, line: 832, baseType: !513, offset: 976)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !450, file: !451, line: 834, baseType: !514, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !450, file: !451, line: 835, baseType: !514, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !450, file: !451, line: 836, baseType: !514, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !450, file: !451, line: 837, baseType: !514, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !450, file: !451, line: 838, baseType: !514, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !450, file: !451, line: 840, baseType: !514, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !450, file: !451, line: 843, baseType: !514, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !450, file: !451, line: 844, baseType: !514, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !450, file: !451, line: 845, baseType: !514, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !450, file: !451, line: 847, baseType: !514, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !450, file: !451, line: 848, baseType: !514, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!553 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 866, baseType: !554, size: 32, offset: 992)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 866, size: 32, elements: !555)
!555 = !{!556, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !554, file: !451, line: 867, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !558, line: 37, baseType: !526)
!558 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !554, file: !451, line: 868, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !451, line: 868, size: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !560, file: !451, line: 869, baseType: !508, size: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !560, file: !451, line: 870, baseType: !508, size: 16, offset: 16)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !450, file: !451, line: 873, baseType: !526, size: 32, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !450, file: !451, line: 874, baseType: !5, size: 32, offset: 1056)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !450, file: !451, line: 875, baseType: !526, size: 32, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !450, file: !451, line: 876, baseType: !568, size: 16, offset: 1120)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !558, line: 30, baseType: !508)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !450, file: !451, line: 877, baseType: !508, size: 16, offset: 1136)
!570 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 879, baseType: !571, size: 32, offset: 1152)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 879, size: 32, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !571, file: !451, line: 880, baseType: !11, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !571, file: !451, line: 881, baseType: !11, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 888, baseType: !576, size: 32, offset: 1184)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 888, size: 32, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !576, file: !451, line: 889, baseType: !526, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !576, file: !451, line: 890, baseType: !526, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 893, baseType: !581, size: 16, offset: 1216)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 893, size: 16, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !581, file: !451, line: 894, baseType: !568, size: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !581, file: !451, line: 895, baseType: !514, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !450, file: !451, line: 898, baseType: !508, size: 16, offset: 1232)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !450, file: !451, line: 899, baseType: !508, size: 16, offset: 1248)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !450, file: !451, line: 900, baseType: !508, size: 16, offset: 1264)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !450, file: !451, line: 902, baseType: !568, size: 16, offset: 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !450, file: !451, line: 903, baseType: !508, size: 16, offset: 1296)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !450, file: !451, line: 904, baseType: !508, size: 16, offset: 1312)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !450, file: !451, line: 905, baseType: !508, size: 16, offset: 1328)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !450, file: !451, line: 908, baseType: !525, offset: 1344)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !450, file: !451, line: 912, baseType: !594, size: 32, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !451, line: 606, baseType: !11)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !450, file: !451, line: 913, baseType: !594, size: 32, offset: 1376)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !450, file: !451, line: 914, baseType: !597, size: 64, offset: 1408)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !451, line: 915, baseType: !597, size: 64, offset: 1472)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !450, file: !451, line: 916, baseType: !11, size: 32, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !450, file: !451, line: 917, baseType: !601, size: 32, offset: 1568)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !602, line: 113, baseType: !603)
!602 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !602, line: 111, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !603, file: !602, line: 112, baseType: !417, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !432, file: !4, line: 1290, baseType: !607, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!363, !449, !324, !363}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !432, file: !4, line: 1293, baseType: !611, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!614, !324, !449, !324}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !366, line: 19, baseType: !508)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !432, file: !4, line: 1296, baseType: !616, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !324, !5}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !432, file: !4, line: 1298, baseType: !439, size: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !432, file: !4, line: 1299, baseType: !621, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!5, !324, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !432, file: !4, line: 1301, baseType: !435, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !432, file: !4, line: 1302, baseType: !627, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!5, !324, !630, !5}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !632, line: 234, size: 320, elements: !633)
!632 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!633 = !{!634, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !631, file: !632, line: 239, baseType: !635, size: 128)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !631, file: !632, line: 236, size: 128, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !635, file: !632, line: 238, baseType: !301, size: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !631, file: !632, line: 255, baseType: !639, size: 192, offset: 128)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !631, file: !632, line: 241, size: 192, elements: !640)
!640 = !{!641, !653, !654, !655, !656, !657, !659, !660, !661, !670, !671, !672, !673}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !639, file: !632, line: 242, baseType: !642, size: 128)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !643, line: 32, size: 128, elements: !644)
!643 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!644 = !{!645, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !642, file: !643, line: 33, baseType: !646, size: 16)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !643, line: 26, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !648, line: 10, baseType: !509)
!648 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !642, file: !643, line: 34, baseType: !650, size: 112, offset: 16)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 112, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 14)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !639, file: !632, line: 243, baseType: !642, size: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !639, file: !632, line: 244, baseType: !642, size: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !639, file: !632, line: 245, baseType: !642, size: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !639, file: !632, line: 246, baseType: !642, size: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !639, file: !632, line: 247, baseType: !658, size: 16)
!658 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !639, file: !632, line: 248, baseType: !5, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !639, file: !632, line: 249, baseType: !5, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !639, file: !632, line: 250, baseType: !662, size: 192)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !632, line: 196, size: 192, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !662, file: !632, line: 197, baseType: !346, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !662, file: !632, line: 198, baseType: !346, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !662, file: !632, line: 199, baseType: !509, size: 16, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !662, file: !632, line: 200, baseType: !515, size: 8, offset: 144)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !662, file: !632, line: 201, baseType: !515, size: 8, offset: 152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !662, file: !632, line: 202, baseType: !515, size: 8, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !639, file: !632, line: 251, baseType: !301, size: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !639, file: !632, line: 252, baseType: !301, size: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !639, file: !632, line: 253, baseType: !624, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !639, file: !632, line: 254, baseType: !674, size: 128)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !632, line: 207, size: 128, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !674, file: !632, line: 208, baseType: !11, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !674, file: !632, line: 209, baseType: !11, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !674, file: !632, line: 222, baseType: !679, size: 64, offset: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !674, file: !632, line: 210, size: 64, elements: !680)
!680 = !{!681, !689, !696, !708, !714, !721, !732, !740}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !679, file: !632, line: 212, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !684, line: 56, baseType: !685)
!684 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 53, size: 32, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !685, file: !684, line: 54, baseType: !509, size: 16)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !685, file: !684, line: 55, baseType: !509, size: 16, offset: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !679, file: !632, line: 213, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !684, line: 80, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 77, size: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !692, file: !684, line: 78, baseType: !11, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !692, file: !684, line: 79, baseType: !11, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !679, file: !632, line: 214, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !684, line: 66, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 58, size: 192, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !699, file: !684, line: 59, baseType: !11, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !699, file: !684, line: 60, baseType: !11, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !699, file: !684, line: 61, baseType: !11, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !699, file: !684, line: 62, baseType: !11, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !699, file: !684, line: 63, baseType: !11, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !699, file: !684, line: 64, baseType: !509, size: 16, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !699, file: !684, line: 65, baseType: !509, size: 16, offset: 176)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !679, file: !632, line: 215, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !684, line: 70, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 68, size: 32, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !711, file: !684, line: 69, baseType: !11, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !679, file: !632, line: 216, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !684, line: 75, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 72, size: 160, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !717, file: !684, line: 73, baseType: !11, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !717, file: !684, line: 74, baseType: !301, size: 128, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !679, file: !632, line: 217, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !684, line: 89, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 82, size: 192, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !724, file: !684, line: 83, baseType: !509, size: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !724, file: !684, line: 84, baseType: !11, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !724, file: !684, line: 85, baseType: !11, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !724, file: !684, line: 86, baseType: !11, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !724, file: !684, line: 87, baseType: !11, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !724, file: !684, line: 88, baseType: !11, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !679, file: !632, line: 220, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !684, line: 44, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 40, size: 96, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !735, file: !684, line: 41, baseType: !11, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !735, file: !684, line: 42, baseType: !11, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !735, file: !684, line: 43, baseType: !509, size: 16, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !679, file: !632, line: 221, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !684, line: 51, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 46, size: 128, elements: !744)
!744 = !{!745, !746, !747, !748}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !743, file: !684, line: 47, baseType: !11, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !743, file: !684, line: 48, baseType: !11, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !743, file: !684, line: 49, baseType: !509, size: 16, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !743, file: !684, line: 50, baseType: !11, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !432, file: !4, line: 1304, baseType: !750, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!5, !324, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !432, file: !4, line: 1306, baseType: !755, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!5, !324, !5}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !432, file: !4, line: 1308, baseType: !759, size: 64, offset: 896)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!5, !324, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !4, line: 206, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !432, file: !4, line: 1310, baseType: !765, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !324, !11}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !432, file: !4, line: 1313, baseType: !769, size: 64, offset: 1024)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !324, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !774, line: 214, size: 1536, elements: !775)
!774 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !773, file: !774, line: 215, baseType: !367, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !773, file: !774, line: 216, baseType: !367, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !773, file: !774, line: 217, baseType: !367, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !773, file: !774, line: 218, baseType: !367, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !773, file: !774, line: 219, baseType: !367, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !773, file: !774, line: 220, baseType: !367, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !773, file: !774, line: 221, baseType: !367, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !773, file: !774, line: 222, baseType: !367, size: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !773, file: !774, line: 223, baseType: !367, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !773, file: !774, line: 224, baseType: !367, size: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !773, file: !774, line: 227, baseType: !367, size: 64, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !773, file: !774, line: 228, baseType: !367, size: 64, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !773, file: !774, line: 229, baseType: !367, size: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !773, file: !774, line: 230, baseType: !367, size: 64, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !773, file: !774, line: 231, baseType: !367, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !773, file: !774, line: 232, baseType: !367, size: 64, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !773, file: !774, line: 235, baseType: !367, size: 64, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !773, file: !774, line: 236, baseType: !367, size: 64, offset: 1088)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !773, file: !774, line: 237, baseType: !367, size: 64, offset: 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !773, file: !774, line: 238, baseType: !367, size: 64, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !773, file: !774, line: 239, baseType: !367, size: 64, offset: 1280)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !773, file: !774, line: 242, baseType: !367, size: 64, offset: 1344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !773, file: !774, line: 243, baseType: !367, size: 64, offset: 1408)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !773, file: !774, line: 244, baseType: !367, size: 64, offset: 1472)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !432, file: !4, line: 1315, baseType: !801, size: 64, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !806, !5}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !311, line: 30, baseType: !805)
!805 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !432, file: !4, line: 1316, baseType: !809, size: 64, offset: 1152)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!5, !5, !806, !624}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !432, file: !4, line: 1319, baseType: !813, size: 64, offset: 1216)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!816, !324}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !432, file: !4, line: 1321, baseType: !818, size: 64, offset: 1280)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!5, !324, !568, !614}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !432, file: !4, line: 1323, baseType: !818, size: 64, offset: 1344)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !432, file: !4, line: 1331, baseType: !823, size: 64, offset: 1408)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!5, !324, !5, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !366, line: 17, baseType: !514)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !432, file: !4, line: 1333, baseType: !829, size: 64, offset: 1472)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!5, !324, !5, !614, !827, !568}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !432, file: !4, line: 1336, baseType: !833, size: 64, offset: 1536)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!5, !324, !5, !5, !5}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !432, file: !4, line: 1339, baseType: !837, size: 64, offset: 1600)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!5, !324, !5, !804}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !432, file: !4, line: 1341, baseType: !837, size: 64, offset: 1664)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !432, file: !4, line: 1343, baseType: !842, size: 64, offset: 1728)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!5, !324, !5, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !847, line: 20, size: 576, elements: !848)
!847 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!848 = !{!849, !850, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !846, file: !847, line: 21, baseType: !526, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !846, file: !847, line: 22, baseType: !851, size: 256, offset: 32)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 256, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !846, file: !847, line: 23, baseType: !526, size: 32, offset: 288)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !846, file: !847, line: 24, baseType: !526, size: 32, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !846, file: !847, line: 25, baseType: !526, size: 32, offset: 352)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !846, file: !847, line: 26, baseType: !526, size: 32, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !846, file: !847, line: 27, baseType: !526, size: 32, offset: 416)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !846, file: !847, line: 28, baseType: !526, size: 32, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !846, file: !847, line: 29, baseType: !526, size: 32, offset: 480)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !846, file: !847, line: 30, baseType: !526, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !846, file: !847, line: 31, baseType: !568, size: 16, offset: 544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !432, file: !4, line: 1346, baseType: !864, size: 64, offset: 1792)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!5, !324, !5, !5}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !432, file: !4, line: 1348, baseType: !868, size: 64, offset: 1856)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!5, !324, !5, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !847, line: 9, size: 512, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !872, file: !847, line: 10, baseType: !367, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !872, file: !847, line: 11, baseType: !367, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !872, file: !847, line: 12, baseType: !367, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !872, file: !847, line: 13, baseType: !367, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !872, file: !847, line: 14, baseType: !367, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !872, file: !847, line: 15, baseType: !367, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !872, file: !847, line: 16, baseType: !367, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !872, file: !847, line: 17, baseType: !367, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !432, file: !4, line: 1352, baseType: !883, size: 64, offset: 1920)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!5, !324, !5, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !889, line: 213, size: 32, elements: !890)
!889 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !888, file: !889, line: 214, baseType: !508, size: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !888, file: !889, line: 215, baseType: !508, size: 16, offset: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !432, file: !4, line: 1355, baseType: !894, size: 64, offset: 1984)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!5, !324, !5, !449}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !432, file: !4, line: 1357, baseType: !898, size: 64, offset: 2048)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!5, !324, !5, !901, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !774, line: 956, size: 128, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !902, file: !774, line: 957, baseType: !526, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !902, file: !774, line: 958, baseType: !367, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !432, file: !4, line: 1361, baseType: !907, size: 64, offset: 2112)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!5, !324, !5, !365, !5}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !432, file: !4, line: 1364, baseType: !837, size: 64, offset: 2176)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !432, file: !4, line: 1367, baseType: !912, size: 64, offset: 2240)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!5, !324, !10, !624}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !432, file: !4, line: 1400, baseType: !916, size: 64, offset: 2304)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!5, !324, !324, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !921, line: 75, size: 384, elements: !922)
!921 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!922 = !{!923, !924, !927, !969, !973}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !920, file: !921, line: 76, baseType: !326, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !920, file: !921, line: 77, baseType: !925, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !920, file: !921, line: 78, baseType: !928, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !931, line: 315, size: 128, elements: !932)
!931 = !DIFile(filename: "./include/net/netlink.h", directory: "/home/lizy2001/genbc/linux")
!932 = !{!933, !934, !935, !936}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !930, file: !931, line: 316, baseType: !827, size: 8)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "validation_type", scope: !930, file: !931, line: 317, baseType: !827, size: 8, offset: 8)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !930, file: !931, line: 318, baseType: !614, size: 16, offset: 16)
!936 = !DIDerivedType(tag: DW_TAG_member, scope: !930, file: !931, line: 319, baseType: !937, size: 64, offset: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !930, file: !931, line: 319, size: 64, elements: !938)
!938 = !{!939, !942, !943, !944, !945, !951, !957, !964, !968}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "bitfield32_valid", scope: !937, file: !931, line: 320, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !366, line: 21, baseType: !526)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !937, file: !931, line: 321, baseType: !940, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "reject_message", scope: !937, file: !931, line: 322, baseType: !326, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "nested_policy", scope: !937, file: !931, line: 323, baseType: !928, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !937, file: !931, line: 324, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_range_validation", file: !931, line: 189, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !947, file: !931, line: 190, baseType: !365, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !947, file: !931, line: 190, baseType: !365, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "range_signed", scope: !937, file: !931, line: 325, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_range_validation_signed", file: !931, line: 193, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !953, file: !931, line: 194, baseType: !411, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !953, file: !931, line: 194, baseType: !411, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, scope: !937, file: !931, line: 326, baseType: !958, size: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !937, file: !931, line: 326, size: 32, elements: !959)
!959 = !{!960, !963}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !958, file: !931, line: 327, baseType: !961, size: 16)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !366, line: 18, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !368, line: 23, baseType: !658)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !958, file: !931, line: 327, baseType: !961, size: 16, offset: 16)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !937, file: !931, line: 329, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!5, !925, !919}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "strict_start_type", scope: !937, file: !931, line: 349, baseType: !614, size: 16)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !920, file: !921, line: 79, baseType: !970, size: 160, offset: 192)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 160, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 20)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !920, file: !921, line: 80, baseType: !827, size: 8, offset: 352)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !432, file: !4, line: 1403, baseType: !975, size: 64, offset: 2368)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!5, !324, !324}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !432, file: !4, line: 1405, baseType: !979, size: 64, offset: 2432)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!324, !324, !449, !804}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !432, file: !4, line: 1408, baseType: !983, size: 64, offset: 2496)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!363, !324, !363}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !432, file: !4, line: 1410, baseType: !987, size: 64, offset: 2560)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!5, !324, !363}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !432, file: !4, line: 1412, baseType: !991, size: 64, offset: 2624)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!5, !324, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !996, line: 35, flags: DIFlagFwdDecl)
!996 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !432, file: !4, line: 1414, baseType: !998, size: 64, offset: 2688)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !324, !994}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !432, file: !4, line: 1417, baseType: !1002, size: 64, offset: 2752)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!5, !1005, !886, !324, !1017, !614, !614, !919}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1007, line: 8, size: 96, elements: !1008)
!1007 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1008 = !{!1009, !1010, !1011, !1012, !1014, !1015, !1016}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1006, file: !1007, line: 9, baseType: !514, size: 8)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1006, file: !1007, line: 10, baseType: !514, size: 8, offset: 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1006, file: !1007, line: 11, baseType: !508, size: 16, offset: 16)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1006, file: !1007, line: 12, baseType: !1013, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !368, line: 26, baseType: !5)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1006, file: !1007, line: 13, baseType: !508, size: 16, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1006, file: !1007, line: 14, baseType: !514, size: 8, offset: 80)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1006, file: !1007, line: 15, baseType: !514, size: 8, offset: 88)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !432, file: !4, line: 1424, baseType: !1020, size: 64, offset: 2816)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!5, !1005, !886, !324, !1017, !614}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !432, file: !4, line: 1429, baseType: !1024, size: 64, offset: 2880)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!5, !449, !1027, !324, !324, !1071}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !921, line: 203, size: 1024, elements: !1029)
!1029 = !{!1030, !1031, !1041, !1045, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1028, file: !921, line: 204, baseType: !449, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1028, file: !921, line: 205, baseType: !1032, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !889, line: 44, size: 128, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1034, file: !889, line: 45, baseType: !526, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1034, file: !889, line: 46, baseType: !508, size: 16, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1034, file: !889, line: 47, baseType: !508, size: 16, offset: 48)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1034, file: !889, line: 48, baseType: !526, size: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1034, file: !889, line: 49, baseType: !526, size: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1028, file: !921, line: 206, baseType: !1042, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!5, !449, !1027}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1028, file: !921, line: 208, baseType: !1046, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!5, !1027}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1028, file: !921, line: 209, baseType: !624, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1028, file: !921, line: 211, baseType: !1051, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1053, line: 189, flags: DIFlagFwdDecl)
!1053 = !DIFile(filename: "./include/linux/jump_label.h", directory: "/home/lizy2001/genbc/linux")
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1028, file: !921, line: 212, baseType: !919, size: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1028, file: !921, line: 213, baseType: !614, size: 16, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1028, file: !921, line: 214, baseType: !614, size: 16, offset: 464)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1028, file: !921, line: 215, baseType: !941, size: 32, offset: 480)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1028, file: !921, line: 216, baseType: !11, size: 32, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1028, file: !921, line: 216, baseType: !11, size: 32, offset: 544)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1028, file: !921, line: 217, baseType: !804, size: 8, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, scope: !1028, file: !921, line: 218, baseType: !1062, size: 384, offset: 640)
!1062 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !921, line: 218, size: 384, elements: !1063)
!1063 = !{!1064, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1062, file: !921, line: 219, baseType: !1065, size: 384)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 384, elements: !491)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1062, file: !921, line: 224, baseType: !1067, size: 384)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 384, elements: !1069)
!1068 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1069 = !{!1070}
!1070 = !DISubrange(count: 6)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !432, file: !4, line: 1434, baseType: !1073, size: 64, offset: 2944)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!5, !449, !886, !324, !1017, !614, !941, !941, !919}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !432, file: !4, line: 1440, baseType: !1077, size: 64, offset: 3008)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!5, !324, !1080, !614, !919}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !432, file: !4, line: 1444, baseType: !1082, size: 64, offset: 3072)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!5, !449, !941, !941, !324, !941, !5}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !432, file: !4, line: 1449, baseType: !1086, size: 64, offset: 3136)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!5, !324, !1080, !614}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !432, file: !4, line: 1452, baseType: !1090, size: 64, offset: 3200)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!5, !324, !804}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !432, file: !4, line: 1454, baseType: !1094, size: 64, offset: 3264)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!5, !324, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !4, line: 820, size: 264, elements: !1099)
!1099 = !{!1100, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1098, file: !4, line: 821, baseType: !1101, size: 256)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 256, elements: !852)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1098, file: !4, line: 822, baseType: !515, size: 8, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !432, file: !4, line: 1456, baseType: !1094, size: 64, offset: 3328)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !432, file: !4, line: 1458, baseType: !1105, size: 64, offset: 3392)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!5, !324, !1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !311, line: 55, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1111, line: 72, baseType: !1112)
!1111 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1111, line: 16, baseType: !346)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !432, file: !4, line: 1460, baseType: !1114, size: 64, offset: 3456)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !324, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !4, line: 67, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !432, file: !4, line: 1462, baseType: !1114, size: 64, offset: 3520)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !432, file: !4, line: 1464, baseType: !1121, size: 64, offset: 3584)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!624, !324, !324}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !432, file: !4, line: 1466, baseType: !1125, size: 64, offset: 3648)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !324, !624}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !432, file: !4, line: 1469, baseType: !1129, size: 64, offset: 3712)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!5, !324, !5, !941}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !432, file: !4, line: 1472, baseType: !1133, size: 64, offset: 3776)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!5, !806}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !432, file: !4, line: 1473, baseType: !1090, size: 64, offset: 3840)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !432, file: !4, line: 1475, baseType: !1138, size: 64, offset: 3904)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!5, !324, !449}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !432, file: !4, line: 1477, baseType: !616, size: 64, offset: 3968)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !432, file: !4, line: 1479, baseType: !1143, size: 64, offset: 4032)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!5, !324, !1146}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !4, line: 894, size: 256, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1147, file: !4, line: 895, baseType: !31, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, scope: !1147, file: !4, line: 896, baseType: !1151, size: 192, offset: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1147, file: !4, line: 896, size: 192, elements: !1152)
!1152 = !{!1153, !1162, !5510}
!1153 = !DIDerivedType(tag: DW_TAG_member, scope: !1151, file: !4, line: 898, baseType: !1154, size: 192)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1151, file: !4, line: 898, size: 192, elements: !1155)
!1155 = !{!1156, !1157, !1161}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !4, line: 899, baseType: !941, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1154, file: !4, line: 900, baseType: !1158, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1160, line: 11, flags: DIFlagFwdDecl)
!1160 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1154, file: !4, line: 901, baseType: !919, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, scope: !1151, file: !4, line: 904, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1151, file: !4, line: 904, size: 64, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1163, file: !4, line: 905, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !93, line: 222, size: 2560, elements: !1168)
!1168 = !{!1169, !5489, !5490, !5508, !5509}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1167, file: !93, line: 223, baseType: !1170, size: 2048)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !93, line: 141, size: 2048, elements: !1171)
!1171 = !{!1172, !5463, !5464, !5465, !5466, !5467, !5468, !5469, !5470, !5471, !5472, !5473, !5474, !5475, !5480, !5481, !5482, !5483, !5484, !5485, !5486, !5487, !5488}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1170, file: !93, line: 145, baseType: !1173, size: 64, align: 512)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !93, line: 54, size: 2368, elements: !1176)
!1176 = !{!1177, !1376, !1381, !5135, !5139, !5143, !5144, !5148, !5154, !5155, !5156, !5157, !5158, !5162, !5166, !5170, !5171, !5172, !5176, !5177, !5189, !5193, !5197, !5209, !5398, !5402, !5406, !5411, !5415, !5419, !5423, !5429, !5433, !5440, !5444, !5446, !5447}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1175, file: !93, line: 56, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!5, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !124, line: 483, size: 960, align: 64, elements: !1183)
!1183 = !{!1184, !1200, !1211, !1222, !1246, !1252, !1260, !1277, !1290, !1296, !1305, !1310, !1318, !1330, !1350, !1357, !1361, !1365, !1370}
!1184 = !DIDerivedType(tag: DW_TAG_member, scope: !1182, file: !124, line: 484, baseType: !1185, size: 512)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1182, file: !124, line: 484, size: 512, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1185, file: !124, line: 485, baseType: !526, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1185, file: !124, line: 486, baseType: !526, size: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1185, file: !124, line: 487, baseType: !526, size: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1185, file: !124, line: 488, baseType: !526, size: 32, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1185, file: !124, line: 489, baseType: !526, size: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1185, file: !124, line: 492, baseType: !526, size: 32, offset: 160)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1185, file: !124, line: 493, baseType: !526, size: 32, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1185, file: !124, line: 496, baseType: !301, size: 128, offset: 224)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1185, file: !124, line: 497, baseType: !526, size: 32, offset: 352)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1185, file: !124, line: 498, baseType: !526, size: 32, offset: 384)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1185, file: !124, line: 499, baseType: !526, size: 32, offset: 416)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1185, file: !124, line: 500, baseType: !526, size: 32, offset: 448)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1185, file: !124, line: 501, baseType: !526, size: 32, offset: 480)
!1200 = !DIDerivedType(tag: DW_TAG_member, scope: !1182, file: !124, line: 507, baseType: !1201, size: 256)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1182, file: !124, line: 507, size: 256, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1210}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1201, file: !124, line: 508, baseType: !526, size: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1201, file: !124, line: 509, baseType: !367, size: 64, align: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, scope: !1201, file: !124, line: 510, baseType: !1206, size: 64, offset: 128)
!1206 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1201, file: !124, line: 510, size: 64, elements: !1207)
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1206, file: !124, line: 511, baseType: !367, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1206, file: !124, line: 512, baseType: !367, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1201, file: !124, line: 514, baseType: !367, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1182, file: !124, line: 532, baseType: !1212, size: 448)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1182, file: !124, line: 517, size: 448, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1212, file: !124, line: 518, baseType: !367, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1212, file: !124, line: 521, baseType: !367, size: 64, align: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1212, file: !124, line: 522, baseType: !367, size: 64, align: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1212, file: !124, line: 523, baseType: !367, size: 64, align: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1212, file: !124, line: 524, baseType: !526, size: 32, offset: 256)
