; ModuleID = '../bcout/drivers/net/wimax/i2400m/rx.llvm.bc'
source_filename = "drivers/net/wimax/i2400m/rx.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.d_level = type { i8, i8* }
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!251 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !239, line: 602, baseType: !13, size: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258}
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!257 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!258 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !239, line: 615, baseType: !13, size: 32, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !239, line: 626, baseType: !13, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270, !271}
!267 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!270 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!271 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !239, line: 638, baseType: !13, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !239, line: 647, baseType: !13, size: 32, elements: !277)
!277 = !{!278, !279}
!278 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !281, line: 54, baseType: !13, size: 32, elements: !282)
!281 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!282 = !{!283, !284, !285, !286}
!283 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !288, line: 26, baseType: !13, size: 32, elements: !289)
!288 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !6, line: 423, baseType: !13, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298}
!295 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !300, file: !6, line: 2085, baseType: !13, size: 32, elements: !7080)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !6, line: 1858, size: 15808, elements: !301)
!301 = !{!302, !307, !330, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !364, !372, !373, !374, !375, !376, !377, !378, !379, !380, !406, !416, !417, !418, !423, !424, !428, !431, !5558, !6073, !6077, !6117, !6118, !6119, !6120, !6121, !6122, !6123, !6124, !6125, !6126, !6127, !6128, !6129, !6130, !6131, !6132, !6133, !6134, !6135, !6136, !6137, !6138, !6139, !6140, !6141, !6142, !6143, !6148, !6149, !6150, !6426, !6427, !6428, !6429, !6432, !6435, !6438, !6441, !6444, !6445, !6458, !6459, !6460, !6461, !6462, !6463, !6470, !6471, !6505, !6506, !6507, !6508, !6509, !6510, !6511, !6512, !6513, !6516, !6517, !6518, !6519, !6520, !6521, !6522, !6523, !6524, !6529, !6530, !6531, !6536, !6573, !7035, !7037, !7038, !7042, !7043, !7044, !7045, !7051, !7053, !7056, !7059, !7061, !7062, !7063, !7064, !7065, !7069, !7072}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !6, line: 1859, baseType: !303, size: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !305)
!304 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!305 = !{!306}
!306 = !DISubrange(count: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !300, file: !6, line: 1860, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !6, line: 938, size: 384, elements: !310)
!310 = !{!311, !319, !325, !327}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !309, file: !6, line: 939, baseType: !312, size: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !313, line: 186, size: 128, elements: !314)
!313 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !313, line: 187, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !312, file: !313, line: 187, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !309, file: !6, line: 940, baseType: !320, size: 128, offset: 128)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !313, line: 178, size: 128, elements: !321)
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !313, line: 179, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !313, line: 179, baseType: !323, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !309, file: !6, line: 941, baseType: !326, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !6, line: 942, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !300, file: !6, line: 1861, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !6, line: 930, size: 128, elements: !333)
!333 = !{!334, !343}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !332, file: !6, line: 931, baseType: !335, size: 128, align: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !313, line: 216, size: 128, align: 64, elements: !336)
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !335, file: !313, line: 217, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !335, file: !313, line: 218, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !338}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !332, file: !6, line: 932, baseType: !344, offset: 128)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: -1)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !300, file: !6, line: 1866, baseType: !348, size: 64, offset: 256)
!348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !300, file: !6, line: 1867, baseType: !348, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !300, file: !6, line: 1868, baseType: !348, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !300, file: !6, line: 1869, baseType: !7, size: 32, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !300, file: !6, line: 1877, baseType: !348, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !300, file: !6, line: 1879, baseType: !320, size: 128, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !300, file: !6, line: 1880, baseType: !320, size: 128, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !300, file: !6, line: 1881, baseType: !320, size: 128, offset: 832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !300, file: !6, line: 1882, baseType: !320, size: 128, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !300, file: !6, line: 1883, baseType: !320, size: 128, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !300, file: !6, line: 1884, baseType: !320, size: 128, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !300, file: !6, line: 1889, baseType: !360, size: 256, offset: 1344)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !6, line: 1886, size: 256, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !360, file: !6, line: 1887, baseType: !320, size: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !360, file: !6, line: 1888, baseType: !320, size: 128, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !300, file: !6, line: 1891, baseType: !365, size: 64, offset: 1600)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !366, line: 12, baseType: !367)
!366 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !368, line: 23, baseType: !369)
!368 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !370, line: 31, baseType: !371)
!370 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!371 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !300, file: !6, line: 1892, baseType: !365, size: 64, offset: 1664)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !300, file: !6, line: 1893, baseType: !365, size: 64, offset: 1728)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !300, file: !6, line: 1894, baseType: !365, size: 64, offset: 1792)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !300, file: !6, line: 1895, baseType: !365, size: 64, offset: 1856)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !300, file: !6, line: 1896, baseType: !365, size: 64, offset: 1920)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !300, file: !6, line: 1897, baseType: !365, size: 64, offset: 1984)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !300, file: !6, line: 1899, baseType: !7, size: 32, offset: 2048)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !300, file: !6, line: 1900, baseType: !7, size: 32, offset: 2080)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !300, file: !6, line: 1902, baseType: !381, size: 1472, offset: 2112)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !6, line: 169, size: 1472, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !381, file: !6, line: 170, baseType: !348, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !381, file: !6, line: 171, baseType: !348, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !381, file: !6, line: 172, baseType: !348, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !381, file: !6, line: 173, baseType: !348, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !381, file: !6, line: 174, baseType: !348, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !381, file: !6, line: 175, baseType: !348, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !381, file: !6, line: 176, baseType: !348, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !381, file: !6, line: 177, baseType: !348, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !381, file: !6, line: 178, baseType: !348, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !381, file: !6, line: 179, baseType: !348, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !381, file: !6, line: 180, baseType: !348, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !381, file: !6, line: 181, baseType: !348, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !381, file: !6, line: 182, baseType: !348, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !381, file: !6, line: 183, baseType: !348, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !381, file: !6, line: 184, baseType: !348, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !381, file: !6, line: 185, baseType: !348, size: 64, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !381, file: !6, line: 186, baseType: !348, size: 64, offset: 1024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !381, file: !6, line: 187, baseType: !348, size: 64, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !381, file: !6, line: 188, baseType: !348, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !381, file: !6, line: 189, baseType: !348, size: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !381, file: !6, line: 190, baseType: !348, size: 64, offset: 1280)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !381, file: !6, line: 191, baseType: !348, size: 64, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !381, file: !6, line: 192, baseType: !348, size: 64, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !300, file: !6, line: 1904, baseType: !407, size: 64, offset: 3584)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !408, line: 13, baseType: !409)
!408 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !313, line: 175, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 173, size: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !410, file: !313, line: 174, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !368, line: 22, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !370, line: 30, baseType: !415)
!415 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !300, file: !6, line: 1905, baseType: !407, size: 64, offset: 3648)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !300, file: !6, line: 1906, baseType: !407, size: 64, offset: 3712)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !300, file: !6, line: 1909, baseType: !419, size: 32, offset: 3776)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !313, line: 168, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 166, size: 32, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !420, file: !313, line: 167, baseType: !7, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !300, file: !6, line: 1910, baseType: !419, size: 32, offset: 3808)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !300, file: !6, line: 1913, baseType: !425, size: 64, offset: 3840)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !6, line: 1913, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !300, file: !6, line: 1914, baseType: !429, size: 64, offset: 3904)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !6, line: 1914, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !300, file: !6, line: 1916, baseType: !432, size: 64, offset: 3968)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !6, line: 1283, size: 4416, elements: !435)
!435 = !{!436, !440, !444, !445, !446, !609, !613, !618, !622, !623, !628, !629, !752, !757, !761, !767, !771, !803, !811, !815, !820, !824, !825, !831, !835, !839, !843, !844, !866, !870, !885, !896, !900, !909, !913, !914, !918, !977, !981, !985, !989, !993, !1000, !1004, !1022, !1026, !1075, !1079, !1084, !1088, !1092, !1096, !1106, !1107, !1116, !1122, !1123, !1127, !1131, !1135, !1139, !1140, !1144, !1145, !5518, !5538, !5542, !5548, !5554}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !434, file: !6, line: 1284, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!7, !326}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !434, file: !6, line: 1285, baseType: !441, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !326}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !434, file: !6, line: 1286, baseType: !437, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !434, file: !6, line: 1287, baseType: !437, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !434, file: !6, line: 1288, baseType: !447, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !451, !326}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !6, line: 120, baseType: !5)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !453, line: 713, size: 1600, elements: !454)
!453 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!454 = !{!455, !477, !485, !492, !496, !508, !509, !510, !513, !514, !515, !521, !522, !523, !524, !525, !526, !527, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !567, !568, !569, !570, !572, !573, !578, !583, !588, !589, !590, !591, !592, !593, !594, !595, !596, !598, !599, !601, !602, !603}
!455 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 714, baseType: !456, size: 192)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 714, size: 192, elements: !457)
!457 = !{!458, !468, !476}
!458 = !DIDerivedType(tag: DW_TAG_member, scope: !456, file: !453, line: 715, baseType: !459, size: 192)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !453, line: 715, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !453, line: 717, baseType: !451, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !453, line: 718, baseType: !451, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !459, file: !453, line: 720, baseType: !464, size: 64, offset: 128)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !459, file: !453, line: 720, size: 64, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !464, file: !453, line: 721, baseType: !326, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !464, file: !453, line: 726, baseType: !348, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !456, file: !453, line: 729, baseType: !469, size: 192, align: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !470, line: 24, size: 192, align: 64, elements: !471)
!470 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!471 = !{!472, !473, !475}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !469, file: !470, line: 25, baseType: !348, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !469, file: !470, line: 26, baseType: !474, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !469, file: !470, line: 27, baseType: !474, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !456, file: !453, line: 730, baseType: !320, size: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 733, baseType: !478, size: 64, offset: 192)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 733, size: 64, elements: !479)
!479 = !{!480, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !478, file: !453, line: 734, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !483, line: 124, flags: DIFlagFwdDecl)
!483 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !478, file: !453, line: 735, baseType: !7, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 738, baseType: !486, size: 64, offset: 256)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 738, size: 64, elements: !487)
!487 = !{!488, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !486, file: !453, line: 739, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !490, line: 29, baseType: !413)
!490 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !486, file: !453, line: 740, baseType: !367, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !452, file: !453, line: 748, baseType: !493, size: 384, align: 64, offset: 320)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 384, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 48)
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 750, baseType: !497, size: 128, offset: 704)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 750, size: 128, elements: !498)
!498 = !{!499, !507}
!499 = !DIDerivedType(tag: DW_TAG_member, scope: !497, file: !453, line: 751, baseType: !500, size: 128)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !453, line: 751, size: 128, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !500, file: !453, line: 752, baseType: !348, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !500, file: !453, line: 753, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !451}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !497, file: !453, line: 755, baseType: !320, size: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !452, file: !453, line: 761, baseType: !13, size: 32, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !452, file: !453, line: 762, baseType: !13, size: 32, offset: 864)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !452, file: !453, line: 763, baseType: !511, size: 16, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !370, line: 24, baseType: !512)
!512 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !452, file: !453, line: 764, baseType: !511, size: 16, offset: 912)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !452, file: !453, line: 769, baseType: !511, size: 16, offset: 928)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !452, file: !453, line: 780, baseType: !516, offset: 944)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, elements: !519)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !370, line: 21, baseType: !518)
!518 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!519 = !{!520}
!520 = !DISubrange(count: 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !452, file: !453, line: 782, baseType: !517, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !452, file: !453, line: 783, baseType: !517, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !452, file: !453, line: 784, baseType: !517, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !452, file: !453, line: 785, baseType: !517, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !452, file: !453, line: 786, baseType: !517, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !452, file: !453, line: 787, baseType: !517, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !452, file: !453, line: 795, baseType: !528, offset: 960)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, elements: !519)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !370, line: 27, baseType: !13)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !452, file: !453, line: 807, baseType: !516, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !452, file: !453, line: 809, baseType: !517, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !452, file: !453, line: 810, baseType: !517, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !452, file: !453, line: 811, baseType: !517, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !452, file: !453, line: 812, baseType: !517, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !452, file: !453, line: 813, baseType: !517, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !452, file: !453, line: 815, baseType: !517, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !452, file: !453, line: 816, baseType: !517, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !452, file: !453, line: 817, baseType: !517, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !452, file: !453, line: 818, baseType: !517, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !452, file: !453, line: 819, baseType: !517, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !452, file: !453, line: 821, baseType: !517, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !452, file: !453, line: 822, baseType: !517, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !452, file: !453, line: 823, baseType: !517, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !452, file: !453, line: 832, baseType: !516, offset: 976)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !452, file: !453, line: 834, baseType: !517, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !452, file: !453, line: 835, baseType: !517, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !452, file: !453, line: 836, baseType: !517, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !452, file: !453, line: 837, baseType: !517, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !452, file: !453, line: 838, baseType: !517, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !452, file: !453, line: 840, baseType: !517, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !452, file: !453, line: 843, baseType: !517, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !452, file: !453, line: 844, baseType: !517, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !452, file: !453, line: 845, baseType: !517, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !452, file: !453, line: 847, baseType: !517, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !452, file: !453, line: 848, baseType: !517, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!556 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 866, baseType: !557, size: 32, offset: 992)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 866, size: 32, elements: !558)
!558 = !{!559, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !557, file: !453, line: 867, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !561, line: 37, baseType: !529)
!561 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!562 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !453, line: 868, baseType: !563, size: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !557, file: !453, line: 868, size: 32, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !563, file: !453, line: 869, baseType: !511, size: 16)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !563, file: !453, line: 870, baseType: !511, size: 16, offset: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !452, file: !453, line: 873, baseType: !529, size: 32, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !452, file: !453, line: 874, baseType: !7, size: 32, offset: 1056)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !452, file: !453, line: 875, baseType: !529, size: 32, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !452, file: !453, line: 876, baseType: !571, size: 16, offset: 1120)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !561, line: 30, baseType: !511)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !452, file: !453, line: 877, baseType: !511, size: 16, offset: 1136)
!573 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 879, baseType: !574, size: 32, offset: 1152)
!574 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 879, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !574, file: !453, line: 880, baseType: !13, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !574, file: !453, line: 881, baseType: !13, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 888, baseType: !579, size: 32, offset: 1184)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 888, size: 32, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !579, file: !453, line: 889, baseType: !529, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !579, file: !453, line: 890, baseType: !529, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !453, line: 893, baseType: !584, size: 16, offset: 1216)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !453, line: 893, size: 16, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !584, file: !453, line: 894, baseType: !571, size: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !584, file: !453, line: 895, baseType: !517, size: 8)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !452, file: !453, line: 898, baseType: !511, size: 16, offset: 1232)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !452, file: !453, line: 899, baseType: !511, size: 16, offset: 1248)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !452, file: !453, line: 900, baseType: !511, size: 16, offset: 1264)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !452, file: !453, line: 902, baseType: !571, size: 16, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !452, file: !453, line: 903, baseType: !511, size: 16, offset: 1296)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !452, file: !453, line: 904, baseType: !511, size: 16, offset: 1312)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !452, file: !453, line: 905, baseType: !511, size: 16, offset: 1328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !452, file: !453, line: 908, baseType: !528, offset: 1344)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !452, file: !453, line: 912, baseType: !597, size: 32, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !453, line: 606, baseType: !13)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !452, file: !453, line: 913, baseType: !597, size: 32, offset: 1376)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !452, file: !453, line: 914, baseType: !600, size: 64, offset: 1408)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !453, line: 915, baseType: !600, size: 64, offset: 1472)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !452, file: !453, line: 916, baseType: !13, size: 32, offset: 1536)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !452, file: !453, line: 917, baseType: !604, size: 32, offset: 1568)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !605, line: 113, baseType: !606)
!605 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !605, line: 111, size: 32, elements: !607)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !606, file: !605, line: 112, baseType: !419, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !434, file: !6, line: 1290, baseType: !610, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!365, !451, !326, !365}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !434, file: !6, line: 1293, baseType: !614, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !326, !451, !326}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !368, line: 19, baseType: !511)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !434, file: !6, line: 1296, baseType: !619, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !326, !7}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !434, file: !6, line: 1298, baseType: !441, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !434, file: !6, line: 1299, baseType: !624, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!7, !326, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !434, file: !6, line: 1301, baseType: !437, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !434, file: !6, line: 1302, baseType: !630, size: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!7, !326, !633, !7}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !635, line: 234, size: 320, elements: !636)
!635 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!636 = !{!637, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !634, file: !635, line: 239, baseType: !638, size: 128)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !635, line: 236, size: 128, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !638, file: !635, line: 238, baseType: !303, size: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !634, file: !635, line: 255, baseType: !642, size: 192, offset: 128)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !635, line: 241, size: 192, elements: !643)
!643 = !{!644, !656, !657, !658, !659, !660, !662, !663, !664, !673, !674, !675, !676}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !642, file: !635, line: 242, baseType: !645, size: 128)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !646, line: 32, size: 128, elements: !647)
!646 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!647 = !{!648, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !645, file: !646, line: 33, baseType: !649, size: 16)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !646, line: 26, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !651, line: 10, baseType: !512)
!651 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !645, file: !646, line: 34, baseType: !653, size: 112, offset: 16)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 112, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 14)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !642, file: !635, line: 243, baseType: !645, size: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !642, file: !635, line: 244, baseType: !645, size: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !642, file: !635, line: 245, baseType: !645, size: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !642, file: !635, line: 246, baseType: !645, size: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !642, file: !635, line: 247, baseType: !661, size: 16)
!661 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !642, file: !635, line: 248, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !642, file: !635, line: 249, baseType: !7, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !642, file: !635, line: 250, baseType: !665, size: 192)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !635, line: 196, size: 192, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !665, file: !635, line: 197, baseType: !348, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !665, file: !635, line: 198, baseType: !348, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !665, file: !635, line: 199, baseType: !512, size: 16, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !665, file: !635, line: 200, baseType: !518, size: 8, offset: 144)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !665, file: !635, line: 201, baseType: !518, size: 8, offset: 152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !665, file: !635, line: 202, baseType: !518, size: 8, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !642, file: !635, line: 251, baseType: !303, size: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !642, file: !635, line: 252, baseType: !303, size: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !642, file: !635, line: 253, baseType: !627, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !642, file: !635, line: 254, baseType: !677, size: 128)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !635, line: 207, size: 128, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !635, line: 208, baseType: !13, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !677, file: !635, line: 209, baseType: !13, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !677, file: !635, line: 222, baseType: !682, size: 64, offset: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !677, file: !635, line: 210, size: 64, elements: !683)
!683 = !{!684, !692, !699, !711, !717, !724, !735, !743}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !682, file: !635, line: 212, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !687, line: 56, baseType: !688)
!687 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 53, size: 32, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !688, file: !687, line: 54, baseType: !512, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !688, file: !687, line: 55, baseType: !512, size: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !682, file: !635, line: 213, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !687, line: 80, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 77, size: 64, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !695, file: !687, line: 78, baseType: !13, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !695, file: !687, line: 79, baseType: !13, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !682, file: !635, line: 214, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !687, line: 66, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 58, size: 192, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !702, file: !687, line: 59, baseType: !13, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !702, file: !687, line: 60, baseType: !13, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !702, file: !687, line: 61, baseType: !13, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !702, file: !687, line: 62, baseType: !13, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !702, file: !687, line: 63, baseType: !13, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !702, file: !687, line: 64, baseType: !512, size: 16, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !702, file: !687, line: 65, baseType: !512, size: 16, offset: 176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !682, file: !635, line: 215, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !687, line: 70, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 68, size: 32, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !714, file: !687, line: 69, baseType: !13, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !682, file: !635, line: 216, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !687, line: 75, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 72, size: 160, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !720, file: !687, line: 73, baseType: !13, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !720, file: !687, line: 74, baseType: !303, size: 128, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !682, file: !635, line: 217, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !687, line: 89, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 82, size: 192, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !727, file: !687, line: 83, baseType: !512, size: 16)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !727, file: !687, line: 84, baseType: !13, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !727, file: !687, line: 85, baseType: !13, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !727, file: !687, line: 86, baseType: !13, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !727, file: !687, line: 87, baseType: !13, size: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !727, file: !687, line: 88, baseType: !13, size: 32, offset: 160)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !682, file: !635, line: 220, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !687, line: 44, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 40, size: 96, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !738, file: !687, line: 41, baseType: !13, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !738, file: !687, line: 42, baseType: !13, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !738, file: !687, line: 43, baseType: !512, size: 16, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !682, file: !635, line: 221, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !687, line: 51, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 46, size: 128, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !746, file: !687, line: 47, baseType: !13, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !746, file: !687, line: 48, baseType: !13, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !746, file: !687, line: 49, baseType: !512, size: 16, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !746, file: !687, line: 50, baseType: !13, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !434, file: !6, line: 1304, baseType: !753, size: 64, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!7, !326, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !434, file: !6, line: 1306, baseType: !758, size: 64, offset: 832)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!7, !326, !7}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !434, file: !6, line: 1308, baseType: !762, size: 64, offset: 896)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!7, !326, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !6, line: 206, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !434, file: !6, line: 1310, baseType: !768, size: 64, offset: 960)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !326, !13}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !434, file: !6, line: 1313, baseType: !772, size: 64, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !326, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !777, line: 214, size: 1536, elements: !778)
!777 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !776, file: !777, line: 215, baseType: !369, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !776, file: !777, line: 216, baseType: !369, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !776, file: !777, line: 217, baseType: !369, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !776, file: !777, line: 218, baseType: !369, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !776, file: !777, line: 219, baseType: !369, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !776, file: !777, line: 220, baseType: !369, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !776, file: !777, line: 221, baseType: !369, size: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !776, file: !777, line: 222, baseType: !369, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !776, file: !777, line: 223, baseType: !369, size: 64, offset: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !776, file: !777, line: 224, baseType: !369, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !776, file: !777, line: 227, baseType: !369, size: 64, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !776, file: !777, line: 228, baseType: !369, size: 64, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !776, file: !777, line: 229, baseType: !369, size: 64, offset: 768)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !776, file: !777, line: 230, baseType: !369, size: 64, offset: 832)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !776, file: !777, line: 231, baseType: !369, size: 64, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !776, file: !777, line: 232, baseType: !369, size: 64, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !776, file: !777, line: 235, baseType: !369, size: 64, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !776, file: !777, line: 236, baseType: !369, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !776, file: !777, line: 237, baseType: !369, size: 64, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !776, file: !777, line: 238, baseType: !369, size: 64, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !776, file: !777, line: 239, baseType: !369, size: 64, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !776, file: !777, line: 242, baseType: !369, size: 64, offset: 1344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !776, file: !777, line: 243, baseType: !369, size: 64, offset: 1408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !776, file: !777, line: 244, baseType: !369, size: 64, offset: 1472)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !434, file: !6, line: 1315, baseType: !804, size: 64, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !809, !7}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !313, line: 30, baseType: !808)
!808 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !434, file: !6, line: 1316, baseType: !812, size: 64, offset: 1152)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!7, !7, !809, !627}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !434, file: !6, line: 1319, baseType: !816, size: 64, offset: 1216)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !326}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !434, file: !6, line: 1321, baseType: !821, size: 64, offset: 1280)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!7, !326, !571, !617}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !434, file: !6, line: 1323, baseType: !821, size: 64, offset: 1344)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !434, file: !6, line: 1331, baseType: !826, size: 64, offset: 1408)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!7, !326, !7, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !368, line: 17, baseType: !517)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !434, file: !6, line: 1333, baseType: !832, size: 64, offset: 1472)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!7, !326, !7, !617, !830, !571}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !434, file: !6, line: 1336, baseType: !836, size: 64, offset: 1536)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!7, !326, !7, !7, !7}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !434, file: !6, line: 1339, baseType: !840, size: 64, offset: 1600)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!7, !326, !7, !807}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !434, file: !6, line: 1341, baseType: !840, size: 64, offset: 1664)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !434, file: !6, line: 1343, baseType: !845, size: 64, offset: 1728)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!7, !326, !7, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !850, line: 20, size: 576, elements: !851)
!850 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!851 = !{!852, !853, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !849, file: !850, line: 21, baseType: !529, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !849, file: !850, line: 22, baseType: !854, size: 256, offset: 32)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 256, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !849, file: !850, line: 23, baseType: !529, size: 32, offset: 288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !849, file: !850, line: 24, baseType: !529, size: 32, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !849, file: !850, line: 25, baseType: !529, size: 32, offset: 352)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !849, file: !850, line: 26, baseType: !529, size: 32, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !849, file: !850, line: 27, baseType: !529, size: 32, offset: 416)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !849, file: !850, line: 28, baseType: !529, size: 32, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !849, file: !850, line: 29, baseType: !529, size: 32, offset: 480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !849, file: !850, line: 30, baseType: !529, size: 32, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !849, file: !850, line: 31, baseType: !571, size: 16, offset: 544)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !434, file: !6, line: 1346, baseType: !867, size: 64, offset: 1792)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!7, !326, !7, !7}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !434, file: !6, line: 1348, baseType: !871, size: 64, offset: 1856)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!7, !326, !7, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !850, line: 9, size: 512, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !875, file: !850, line: 10, baseType: !369, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !875, file: !850, line: 11, baseType: !369, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !875, file: !850, line: 12, baseType: !369, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !875, file: !850, line: 13, baseType: !369, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !875, file: !850, line: 14, baseType: !369, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !875, file: !850, line: 15, baseType: !369, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !875, file: !850, line: 16, baseType: !369, size: 64, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !875, file: !850, line: 17, baseType: !369, size: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !434, file: !6, line: 1352, baseType: !886, size: 64, offset: 1920)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!7, !326, !7, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !892, line: 213, size: 32, elements: !893)
!892 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !891, file: !892, line: 214, baseType: !511, size: 16)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !891, file: !892, line: 215, baseType: !511, size: 16, offset: 16)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !434, file: !6, line: 1355, baseType: !897, size: 64, offset: 1984)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!7, !326, !7, !451}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !434, file: !6, line: 1357, baseType: !901, size: 64, offset: 2048)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!7, !326, !7, !904, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !777, line: 956, size: 128, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !905, file: !777, line: 957, baseType: !529, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !905, file: !777, line: 958, baseType: !369, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !434, file: !6, line: 1361, baseType: !910, size: 64, offset: 2112)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!7, !326, !7, !367, !7}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !434, file: !6, line: 1364, baseType: !840, size: 64, offset: 2176)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !434, file: !6, line: 1367, baseType: !915, size: 64, offset: 2240)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!7, !326, !12, !627}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !434, file: !6, line: 1400, baseType: !919, size: 64, offset: 2304)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!7, !326, !326, !922}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !924, line: 75, size: 384, elements: !925)
!924 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!925 = !{!926, !927, !930, !972, !976}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !923, file: !924, line: 76, baseType: !328, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !923, file: !924, line: 77, baseType: !928, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !923, file: !924, line: 78, baseType: !931, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !934, line: 315, size: 128, elements: !935)
!934 = !DIFile(filename: "./include/net/netlink.h", directory: "/home/lizy2001/genbc/linux")
!935 = !{!936, !937, !938, !939}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !933, file: !934, line: 316, baseType: !830, size: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "validation_type", scope: !933, file: !934, line: 317, baseType: !830, size: 8, offset: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !933, file: !934, line: 318, baseType: !617, size: 16, offset: 16)
!939 = !DIDerivedType(tag: DW_TAG_member, scope: !933, file: !934, line: 319, baseType: !940, size: 64, offset: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !933, file: !934, line: 319, size: 64, elements: !941)
!941 = !{!942, !945, !946, !947, !948, !954, !960, !967, !971}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bitfield32_valid", scope: !940, file: !934, line: 320, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !368, line: 21, baseType: !529)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !940, file: !934, line: 321, baseType: !943, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "reject_message", scope: !940, file: !934, line: 322, baseType: !328, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nested_policy", scope: !940, file: !934, line: 323, baseType: !931, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !940, file: !934, line: 324, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_range_validation", file: !934, line: 189, size: 128, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !950, file: !934, line: 190, baseType: !367, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !950, file: !934, line: 190, baseType: !367, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "range_signed", scope: !940, file: !934, line: 325, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_range_validation_signed", file: !934, line: 193, size: 128, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !956, file: !934, line: 194, baseType: !413, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !956, file: !934, line: 194, baseType: !413, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, scope: !940, file: !934, line: 326, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !940, file: !934, line: 326, size: 32, elements: !962)
!962 = !{!963, !966}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !961, file: !934, line: 327, baseType: !964, size: 16)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !368, line: 18, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !370, line: 23, baseType: !661)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !961, file: !934, line: 327, baseType: !964, size: 16, offset: 16)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !940, file: !934, line: 329, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!7, !928, !922}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "strict_start_type", scope: !940, file: !934, line: 349, baseType: !617, size: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !923, file: !924, line: 79, baseType: !973, size: 160, offset: 192)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 160, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 20)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !923, file: !924, line: 80, baseType: !830, size: 8, offset: 352)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !434, file: !6, line: 1403, baseType: !978, size: 64, offset: 2368)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!7, !326, !326}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !434, file: !6, line: 1405, baseType: !982, size: 64, offset: 2432)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!326, !326, !451, !807}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !434, file: !6, line: 1408, baseType: !986, size: 64, offset: 2496)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!365, !326, !365}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !434, file: !6, line: 1410, baseType: !990, size: 64, offset: 2560)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!7, !326, !365}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !434, file: !6, line: 1412, baseType: !994, size: 64, offset: 2624)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!7, !326, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !999, line: 35, flags: DIFlagFwdDecl)
!999 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !434, file: !6, line: 1414, baseType: !1001, size: 64, offset: 2688)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !326, !997}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !434, file: !6, line: 1417, baseType: !1005, size: 64, offset: 2752)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!7, !1008, !889, !326, !1020, !617, !617, !922}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1010, line: 8, size: 96, elements: !1011)
!1010 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1011 = !{!1012, !1013, !1014, !1015, !1017, !1018, !1019}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1009, file: !1010, line: 9, baseType: !517, size: 8)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1009, file: !1010, line: 10, baseType: !517, size: 8, offset: 8)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1009, file: !1010, line: 11, baseType: !511, size: 16, offset: 16)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1009, file: !1010, line: 12, baseType: !1016, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !370, line: 26, baseType: !7)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1009, file: !1010, line: 13, baseType: !511, size: 16, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1009, file: !1010, line: 14, baseType: !517, size: 8, offset: 80)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1009, file: !1010, line: 15, baseType: !517, size: 8, offset: 88)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !434, file: !6, line: 1424, baseType: !1023, size: 64, offset: 2816)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!7, !1008, !889, !326, !1020, !617}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !434, file: !6, line: 1429, baseType: !1027, size: 64, offset: 2880)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!7, !451, !1030, !326, !326, !1074}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !924, line: 203, size: 1024, elements: !1032)
!1032 = !{!1033, !1034, !1044, !1048, !1052, !1053, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1031, file: !924, line: 204, baseType: !451, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1031, file: !924, line: 205, baseType: !1035, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !892, line: 44, size: 128, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1037, file: !892, line: 45, baseType: !529, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1037, file: !892, line: 46, baseType: !511, size: 16, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1037, file: !892, line: 47, baseType: !511, size: 16, offset: 48)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1037, file: !892, line: 48, baseType: !529, size: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1037, file: !892, line: 49, baseType: !529, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1031, file: !924, line: 206, baseType: !1045, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!7, !451, !1030}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1031, file: !924, line: 208, baseType: !1049, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!7, !1030}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1031, file: !924, line: 209, baseType: !627, size: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1031, file: !924, line: 211, baseType: !1054, size: 64, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1056, line: 76, flags: DIFlagFwdDecl)
!1056 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1031, file: !924, line: 212, baseType: !922, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1031, file: !924, line: 213, baseType: !617, size: 16, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1031, file: !924, line: 214, baseType: !617, size: 16, offset: 464)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1031, file: !924, line: 215, baseType: !944, size: 32, offset: 480)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1031, file: !924, line: 216, baseType: !13, size: 32, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1031, file: !924, line: 216, baseType: !13, size: 32, offset: 544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1031, file: !924, line: 217, baseType: !807, size: 8, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, scope: !1031, file: !924, line: 218, baseType: !1065, size: 384, offset: 640)
!1065 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1031, file: !924, line: 218, size: 384, elements: !1066)
!1066 = !{!1067, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1065, file: !924, line: 219, baseType: !1068, size: 384)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 384, elements: !494)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1065, file: !924, line: 224, baseType: !1070, size: 384)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1071, size: 384, elements: !1072)
!1071 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1072 = !{!1073}
!1073 = !DISubrange(count: 6)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !434, file: !6, line: 1434, baseType: !1076, size: 64, offset: 2944)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!7, !451, !889, !326, !1020, !617, !944, !944, !922}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !434, file: !6, line: 1440, baseType: !1080, size: 64, offset: 3008)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!7, !326, !1083, !617, !922}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !434, file: !6, line: 1444, baseType: !1085, size: 64, offset: 3072)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!7, !451, !944, !944, !326, !944, !7}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !434, file: !6, line: 1449, baseType: !1089, size: 64, offset: 3136)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!7, !326, !1083, !617}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !434, file: !6, line: 1452, baseType: !1093, size: 64, offset: 3200)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!7, !326, !807}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !434, file: !6, line: 1454, baseType: !1097, size: 64, offset: 3264)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!7, !326, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !6, line: 820, size: 264, elements: !1102)
!1102 = !{!1103, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1101, file: !6, line: 821, baseType: !1104, size: 256)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 256, elements: !855)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1101, file: !6, line: 822, baseType: !518, size: 8, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !434, file: !6, line: 1456, baseType: !1097, size: 64, offset: 3328)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !434, file: !6, line: 1458, baseType: !1108, size: 64, offset: 3392)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!7, !326, !1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 55, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1114, line: 72, baseType: !1115)
!1114 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1114, line: 16, baseType: !348)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !434, file: !6, line: 1460, baseType: !1117, size: 64, offset: 3456)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !326, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !6, line: 67, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !434, file: !6, line: 1462, baseType: !1117, size: 64, offset: 3520)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !434, file: !6, line: 1464, baseType: !1124, size: 64, offset: 3584)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!627, !326, !326}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !434, file: !6, line: 1466, baseType: !1128, size: 64, offset: 3648)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !326, !627}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !434, file: !6, line: 1469, baseType: !1132, size: 64, offset: 3712)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!7, !326, !7, !944}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !434, file: !6, line: 1472, baseType: !1136, size: 64, offset: 3776)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!7, !809}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !434, file: !6, line: 1473, baseType: !1093, size: 64, offset: 3840)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !434, file: !6, line: 1475, baseType: !1141, size: 64, offset: 3904)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!7, !326, !451}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !434, file: !6, line: 1477, baseType: !619, size: 64, offset: 3968)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !434, file: !6, line: 1479, baseType: !1146, size: 64, offset: 4032)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!7, !326, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !6, line: 894, size: 256, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1150, file: !6, line: 895, baseType: !33, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, scope: !1150, file: !6, line: 896, baseType: !1154, size: 192, offset: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1150, file: !6, line: 896, size: 192, elements: !1155)
!1155 = !{!1156, !1165, !5511}
!1156 = !DIDerivedType(tag: DW_TAG_member, scope: !1154, file: !6, line: 898, baseType: !1157, size: 192)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1154, file: !6, line: 898, size: 192, elements: !1158)
!1158 = !{!1159, !1160, !1164}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1157, file: !6, line: 899, baseType: !944, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1157, file: !6, line: 900, baseType: !1161, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1163, line: 11, flags: DIFlagFwdDecl)
!1163 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1157, file: !6, line: 901, baseType: !922, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, scope: !1154, file: !6, line: 904, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1154, file: !6, line: 904, size: 64, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1166, file: !6, line: 905, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !95, line: 222, size: 2560, elements: !1171)
!1171 = !{!1172, !5490, !5491, !5509, !5510}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1170, file: !95, line: 223, baseType: !1173, size: 2048)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !95, line: 141, size: 2048, elements: !1174)
!1174 = !{!1175, !5464, !5465, !5466, !5467, !5468, !5469, !5470, !5471, !5472, !5473, !5474, !5475, !5476, !5481, !5482, !5483, !5484, !5485, !5486, !5487, !5488, !5489}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1173, file: !95, line: 145, baseType: !1176, size: 64, align: 512)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !95, line: 54, size: 2368, elements: !1179)
!1179 = !{!1180, !1379, !1384, !5136, !5140, !5144, !5145, !5149, !5155, !5156, !5157, !5158, !5159, !5163, !5167, !5171, !5172, !5173, !5177, !5178, !5190, !5194, !5198, !5210, !5399, !5403, !5407, !5412, !5416, !5420, !5424, !5430, !5434, !5441, !5445, !5447, !5448}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1178, file: !95, line: 56, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!7, !1184}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !126, line: 483, size: 960, align: 64, elements: !1186)
!1186 = !{!1187, !1203, !1214, !1225, !1249, !1255, !1263, !1280, !1293, !1299, !1308, !1313, !1321, !1333, !1353, !1360, !1364, !1368, !1373}
!1187 = !DIDerivedType(tag: DW_TAG_member, scope: !1185, file: !126, line: 484, baseType: !1188, size: 512)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1185, file: !126, line: 484, size: 512, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1188, file: !126, line: 485, baseType: !529, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1188, file: !126, line: 486, baseType: !529, size: 32, offset: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1188, file: !126, line: 487, baseType: !529, size: 32, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1188, file: !126, line: 488, baseType: !529, size: 32, offset: 96)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1188, file: !126, line: 489, baseType: !529, size: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1188, file: !126, line: 492, baseType: !529, size: 32, offset: 160)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1188, file: !126, line: 493, baseType: !529, size: 32, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1188, file: !126, line: 496, baseType: !303, size: 128, offset: 224)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1188, file: !126, line: 497, baseType: !529, size: 32, offset: 352)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1188, file: !126, line: 498, baseType: !529, size: 32, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1188, file: !126, line: 499, baseType: !529, size: 32, offset: 416)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1188, file: !126, line: 500, baseType: !529, size: 32, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1188, file: !126, line: 501, baseType: !529, size: 32, offset: 480)
!1203 = !DIDerivedType(tag: DW_TAG_member, scope: !1185, file: !126, line: 507, baseType: !1204, size: 256)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1185, file: !126, line: 507, size: 256, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1213}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1204, file: !126, line: 508, baseType: !529, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1204, file: !126, line: 509, baseType: !369, size: 64, align: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, scope: !1204, file: !126, line: 510, baseType: !1209, size: 64, offset: 128)
!1209 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1204, file: !126, line: 510, size: 64, elements: !1210)
!1210 = !{!1211, !1212}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1209, file: !126, line: 511, baseType: !369, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1209, file: !126, line: 512, baseType: !369, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1204, file: !126, line: 514, baseType: !369, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1185, file: !126, line: 532, baseType: !1215, size: 448)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1185, file: !126, line: 517, size: 448, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1215, file: !126, line: 518, baseType: !369, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1215, file: !126, line: 521, baseType: !369, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1215, file: !126, line: 522, baseType: !369, size: 64, align: 64, offset: 128)
