; ModuleID = '../bcout/drivers/leds/leds-netxbig.llvm.bc'
source_filename = "drivers/leds/leds-netxbig.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_netxbig_led_driver_init6:\09\09\09"
module asm ".long\09netxbig_led_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netxbig_led_mode", file: !3, line: 28, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "NETXBIG_LED_OFF", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "NETXBIG_LED_ON", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "NETXBIG_LED_SATA", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "NETXBIG_LED_TIMER1", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "NETXBIG_LED_TIMER2", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "NETXBIG_LED_MODE_NUM", value: 5, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "led_brightness", file: !59, line: 29, baseType: !7, size: 32, elements: !60)
!59 = !DIFile(filename: "./include/linux/leds.h", directory: "/home/lizy2001/genbc/linux")
!60 = !{!61, !62, !63, !64}
!61 = !DIEnumerator(name: "LED_OFF", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "LED_ON", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "LED_HALF", value: 127, isUnsigned: true)
!64 = !DIEnumerator(name: "LED_FULL", value: 255, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpiod_flags", file: !66, line: 49, baseType: !7, size: 32, elements: !67)
!66 = !DIFile(filename: "./include/linux/gpio/consumer.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIEnumerator(name: "GPIOD_ASIS", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "GPIOD_IN", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "GPIOD_OUT_LOW", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "GPIOD_OUT_HIGH", value: 7, isUnsigned: true)
!72 = !DIEnumerator(name: "GPIOD_OUT_LOW_OPEN_DRAIN", value: 11, isUnsigned: true)
!73 = !DIEnumerator(name: "GPIOD_OUT_HIGH_OPEN_DRAIN", value: 15, isUnsigned: true)
!74 = !{!75, !78, !80, !81, !82, !83, !2150}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !77, line: 76, flags: DIFlagFwdDecl)
!77 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !79, line: 148, baseType: !7)
!79 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netxbig_led_data", file: !3, line: 107, size: 2496, elements: !85)
!85 = !{!86, !99, !2136, !2137, !2138, !2139, !2146, !2147, !2148, !2149}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "gpio_ext", scope: !84, file: !3, line: 108, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netxbig_gpio_ext", file: !3, line: 20, size: 320, elements: !89)
!89 = !{!90, !94, !96, !97, !98}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !88, file: !3, line: 21, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_desc", file: !66, line: 19, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_addr", scope: !88, file: !3, line: 22, baseType: !95, size: 32, offset: 64)
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !3, line: 23, baseType: !91, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "num_data", scope: !88, file: !3, line: 24, baseType: !95, size: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !88, file: !3, line: 25, baseType: !92, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cdev", scope: !84, file: !3, line: 109, baseType: !100, size: 2048, offset: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_classdev", file: !59, line: 64, size: 2048, elements: !101)
!101 = !{!102, !106, !107, !108, !109, !110, !115, !119, !123, !128, !141, !145, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2133, !2134, !2135}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !59, line: 65, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !100, file: !59, line: 66, baseType: !58, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "max_brightness", scope: !100, file: !59, line: 67, baseType: !58, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !59, line: 68, baseType: !95, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "work_flags", scope: !100, file: !59, line: 84, baseType: !81, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "brightness_set", scope: !100, file: !59, line: 97, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114, !58}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "brightness_set_blocking", scope: !100, file: !59, line: 103, baseType: !116, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!95, !114, !58}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "brightness_get", scope: !100, file: !59, line: 106, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!58, !114}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "blink_set", scope: !100, file: !59, line: 116, baseType: !124, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!95, !114, !127, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_set", scope: !100, file: !59, line: 120, baseType: !129, size: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!95, !114, !132, !136, !95}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_pattern", file: !59, line: 579, size: 64, elements: !134)
!134 = !{!135, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !133, file: !59, line: 580, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !137, line: 21, baseType: !138)
!137 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !139, line: 27, baseType: !7)
!139 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!140 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !133, file: !59, line: 581, baseType: !95, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_clear", scope: !100, file: !59, line: 122, baseType: !142, size: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!95, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !100, file: !59, line: 124, baseType: !146, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !148)
!148 = !{!149, !1647, !1648, !1651, !1652, !1703, !1797, !1798, !1799, !1800, !1801, !1810, !1915, !1928, !1932, !1933, !1937, !1939, !1940, !1941, !1945, !1951, !1952, !1955, !2070, !2071, !2074, !2075, !2076, !2077, !2109, !2110, !2111, !2114, !2117, !2118, !2119, !2120}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !147, file: !30, line: 462, baseType: !150, size: 512)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !151, line: 64, size: 512, elements: !152)
!151 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!152 = !{!153, !154, !160, !162, !222, !1484, !1637, !1642, !1643, !1644, !1645, !1646}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !151, line: 65, baseType: !103, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !150, file: !151, line: 66, baseType: !155, size: 128, offset: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !79, line: 178, size: 128, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !79, line: 179, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !79, line: 179, baseType: !158, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !150, file: !151, line: 67, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !150, file: !151, line: 68, baseType: !163, size: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !151, line: 192, size: 704, elements: !165)
!165 = !{!166, !167, !183, !184}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !164, file: !151, line: 193, baseType: !155, size: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !164, file: !151, line: 194, baseType: !168, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !169, line: 83, baseType: !170)
!169 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !169, line: 71, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 72, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 72, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !173, file: !169, line: 73, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !169, line: 20, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !176, file: !169, line: 21, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !180, line: 25, baseType: !181)
!180 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 25, elements: !182)
!182 = !{}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !164, file: !151, line: 195, baseType: !150, size: 512, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !164, file: !151, line: 196, baseType: !185, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !151, line: 156, size: 192, elements: !188)
!188 = !{!189, !194, !199}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !187, file: !151, line: 157, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!95, !163, !161}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !151, line: 158, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!103, !163, !161}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !187, file: !151, line: 159, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!95, !163, !161, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !151, line: 148, size: 20736, elements: !206)
!206 = !{!207, !212, !216, !217, !221}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !205, file: !151, line: 149, baseType: !208, size: 192)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 192, elements: !210)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !205, file: !151, line: 150, baseType: !213, size: 4096, offset: 192)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 4096, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !205, file: !151, line: 151, baseType: !95, size: 32, offset: 4288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !151, line: 152, baseType: !218, size: 16384, offset: 4320)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 16384, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 2048)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !205, file: !151, line: 153, baseType: !95, size: 32, offset: 20704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !150, file: !151, line: 69, baseType: !223, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !151, line: 138, size: 448, elements: !225)
!225 = !{!226, !230, !258, !260, !1432, !1463, !1467}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !224, file: !151, line: 139, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !161}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !224, file: !151, line: 140, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !234, line: 230, size: 128, elements: !235)
!234 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!235 = !{!236, !251}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !233, file: !234, line: 231, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !161, !244, !209}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !79, line: 60, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !242, line: 73, baseType: !243)
!242 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !242, line: 15, baseType: !82)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !234, line: 30, size: 128, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !234, line: 31, baseType: !103, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !245, file: !234, line: 32, baseType: !249, size: 16, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !79, line: 19, baseType: !250)
!250 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !233, file: !234, line: 232, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!240, !161, !244, !103, !255}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 55, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !242, line: 72, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !242, line: 16, baseType: !81)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !224, file: !151, line: 141, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !224, file: !151, line: 142, baseType: !261, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !234, line: 84, size: 320, elements: !265)
!265 = !{!266, !267, !271, !1429, !1430}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !234, line: 85, baseType: !103, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !264, file: !234, line: 86, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!249, !161, !244, !95}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !264, file: !234, line: 88, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!249, !161, !275, !95}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !234, line: 168, size: 448, elements: !277)
!277 = !{!278, !279, !280, !281, !291, !292}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !276, file: !234, line: 169, baseType: !245, size: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !276, file: !234, line: 170, baseType: !255, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !276, file: !234, line: 171, baseType: !80, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !276, file: !234, line: 172, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!240, !285, !161, !275, !209, !288, !255}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !287, line: 526, flags: DIFlagFwdDecl)
!287 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !79, line: 46, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !242, line: 88, baseType: !290)
!290 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !276, file: !234, line: 174, baseType: !282, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !276, file: !234, line: 176, baseType: !293, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!95, !285, !161, !275, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !298, line: 305, size: 1472, elements: !299)
!298 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!299 = !{!300, !301, !302, !303, !304, !312, !313, !1403, !1409, !1410, !1415, !1416, !1419, !1423, !1424, !1425, !1426, !1427}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !297, file: !298, line: 308, baseType: !81, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !297, file: !298, line: 309, baseType: !81, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !297, file: !298, line: 313, baseType: !296, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !297, file: !298, line: 313, baseType: !296, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !297, file: !298, line: 315, baseType: !305, size: 192, align: 64, offset: 256)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !306, line: 24, size: 192, align: 64, elements: !307)
!306 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!307 = !{!308, !309, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !305, file: !306, line: 25, baseType: !81, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !305, file: !306, line: 26, baseType: !310, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !305, file: !306, line: 27, baseType: !310, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !297, file: !298, line: 323, baseType: !81, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !297, file: !298, line: 327, baseType: !314, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !298, line: 388, size: 7296, elements: !316)
!316 = !{!317, !1399}
!317 = !DIDerivedType(tag: DW_TAG_member, scope: !315, file: !298, line: 389, baseType: !318, size: 7296)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !298, line: 389, size: 7296, elements: !319)
!319 = !{!320, !321, !325, !329, !333, !334, !335, !336, !337, !345, !350, !351, !352, !353, !362, !363, !364, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !399, !407, !410, !458, !459, !1369, !1370, !1373, !1377, !1378, !1381, !1382, !1383, !1386, !1398}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !318, file: !298, line: 390, baseType: !296, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !318, file: !298, line: 391, baseType: !322, size: 64, offset: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !306, line: 31, size: 64, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !322, file: !306, line: 32, baseType: !310, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !318, file: !298, line: 392, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !137, line: 23, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !139, line: 31, baseType: !328)
!328 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !318, file: !298, line: 394, baseType: !330, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!81, !285, !81, !81, !81, !81}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !318, file: !298, line: 398, baseType: !81, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !318, file: !298, line: 399, baseType: !81, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !318, file: !298, line: 405, baseType: !81, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !318, file: !298, line: 406, baseType: !81, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !318, file: !298, line: 407, baseType: !338, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !287, line: 286, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 286, size: 64, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !340, file: !287, line: 286, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !344, line: 18, baseType: !81)
!344 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !318, file: !298, line: 416, baseType: !346, size: 32, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !79, line: 168, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 166, size: 32, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !347, file: !79, line: 167, baseType: !95, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !318, file: !298, line: 428, baseType: !346, size: 32, offset: 608)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !318, file: !298, line: 437, baseType: !346, size: 32, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !318, file: !298, line: 447, baseType: !346, size: 32, offset: 672)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !318, file: !298, line: 450, baseType: !354, size: 64, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !355, line: 13, baseType: !356)
!355 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !79, line: 175, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 173, size: 64, elements: !358)
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !357, file: !79, line: 174, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !137, line: 22, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !139, line: 30, baseType: !290)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !318, file: !298, line: 452, baseType: !95, size: 32, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !318, file: !298, line: 454, baseType: !168, offset: 800)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !318, file: !298, line: 457, baseType: !365, size: 256, offset: 832)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !366, line: 35, size: 256, elements: !367)
!366 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!367 = !{!368, !369, !370, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !365, file: !366, line: 36, baseType: !354, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !365, file: !366, line: 42, baseType: !354, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !365, file: !366, line: 46, baseType: !371, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !169, line: 29, baseType: !176)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !365, file: !366, line: 47, baseType: !155, size: 128, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !318, file: !298, line: 459, baseType: !155, size: 128, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !318, file: !298, line: 466, baseType: !81, size: 64, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !318, file: !298, line: 467, baseType: !81, size: 64, offset: 1280)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !318, file: !298, line: 469, baseType: !81, size: 64, offset: 1344)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !318, file: !298, line: 470, baseType: !81, size: 64, offset: 1408)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !318, file: !298, line: 471, baseType: !356, size: 64, offset: 1472)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !318, file: !298, line: 472, baseType: !81, size: 64, offset: 1536)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !318, file: !298, line: 473, baseType: !81, size: 64, offset: 1600)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !318, file: !298, line: 474, baseType: !81, size: 64, offset: 1664)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !318, file: !298, line: 475, baseType: !81, size: 64, offset: 1728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !318, file: !298, line: 477, baseType: !168, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !318, file: !298, line: 478, baseType: !81, size: 64, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !318, file: !298, line: 478, baseType: !81, size: 64, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !318, file: !298, line: 478, baseType: !81, size: 64, offset: 1920)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !318, file: !298, line: 478, baseType: !81, size: 64, offset: 1984)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !318, file: !298, line: 479, baseType: !81, size: 64, offset: 2048)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !318, file: !298, line: 479, baseType: !81, size: 64, offset: 2112)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !318, file: !298, line: 479, baseType: !81, size: 64, offset: 2176)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !318, file: !298, line: 480, baseType: !81, size: 64, offset: 2240)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !318, file: !298, line: 480, baseType: !81, size: 64, offset: 2304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !318, file: !298, line: 480, baseType: !81, size: 64, offset: 2368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !318, file: !298, line: 480, baseType: !81, size: 64, offset: 2432)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !318, file: !298, line: 482, baseType: !396, size: 2816, offset: 2496)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2816, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 44)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !318, file: !298, line: 488, baseType: !400, size: 256, offset: 5312)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !401, line: 60, size: 256, elements: !402)
!401 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !400, file: !401, line: 61, baseType: !404, size: 256)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 256, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 4)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !318, file: !298, line: 490, baseType: !408, size: 64, offset: 5568)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !298, line: 490, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !318, file: !298, line: 493, baseType: !411, size: 896, offset: 5632)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !412, line: 53, baseType: !413)
!412 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 13, size: 896, elements: !414)
!414 = !{!415, !416, !417, !418, !421, !422, !429, !430, !450, !451, !454}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !413, file: !412, line: 18, baseType: !326, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !413, file: !412, line: 28, baseType: !356, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !413, file: !412, line: 31, baseType: !365, size: 256, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !413, file: !412, line: 32, baseType: !419, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !412, line: 32, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !413, file: !412, line: 37, baseType: !250, size: 16, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !413, file: !412, line: 40, baseType: !423, size: 192, offset: 512)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !424, line: 53, size: 192, elements: !425)
!424 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !423, file: !424, line: 54, baseType: !354, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !423, file: !424, line: 55, baseType: !168, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !423, file: !424, line: 59, baseType: !155, size: 128, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !413, file: !412, line: 41, baseType: !80, size: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !413, file: !412, line: 42, baseType: !431, size: 64, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !434, line: 13, size: 896, elements: !435)
!434 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !433, file: !434, line: 14, baseType: !80, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !434, line: 15, baseType: !81, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !433, file: !434, line: 17, baseType: !81, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !433, file: !434, line: 17, baseType: !81, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !433, file: !434, line: 19, baseType: !82, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !433, file: !434, line: 21, baseType: !82, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !433, file: !434, line: 22, baseType: !82, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !433, file: !434, line: 23, baseType: !82, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !433, file: !434, line: 24, baseType: !82, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !433, file: !434, line: 25, baseType: !82, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !433, file: !434, line: 26, baseType: !82, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !433, file: !434, line: 27, baseType: !82, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !433, file: !434, line: 28, baseType: !82, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !433, file: !434, line: 29, baseType: !82, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !413, file: !412, line: 44, baseType: !346, size: 32, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !413, file: !412, line: 50, baseType: !452, size: 16, offset: 864)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !137, line: 19, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !139, line: 24, baseType: !250)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !413, file: !412, line: 51, baseType: !455, size: 16, offset: 880)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !137, line: 18, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !139, line: 23, baseType: !457)
!457 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !298, line: 495, baseType: !81, size: 64, offset: 6528)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !318, file: !298, line: 497, baseType: !460, size: 64, offset: 6592)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !298, line: 381, size: 384, elements: !462)
!462 = !{!463, !464, !1368}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !461, file: !298, line: 382, baseType: !346, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !461, file: !298, line: 383, baseType: !465, size: 128, offset: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !298, line: 376, size: 128, elements: !466)
!466 = !{!467, !1366}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !465, file: !298, line: 377, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !470, line: 640, size: 48640, elements: !471)
!470 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!471 = !{!472, !478, !480, !481, !487, !488, !489, !490, !491, !492, !493, !494, !498, !516, !527, !622, !623, !624, !635, !636, !638, !639, !640, !641, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !720, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !776, !778, !779, !780, !792, !794, !795, !796, !797, !798, !804, !805, !806, !807, !808, !809, !810, !822, !827, !832, !833, !834, !837, !841, !844, !847, !850, !853, !857, !860, !863, !869, !870, !871, !877, !878, !879, !880, !881, !890, !891, !892, !893, !894, !899, !900, !901, !904, !905, !908, !911, !914, !917, !920, !923, !924, !1004, !1007, !1010, !1011, !1014, !1015, !1016, !1022, !1023, !1024, !1037, !1038, !1039, !1051, !1056, !1059, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !469, file: !470, line: 646, baseType: !473, size: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !474, line: 56, size: 128, elements: !475)
!474 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !474, line: 57, baseType: !81, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !473, file: !474, line: 58, baseType: !136, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !470, line: 649, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !469, file: !470, line: 657, baseType: !80, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !469, file: !470, line: 658, baseType: !482, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !483, line: 113, baseType: !484)
!483 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !483, line: 111, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !484, file: !483, line: 112, baseType: !346, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !469, file: !470, line: 660, baseType: !7, size: 32, offset: 288)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !469, file: !470, line: 661, baseType: !7, size: 32, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !469, file: !470, line: 684, baseType: !95, size: 32, offset: 352)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !469, file: !470, line: 686, baseType: !95, size: 32, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !469, file: !470, line: 687, baseType: !95, size: 32, offset: 416)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !469, file: !470, line: 688, baseType: !95, size: 32, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !469, file: !470, line: 689, baseType: !7, size: 32, offset: 480)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !469, file: !470, line: 691, baseType: !495, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !470, line: 691, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !469, file: !470, line: 692, baseType: !499, size: 832, offset: 576)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !470, line: 451, size: 832, elements: !500)
!500 = !{!501, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !499, file: !470, line: 453, baseType: !502, size: 128)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !470, line: 325, size: 128, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !502, file: !470, line: 326, baseType: !81, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !502, file: !470, line: 327, baseType: !136, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !499, file: !470, line: 454, baseType: !305, size: 192, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !499, file: !470, line: 455, baseType: !155, size: 128, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !499, file: !470, line: 456, baseType: !7, size: 32, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !499, file: !470, line: 458, baseType: !326, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !499, file: !470, line: 459, baseType: !326, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !499, file: !470, line: 460, baseType: !326, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !499, file: !470, line: 461, baseType: !326, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !499, file: !470, line: 463, baseType: !326, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !499, file: !470, line: 465, baseType: !515, offset: 832)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !470, line: 415, elements: !182)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !469, file: !470, line: 693, baseType: !517, size: 384, offset: 1408)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !470, line: 489, size: 384, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !517, file: !470, line: 490, baseType: !155, size: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !517, file: !470, line: 491, baseType: !81, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !517, file: !470, line: 492, baseType: !81, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !517, file: !470, line: 493, baseType: !7, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !517, file: !470, line: 494, baseType: !250, size: 16, offset: 288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !517, file: !470, line: 495, baseType: !250, size: 16, offset: 304)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !517, file: !470, line: 497, baseType: !526, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !469, file: !470, line: 697, baseType: !528, size: 1792, offset: 1792)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !470, line: 507, size: 1792, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !619, !620}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !528, file: !470, line: 508, baseType: !305, size: 192, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !528, file: !470, line: 515, baseType: !326, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !528, file: !470, line: 516, baseType: !326, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !528, file: !470, line: 517, baseType: !326, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !528, file: !470, line: 518, baseType: !326, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !528, file: !470, line: 519, baseType: !326, size: 64, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !528, file: !470, line: 526, baseType: !360, size: 64, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !528, file: !470, line: 527, baseType: !326, size: 64, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !528, file: !470, line: 528, baseType: !7, size: 32, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !528, file: !470, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !528, file: !470, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !528, file: !470, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !528, file: !470, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !528, file: !470, line: 563, baseType: !544, size: 512, offset: 704)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !545)
!545 = !{!546, !554, !555, !560, !612, !616, !617, !618}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !544, file: !6, line: 119, baseType: !547, size: 256)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !548, line: 9, size: 256, elements: !549)
!548 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !547, file: !548, line: 10, baseType: !305, size: 192, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !547, file: !548, line: 11, baseType: !552, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !553, line: 29, baseType: !360)
!553 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !544, file: !6, line: 120, baseType: !552, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !544, file: !6, line: 121, baseType: !556, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!5, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !544, file: !6, line: 122, baseType: !561, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !563)
!563 = !{!564, !584, !585, !588, !598, !599, !607, !611}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !562, file: !6, line: 160, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !566, file: !6, line: 215, baseType: !371)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !566, file: !6, line: 216, baseType: !7, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !566, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !566, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !566, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !566, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !566, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !566, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !566, file: !6, line: 233, baseType: !552, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !566, file: !6, line: 234, baseType: !559, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !566, file: !6, line: 235, baseType: !552, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !566, file: !6, line: 236, baseType: !559, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !566, file: !6, line: 237, baseType: !581, size: 4096, offset: 512)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 4096, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !562, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !562, file: !6, line: 162, baseType: !586, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !79, line: 27, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !242, line: 96, baseType: !95)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !562, file: !6, line: 163, baseType: !589, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !590, line: 276, baseType: !591)
!590 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !590, line: 276, size: 32, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !591, file: !590, line: 276, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !590, line: 70, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !590, line: 65, size: 32, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !595, file: !590, line: 66, baseType: !7, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !562, file: !6, line: 164, baseType: !559, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !562, file: !6, line: 165, baseType: !600, size: 128, offset: 256)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !548, line: 14, size: 128, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !600, file: !548, line: 15, baseType: !603, size: 128)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !306, line: 125, size: 128, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !603, file: !306, line: 126, baseType: !322, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !603, file: !306, line: 127, baseType: !310, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !562, file: !6, line: 166, baseType: !608, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!552}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !562, file: !6, line: 167, baseType: !552, size: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !544, file: !6, line: 123, baseType: !613, size: 8, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !137, line: 17, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !139, line: 21, baseType: !615)
!615 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !544, file: !6, line: 124, baseType: !613, size: 8, offset: 456)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !544, file: !6, line: 125, baseType: !613, size: 8, offset: 464)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !544, file: !6, line: 126, baseType: !613, size: 8, offset: 472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !528, file: !470, line: 572, baseType: !544, size: 512, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !528, file: !470, line: 580, baseType: !621, size: 64, offset: 1728)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !469, file: !470, line: 721, baseType: !7, size: 32, offset: 3584)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !469, file: !470, line: 722, baseType: !95, size: 32, offset: 3616)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !469, file: !470, line: 723, baseType: !625, size: 64, offset: 3648)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !628, line: 17, baseType: !629)
!628 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !628, line: 17, size: 64, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !629, file: !628, line: 17, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 1)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !469, file: !470, line: 724, baseType: !627, size: 64, offset: 3712)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !469, file: !470, line: 749, baseType: !637, offset: 3776)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !470, line: 290, elements: !182)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !469, file: !470, line: 751, baseType: !155, size: 128, offset: 3776)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !469, file: !470, line: 757, baseType: !314, size: 64, offset: 3904)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !469, file: !470, line: 758, baseType: !314, size: 64, offset: 3968)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !469, file: !470, line: 761, baseType: !642, size: 320, offset: 4032)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !401, line: 34, size: 320, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !642, file: !401, line: 35, baseType: !326, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !642, file: !401, line: 36, baseType: !646, size: 256, offset: 64)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 256, elements: !405)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !469, file: !470, line: 766, baseType: !95, size: 32, offset: 4352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !469, file: !470, line: 767, baseType: !95, size: 32, offset: 4384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !469, file: !470, line: 768, baseType: !95, size: 32, offset: 4416)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !469, file: !470, line: 770, baseType: !95, size: 32, offset: 4448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !469, file: !470, line: 772, baseType: !81, size: 64, offset: 4480)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !469, file: !470, line: 775, baseType: !7, size: 32, offset: 4544)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !469, file: !470, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !469, file: !470, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !469, file: !470, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !469, file: !470, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !469, file: !470, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !469, file: !470, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !469, file: !470, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !469, file: !470, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !469, file: !470, line: 831, baseType: !81, size: 64, offset: 4672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !469, file: !470, line: 833, baseType: !663, size: 384, offset: 4736)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !664)
!664 = !{!665, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !663, file: !12, line: 26, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!82, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !12, line: 27, baseType: !671, size: 320, offset: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !12, line: 27, size: 320, elements: !672)
!672 = !{!673, !683, !710}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !671, file: !12, line: 36, baseType: !674, size: 320)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !12, line: 29, size: 320, elements: !675)
!675 = !{!676, !678, !679, !680, !681, !682}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !674, file: !12, line: 30, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !674, file: !12, line: 31, baseType: !136, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !12, line: 32, baseType: !136, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !674, file: !12, line: 33, baseType: !136, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !674, file: !12, line: 34, baseType: !326, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !674, file: !12, line: 35, baseType: !677, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !671, file: !12, line: 46, baseType: !684, size: 192)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !12, line: 38, size: 192, elements: !685)
!685 = !{!686, !687, !688, !709}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !684, file: !12, line: 39, baseType: !586, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, scope: !684, file: !12, line: 41, baseType: !689, size: 64, offset: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !684, file: !12, line: 41, size: 64, elements: !690)
!690 = !{!691, !699}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !689, file: !12, line: 42, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !694, line: 7, size: 128, elements: !695)
!694 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!695 = !{!696, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !693, file: !694, line: 8, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !242, line: 93, baseType: !290)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !693, file: !694, line: 9, baseType: !290, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !689, file: !12, line: 43, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !702, line: 7, size: 64, elements: !703)
!702 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!703 = !{!704, !708}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !701, file: !702, line: 8, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !702, line: 5, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !137, line: 20, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !139, line: 26, baseType: !95)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !701, file: !702, line: 9, baseType: !706, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !684, file: !12, line: 45, baseType: !326, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !671, file: !12, line: 54, baseType: !711, size: 256)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !12, line: 48, size: 256, elements: !712)
!712 = !{!713, !716, !717, !718, !719}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !711, file: !12, line: 49, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !711, file: !12, line: 50, baseType: !95, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !711, file: !12, line: 51, baseType: !95, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !711, file: !12, line: 52, baseType: !81, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !711, file: !12, line: 53, baseType: !81, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !469, file: !470, line: 835, baseType: !721, size: 32, offset: 5120)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !79, line: 22, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !242, line: 28, baseType: !95)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !469, file: !470, line: 836, baseType: !721, size: 32, offset: 5152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !469, file: !470, line: 840, baseType: !81, size: 64, offset: 5184)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !469, file: !470, line: 849, baseType: !468, size: 64, offset: 5248)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !469, file: !470, line: 852, baseType: !468, size: 64, offset: 5312)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !469, file: !470, line: 857, baseType: !155, size: 128, offset: 5376)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !469, file: !470, line: 858, baseType: !155, size: 128, offset: 5504)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !469, file: !470, line: 859, baseType: !468, size: 64, offset: 5632)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !469, file: !470, line: 867, baseType: !155, size: 128, offset: 5696)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !469, file: !470, line: 868, baseType: !155, size: 128, offset: 5824)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !469, file: !470, line: 871, baseType: !733, size: 64, offset: 5952)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !735, line: 59, size: 768, elements: !736)
!735 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!736 = !{!737, !738, !739, !740, !751, !752, !759, !768}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !734, file: !735, line: 61, baseType: !482, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !734, file: !735, line: 62, baseType: !7, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !734, file: !735, line: 63, baseType: !168, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !734, file: !735, line: 65, baseType: !741, size: 256, offset: 64)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 256, elements: !405)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !79, line: 182, size: 64, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !742, file: !79, line: 183, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !79, line: 186, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !746, file: !79, line: 187, baseType: !745, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !746, file: !79, line: 187, baseType: !750, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !734, file: !735, line: 66, baseType: !742, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !734, file: !735, line: 68, baseType: !753, size: 128, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !754, line: 40, baseType: !755)
!754 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !754, line: 36, size: 128, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !755, file: !754, line: 37, baseType: !168)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !755, file: !754, line: 38, baseType: !155, size: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !734, file: !735, line: 69, baseType: !760, size: 128, align: 64, offset: 512)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !79, line: 216, size: 128, align: 64, elements: !761)
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !79, line: 217, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !760, file: !79, line: 218, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !763}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !734, file: !735, line: 70, baseType: !769, size: 128, offset: 640)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 128, elements: !633)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !735, line: 54, size: 128, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !770, file: !735, line: 55, baseType: !95, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !770, file: !735, line: 56, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !735, line: 56, flags: DIFlagFwdDecl)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !469, file: !470, line: 872, baseType: !777, size: 512, offset: 6016)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 512, elements: !405)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !469, file: !470, line: 873, baseType: !155, size: 128, offset: 6528)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !469, file: !470, line: 874, baseType: !155, size: 128, offset: 6656)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !469, file: !470, line: 876, baseType: !781, size: 64, offset: 6784)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !783, line: 26, size: 192, elements: !784)
!783 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !782, file: !783, line: 27, baseType: !7, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !782, file: !783, line: 28, baseType: !787, size: 128, offset: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !788, line: 43, size: 128, elements: !789)
!788 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !787, file: !788, line: 44, baseType: !371)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !787, file: !788, line: 45, baseType: !155, size: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !469, file: !470, line: 879, baseType: !793, size: 64, offset: 6848)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !469, file: !470, line: 882, baseType: !793, size: 64, offset: 6912)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !469, file: !470, line: 884, baseType: !326, size: 64, offset: 6976)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !469, file: !470, line: 885, baseType: !326, size: 64, offset: 7040)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !469, file: !470, line: 890, baseType: !326, size: 64, offset: 7104)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !469, file: !470, line: 891, baseType: !799, size: 128, offset: 7168)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !470, line: 242, size: 128, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !799, file: !470, line: 244, baseType: !326, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !799, file: !470, line: 245, baseType: !326, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !799, file: !470, line: 246, baseType: !371, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !469, file: !470, line: 900, baseType: !81, size: 64, offset: 7296)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !469, file: !470, line: 901, baseType: !81, size: 64, offset: 7360)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !469, file: !470, line: 904, baseType: !326, size: 64, offset: 7424)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !469, file: !470, line: 907, baseType: !326, size: 64, offset: 7488)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !469, file: !470, line: 910, baseType: !81, size: 64, offset: 7552)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !469, file: !470, line: 911, baseType: !81, size: 64, offset: 7616)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !469, file: !470, line: 914, baseType: !811, size: 640, offset: 7680)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !812, line: 123, size: 640, elements: !813)
!812 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!813 = !{!814, !820, !821}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !811, file: !812, line: 124, baseType: !815, size: 576)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 576, elements: !210)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !812, line: 108, size: 192, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !816, file: !812, line: 109, baseType: !326, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !816, file: !812, line: 110, baseType: !600, size: 128, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !811, file: !812, line: 125, baseType: !7, size: 32, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !811, file: !812, line: 126, baseType: !7, size: 32, offset: 608)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !469, file: !470, line: 917, baseType: !823, size: 192, offset: 8320)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !812, line: 134, size: 192, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !823, file: !812, line: 135, baseType: !760, size: 128, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !823, file: !812, line: 136, baseType: !7, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !469, file: !470, line: 923, baseType: !828, size: 64, offset: 8512)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !831, line: 11, flags: DIFlagFwdDecl)
!831 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!832 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !469, file: !470, line: 926, baseType: !828, size: 64, offset: 8576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !469, file: !470, line: 929, baseType: !828, size: 64, offset: 8640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !469, file: !470, line: 933, baseType: !835, size: 64, offset: 8704)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !470, line: 933, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !469, file: !470, line: 943, baseType: !838, size: 128, offset: 8768)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 16)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !469, file: !470, line: 945, baseType: !842, size: 64, offset: 8896)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !470, line: 49, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !469, file: !470, line: 956, baseType: !845, size: 64, offset: 8960)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !470, line: 45, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !469, file: !470, line: 959, baseType: !848, size: 64, offset: 9024)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !470, line: 959, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !469, file: !470, line: 962, baseType: !851, size: 64, offset: 9088)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !470, line: 66, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !469, file: !470, line: 966, baseType: !854, size: 64, offset: 9152)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !856, line: 35, flags: DIFlagFwdDecl)
!856 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!857 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !469, file: !470, line: 969, baseType: !858, size: 64, offset: 9216)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !812, line: 223, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !469, file: !470, line: 970, baseType: !861, size: 64, offset: 9280)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !470, line: 62, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !469, file: !470, line: 971, baseType: !864, size: 64, offset: 9344)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !865, line: 25, baseType: !866)
!865 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !865, line: 23, size: 64, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !866, file: !865, line: 24, baseType: !632, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !469, file: !470, line: 972, baseType: !864, size: 64, offset: 9408)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !469, file: !470, line: 974, baseType: !864, size: 64, offset: 9472)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !469, file: !470, line: 975, baseType: !872, size: 192, offset: 9536)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !873, line: 30, size: 192, elements: !874)
!873 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !872, file: !873, line: 31, baseType: !155, size: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !872, file: !873, line: 32, baseType: !864, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !469, file: !470, line: 976, baseType: !81, size: 64, offset: 9728)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !469, file: !470, line: 977, baseType: !255, size: 64, offset: 9792)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !469, file: !470, line: 978, baseType: !7, size: 32, offset: 9856)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !469, file: !470, line: 980, baseType: !763, size: 64, offset: 9920)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !469, file: !470, line: 989, baseType: !882, size: 128, offset: 9984)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !883, line: 35, size: 128, elements: !884)
!883 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !882, file: !883, line: 36, baseType: !95, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !882, file: !883, line: 37, baseType: !346, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !882, file: !883, line: 38, baseType: !888, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !883, line: 23, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !469, file: !470, line: 992, baseType: !326, size: 64, offset: 10112)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !469, file: !470, line: 993, baseType: !326, size: 64, offset: 10176)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !469, file: !470, line: 996, baseType: !168, offset: 10240)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !469, file: !470, line: 999, baseType: !371, offset: 10240)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !469, file: !470, line: 1001, baseType: !895, size: 64, offset: 10240)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !470, line: 636, size: 64, elements: !896)
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !895, file: !470, line: 637, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !469, file: !470, line: 1005, baseType: !603, size: 128, offset: 10304)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !469, file: !470, line: 1007, baseType: !468, size: 64, offset: 10432)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !469, file: !470, line: 1009, baseType: !902, size: 64, offset: 10496)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !470, line: 1009, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !469, file: !470, line: 1043, baseType: !80, size: 64, offset: 10560)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !469, file: !470, line: 1046, baseType: !906, size: 64, offset: 10624)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !470, line: 41, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !469, file: !470, line: 1050, baseType: !909, size: 64, offset: 10688)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !470, line: 42, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !469, file: !470, line: 1054, baseType: !912, size: 64, offset: 10752)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !470, line: 55, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !469, file: !470, line: 1056, baseType: !915, size: 64, offset: 10816)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !470, line: 40, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !469, file: !470, line: 1058, baseType: !918, size: 64, offset: 10880)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !470, line: 47, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !469, file: !470, line: 1061, baseType: !921, size: 64, offset: 10944)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !470, line: 43, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !469, file: !470, line: 1064, baseType: !81, size: 64, offset: 11008)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !469, file: !470, line: 1065, baseType: !925, size: 64, offset: 11072)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !873, line: 14, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !873, line: 12, size: 384, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, scope: !927, file: !873, line: 13, baseType: !930, size: 384)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !927, file: !873, line: 13, size: 384, elements: !931)
!931 = !{!932, !933, !934, !935}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !930, file: !873, line: 13, baseType: !95, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !930, file: !873, line: 13, baseType: !95, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !930, file: !873, line: 13, baseType: !95, size: 32, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !930, file: !873, line: 13, baseType: !936, size: 256, offset: 128)
!936 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !937, line: 32, size: 256, elements: !938)
!937 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!938 = !{!939, !945, !958, !964, !973, !993, !998}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !936, file: !937, line: 37, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !936, file: !937, line: 34, size: 64, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !940, file: !937, line: 35, baseType: !722, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !940, file: !937, line: 36, baseType: !944, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !242, line: 49, baseType: !7)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !936, file: !937, line: 45, baseType: !946, size: 192)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !936, file: !937, line: 40, size: 192, elements: !947)
!947 = !{!948, !950, !951, !957}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !946, file: !937, line: 41, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !242, line: 95, baseType: !95)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !946, file: !937, line: 42, baseType: !95, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !946, file: !937, line: 43, baseType: !952, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !937, line: 11, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !937, line: 8, size: 64, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !953, file: !937, line: 9, baseType: !95, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !953, file: !937, line: 10, baseType: !80, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !946, file: !937, line: 44, baseType: !95, size: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !936, file: !937, line: 52, baseType: !959, size: 128)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !936, file: !937, line: 48, size: 128, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !959, file: !937, line: 49, baseType: !722, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !959, file: !937, line: 50, baseType: !944, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !959, file: !937, line: 51, baseType: !952, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !936, file: !937, line: 61, baseType: !965, size: 256)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !936, file: !937, line: 55, size: 256, elements: !966)
!966 = !{!967, !968, !969, !970, !972}
