; ModuleID = '../bcout/drivers/input/gameport/gameport.llvm.bc'
source_filename = "drivers/input/gameport/gameport.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall4.init\22, \22a\22\09"
module asm "__initcall_gameport_init4:\09\09\09"
module asm ".long\09gameport_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!26 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !31, line: 524, baseType: !7, size: 32, elements: !32)
!31 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!37 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !31, line: 502, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !45, line: 44, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gameport_event_type", file: !3, line: 254, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "GAMEPORT_REGISTER_PORT", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "GAMEPORT_ATTACH_DRIVER", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 10, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !60, line: 305, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 30, baseType: !68, size: 64, elements: !69)
!67 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!68 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!70 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!71 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!72 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!73 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!74 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!75 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!76 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!77 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!78 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!79 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!80 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!81 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!82 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!83 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!84 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!85 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!86 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!87 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!88 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!89 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!90 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!91 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!92 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!93 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!94 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!95 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!96 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!97 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!98 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!99 = !{!100, !101, !113, !68, !2000, !149, !2102, !2104, !1557, !182, !2111, !2113}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gameport", file: !103, line: 17, size: 7616, elements: !104)
!103 = !DIFile(filename: "./include/linux/gameport.h", directory: "/home/lizy2001/genbc/linux")
!104 = !{!105, !106, !111, !112, !114, !115, !116, !120, !125, !130, !131, !135, !136, !160, !161, !177, !178, !179, !180, !181, !2099, !2100, !2101}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "port_data", scope: !102, file: !103, line: 19, baseType: !100, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !103, line: 20, baseType: !107, size: 256, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 256, elements: !109)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!109 = !{!110}
!110 = !DISubrange(count: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !102, file: !103, line: 21, baseType: !107, size: 256, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !102, file: !103, line: 23, baseType: !113, size: 32, offset: 576)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !102, file: !103, line: 24, baseType: !113, size: 32, offset: 608)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !102, file: !103, line: 25, baseType: !113, size: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !102, file: !103, line: 27, baseType: !117, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !101}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !102, file: !103, line: 28, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !101}
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cooked_read", scope: !102, file: !103, line: 29, baseType: !126, size: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!113, !101, !129, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "calibrate", scope: !102, file: !103, line: 30, baseType: !126, size: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !102, file: !103, line: 31, baseType: !132, size: 64, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!113, !101, !113}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !102, file: !103, line: 32, baseType: !117, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "poll_timer", scope: !102, file: !103, line: 34, baseType: !137, size: 320, offset: 1088)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_list", file: !138, line: 11, size: 320, elements: !139)
!138 = !DIFile(filename: "./include/linux/timer.h", directory: "/home/lizy2001/genbc/linux")
!139 = !{!140, !148, !150, !155}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !137, file: !138, line: 16, baseType: !141, size: 128)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !142, line: 186, size: 128, elements: !143)
!142 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !142, line: 187, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !141, file: !142, line: 187, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !137, file: !138, line: 17, baseType: !149, size: 64, offset: 128)
!149 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !137, file: !138, line: 18, baseType: !151, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !138, line: 19, baseType: !156, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !157, line: 21, baseType: !158)
!157 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !159, line: 27, baseType: !7)
!159 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "poll_interval", scope: !102, file: !103, line: 35, baseType: !7, size: 32, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timer_lock", scope: !102, file: !103, line: 36, baseType: !162, offset: 1440)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !163, line: 83, baseType: !164)
!163 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !163, line: 71, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, scope: !164, file: !163, line: 72, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !164, file: !163, line: 72, elements: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !167, file: !163, line: 73, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !163, line: 20, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !170, file: !163, line: 21, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !174, line: 25, baseType: !175)
!174 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 25, elements: !176)
!176 = !{}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "poll_cnt", scope: !102, file: !103, line: 37, baseType: !7, size: 32, offset: 1440)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "poll_handler", scope: !102, file: !103, line: 38, baseType: !117, size: 64, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !102, file: !103, line: 40, baseType: !101, size: 64, offset: 1536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !102, file: !103, line: 40, baseType: !101, size: 64, offset: 1600)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "drv", scope: !102, file: !103, line: 42, baseType: !182, size: 64, offset: 1664)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gameport_driver", file: !103, line: 51, size: 1472, elements: !184)
!184 = !{!185, !188, !192, !196, !197, !2098}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !183, file: !103, line: 52, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !183, file: !103, line: 54, baseType: !189, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!113, !101, !182}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect", scope: !183, file: !103, line: 55, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!113, !101}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !183, file: !103, line: 56, baseType: !117, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !183, file: !103, line: 58, baseType: !198, size: 1152, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_driver", file: !45, line: 95, size: 1152, elements: !199)
!199 = !{!200, !201, !2073, !2074, !2075, !2076, !2077, !2081, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !45, line: 96, baseType: !186, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !198, file: !45, line: 97, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bus_type", file: !204, line: 82, size: 1408, elements: !205)
!204 = !DIFile(filename: "./include/linux/device/bus.h", directory: "/home/lizy2001/genbc/linux")
!205 = !{!206, !207, !208, !2042, !2043, !2044, !2045, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2060, !2061, !2062, !2063, !2064, !2068, !2069, !2072}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !204, line: 83, baseType: !186, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dev_name", scope: !203, file: !204, line: 84, baseType: !186, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dev_root", scope: !203, file: !204, line: 85, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !24, line: 461, size: 5568, elements: !211)
!211 = !{!212, !1685, !1686, !1689, !1690, !1741, !1742, !1744, !1745, !1746, !1747, !1756, !1854, !1867, !1870, !1871, !1875, !1877, !1878, !1879, !1883, !1889, !1890, !1893, !1897, !1987, !1990, !1991, !1992, !1993, !2030, !2031, !2032, !2035, !2038, !2039, !2040, !2041}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !210, file: !24, line: 462, baseType: !213, size: 512)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !214, line: 64, size: 512, elements: !215)
!214 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!215 = !{!216, !217, !223, !225, !270, !1521, !1675, !1680, !1681, !1682, !1683, !1684}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 65, baseType: !186, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !213, file: !214, line: 66, baseType: !218, size: 128, offset: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !142, line: 178, size: 128, elements: !219)
!219 = !{!220, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !142, line: 179, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !218, file: !142, line: 179, baseType: !221, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !214, line: 67, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !213, file: !214, line: 68, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !214, line: 192, size: 704, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !227, file: !214, line: 193, baseType: !218, size: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !227, file: !214, line: 194, baseType: !162, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !227, file: !214, line: 195, baseType: !213, size: 512, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !227, file: !214, line: 196, baseType: !233, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !214, line: 156, size: 192, elements: !236)
!236 = !{!237, !242, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !235, file: !214, line: 157, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!113, !226, !224}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !214, line: 158, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!186, !226, !224}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !235, file: !214, line: 159, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!113, !226, !224, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !214, line: 148, size: 20736, elements: !254)
!254 = !{!255, !260, !264, !265, !269}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !253, file: !214, line: 149, baseType: !256, size: 192)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 192, elements: !258)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!258 = !{!259}
!259 = !DISubrange(count: 3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !253, file: !214, line: 150, baseType: !261, size: 4096, offset: 192)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 4096, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !253, file: !214, line: 151, baseType: !113, size: 32, offset: 4288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !253, file: !214, line: 152, baseType: !266, size: 16384, offset: 4320)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16384, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 2048)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !253, file: !214, line: 153, baseType: !113, size: 32, offset: 20704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !213, file: !214, line: 69, baseType: !271, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !214, line: 138, size: 448, elements: !273)
!273 = !{!274, !278, !306, !308, !1469, !1500, !1504}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !272, file: !214, line: 139, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !224}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !272, file: !214, line: 140, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !282, line: 230, size: 128, elements: !283)
!282 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!283 = !{!284, !299}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !281, file: !282, line: 231, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !224, !292, !257}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !142, line: 60, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !290, line: 73, baseType: !291)
!290 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !290, line: 15, baseType: !68)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !282, line: 30, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !282, line: 31, baseType: !186, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !293, file: !282, line: 32, baseType: !297, size: 16, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !142, line: 19, baseType: !298)
!298 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !281, file: !282, line: 232, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!288, !224, !292, !186, !303}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !142, line: 55, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !290, line: 72, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !290, line: 16, baseType: !149)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !272, file: !214, line: 141, baseType: !307, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !272, file: !214, line: 142, baseType: !309, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !282, line: 84, size: 320, elements: !313)
!313 = !{!314, !315, !319, !1466, !1467}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !282, line: 85, baseType: !186, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !312, file: !282, line: 86, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!297, !224, !292, !113}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !312, file: !282, line: 88, baseType: !320, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!297, !224, !323, !113}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !282, line: 168, size: 448, elements: !325)
!325 = !{!326, !327, !328, !329, !339, !340}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !324, file: !282, line: 169, baseType: !293, size: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !324, file: !282, line: 170, baseType: !303, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !324, file: !282, line: 171, baseType: !100, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !324, file: !282, line: 172, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!288, !333, !224, !323, !257, !336, !303}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !335, line: 526, flags: DIFlagFwdDecl)
!335 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !142, line: 46, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !290, line: 88, baseType: !338)
!338 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !324, file: !282, line: 174, baseType: !330, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !324, file: !282, line: 176, baseType: !341, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!113, !333, !224, !323, !344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !346, line: 305, size: 1472, elements: !347)
!346 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!347 = !{!348, !349, !350, !351, !352, !360, !361, !1440, !1446, !1447, !1452, !1453, !1456, !1460, !1461, !1462, !1463, !1464}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !345, file: !346, line: 308, baseType: !149, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !345, file: !346, line: 309, baseType: !149, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !345, file: !346, line: 313, baseType: !344, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !345, file: !346, line: 313, baseType: !344, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !345, file: !346, line: 315, baseType: !353, size: 192, align: 64, offset: 256)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !354, line: 24, size: 192, align: 64, elements: !355)
!354 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!355 = !{!356, !357, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !353, file: !354, line: 25, baseType: !149, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !353, file: !354, line: 26, baseType: !358, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !353, file: !354, line: 27, baseType: !358, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !345, file: !346, line: 323, baseType: !149, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !345, file: !346, line: 327, baseType: !362, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !346, line: 388, size: 7296, elements: !364)
!364 = !{!365, !1436}
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !346, line: 389, baseType: !366, size: 7296)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !346, line: 389, size: 7296, elements: !367)
!367 = !{!368, !369, !373, !377, !381, !382, !383, !384, !385, !393, !398, !399, !400, !401, !410, !411, !412, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !447, !455, !458, !506, !507, !1407, !1408, !1411, !1415, !1416, !1419, !1420, !1421, !1424, !1435}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !366, file: !346, line: 390, baseType: !344, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !366, file: !346, line: 391, baseType: !370, size: 64, offset: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !354, line: 31, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !370, file: !354, line: 32, baseType: !358, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !366, file: !346, line: 392, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !157, line: 23, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !159, line: 31, baseType: !376)
!376 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !366, file: !346, line: 394, baseType: !378, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!149, !333, !149, !149, !149, !149}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !366, file: !346, line: 398, baseType: !149, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !366, file: !346, line: 399, baseType: !149, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !366, file: !346, line: 405, baseType: !149, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !366, file: !346, line: 406, baseType: !149, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !366, file: !346, line: 407, baseType: !386, size: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !335, line: 286, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 286, size: 64, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !388, file: !335, line: 286, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !392, line: 18, baseType: !149)
!392 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !366, file: !346, line: 416, baseType: !394, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !142, line: 168, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 166, size: 32, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !395, file: !142, line: 167, baseType: !113, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !366, file: !346, line: 428, baseType: !394, size: 32, offset: 608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !366, file: !346, line: 437, baseType: !394, size: 32, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !366, file: !346, line: 447, baseType: !394, size: 32, offset: 672)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !366, file: !346, line: 450, baseType: !402, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !403, line: 13, baseType: !404)
!403 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !142, line: 175, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 173, size: 64, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !405, file: !142, line: 174, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !157, line: 22, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !159, line: 30, baseType: !338)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !366, file: !346, line: 452, baseType: !113, size: 32, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !366, file: !346, line: 454, baseType: !162, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !366, file: !346, line: 457, baseType: !413, size: 256, offset: 832)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !414, line: 35, size: 256, elements: !415)
!414 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!415 = !{!416, !417, !418, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !413, file: !414, line: 36, baseType: !402, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !413, file: !414, line: 42, baseType: !402, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !413, file: !414, line: 46, baseType: !419, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !163, line: 29, baseType: !170)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !413, file: !414, line: 47, baseType: !218, size: 128, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !366, file: !346, line: 459, baseType: !218, size: 128, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !366, file: !346, line: 466, baseType: !149, size: 64, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !366, file: !346, line: 467, baseType: !149, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !366, file: !346, line: 469, baseType: !149, size: 64, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !366, file: !346, line: 470, baseType: !149, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !366, file: !346, line: 471, baseType: !404, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !366, file: !346, line: 472, baseType: !149, size: 64, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !366, file: !346, line: 473, baseType: !149, size: 64, offset: 1600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !366, file: !346, line: 474, baseType: !149, size: 64, offset: 1664)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !366, file: !346, line: 475, baseType: !149, size: 64, offset: 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !366, file: !346, line: 477, baseType: !162, offset: 1792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !366, file: !346, line: 478, baseType: !149, size: 64, offset: 1792)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !366, file: !346, line: 478, baseType: !149, size: 64, offset: 1856)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !366, file: !346, line: 478, baseType: !149, size: 64, offset: 1920)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !366, file: !346, line: 478, baseType: !149, size: 64, offset: 1984)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !366, file: !346, line: 479, baseType: !149, size: 64, offset: 2048)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !366, file: !346, line: 479, baseType: !149, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !366, file: !346, line: 479, baseType: !149, size: 64, offset: 2176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !366, file: !346, line: 480, baseType: !149, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !366, file: !346, line: 480, baseType: !149, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !366, file: !346, line: 480, baseType: !149, size: 64, offset: 2368)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !366, file: !346, line: 480, baseType: !149, size: 64, offset: 2432)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !366, file: !346, line: 482, baseType: !444, size: 2816, offset: 2496)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 2816, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 44)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !366, file: !346, line: 488, baseType: !448, size: 256, offset: 5312)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !449, line: 60, size: 256, elements: !450)
!449 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !448, file: !449, line: 61, baseType: !452, size: 256)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 256, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 4)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !366, file: !346, line: 490, baseType: !456, size: 64, offset: 5568)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !346, line: 490, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !366, file: !346, line: 493, baseType: !459, size: 896, offset: 5632)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !460, line: 53, baseType: !461)
!460 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 13, size: 896, elements: !462)
!462 = !{!463, !464, !465, !466, !469, !470, !477, !478, !498, !499, !502}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !461, file: !460, line: 18, baseType: !374, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !461, file: !460, line: 28, baseType: !404, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !461, file: !460, line: 31, baseType: !413, size: 256, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !461, file: !460, line: 32, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !460, line: 32, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !461, file: !460, line: 37, baseType: !298, size: 16, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !461, file: !460, line: 40, baseType: !471, size: 192, offset: 512)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !472, line: 53, size: 192, elements: !473)
!472 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !471, file: !472, line: 54, baseType: !402, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !471, file: !472, line: 55, baseType: !162, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !471, file: !472, line: 59, baseType: !218, size: 128, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !461, file: !460, line: 41, baseType: !100, size: 64, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !461, file: !460, line: 42, baseType: !479, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !482, line: 13, size: 896, elements: !483)
!482 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !482, line: 14, baseType: !100, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !482, line: 15, baseType: !149, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !481, file: !482, line: 17, baseType: !149, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !481, file: !482, line: 17, baseType: !149, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !481, file: !482, line: 19, baseType: !68, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !481, file: !482, line: 21, baseType: !68, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !481, file: !482, line: 22, baseType: !68, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !481, file: !482, line: 23, baseType: !68, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !481, file: !482, line: 24, baseType: !68, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !481, file: !482, line: 25, baseType: !68, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !481, file: !482, line: 26, baseType: !68, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !481, file: !482, line: 27, baseType: !68, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !481, file: !482, line: 28, baseType: !68, size: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !481, file: !482, line: 29, baseType: !68, size: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !461, file: !460, line: 44, baseType: !394, size: 32, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !461, file: !460, line: 50, baseType: !500, size: 16, offset: 864)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !157, line: 19, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !159, line: 24, baseType: !298)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !461, file: !460, line: 51, baseType: !503, size: 16, offset: 880)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !157, line: 18, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !159, line: 23, baseType: !505)
!505 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !346, line: 495, baseType: !149, size: 64, offset: 6528)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !366, file: !346, line: 497, baseType: !508, size: 64, offset: 6592)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !346, line: 381, size: 384, elements: !510)
!510 = !{!511, !512, !1406}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !509, file: !346, line: 382, baseType: !394, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !509, file: !346, line: 383, baseType: !513, size: 128, offset: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !346, line: 376, size: 128, elements: !514)
!514 = !{!515, !1404}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !513, file: !346, line: 377, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !518, line: 640, size: 48640, elements: !519)
!518 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!519 = !{!520, !526, !528, !529, !535, !536, !537, !538, !539, !540, !541, !542, !546, !564, !575, !669, !670, !671, !682, !683, !685, !686, !687, !688, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !767, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !817, !819, !820, !821, !833, !834, !835, !836, !837, !838, !844, !845, !846, !847, !848, !849, !850, !862, !867, !872, !873, !874, !877, !881, !884, !887, !890, !893, !897, !900, !903, !909, !910, !911, !917, !918, !919, !920, !921, !930, !931, !932, !933, !934, !939, !940, !941, !944, !945, !948, !951, !954, !957, !960, !963, !964, !1044, !1047, !1050, !1051, !1054, !1055, !1056, !1062, !1063, !1064, !1077, !1078, !1079, !1091, !1096, !1099, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !517, file: !518, line: 646, baseType: !521, size: 128)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !522, line: 56, size: 128, elements: !523)
!522 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !521, file: !522, line: 57, baseType: !149, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !521, file: !522, line: 58, baseType: !156, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !517, file: !518, line: 649, baseType: !527, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !517, file: !518, line: 657, baseType: !100, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !517, file: !518, line: 658, baseType: !530, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !531, line: 113, baseType: !532)
!531 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !531, line: 111, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !532, file: !531, line: 112, baseType: !394, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !517, file: !518, line: 660, baseType: !7, size: 32, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !517, file: !518, line: 661, baseType: !7, size: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !517, file: !518, line: 684, baseType: !113, size: 32, offset: 352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !517, file: !518, line: 686, baseType: !113, size: 32, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !517, file: !518, line: 687, baseType: !113, size: 32, offset: 416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !517, file: !518, line: 688, baseType: !113, size: 32, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !517, file: !518, line: 689, baseType: !7, size: 32, offset: 480)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !517, file: !518, line: 691, baseType: !543, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !518, line: 691, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !517, file: !518, line: 692, baseType: !547, size: 832, offset: 576)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !518, line: 451, size: 832, elements: !548)
!548 = !{!549, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !547, file: !518, line: 453, baseType: !550, size: 128)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !518, line: 325, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !550, file: !518, line: 326, baseType: !149, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !550, file: !518, line: 327, baseType: !156, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !547, file: !518, line: 454, baseType: !353, size: 192, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !547, file: !518, line: 455, baseType: !218, size: 128, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !547, file: !518, line: 456, baseType: !7, size: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !547, file: !518, line: 458, baseType: !374, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !547, file: !518, line: 459, baseType: !374, size: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !547, file: !518, line: 460, baseType: !374, size: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !547, file: !518, line: 461, baseType: !374, size: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !547, file: !518, line: 463, baseType: !374, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !547, file: !518, line: 465, baseType: !563, offset: 832)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !518, line: 415, elements: !176)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !517, file: !518, line: 693, baseType: !565, size: 384, offset: 1408)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !518, line: 489, size: 384, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !565, file: !518, line: 490, baseType: !218, size: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !565, file: !518, line: 491, baseType: !149, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !565, file: !518, line: 492, baseType: !149, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !565, file: !518, line: 493, baseType: !7, size: 32, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !565, file: !518, line: 494, baseType: !298, size: 16, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !565, file: !518, line: 495, baseType: !298, size: 16, offset: 304)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !565, file: !518, line: 497, baseType: !574, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !517, file: !518, line: 697, baseType: !576, size: 1792, offset: 1792)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !518, line: 507, size: 1792, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !666, !667}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !576, file: !518, line: 508, baseType: !353, size: 192, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !576, file: !518, line: 515, baseType: !374, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !576, file: !518, line: 516, baseType: !374, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !576, file: !518, line: 517, baseType: !374, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !576, file: !518, line: 518, baseType: !374, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !576, file: !518, line: 519, baseType: !374, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !576, file: !518, line: 526, baseType: !408, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !576, file: !518, line: 527, baseType: !374, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !576, file: !518, line: 528, baseType: !7, size: 32, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !576, file: !518, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !576, file: !518, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !576, file: !518, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !576, file: !518, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !576, file: !518, line: 563, baseType: !592, size: 512, offset: 704)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !593)
!593 = !{!594, !602, !603, !608, !660, !663, !664, !665}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !592, file: !6, line: 119, baseType: !595, size: 256)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !596, line: 9, size: 256, elements: !597)
!596 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !595, file: !596, line: 10, baseType: !353, size: 192, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !595, file: !596, line: 11, baseType: !600, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !601, line: 29, baseType: !408)
!601 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !592, file: !6, line: 120, baseType: !600, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !592, file: !6, line: 121, baseType: !604, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!5, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !592, file: !6, line: 122, baseType: !609, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !611)
!611 = !{!612, !632, !633, !636, !646, !647, !655, !659}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !610, file: !6, line: 160, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !614, file: !6, line: 215, baseType: !419)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !614, file: !6, line: 216, baseType: !7, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !614, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !614, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !614, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !614, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !614, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !614, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !614, file: !6, line: 233, baseType: !600, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !614, file: !6, line: 234, baseType: !607, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !614, file: !6, line: 235, baseType: !600, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !614, file: !6, line: 236, baseType: !607, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !614, file: !6, line: 237, baseType: !629, size: 4096, offset: 512)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 4096, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 8)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !610, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !610, file: !6, line: 162, baseType: !634, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !142, line: 27, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !290, line: 96, baseType: !113)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !610, file: !6, line: 163, baseType: !637, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !638, line: 276, baseType: !639)
!638 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !638, line: 276, size: 32, elements: !640)
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !639, file: !638, line: 276, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !638, line: 70, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !638, line: 65, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !643, file: !638, line: 66, baseType: !7, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !610, file: !6, line: 164, baseType: !607, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !610, file: !6, line: 165, baseType: !648, size: 128, offset: 256)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !596, line: 14, size: 128, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !648, file: !596, line: 15, baseType: !651, size: 128)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !354, line: 125, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !651, file: !354, line: 126, baseType: !370, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !651, file: !354, line: 127, baseType: !358, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !610, file: !6, line: 166, baseType: !656, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!600}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !610, file: !6, line: 167, baseType: !600, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !592, file: !6, line: 123, baseType: !661, size: 8, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !157, line: 17, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !159, line: 21, baseType: !124)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !592, file: !6, line: 124, baseType: !661, size: 8, offset: 456)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !592, file: !6, line: 125, baseType: !661, size: 8, offset: 464)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !592, file: !6, line: 126, baseType: !661, size: 8, offset: 472)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !576, file: !518, line: 572, baseType: !592, size: 512, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !576, file: !518, line: 580, baseType: !668, size: 64, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !517, file: !518, line: 721, baseType: !7, size: 32, offset: 3584)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !517, file: !518, line: 722, baseType: !113, size: 32, offset: 3616)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !517, file: !518, line: 723, baseType: !672, size: 64, offset: 3648)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !675, line: 17, baseType: !676)
!675 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !675, line: 17, size: 64, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !676, file: !675, line: 17, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 1)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !517, file: !518, line: 724, baseType: !674, size: 64, offset: 3712)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !517, file: !518, line: 749, baseType: !684, offset: 3776)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !518, line: 290, elements: !176)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !517, file: !518, line: 751, baseType: !218, size: 128, offset: 3776)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !517, file: !518, line: 757, baseType: !362, size: 64, offset: 3904)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !517, file: !518, line: 758, baseType: !362, size: 64, offset: 3968)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !517, file: !518, line: 761, baseType: !689, size: 320, offset: 4032)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !449, line: 34, size: 320, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !689, file: !449, line: 35, baseType: !374, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !689, file: !449, line: 36, baseType: !693, size: 256, offset: 64)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 256, elements: !453)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !517, file: !518, line: 766, baseType: !113, size: 32, offset: 4352)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !517, file: !518, line: 767, baseType: !113, size: 32, offset: 4384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !517, file: !518, line: 768, baseType: !113, size: 32, offset: 4416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !517, file: !518, line: 770, baseType: !113, size: 32, offset: 4448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !517, file: !518, line: 772, baseType: !149, size: 64, offset: 4480)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !517, file: !518, line: 775, baseType: !7, size: 32, offset: 4544)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !517, file: !518, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !517, file: !518, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !517, file: !518, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !517, file: !518, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !517, file: !518, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !517, file: !518, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !517, file: !518, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !517, file: !518, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !517, file: !518, line: 831, baseType: !149, size: 64, offset: 4672)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !517, file: !518, line: 833, baseType: !710, size: 384, offset: 4736)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !711)
!711 = !{!712, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !710, file: !12, line: 26, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!68, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !12, line: 27, baseType: !718, size: 320, offset: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !710, file: !12, line: 27, size: 320, elements: !719)
!719 = !{!720, !730, !757}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !718, file: !12, line: 36, baseType: !721, size: 320)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !12, line: 29, size: 320, elements: !722)
!722 = !{!723, !725, !726, !727, !728, !729}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !721, file: !12, line: 30, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !721, file: !12, line: 31, baseType: !156, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !721, file: !12, line: 32, baseType: !156, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !721, file: !12, line: 33, baseType: !156, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !721, file: !12, line: 34, baseType: !374, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !721, file: !12, line: 35, baseType: !724, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !718, file: !12, line: 46, baseType: !731, size: 192)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !12, line: 38, size: 192, elements: !732)
!732 = !{!733, !734, !735, !756}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !731, file: !12, line: 39, baseType: !634, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !731, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, scope: !731, file: !12, line: 41, baseType: !736, size: 64, offset: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !731, file: !12, line: 41, size: 64, elements: !737)
!737 = !{!738, !746}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !736, file: !12, line: 42, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !741, line: 7, size: 128, elements: !742)
!741 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!742 = !{!743, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !740, file: !741, line: 8, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !290, line: 93, baseType: !338)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !740, file: !741, line: 9, baseType: !338, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !736, file: !12, line: 43, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !749, line: 7, size: 64, elements: !750)
!749 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!750 = !{!751, !755}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !748, file: !749, line: 8, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !749, line: 5, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !157, line: 20, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !159, line: 26, baseType: !113)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !748, file: !749, line: 9, baseType: !753, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !731, file: !12, line: 45, baseType: !374, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !718, file: !12, line: 54, baseType: !758, size: 256)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !12, line: 48, size: 256, elements: !759)
!759 = !{!760, !763, !764, !765, !766}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !758, file: !12, line: 49, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !758, file: !12, line: 50, baseType: !113, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !758, file: !12, line: 51, baseType: !113, size: 32, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !758, file: !12, line: 52, baseType: !149, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !758, file: !12, line: 53, baseType: !149, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !517, file: !518, line: 835, baseType: !768, size: 32, offset: 5120)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !142, line: 22, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !290, line: 28, baseType: !113)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !517, file: !518, line: 836, baseType: !768, size: 32, offset: 5152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !517, file: !518, line: 840, baseType: !149, size: 64, offset: 5184)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !517, file: !518, line: 849, baseType: !516, size: 64, offset: 5248)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !517, file: !518, line: 852, baseType: !516, size: 64, offset: 5312)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !517, file: !518, line: 857, baseType: !218, size: 128, offset: 5376)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !517, file: !518, line: 858, baseType: !218, size: 128, offset: 5504)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !517, file: !518, line: 859, baseType: !516, size: 64, offset: 5632)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !517, file: !518, line: 867, baseType: !218, size: 128, offset: 5696)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !517, file: !518, line: 868, baseType: !218, size: 128, offset: 5824)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !517, file: !518, line: 871, baseType: !780, size: 64, offset: 5952)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !782, line: 59, size: 768, elements: !783)
!782 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!783 = !{!784, !785, !786, !787, !792, !793, !800, !809}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !781, file: !782, line: 61, baseType: !530, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !781, file: !782, line: 62, baseType: !7, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !781, file: !782, line: 63, baseType: !162, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !781, file: !782, line: 65, baseType: !788, size: 256, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 256, elements: !453)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !142, line: 182, size: 64, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !789, file: !142, line: 183, baseType: !145, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !781, file: !782, line: 66, baseType: !789, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !781, file: !782, line: 68, baseType: !794, size: 128, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !795, line: 40, baseType: !796)
!795 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !795, line: 36, size: 128, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !796, file: !795, line: 37, baseType: !162)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !796, file: !795, line: 38, baseType: !218, size: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !781, file: !782, line: 69, baseType: !801, size: 128, align: 64, offset: 512)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !142, line: 216, size: 128, align: 64, elements: !802)
!802 = !{!803, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !142, line: 217, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !801, file: !142, line: 218, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !804}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !781, file: !782, line: 70, baseType: !810, size: 128, offset: 640)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !680)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !782, line: 54, size: 128, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !811, file: !782, line: 55, baseType: !113, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !811, file: !782, line: 56, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !782, line: 56, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !517, file: !518, line: 872, baseType: !818, size: 512, offset: 6016)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 512, elements: !453)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !517, file: !518, line: 873, baseType: !218, size: 128, offset: 6528)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !517, file: !518, line: 874, baseType: !218, size: 128, offset: 6656)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !517, file: !518, line: 876, baseType: !822, size: 64, offset: 6784)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !824, line: 26, size: 192, elements: !825)
!824 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !823, file: !824, line: 27, baseType: !7, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !823, file: !824, line: 28, baseType: !828, size: 128, offset: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !829, line: 43, size: 128, elements: !830)
!829 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !828, file: !829, line: 44, baseType: !419)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !828, file: !829, line: 45, baseType: !218, size: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !517, file: !518, line: 879, baseType: !129, size: 64, offset: 6848)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !517, file: !518, line: 882, baseType: !129, size: 64, offset: 6912)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !517, file: !518, line: 884, baseType: !374, size: 64, offset: 6976)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !517, file: !518, line: 885, baseType: !374, size: 64, offset: 7040)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !517, file: !518, line: 890, baseType: !374, size: 64, offset: 7104)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !517, file: !518, line: 891, baseType: !839, size: 128, offset: 7168)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !518, line: 242, size: 128, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !839, file: !518, line: 244, baseType: !374, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !839, file: !518, line: 245, baseType: !374, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !839, file: !518, line: 246, baseType: !419, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !517, file: !518, line: 900, baseType: !149, size: 64, offset: 7296)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !517, file: !518, line: 901, baseType: !149, size: 64, offset: 7360)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !517, file: !518, line: 904, baseType: !374, size: 64, offset: 7424)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !517, file: !518, line: 907, baseType: !374, size: 64, offset: 7488)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !517, file: !518, line: 910, baseType: !149, size: 64, offset: 7552)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !517, file: !518, line: 911, baseType: !149, size: 64, offset: 7616)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !517, file: !518, line: 914, baseType: !851, size: 640, offset: 7680)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !852, line: 123, size: 640, elements: !853)
!852 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!853 = !{!854, !860, !861}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !851, file: !852, line: 124, baseType: !855, size: 576)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 576, elements: !258)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !852, line: 108, size: 192, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !856, file: !852, line: 109, baseType: !374, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !856, file: !852, line: 110, baseType: !648, size: 128, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !851, file: !852, line: 125, baseType: !7, size: 32, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !851, file: !852, line: 126, baseType: !7, size: 32, offset: 608)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !517, file: !518, line: 917, baseType: !863, size: 192, offset: 8320)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !852, line: 134, size: 192, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !863, file: !852, line: 135, baseType: !801, size: 128, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !863, file: !852, line: 136, baseType: !7, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !517, file: !518, line: 923, baseType: !868, size: 64, offset: 8512)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !871, line: 11, flags: DIFlagFwdDecl)
!871 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!872 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !517, file: !518, line: 926, baseType: !868, size: 64, offset: 8576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !517, file: !518, line: 929, baseType: !868, size: 64, offset: 8640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !517, file: !518, line: 933, baseType: !875, size: 64, offset: 8704)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !518, line: 933, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !517, file: !518, line: 943, baseType: !878, size: 128, offset: 8768)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 16)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !517, file: !518, line: 945, baseType: !882, size: 64, offset: 8896)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !518, line: 49, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !517, file: !518, line: 956, baseType: !885, size: 64, offset: 8960)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !518, line: 45, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !517, file: !518, line: 959, baseType: !888, size: 64, offset: 9024)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !518, line: 959, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !517, file: !518, line: 962, baseType: !891, size: 64, offset: 9088)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !518, line: 66, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !517, file: !518, line: 966, baseType: !894, size: 64, offset: 9152)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !896, line: 35, flags: DIFlagFwdDecl)
!896 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!897 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !517, file: !518, line: 969, baseType: !898, size: 64, offset: 9216)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !852, line: 223, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !517, file: !518, line: 970, baseType: !901, size: 64, offset: 9280)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !518, line: 62, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !517, file: !518, line: 971, baseType: !904, size: 64, offset: 9344)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !905, line: 25, baseType: !906)
!905 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !905, line: 23, size: 64, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !906, file: !905, line: 24, baseType: !679, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !517, file: !518, line: 972, baseType: !904, size: 64, offset: 9408)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !517, file: !518, line: 974, baseType: !904, size: 64, offset: 9472)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !517, file: !518, line: 975, baseType: !912, size: 192, offset: 9536)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !913, line: 30, size: 192, elements: !914)
!913 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !912, file: !913, line: 31, baseType: !218, size: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !912, file: !913, line: 32, baseType: !904, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !517, file: !518, line: 976, baseType: !149, size: 64, offset: 9728)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !517, file: !518, line: 977, baseType: !303, size: 64, offset: 9792)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !517, file: !518, line: 978, baseType: !7, size: 32, offset: 9856)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !517, file: !518, line: 980, baseType: !804, size: 64, offset: 9920)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !517, file: !518, line: 989, baseType: !922, size: 128, offset: 9984)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !923, line: 35, size: 128, elements: !924)
!923 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !922, file: !923, line: 36, baseType: !113, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !922, file: !923, line: 37, baseType: !394, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !922, file: !923, line: 38, baseType: !928, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !923, line: 23, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !517, file: !518, line: 992, baseType: !374, size: 64, offset: 10112)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !517, file: !518, line: 993, baseType: !374, size: 64, offset: 10176)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !517, file: !518, line: 996, baseType: !162, offset: 10240)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !517, file: !518, line: 999, baseType: !419, offset: 10240)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !517, file: !518, line: 1001, baseType: !935, size: 64, offset: 10240)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !518, line: 636, size: 64, elements: !936)
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !518, line: 637, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !517, file: !518, line: 1005, baseType: !651, size: 128, offset: 10304)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !517, file: !518, line: 1007, baseType: !516, size: 64, offset: 10432)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !517, file: !518, line: 1009, baseType: !942, size: 64, offset: 10496)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !518, line: 1009, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !517, file: !518, line: 1043, baseType: !100, size: 64, offset: 10560)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !517, file: !518, line: 1046, baseType: !946, size: 64, offset: 10624)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !518, line: 41, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !517, file: !518, line: 1050, baseType: !949, size: 64, offset: 10688)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !518, line: 42, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !517, file: !518, line: 1054, baseType: !952, size: 64, offset: 10752)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !518, line: 55, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !517, file: !518, line: 1056, baseType: !955, size: 64, offset: 10816)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !518, line: 40, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !517, file: !518, line: 1058, baseType: !958, size: 64, offset: 10880)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !518, line: 47, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !517, file: !518, line: 1061, baseType: !961, size: 64, offset: 10944)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !518, line: 43, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !517, file: !518, line: 1064, baseType: !149, size: 64, offset: 11008)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !517, file: !518, line: 1065, baseType: !965, size: 64, offset: 11072)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !913, line: 14, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !913, line: 12, size: 384, elements: !968)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, scope: !967, file: !913, line: 13, baseType: !970, size: 384)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !967, file: !913, line: 13, size: 384, elements: !971)
!971 = !{!972, !973, !974, !975}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !970, file: !913, line: 13, baseType: !113, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !970, file: !913, line: 13, baseType: !113, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !970, file: !913, line: 13, baseType: !113, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !970, file: !913, line: 13, baseType: !976, size: 256, offset: 128)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !977, line: 32, size: 256, elements: !978)
