; ModuleID = '../bcout/drivers/net/wireless/ath/dfs_pri_detector.llvm.bc'
source_filename = "drivers/net/wireless/ath/dfs_pri_detector.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.ath_dfs_pool_stats = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.kmem_cache = type opaque
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.pri_detector = type { void (%struct.pri_detector*)*, %struct.pri_sequence* (%struct.pri_detector*, %struct.pulse_event*)*, void (%struct.pri_detector*, i64)*, %struct.radar_detector_specs*, i64, %struct.list_head, %struct.list_head, i32, i32, i32 }
%struct.pri_sequence = type { %struct.list_head, i32, i32, i32, i32, i64, i64, i64 }
%struct.pulse_event = type { i64, i16, i8, i8, i8 }
%struct.radar_detector_specs = type { i8, i8, i8, i16, i16, i8, i8, i8, i8, i8 }
%struct.pulse_elem = type { %struct.list_head, i64 }

@global_dfs_pool_stats = dso_local global %struct.ath_dfs_pool_stats zeroinitializer, align 4, !dbg !0
@kmalloc_caches = external dso_local global [3 x [14 x %struct.kmem_cache*]], align 16
@.str = private unnamed_addr constant [21 x i8] c"include/linux/slab.h\00", align 1
@pool_lock = internal global %struct.spinlock undef, align 1, !dbg !58

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "global_dfs_pool_stats", scope: !2, file: !3, line: 24, type: !81, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !57, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/wireless/ath/dfs_pri_detector.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 10, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!18 = !{!19, !21, !22, !37, !51, !52, !43, !53, !55}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !20, line: 148, baseType: !7)
!20 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pulse_elem", file: !3, line: 36, size: 192, elements: !24)
!24 = !{!25, !31}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !23, file: !3, line: 37, baseType: !26, size: 128)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !20, line: 178, size: 128, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !20, line: 179, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !26, file: !20, line: 179, baseType: !29, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !23, file: !3, line: 38, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !33, line: 23, baseType: !34)
!33 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !35, line: 31, baseType: !36)
!35 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!36 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pri_sequence", file: !39, line: 35, size: 448, elements: !40)
!39 = !DIFile(filename: "drivers/net/wireless/ath/dfs_pri_detector.h", directory: "/home/lizy2001/genbc/linux")
!40 = !{!41, !42, !45, !46, !47, !48, !49, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !38, file: !39, line: 36, baseType: !26, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pri", scope: !38, file: !39, line: 37, baseType: !43, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !33, line: 21, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !35, line: 27, baseType: !7)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dur", scope: !38, file: !39, line: 38, baseType: !43, size: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !38, file: !39, line: 39, baseType: !43, size: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "count_falses", scope: !38, file: !39, line: 40, baseType: !43, size: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "first_ts", scope: !38, file: !39, line: 41, baseType: !32, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "last_ts", scope: !38, file: !39, line: 42, baseType: !32, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "deadline_ts", scope: !38, file: !39, line: 43, baseType: !32, size: 64, offset: 384)
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!57 = !{!0, !58, !75, !77, !79}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "pool_lock", scope: !2, file: !3, line: 85, type: !60, isLocal: true, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !61, line: 83, baseType: !62)
!61 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !61, line: 71, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !62, file: !61, line: 72, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !61, line: 72, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !65, file: !61, line: 73, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !61, line: 20, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !68, file: !61, line: 21, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !72, line: 25, baseType: !73)
!72 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 25, elements: !74)
!74 = !{}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "singleton_pool_references", scope: !2, file: !3, line: 82, type: !43, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "pulse_pool", scope: !2, file: !3, line: 83, type: !26, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "pseq_pool", scope: !2, file: !3, line: 84, type: !26, isLocal: true, isDefinition: true)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ath_dfs_pool_stats", file: !82, line: 32, size: 224, elements: !83)
!82 = !DIFile(filename: "drivers/net/wireless/ath/dfs_pattern_detector.h", directory: "/home/lizy2001/genbc/linux")
!83 = !{!84, !85, !86, !87, !88, !89, !90}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pool_reference", scope: !81, file: !82, line: 33, baseType: !43, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pulse_allocated", scope: !81, file: !82, line: 34, baseType: !43, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pulse_alloc_error", scope: !81, file: !82, line: 35, baseType: !43, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pulse_used", scope: !81, file: !82, line: 36, baseType: !43, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pseq_allocated", scope: !81, file: !82, line: 37, baseType: !43, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pseq_alloc_error", scope: !81, file: !82, line: 38, baseType: !43, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pseq_used", scope: !81, file: !82, line: 39, baseType: !43, size: 32, offset: 192)
!91 = !{i32 7, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 2}
!94 = !{i32 1, !"Code Model", i32 2}
!95 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!96 = distinct !DISubprogram(name: "pri_detector_init", scope: !3, file: !3, line: 418, type: !97, scopeLine: 419, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !74)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !131}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pri_detector", file: !39, line: 59, size: 704, elements: !101)
!101 = !{!102, !106, !126, !130, !145, !146, !147, !148, !149, !150}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !100, file: !39, line: 60, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !99}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "add_pulse", scope: !100, file: !39, line: 62, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!37, !99, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pulse_event", file: !82, line: 50, size: 128, elements: !112)
!112 = !{!113, !114, !118, !122, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !111, file: !82, line: 51, baseType: !32, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !111, file: !82, line: 52, baseType: !115, size: 16, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !33, line: 19, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !35, line: 24, baseType: !117)
!117 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !111, file: !82, line: 53, baseType: !119, size: 8, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !33, line: 17, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !35, line: 21, baseType: !121)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rssi", scope: !111, file: !82, line: 54, baseType: !119, size: 8, offset: 88)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "chirp", scope: !111, file: !82, line: 55, baseType: !124, size: 8, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !20, line: 30, baseType: !125)
!125 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !100, file: !39, line: 63, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !99, !32}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !100, file: !39, line: 65, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "radar_detector_specs", file: !82, line: 71, size: 112, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !133, file: !82, line: 72, baseType: !119, size: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "width_min", scope: !133, file: !82, line: 73, baseType: !119, size: 8, offset: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "width_max", scope: !133, file: !82, line: 74, baseType: !119, size: 8, offset: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pri_min", scope: !133, file: !82, line: 75, baseType: !115, size: 16, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pri_max", scope: !133, file: !82, line: 76, baseType: !115, size: 16, offset: 48)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "num_pri", scope: !133, file: !82, line: 77, baseType: !119, size: 8, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ppb", scope: !133, file: !82, line: 78, baseType: !119, size: 8, offset: 72)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ppb_thresh", scope: !133, file: !82, line: 79, baseType: !119, size: 8, offset: 80)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "max_pri_tolerance", scope: !133, file: !82, line: 80, baseType: !119, size: 8, offset: 88)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "chirp", scope: !133, file: !82, line: 81, baseType: !124, size: 8, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "last_ts", scope: !100, file: !39, line: 68, baseType: !32, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sequences", scope: !100, file: !39, line: 69, baseType: !26, size: 128, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pulses", scope: !100, file: !39, line: 70, baseType: !26, size: 128, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !100, file: !39, line: 71, baseType: !43, size: 32, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "max_count", scope: !100, file: !39, line: 72, baseType: !43, size: 32, offset: 608)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !100, file: !39, line: 73, baseType: !43, size: 32, offset: 640)
!151 = !DILocalVariable(name: "rs", arg: 1, scope: !96, file: !3, line: 418, type: !131)
!152 = !DILocation(line: 418, column: 75, scope: !96)
!153 = !DILocalVariable(name: "de", scope: !96, file: !3, line: 420, type: !99)
!154 = !DILocation(line: 420, column: 23, scope: !96)
!155 = !DILocation(line: 422, column: 7, scope: !96)
!156 = !DILocation(line: 422, column: 5, scope: !96)
!157 = !DILocation(line: 423, column: 6, scope: !158)
!158 = distinct !DILexicalBlock(scope: !96, file: !3, line: 423, column: 6)
!159 = !DILocation(line: 423, column: 9, scope: !158)
!160 = !DILocation(line: 423, column: 6, scope: !96)
!161 = !DILocation(line: 424, column: 3, scope: !158)
!162 = !DILocation(line: 425, column: 2, scope: !96)
!163 = !DILocation(line: 425, column: 6, scope: !96)
!164 = !DILocation(line: 425, column: 11, scope: !96)
!165 = !DILocation(line: 426, column: 2, scope: !96)
!166 = !DILocation(line: 426, column: 6, scope: !96)
!167 = !DILocation(line: 426, column: 16, scope: !96)
!168 = !DILocation(line: 427, column: 2, scope: !96)
!169 = !DILocation(line: 427, column: 6, scope: !96)
!170 = !DILocation(line: 427, column: 12, scope: !96)
!171 = !DILocation(line: 429, column: 18, scope: !96)
!172 = !DILocation(line: 429, column: 22, scope: !96)
!173 = !DILocation(line: 429, column: 2, scope: !96)
!174 = !DILocation(line: 430, column: 18, scope: !96)
!175 = !DILocation(line: 430, column: 22, scope: !96)
!176 = !DILocation(line: 430, column: 2, scope: !96)
!177 = !DILocation(line: 431, column: 20, scope: !96)
!178 = !DILocation(line: 431, column: 24, scope: !96)
!179 = !DILocation(line: 431, column: 34, scope: !96)
!180 = !DILocation(line: 431, column: 38, scope: !96)
!181 = !DILocation(line: 431, column: 32, scope: !96)
!182 = !DILocation(line: 431, column: 44, scope: !96)
!183 = !DILocation(line: 431, column: 48, scope: !96)
!184 = !DILocation(line: 431, column: 42, scope: !96)
!185 = !DILocation(line: 431, column: 2, scope: !96)
!186 = !DILocation(line: 431, column: 6, scope: !96)
!187 = !DILocation(line: 431, column: 18, scope: !96)
!188 = !DILocation(line: 432, column: 18, scope: !96)
!189 = !DILocation(line: 432, column: 22, scope: !96)
!190 = !DILocation(line: 432, column: 26, scope: !96)
!191 = !DILocation(line: 432, column: 2, scope: !96)
!192 = !DILocation(line: 432, column: 6, scope: !96)
!193 = !DILocation(line: 432, column: 16, scope: !96)
!194 = !DILocation(line: 433, column: 11, scope: !96)
!195 = !DILocation(line: 433, column: 2, scope: !96)
!196 = !DILocation(line: 433, column: 6, scope: !96)
!197 = !DILocation(line: 433, column: 9, scope: !96)
!198 = !DILocation(line: 435, column: 2, scope: !96)
!199 = !DILocation(line: 436, column: 9, scope: !96)
!200 = !DILocation(line: 436, column: 2, scope: !96)
!201 = !DILocation(line: 437, column: 1, scope: !96)
!202 = distinct !DISubprogram(name: "kzalloc", scope: !6, file: !6, line: 662, type: !203, scopeLine: 663, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!203 = !DISubroutineType(types: !204)
!204 = !{!21, !205, !19}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 55, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !207, line: 72, baseType: !208)
!207 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !207, line: 16, baseType: !51)
!209 = !DILocalVariable(name: "s", arg: 1, scope: !210, file: !6, line: 445, type: !213)
!210 = distinct !DISubprogram(name: "kmem_cache_alloc_trace", scope: !6, file: !6, line: 445, type: !211, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!211 = !DISubroutineType(types: !212)
