; ModuleID = '../bcout/drivers/mtd/nand/raw/ams-delta.llvm.bc'
source_filename = "drivers/mtd/nand/raw/ams-delta.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_gpio_nand_driver_init6:\09\09\09"
module asm ".long\09gpio_nand_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!55 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_SOFT", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_HOST", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_DIE", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_placement", file: !51, line: 158, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_UNKNOWN", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_OOB", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_INTERLEAVED", value: 2, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_algo", file: !51, line: 171, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_UNKNOWN", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !51, line: 90, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_interface_type", file: !74, line: 481, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "./include/linux/mtd/rawnand.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76}
!76 = !DIEnumerator(name: "NAND_SDR_IFACE", value: 0, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_op_instr_type", file: !74, line: 570, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "NAND_OP_CMD_INSTR", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "NAND_OP_ADDR_INSTR", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "NAND_OP_DATA_IN_INSTR", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "NAND_OP_DATA_OUT_INSTR", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "NAND_OP_WAITRDY_INSTR", value: 4, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpiod_flags", file: !85, line: 49, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./include/linux/gpio/consumer.h", directory: "/home/lizy2001/genbc/linux")
!86 = !{!87, !88, !89, !90, !91, !92}
!87 = !DIEnumerator(name: "GPIOD_ASIS", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "GPIOD_IN", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "GPIOD_OUT_LOW", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "GPIOD_OUT_HIGH", value: 7, isUnsigned: true)
!91 = !DIEnumerator(name: "GPIOD_OUT_LOW_OPEN_DRAIN", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "GPIOD_OUT_HIGH_OPEN_DRAIN", value: 15, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 10, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!95 = !{!96, !97}
!96 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!98 = !{!99, !102, !104, !105, !106, !107, !108}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !101, line: 76, flags: DIFlagFwdDecl)
!101 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !103, line: 148, baseType: !7)
!103 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_chip", file: !74, line: 1096, size: 16704, elements: !110)
!110 = !{!111, !2421, !2427, !2451, !2459, !2535, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2682, !2683, !2684, !2685, !2686, !2687, !2689, !2739}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !109, file: !74, line: 1097, baseType: !112, size: 11200)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !51, line: 319, size: 11200, elements: !113)
!113 = !{!114, !2314, !2326, !2396, !2401, !2405}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !112, file: !51, line: 320, baseType: !115, size: 9664)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !116, line: 235, size: 9664, elements: !117)
!116 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!117 = !{!118, !121, !127, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !146, !148, !164, !185, !186, !187, !188, !196, !206, !222, !226, !231, !237, !238, !257, !258, !269, !270, !271, !272, !273, !274, !285, !289, !293, !294, !295, !299, !300, !301, !302, !306, !307, !308, !309, !310, !313, !325, !332, !333, !334, !335, !2284, !2285, !2293, !2297, !2298, !2299}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !116, line: 236, baseType: !119, size: 8)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !103, line: 79, baseType: !120)
!120 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !116, line: 237, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !103, line: 104, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !124, line: 21, baseType: !125)
!124 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !126, line: 27, baseType: !7)
!126 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !115, file: !116, line: 238, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !103, line: 107, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !124, line: 23, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !126, line: 31, baseType: !131)
!131 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !115, file: !116, line: 244, baseType: !122, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !115, file: !116, line: 252, baseType: !122, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !115, file: !116, line: 263, baseType: !122, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !115, file: !116, line: 265, baseType: !122, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !115, file: !116, line: 266, baseType: !122, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !115, file: !116, line: 272, baseType: !7, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !115, file: !116, line: 273, baseType: !7, size: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !115, file: !116, line: 275, baseType: !7, size: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !115, file: !116, line: 276, baseType: !7, size: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !115, file: !116, line: 285, baseType: !7, size: 32, offset: 416)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !116, line: 288, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !115, file: !116, line: 289, baseType: !147, size: 32, offset: 512)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !115, file: !116, line: 292, baseType: !149, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !116, line: 101, size: 128, elements: !152)
!152 = !{!153, !163}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !151, file: !116, line: 102, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!147, !157, !147, !158}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !116, line: 87, size: 64, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !159, file: !116, line: 88, baseType: !123, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !159, file: !116, line: 89, baseType: !123, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !151, file: !116, line: 104, baseType: !154, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !115, file: !116, line: 295, baseType: !165, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !116, line: 176, size: 192, elements: !168)
!168 = !{!169, !170, !179}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !167, file: !116, line: 177, baseType: !147, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !167, file: !116, line: 178, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!147, !157, !147, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !116, line: 138, size: 64, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !175, file: !116, line: 139, baseType: !147, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !175, file: !116, line: 140, baseType: !147, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !167, file: !116, line: 180, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!147, !157, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !115, file: !116, line: 298, baseType: !7, size: 32, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !115, file: !116, line: 301, baseType: !7, size: 32, offset: 736)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !115, file: !116, line: 306, baseType: !147, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !115, file: !116, line: 307, baseType: !189, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !116, line: 36, size: 192, elements: !191)
!191 = !{!192, !193, !194, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !190, file: !116, line: 37, baseType: !128, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !190, file: !116, line: 38, baseType: !122, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !190, file: !116, line: 39, baseType: !122, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !190, file: !116, line: 40, baseType: !107, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !115, file: !116, line: 313, baseType: !197, size: 64, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!147, !157, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !116, line: 30, size: 192, elements: !202)
!202 = !{!203, !204, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !201, file: !116, line: 31, baseType: !128, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !201, file: !116, line: 32, baseType: !128, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !201, file: !116, line: 33, baseType: !128, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !115, file: !116, line: 314, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!147, !157, !210, !214, !217, !218, !219}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !103, line: 46, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !212, line: 88, baseType: !213)
!212 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!213 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 55, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !212, line: 72, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !212, line: 16, baseType: !105)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !103, line: 158, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !103, line: 153, baseType: !129)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !115, file: !116, line: 316, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!147, !157, !210, !214}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !115, file: !116, line: 317, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!147, !157, !210, !214, !217, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !115, file: !116, line: 319, baseType: !232, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!147, !157, !210, !214, !217, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !115, file: !116, line: 321, baseType: !232, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !115, file: !116, line: 323, baseType: !239, size: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!147, !157, !210, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !116, line: 64, size: 512, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !243, file: !116, line: 65, baseType: !7, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !116, line: 66, baseType: !214, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !243, file: !116, line: 67, baseType: !214, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !243, file: !116, line: 68, baseType: !214, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !243, file: !116, line: 69, baseType: !214, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !243, file: !116, line: 70, baseType: !122, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !243, file: !116, line: 71, baseType: !252, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !103, line: 102, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !124, line: 17, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !126, line: 21, baseType: !120)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !243, file: !116, line: 72, baseType: !252, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !115, file: !116, line: 325, baseType: !239, size: 64, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !115, file: !116, line: 327, baseType: !259, size: 64, offset: 1408)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!147, !157, !214, !217, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !264, line: 146, size: 96, elements: !265)
!264 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!265 = !{!266, !267, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !263, file: !264, line: 147, baseType: !125, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !263, file: !264, line: 148, baseType: !125, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !263, file: !264, line: 149, baseType: !125, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !115, file: !116, line: 329, baseType: !227, size: 64, offset: 1472)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !115, file: !116, line: 331, baseType: !259, size: 64, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !115, file: !116, line: 333, baseType: !227, size: 64, offset: 1600)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !115, file: !116, line: 335, baseType: !227, size: 64, offset: 1664)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !115, file: !116, line: 337, baseType: !223, size: 64, offset: 1728)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !115, file: !116, line: 339, baseType: !275, size: 64, offset: 1792)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!147, !157, !278, !105, !210, !217}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !281, line: 15, size: 128, elements: !282)
!281 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !280, file: !281, line: 16, baseType: !104, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !280, file: !281, line: 17, baseType: !214, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !115, file: !116, line: 341, baseType: !286, size: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !157}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !115, file: !116, line: 342, baseType: !290, size: 64, offset: 1920)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!147, !157, !210, !128}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !115, file: !116, line: 343, baseType: !290, size: 64, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !115, file: !116, line: 344, baseType: !290, size: 64, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !115, file: !116, line: 345, baseType: !296, size: 64, offset: 2112)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!147, !157, !210}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !115, file: !116, line: 346, baseType: !296, size: 64, offset: 2176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !115, file: !116, line: 347, baseType: !296, size: 64, offset: 2240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !115, file: !116, line: 348, baseType: !223, size: 64, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !115, file: !116, line: 349, baseType: !303, size: 64, offset: 2368)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!147, !157}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !115, file: !116, line: 350, baseType: !286, size: 64, offset: 2432)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !115, file: !116, line: 351, baseType: !286, size: 64, offset: 2496)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !115, file: !116, line: 356, baseType: !303, size: 64, offset: 2560)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !115, file: !116, line: 357, baseType: !286, size: 64, offset: 2624)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !115, file: !116, line: 363, baseType: !311, size: 8, offset: 2688)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !103, line: 30, baseType: !312)
!312 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !115, file: !116, line: 365, baseType: !314, size: 192, offset: 2752)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !315, line: 54, size: 192, elements: !316)
!315 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!316 = !{!317, !323, !324}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !314, file: !315, line: 55, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !315, line: 51, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!147, !322, !105, !104}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !315, line: 56, baseType: !322, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !314, file: !315, line: 57, baseType: !147, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !115, file: !116, line: 368, baseType: !326, size: 128, offset: 2944)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !264, line: 250, size: 128, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !326, file: !264, line: 251, baseType: !125, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !326, file: !264, line: 252, baseType: !125, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !326, file: !264, line: 253, baseType: !125, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !326, file: !264, line: 254, baseType: !125, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !115, file: !116, line: 370, baseType: !147, size: 32, offset: 3072)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !115, file: !116, line: 372, baseType: !104, size: 64, offset: 3136)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !115, file: !116, line: 374, baseType: !99, size: 64, offset: 3200)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !115, file: !116, line: 375, baseType: !336, size: 5568, offset: 3264)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !337)
!337 = !{!338, !1810, !1812, !1815, !1816, !1867, !1961, !1962, !1963, !1964, !1965, !1974, !2079, !2092, !2095, !2096, !2100, !2102, !2103, !2104, !2108, !2114, !2115, !2118, !2233, !2234, !2237, !2238, !2239, !2240, !2272, !2273, !2274, !2277, !2280, !2281, !2282, !2283}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !336, file: !30, line: 462, baseType: !339, size: 512)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !340, line: 64, size: 512, elements: !341)
!340 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!341 = !{!342, !343, !349, !351, !411, !1647, !1800, !1805, !1806, !1807, !1808, !1809}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !340, line: 65, baseType: !143, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !339, file: !340, line: 66, baseType: !344, size: 128, offset: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !103, line: 178, size: 128, elements: !345)
!345 = !{!346, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !103, line: 179, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !344, file: !103, line: 179, baseType: !347, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !339, file: !340, line: 67, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !339, file: !340, line: 68, baseType: !352, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !340, line: 192, size: 704, elements: !354)
!354 = !{!355, !356, !372, !373}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !353, file: !340, line: 193, baseType: !344, size: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !353, file: !340, line: 194, baseType: !357, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !358, line: 83, baseType: !359)
!358 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !358, line: 71, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !358, line: 72, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !358, line: 72, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !362, file: !358, line: 73, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !358, line: 20, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !365, file: !358, line: 21, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !369, line: 25, baseType: !370)
!369 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 25, elements: !371)
!371 = !{}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !353, file: !340, line: 195, baseType: !339, size: 512, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !353, file: !340, line: 196, baseType: !374, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !340, line: 156, size: 192, elements: !377)
!377 = !{!378, !383, !388}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !376, file: !340, line: 157, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!147, !352, !350}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !340, line: 158, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!143, !352, !350}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !376, file: !340, line: 159, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!147, !352, !350, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !340, line: 148, size: 20736, elements: !395)
!395 = !{!396, !401, !405, !406, !410}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !394, file: !340, line: 149, baseType: !397, size: 192)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 192, elements: !399)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!399 = !{!400}
!400 = !DISubrange(count: 3)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !394, file: !340, line: 150, baseType: !402, size: 4096, offset: 192)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 4096, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !394, file: !340, line: 151, baseType: !147, size: 32, offset: 4288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !394, file: !340, line: 152, baseType: !407, size: 16384, offset: 4320)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 16384, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 2048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !394, file: !340, line: 153, baseType: !147, size: 32, offset: 20704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !339, file: !340, line: 69, baseType: !412, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !340, line: 138, size: 448, elements: !414)
!414 = !{!415, !419, !443, !445, !1592, !1625, !1629}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !413, file: !340, line: 139, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !350}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !413, file: !340, line: 140, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !423, line: 230, size: 128, elements: !424)
!423 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!424 = !{!425, !439}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !422, file: !423, line: 231, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !350, !432, !398}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !103, line: 60, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !212, line: 73, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !212, line: 15, baseType: !106)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !423, line: 30, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !423, line: 31, baseType: !143, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !433, file: !423, line: 32, baseType: !437, size: 16, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !103, line: 19, baseType: !438)
!438 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !422, file: !423, line: 232, baseType: !440, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!429, !350, !432, !143, !214}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !413, file: !340, line: 141, baseType: !444, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !413, file: !340, line: 142, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !423, line: 84, size: 320, elements: !450)
!450 = !{!451, !452, !456, !1589, !1590}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !449, file: !423, line: 85, baseType: !143, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !449, file: !423, line: 86, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!437, !350, !432, !147}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !449, file: !423, line: 88, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!437, !350, !460, !147}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !423, line: 168, size: 448, elements: !462)
!462 = !{!463, !464, !465, !466, !473, !474}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !461, file: !423, line: 169, baseType: !433, size: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !461, file: !423, line: 170, baseType: !214, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !461, file: !423, line: 171, baseType: !104, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !461, file: !423, line: 172, baseType: !467, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!429, !470, !350, !460, !398, !210, !214}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !472, line: 526, flags: DIFlagFwdDecl)
!472 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!473 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !461, file: !423, line: 174, baseType: !467, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !461, file: !423, line: 176, baseType: !475, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!147, !470, !350, !460, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !480, line: 305, size: 1472, elements: !481)
!480 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!481 = !{!482, !483, !484, !485, !486, !494, !495, !1563, !1569, !1570, !1575, !1576, !1579, !1583, !1584, !1585, !1586, !1587}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !479, file: !480, line: 308, baseType: !105, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !479, file: !480, line: 309, baseType: !105, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !479, file: !480, line: 313, baseType: !478, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !479, file: !480, line: 313, baseType: !478, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !479, file: !480, line: 315, baseType: !487, size: 192, align: 64, offset: 256)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !488, line: 24, size: 192, align: 64, elements: !489)
!488 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!489 = !{!490, !491, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !487, file: !488, line: 25, baseType: !105, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !487, file: !488, line: 26, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !487, file: !488, line: 27, baseType: !492, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !479, file: !480, line: 323, baseType: !105, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !479, file: !480, line: 327, baseType: !496, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !480, line: 388, size: 7296, elements: !498)
!498 = !{!499, !1559}
!499 = !DIDerivedType(tag: DW_TAG_member, scope: !497, file: !480, line: 389, baseType: !500, size: 7296)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !480, line: 389, size: 7296, elements: !501)
!501 = !{!502, !503, !507, !508, !512, !513, !514, !515, !516, !524, !529, !530, !531, !532, !541, !542, !543, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !578, !586, !589, !637, !638, !1530, !1531, !1534, !1537, !1538, !1541, !1542, !1543, !1546, !1558}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !500, file: !480, line: 390, baseType: !478, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !500, file: !480, line: 391, baseType: !504, size: 64, offset: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !488, line: 31, size: 64, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !504, file: !488, line: 32, baseType: !492, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !500, file: !480, line: 392, baseType: !129, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !500, file: !480, line: 394, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!105, !470, !105, !105, !105, !105}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !500, file: !480, line: 398, baseType: !105, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !500, file: !480, line: 399, baseType: !105, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !500, file: !480, line: 405, baseType: !105, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !500, file: !480, line: 406, baseType: !105, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !500, file: !480, line: 407, baseType: !517, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !472, line: 286, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 286, size: 64, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !519, file: !472, line: 286, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !523, line: 18, baseType: !105)
!523 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!524 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !500, file: !480, line: 416, baseType: !525, size: 32, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !103, line: 168, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 166, size: 32, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !526, file: !103, line: 167, baseType: !147, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !500, file: !480, line: 428, baseType: !525, size: 32, offset: 608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !500, file: !480, line: 437, baseType: !525, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !500, file: !480, line: 447, baseType: !525, size: 32, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !500, file: !480, line: 450, baseType: !533, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !534, line: 13, baseType: !535)
!534 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !103, line: 175, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 173, size: 64, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !536, file: !103, line: 174, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !124, line: 22, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !126, line: 30, baseType: !213)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !500, file: !480, line: 452, baseType: !147, size: 32, offset: 768)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !500, file: !480, line: 454, baseType: !357, offset: 800)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !500, file: !480, line: 457, baseType: !544, size: 256, offset: 832)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !545, line: 35, size: 256, elements: !546)
!545 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!546 = !{!547, !548, !549, !551}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !544, file: !545, line: 36, baseType: !533, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !544, file: !545, line: 42, baseType: !533, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !544, file: !545, line: 46, baseType: !550, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !358, line: 29, baseType: !365)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !544, file: !545, line: 47, baseType: !344, size: 128, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !500, file: !480, line: 459, baseType: !344, size: 128, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !500, file: !480, line: 466, baseType: !105, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !500, file: !480, line: 467, baseType: !105, size: 64, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !500, file: !480, line: 469, baseType: !105, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !500, file: !480, line: 470, baseType: !105, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !500, file: !480, line: 471, baseType: !535, size: 64, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !500, file: !480, line: 472, baseType: !105, size: 64, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !500, file: !480, line: 473, baseType: !105, size: 64, offset: 1600)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !500, file: !480, line: 474, baseType: !105, size: 64, offset: 1664)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !500, file: !480, line: 475, baseType: !105, size: 64, offset: 1728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !500, file: !480, line: 477, baseType: !357, offset: 1792)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !500, file: !480, line: 478, baseType: !105, size: 64, offset: 1792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !500, file: !480, line: 478, baseType: !105, size: 64, offset: 1856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !500, file: !480, line: 478, baseType: !105, size: 64, offset: 1920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !500, file: !480, line: 478, baseType: !105, size: 64, offset: 1984)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !500, file: !480, line: 479, baseType: !105, size: 64, offset: 2048)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !500, file: !480, line: 479, baseType: !105, size: 64, offset: 2112)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !500, file: !480, line: 479, baseType: !105, size: 64, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !500, file: !480, line: 480, baseType: !105, size: 64, offset: 2240)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !500, file: !480, line: 480, baseType: !105, size: 64, offset: 2304)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !500, file: !480, line: 480, baseType: !105, size: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !500, file: !480, line: 480, baseType: !105, size: 64, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !500, file: !480, line: 482, baseType: !575, size: 2816, offset: 2496)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 2816, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 44)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !500, file: !480, line: 488, baseType: !579, size: 256, offset: 5312)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !580, line: 60, size: 256, elements: !581)
!580 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !579, file: !580, line: 61, baseType: !583, size: 256)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 256, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 4)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !500, file: !480, line: 490, baseType: !587, size: 64, offset: 5568)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !480, line: 490, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !500, file: !480, line: 493, baseType: !590, size: 896, offset: 5632)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !591, line: 53, baseType: !592)
!591 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !591, line: 13, size: 896, elements: !593)
!593 = !{!594, !595, !596, !597, !600, !601, !608, !609, !629, !630, !633}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !592, file: !591, line: 18, baseType: !129, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !592, file: !591, line: 28, baseType: !535, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !592, file: !591, line: 31, baseType: !544, size: 256, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !592, file: !591, line: 32, baseType: !598, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !591, line: 32, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !592, file: !591, line: 37, baseType: !438, size: 16, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !592, file: !591, line: 40, baseType: !602, size: 192, offset: 512)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !603, line: 53, size: 192, elements: !604)
!603 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !602, file: !603, line: 54, baseType: !533, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !602, file: !603, line: 55, baseType: !357, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !602, file: !603, line: 59, baseType: !344, size: 128, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !592, file: !591, line: 41, baseType: !104, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !592, file: !591, line: 42, baseType: !610, size: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !613, line: 13, size: 896, elements: !614)
!613 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !612, file: !613, line: 14, baseType: !104, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !612, file: !613, line: 15, baseType: !105, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !612, file: !613, line: 17, baseType: !105, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !612, file: !613, line: 17, baseType: !105, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !612, file: !613, line: 19, baseType: !106, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !612, file: !613, line: 21, baseType: !106, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !612, file: !613, line: 22, baseType: !106, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !612, file: !613, line: 23, baseType: !106, size: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !612, file: !613, line: 24, baseType: !106, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !612, file: !613, line: 25, baseType: !106, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !612, file: !613, line: 26, baseType: !106, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !612, file: !613, line: 27, baseType: !106, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !612, file: !613, line: 28, baseType: !106, size: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !612, file: !613, line: 29, baseType: !106, size: 64, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !592, file: !591, line: 44, baseType: !525, size: 32, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !592, file: !591, line: 50, baseType: !631, size: 16, offset: 864)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !124, line: 19, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !126, line: 24, baseType: !438)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !592, file: !591, line: 51, baseType: !634, size: 16, offset: 880)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !124, line: 18, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !126, line: 23, baseType: !636)
!636 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !480, line: 495, baseType: !105, size: 64, offset: 6528)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !500, file: !480, line: 497, baseType: !639, size: 64, offset: 6592)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !480, line: 381, size: 384, elements: !641)
!641 = !{!642, !643, !1529}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !640, file: !480, line: 382, baseType: !525, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !640, file: !480, line: 383, baseType: !644, size: 128, offset: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !480, line: 376, size: 128, elements: !645)
!645 = !{!646, !1527}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !644, file: !480, line: 377, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !649, line: 640, size: 48640, elements: !650)
!649 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!650 = !{!651, !657, !659, !660, !666, !667, !668, !669, !670, !671, !672, !673, !677, !695, !706, !798, !799, !800, !811, !812, !814, !815, !816, !817, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !896, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !952, !954, !955, !956, !968, !970, !971, !972, !973, !974, !980, !981, !982, !983, !984, !985, !986, !998, !1003, !1008, !1009, !1010, !1013, !1017, !1020, !1023, !1026, !1029, !1033, !1036, !1039, !1045, !1046, !1047, !1053, !1054, !1055, !1056, !1057, !1066, !1067, !1068, !1069, !1070, !1075, !1076, !1077, !1080, !1081, !1084, !1087, !1090, !1093, !1096, !1099, !1100, !1180, !1183, !1186, !1187, !1190, !1191, !1192, !1198, !1199, !1200, !1213, !1214, !1215, !1225, !1230, !1233, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !648, file: !649, line: 646, baseType: !652, size: 128)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !653, line: 56, size: 128, elements: !654)
!653 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !652, file: !653, line: 57, baseType: !105, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !652, file: !653, line: 58, baseType: !123, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !648, file: !649, line: 649, baseType: !658, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !648, file: !649, line: 657, baseType: !104, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !648, file: !649, line: 658, baseType: !661, size: 32, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !662, line: 113, baseType: !663)
!662 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !662, line: 111, size: 32, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !663, file: !662, line: 112, baseType: !525, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !649, line: 660, baseType: !7, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !648, file: !649, line: 661, baseType: !7, size: 32, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !648, file: !649, line: 684, baseType: !147, size: 32, offset: 352)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !648, file: !649, line: 686, baseType: !147, size: 32, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !648, file: !649, line: 687, baseType: !147, size: 32, offset: 416)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !648, file: !649, line: 688, baseType: !147, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !648, file: !649, line: 689, baseType: !7, size: 32, offset: 480)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !648, file: !649, line: 691, baseType: !674, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !649, line: 691, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !648, file: !649, line: 692, baseType: !678, size: 832, offset: 576)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !649, line: 451, size: 832, elements: !679)
!679 = !{!680, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !678, file: !649, line: 453, baseType: !681, size: 128)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !649, line: 325, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !681, file: !649, line: 326, baseType: !105, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !681, file: !649, line: 327, baseType: !123, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !678, file: !649, line: 454, baseType: !487, size: 192, align: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !678, file: !649, line: 455, baseType: !344, size: 128, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !678, file: !649, line: 456, baseType: !7, size: 32, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !678, file: !649, line: 458, baseType: !129, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !678, file: !649, line: 459, baseType: !129, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !678, file: !649, line: 460, baseType: !129, size: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !678, file: !649, line: 461, baseType: !129, size: 64, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !678, file: !649, line: 463, baseType: !129, size: 64, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !678, file: !649, line: 465, baseType: !694, offset: 832)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !649, line: 415, elements: !371)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !648, file: !649, line: 693, baseType: !696, size: 384, offset: 1408)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !649, line: 489, size: 384, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !696, file: !649, line: 490, baseType: !344, size: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !696, file: !649, line: 491, baseType: !105, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !696, file: !649, line: 492, baseType: !105, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !696, file: !649, line: 493, baseType: !7, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !696, file: !649, line: 494, baseType: !438, size: 16, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !696, file: !649, line: 495, baseType: !438, size: 16, offset: 304)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !696, file: !649, line: 497, baseType: !705, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !648, file: !649, line: 697, baseType: !707, size: 1792, offset: 1792)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !649, line: 507, size: 1792, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !795, !796}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !707, file: !649, line: 508, baseType: !487, size: 192, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !707, file: !649, line: 515, baseType: !129, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !707, file: !649, line: 516, baseType: !129, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !707, file: !649, line: 517, baseType: !129, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !707, file: !649, line: 518, baseType: !129, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !707, file: !649, line: 519, baseType: !129, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !707, file: !649, line: 526, baseType: !539, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !707, file: !649, line: 527, baseType: !129, size: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !649, line: 528, baseType: !7, size: 32, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !707, file: !649, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !707, file: !649, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !707, file: !649, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !707, file: !649, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !707, file: !649, line: 563, baseType: !723, size: 512, offset: 704)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !724)
!724 = !{!725, !733, !734, !739, !791, !792, !793, !794}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !723, file: !6, line: 119, baseType: !726, size: 256)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !727, line: 9, size: 256, elements: !728)
!727 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !726, file: !727, line: 10, baseType: !487, size: 192, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !726, file: !727, line: 11, baseType: !731, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !732, line: 29, baseType: !539)
!732 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !723, file: !6, line: 120, baseType: !731, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !723, file: !6, line: 121, baseType: !735, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!5, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !723, file: !6, line: 122, baseType: !740, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !742)
!742 = !{!743, !763, !764, !767, !777, !778, !786, !790}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !741, file: !6, line: 160, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !745, file: !6, line: 215, baseType: !550)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !745, file: !6, line: 216, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !745, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !745, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !745, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !745, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !745, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !745, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !745, file: !6, line: 233, baseType: !731, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !745, file: !6, line: 234, baseType: !738, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !745, file: !6, line: 235, baseType: !731, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !745, file: !6, line: 236, baseType: !738, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !745, file: !6, line: 237, baseType: !760, size: 4096, offset: 512)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 4096, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !741, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !741, file: !6, line: 162, baseType: !765, size: 32, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !103, line: 27, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !212, line: 96, baseType: !147)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !741, file: !6, line: 163, baseType: !768, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !769, line: 276, baseType: !770)
!769 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !769, line: 276, size: 32, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !770, file: !769, line: 276, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !769, line: 70, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !769, line: 65, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !774, file: !769, line: 66, baseType: !7, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !741, file: !6, line: 164, baseType: !738, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !741, file: !6, line: 165, baseType: !779, size: 128, offset: 256)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !727, line: 14, size: 128, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !779, file: !727, line: 15, baseType: !782, size: 128)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !488, line: 125, size: 128, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !782, file: !488, line: 126, baseType: !504, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !782, file: !488, line: 127, baseType: !492, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !741, file: !6, line: 166, baseType: !787, size: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!731}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !741, file: !6, line: 167, baseType: !731, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !723, file: !6, line: 123, baseType: !254, size: 8, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !723, file: !6, line: 124, baseType: !254, size: 8, offset: 456)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !723, file: !6, line: 125, baseType: !254, size: 8, offset: 464)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !723, file: !6, line: 126, baseType: !254, size: 8, offset: 472)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !707, file: !649, line: 572, baseType: !723, size: 512, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !707, file: !649, line: 580, baseType: !797, size: 64, offset: 1728)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !648, file: !649, line: 721, baseType: !7, size: 32, offset: 3584)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !648, file: !649, line: 722, baseType: !147, size: 32, offset: 3616)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !648, file: !649, line: 723, baseType: !801, size: 64, offset: 3648)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !804, line: 17, baseType: !805)
!804 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !804, line: 17, size: 64, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !805, file: !804, line: 17, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 64, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 1)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !648, file: !649, line: 724, baseType: !803, size: 64, offset: 3712)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !648, file: !649, line: 749, baseType: !813, offset: 3776)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !649, line: 290, elements: !371)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !648, file: !649, line: 751, baseType: !344, size: 128, offset: 3776)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !648, file: !649, line: 757, baseType: !496, size: 64, offset: 3904)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !648, file: !649, line: 758, baseType: !496, size: 64, offset: 3968)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !648, file: !649, line: 761, baseType: !818, size: 320, offset: 4032)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !580, line: 34, size: 320, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !818, file: !580, line: 35, baseType: !129, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !818, file: !580, line: 36, baseType: !822, size: 256, offset: 64)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 256, elements: !584)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !648, file: !649, line: 766, baseType: !147, size: 32, offset: 4352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !648, file: !649, line: 767, baseType: !147, size: 32, offset: 4384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !648, file: !649, line: 768, baseType: !147, size: 32, offset: 4416)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !648, file: !649, line: 770, baseType: !147, size: 32, offset: 4448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !648, file: !649, line: 772, baseType: !105, size: 64, offset: 4480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !648, file: !649, line: 775, baseType: !7, size: 32, offset: 4544)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !648, file: !649, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !648, file: !649, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !648, file: !649, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !648, file: !649, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !648, file: !649, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !648, file: !649, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !648, file: !649, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !648, file: !649, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !648, file: !649, line: 831, baseType: !105, size: 64, offset: 4672)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !648, file: !649, line: 833, baseType: !839, size: 384, offset: 4736)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !840)
!840 = !{!841, !846}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !839, file: !12, line: 26, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!106, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, scope: !839, file: !12, line: 27, baseType: !847, size: 320, offset: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !839, file: !12, line: 27, size: 320, elements: !848)
!848 = !{!849, !859, !886}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !847, file: !12, line: 36, baseType: !850, size: 320)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !12, line: 29, size: 320, elements: !851)
!851 = !{!852, !854, !855, !856, !857, !858}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !850, file: !12, line: 30, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !850, file: !12, line: 31, baseType: !123, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !850, file: !12, line: 32, baseType: !123, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !850, file: !12, line: 33, baseType: !123, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !850, file: !12, line: 34, baseType: !129, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !850, file: !12, line: 35, baseType: !853, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !847, file: !12, line: 46, baseType: !860, size: 192)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !12, line: 38, size: 192, elements: !861)
!861 = !{!862, !863, !864, !885}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !860, file: !12, line: 39, baseType: !765, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !860, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, scope: !860, file: !12, line: 41, baseType: !865, size: 64, offset: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !12, line: 41, size: 64, elements: !866)
!866 = !{!867, !875}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !865, file: !12, line: 42, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !870, line: 7, size: 128, elements: !871)
!870 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!871 = !{!872, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !869, file: !870, line: 8, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !212, line: 93, baseType: !213)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !869, file: !870, line: 9, baseType: !213, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !865, file: !12, line: 43, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !878, line: 7, size: 64, elements: !879)
!878 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!879 = !{!880, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !877, file: !878, line: 8, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !878, line: 5, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !124, line: 20, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !126, line: 26, baseType: !147)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !877, file: !878, line: 9, baseType: !882, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !860, file: !12, line: 45, baseType: !129, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !847, file: !12, line: 54, baseType: !887, size: 256)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !12, line: 48, size: 256, elements: !888)
!888 = !{!889, !892, !893, !894, !895}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !887, file: !12, line: 49, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !887, file: !12, line: 50, baseType: !147, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !887, file: !12, line: 51, baseType: !147, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !887, file: !12, line: 52, baseType: !105, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !887, file: !12, line: 53, baseType: !105, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !648, file: !649, line: 835, baseType: !897, size: 32, offset: 5120)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !103, line: 22, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !212, line: 28, baseType: !147)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !648, file: !649, line: 836, baseType: !897, size: 32, offset: 5152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !648, file: !649, line: 840, baseType: !105, size: 64, offset: 5184)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !648, file: !649, line: 849, baseType: !647, size: 64, offset: 5248)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !648, file: !649, line: 852, baseType: !647, size: 64, offset: 5312)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !648, file: !649, line: 857, baseType: !344, size: 128, offset: 5376)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !648, file: !649, line: 858, baseType: !344, size: 128, offset: 5504)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !648, file: !649, line: 859, baseType: !647, size: 64, offset: 5632)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !648, file: !649, line: 867, baseType: !344, size: 128, offset: 5696)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !648, file: !649, line: 868, baseType: !344, size: 128, offset: 5824)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !648, file: !649, line: 871, baseType: !909, size: 64, offset: 5952)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !911, line: 59, size: 768, elements: !912)
!911 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!912 = !{!913, !914, !915, !916, !927, !928, !935, !944}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !910, file: !911, line: 61, baseType: !661, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !910, file: !911, line: 62, baseType: !7, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !910, file: !911, line: 63, baseType: !357, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !910, file: !911, line: 65, baseType: !917, size: 256, offset: 64)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 256, elements: !584)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !103, line: 182, size: 64, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !918, file: !103, line: 183, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !103, line: 186, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !103, line: 187, baseType: !921, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !922, file: !103, line: 187, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !910, file: !911, line: 66, baseType: !918, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !910, file: !911, line: 68, baseType: !929, size: 128, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !930, line: 40, baseType: !931)
!930 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !930, line: 36, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !931, file: !930, line: 37, baseType: !357)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !931, file: !930, line: 38, baseType: !344, size: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !910, file: !911, line: 69, baseType: !936, size: 128, align: 64, offset: 512)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !103, line: 216, size: 128, align: 64, elements: !937)
!937 = !{!938, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !103, line: 217, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !936, file: !103, line: 218, baseType: !941, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !939}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !910, file: !911, line: 70, baseType: !945, size: 128, offset: 640)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, elements: !809)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !911, line: 54, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !946, file: !911, line: 55, baseType: !147, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !946, file: !911, line: 56, baseType: !950, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !911, line: 56, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !648, file: !649, line: 872, baseType: !953, size: 512, offset: 6016)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 512, elements: !584)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !648, file: !649, line: 873, baseType: !344, size: 128, offset: 6528)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !648, file: !649, line: 874, baseType: !344, size: 128, offset: 6656)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !648, file: !649, line: 876, baseType: !957, size: 64, offset: 6784)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !959, line: 26, size: 192, elements: !960)
!959 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !958, file: !959, line: 27, baseType: !7, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !958, file: !959, line: 28, baseType: !963, size: 128, offset: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !964, line: 43, size: 128, elements: !965)
!964 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !963, file: !964, line: 44, baseType: !550)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !963, file: !964, line: 45, baseType: !344, size: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !648, file: !649, line: 879, baseType: !969, size: 64, offset: 6848)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !648, file: !649, line: 882, baseType: !969, size: 64, offset: 6912)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !648, file: !649, line: 884, baseType: !129, size: 64, offset: 6976)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !648, file: !649, line: 885, baseType: !129, size: 64, offset: 7040)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !648, file: !649, line: 890, baseType: !129, size: 64, offset: 7104)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !648, file: !649, line: 891, baseType: !975, size: 128, offset: 7168)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !649, line: 242, size: 128, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !975, file: !649, line: 244, baseType: !129, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !975, file: !649, line: 245, baseType: !129, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !975, file: !649, line: 246, baseType: !550, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !648, file: !649, line: 900, baseType: !105, size: 64, offset: 7296)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !648, file: !649, line: 901, baseType: !105, size: 64, offset: 7360)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !648, file: !649, line: 904, baseType: !129, size: 64, offset: 7424)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !648, file: !649, line: 907, baseType: !129, size: 64, offset: 7488)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !648, file: !649, line: 910, baseType: !105, size: 64, offset: 7552)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !648, file: !649, line: 911, baseType: !105, size: 64, offset: 7616)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !648, file: !649, line: 914, baseType: !987, size: 640, offset: 7680)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !988, line: 123, size: 640, elements: !989)
!988 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!989 = !{!990, !996, !997}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !987, file: !988, line: 124, baseType: !991, size: 576)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 576, elements: !399)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !988, line: 108, size: 192, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !992, file: !988, line: 109, baseType: !129, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !992, file: !988, line: 110, baseType: !779, size: 128, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !987, file: !988, line: 125, baseType: !7, size: 32, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !987, file: !988, line: 126, baseType: !7, size: 32, offset: 608)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !648, file: !649, line: 917, baseType: !999, size: 192, offset: 8320)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !988, line: 134, size: 192, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !999, file: !988, line: 135, baseType: !936, size: 128, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !999, file: !988, line: 136, baseType: !7, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !648, file: !649, line: 923, baseType: !1004, size: 64, offset: 8512)
