; ModuleID = '../bcout/drivers/mtd/nand/raw/nand_macronix.llvm.bc'
source_filename = "drivers/mtd/nand/raw/nand_macronix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.nand_chip = type { %struct.nand_device, %struct.nand_id, %struct.nand_parameters, %struct.nand_manufacturer, %struct.nand_chip_ops, %struct.nand_legacy, i32, %struct.nand_interface_config*, %struct.nand_interface_config*, i32, i32, i32, i32, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, i8*, i32, i32, i32, i32, i32, i8*, i8*, %struct.anon.44, i64, %struct.mutex, i8, i32, i32, %struct.nand_controller*, %struct.nand_ecc_ctrl, i8* }
%struct.nand_device = type { %struct.mtd_info, %struct.nand_memory_organization, %struct.nand_ecc, %struct.nand_row_converter, %struct.nand_bbt, %struct.nand_ops* }

!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_engine_type", file: !51, line: 142, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/mtd/nand.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_INVALID", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_NONE", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_SOFT", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_HOST", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_DIE", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_placement", file: !51, line: 158, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_UNKNOWN", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_OOB", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_INTERLEAVED", value: 2, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_algo", file: !51, line: 171, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_UNKNOWN", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !51, line: 90, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_interface_type", file: !74, line: 481, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "./include/linux/mtd/rawnand.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76}
!76 = !DIEnumerator(name: "NAND_SDR_IFACE", value: 0, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_op_instr_type", file: !74, line: 570, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "NAND_OP_CMD_INSTR", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "NAND_OP_ADDR_INSTR", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "NAND_OP_DATA_IN_INSTR", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "NAND_OP_DATA_OUT_INSTR", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "NAND_OP_WAITRDY_INSTR", value: 4, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 10, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!86 = !{!87, !88}
!87 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!89 = !{!90, !7, !91, !93, !96, !106}
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!95 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_onfi_vendor_macronix", file: !3, line: 34, size: 16, elements: !98)
!98 = !{!99, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !97, file: !3, line: 35, baseType: !100, size: 8)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !101, line: 17, baseType: !102)
!101 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !103, line: 21, baseType: !104)
!103 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!104 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reliability_func", scope: !97, file: !3, line: 36, baseType: !100, size: 8, offset: 8)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !{!0, !109, !2809}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "broken_get_timings", scope: !111, file: !3, line: 151, type: !2805, isLocal: true, isDefinition: true)
!111 = distinct !DISubprogram(name: "macronix_nand_fix_broken_get_timings", scope: !3, file: !3, line: 148, type: !112, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !375)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_chip", file: !74, line: 1096, size: 16704, elements: !116)
!116 = !{!117, !2405, !2411, !2435, !2530, !2600, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2747, !2748, !2749, !2750, !2751, !2752, !2754, !2804}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !115, file: !74, line: 1097, baseType: !118, size: 11200)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !51, line: 319, size: 11200, elements: !119)
!119 = !{!120, !2298, !2310, !2380, !2385, !2389}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !118, file: !51, line: 320, baseType: !121, size: 9664)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !122, line: 235, size: 9664, elements: !123)
!122 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!123 = !{!124, !127, !131, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !149, !150, !166, !187, !188, !189, !190, !198, !208, !225, !229, !234, !240, !241, !258, !259, !270, !271, !272, !273, !274, !275, !286, !290, !294, !295, !296, !300, !301, !302, !303, !307, !308, !309, !310, !311, !314, !326, !333, !334, !335, !339, !2268, !2269, !2277, !2281, !2282, !2283}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !122, line: 236, baseType: !125, size: 8)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !126, line: 79, baseType: !104)
!126 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !122, line: 237, baseType: !128, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !126, line: 104, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !101, line: 21, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !103, line: 27, baseType: !7)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !122, line: 238, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !126, line: 107, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !101, line: 23, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !103, line: 31, baseType: !135)
!135 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !121, file: !122, line: 244, baseType: !128, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !121, file: !122, line: 252, baseType: !128, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !121, file: !122, line: 263, baseType: !128, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !121, file: !122, line: 265, baseType: !128, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !121, file: !122, line: 266, baseType: !128, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !121, file: !122, line: 272, baseType: !7, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !121, file: !122, line: 273, baseType: !7, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !121, file: !122, line: 275, baseType: !7, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !121, file: !122, line: 276, baseType: !7, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !121, file: !122, line: 285, baseType: !7, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !122, line: 288, baseType: !147, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !121, file: !122, line: 289, baseType: !90, size: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !121, file: !122, line: 292, baseType: !151, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !122, line: 101, size: 128, elements: !154)
!154 = !{!155, !165}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !153, file: !122, line: 102, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!90, !159, !90, !160}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !122, line: 87, size: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !161, file: !122, line: 88, baseType: !129, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !161, file: !122, line: 89, baseType: !129, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !153, file: !122, line: 104, baseType: !156, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !121, file: !122, line: 295, baseType: !167, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !122, line: 176, size: 192, elements: !170)
!170 = !{!171, !172, !181}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !169, file: !122, line: 177, baseType: !90, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !169, file: !122, line: 178, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!90, !159, !90, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !122, line: 138, size: 64, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !177, file: !122, line: 139, baseType: !90, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !177, file: !122, line: 140, baseType: !90, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !169, file: !122, line: 180, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!90, !159, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !121, file: !122, line: 298, baseType: !7, size: 32, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !121, file: !122, line: 301, baseType: !7, size: 32, offset: 736)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !121, file: !122, line: 306, baseType: !90, size: 32, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !121, file: !122, line: 307, baseType: !191, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !122, line: 36, size: 192, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !192, file: !122, line: 37, baseType: !132, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !192, file: !122, line: 38, baseType: !128, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !192, file: !122, line: 39, baseType: !128, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !192, file: !122, line: 40, baseType: !106, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !121, file: !122, line: 313, baseType: !199, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!90, !159, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !122, line: 30, size: 192, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !203, file: !122, line: 31, baseType: !132, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !203, file: !122, line: 32, baseType: !132, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !203, file: !122, line: 33, baseType: !132, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !121, file: !122, line: 314, baseType: !209, size: 64, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!90, !159, !212, !216, !219, !220, !222}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !126, line: 46, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !214, line: 88, baseType: !215)
!214 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!215 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !126, line: 55, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !214, line: 72, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !214, line: 16, baseType: !107)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !126, line: 158, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !126, line: 153, baseType: !133)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !121, file: !122, line: 316, baseType: !226, size: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!90, !159, !212, !216}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !121, file: !122, line: 317, baseType: !230, size: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!90, !159, !212, !216, !219, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !121, file: !122, line: 319, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!90, !159, !212, !216, !219, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !121, file: !122, line: 321, baseType: !235, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !121, file: !122, line: 323, baseType: !242, size: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!90, !159, !212, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !122, line: 64, size: 512, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !257}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !246, file: !122, line: 65, baseType: !7, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !246, file: !122, line: 66, baseType: !216, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !246, file: !122, line: 67, baseType: !216, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !246, file: !122, line: 68, baseType: !216, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !246, file: !122, line: 69, baseType: !216, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !246, file: !122, line: 70, baseType: !128, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !246, file: !122, line: 71, baseType: !255, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !126, line: 102, baseType: !100)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !246, file: !122, line: 72, baseType: !255, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !121, file: !122, line: 325, baseType: !242, size: 64, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !121, file: !122, line: 327, baseType: !260, size: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!90, !159, !216, !219, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !265, line: 146, size: 96, elements: !266)
!265 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !264, file: !265, line: 147, baseType: !130, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !264, file: !265, line: 148, baseType: !130, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !264, file: !265, line: 149, baseType: !130, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !121, file: !122, line: 329, baseType: !230, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !121, file: !122, line: 331, baseType: !260, size: 64, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !121, file: !122, line: 333, baseType: !230, size: 64, offset: 1600)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !121, file: !122, line: 335, baseType: !230, size: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !121, file: !122, line: 337, baseType: !226, size: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !121, file: !122, line: 339, baseType: !276, size: 64, offset: 1792)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!90, !159, !279, !107, !212, !219}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !282, line: 15, size: 128, elements: !283)
!282 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !281, file: !282, line: 16, baseType: !221, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !281, file: !282, line: 17, baseType: !216, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !121, file: !122, line: 341, baseType: !287, size: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !159}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !121, file: !122, line: 342, baseType: !291, size: 64, offset: 1920)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!90, !159, !212, !132}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !121, file: !122, line: 343, baseType: !291, size: 64, offset: 1984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !121, file: !122, line: 344, baseType: !291, size: 64, offset: 2048)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !121, file: !122, line: 345, baseType: !297, size: 64, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!90, !159, !212}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !121, file: !122, line: 346, baseType: !297, size: 64, offset: 2176)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !121, file: !122, line: 347, baseType: !297, size: 64, offset: 2240)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !121, file: !122, line: 348, baseType: !226, size: 64, offset: 2304)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !121, file: !122, line: 349, baseType: !304, size: 64, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!90, !159}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !121, file: !122, line: 350, baseType: !287, size: 64, offset: 2432)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !121, file: !122, line: 351, baseType: !287, size: 64, offset: 2496)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !121, file: !122, line: 356, baseType: !304, size: 64, offset: 2560)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !121, file: !122, line: 357, baseType: !287, size: 64, offset: 2624)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !121, file: !122, line: 363, baseType: !312, size: 8, offset: 2688)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !126, line: 30, baseType: !313)
!313 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !121, file: !122, line: 365, baseType: !315, size: 192, offset: 2752)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !316, line: 54, size: 192, elements: !317)
!316 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!317 = !{!318, !324, !325}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !315, file: !316, line: 55, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !316, line: 51, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!90, !323, !107, !221}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !316, line: 56, baseType: !323, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !315, file: !316, line: 57, baseType: !90, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !121, file: !122, line: 368, baseType: !327, size: 128, offset: 2944)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !265, line: 250, size: 128, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !327, file: !265, line: 251, baseType: !130, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !327, file: !265, line: 252, baseType: !130, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !327, file: !265, line: 253, baseType: !130, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !327, file: !265, line: 254, baseType: !130, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !121, file: !122, line: 370, baseType: !90, size: 32, offset: 3072)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !121, file: !122, line: 372, baseType: !221, size: 64, offset: 3136)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !121, file: !122, line: 374, baseType: !336, size: 64, offset: 3200)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !338, line: 76, flags: DIFlagFwdDecl)
!338 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !121, file: !122, line: 375, baseType: !340, size: 5568, offset: 3264)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !341)
!341 = !{!342, !1794, !1796, !1799, !1800, !1851, !1945, !1946, !1947, !1948, !1949, !1958, !2063, !2076, !2079, !2080, !2084, !2086, !2087, !2088, !2092, !2098, !2099, !2102, !2217, !2218, !2221, !2222, !2223, !2224, !2256, !2257, !2258, !2261, !2264, !2265, !2266, !2267}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !340, file: !30, line: 462, baseType: !343, size: 512)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !344, line: 64, size: 512, elements: !345)
!344 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!345 = !{!346, !347, !353, !355, !414, !1630, !1784, !1789, !1790, !1791, !1792, !1793}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !344, line: 65, baseType: !147, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !343, file: !344, line: 66, baseType: !348, size: 128, offset: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !126, line: 178, size: 128, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !126, line: 179, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !126, line: 179, baseType: !351, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !343, file: !344, line: 67, baseType: !354, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !343, file: !344, line: 68, baseType: !356, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !344, line: 192, size: 704, elements: !358)
!358 = !{!359, !360, !376, !377}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !357, file: !344, line: 193, baseType: !348, size: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !357, file: !344, line: 194, baseType: !361, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !362, line: 83, baseType: !363)
!362 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !362, line: 71, elements: !364)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !362, line: 72, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !362, line: 72, elements: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !366, file: !362, line: 73, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !362, line: 20, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !369, file: !362, line: 21, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !373, line: 25, baseType: !374)
!373 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 25, elements: !375)
!375 = !{}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !357, file: !344, line: 195, baseType: !343, size: 512, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !357, file: !344, line: 196, baseType: !378, size: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !344, line: 156, size: 192, elements: !381)
!381 = !{!382, !387, !392}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !380, file: !344, line: 157, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!90, !356, !354}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !344, line: 158, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!147, !356, !354}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !380, file: !344, line: 159, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!90, !356, !354, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !344, line: 148, size: 20736, elements: !399)
!399 = !{!400, !404, !408, !409, !413}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !398, file: !344, line: 149, baseType: !401, size: 192)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 192, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 3)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !398, file: !344, line: 150, baseType: !405, size: 4096, offset: 192)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 4096, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !398, file: !344, line: 151, baseType: !90, size: 32, offset: 4288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !398, file: !344, line: 152, baseType: !410, size: 16384, offset: 4320)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 16384, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 2048)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !398, file: !344, line: 153, baseType: !90, size: 32, offset: 20704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !343, file: !344, line: 69, baseType: !415, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !344, line: 138, size: 448, elements: !417)
!417 = !{!418, !422, !446, !448, !1576, !1609, !1613}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !416, file: !344, line: 139, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !354}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !416, file: !344, line: 140, baseType: !423, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !426, line: 230, size: 128, elements: !427)
!426 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!427 = !{!428, !442}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !425, file: !426, line: 231, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!432, !354, !435, !91}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !126, line: 60, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !214, line: 73, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !214, line: 15, baseType: !95)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !426, line: 30, size: 128, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !426, line: 31, baseType: !147, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !436, file: !426, line: 32, baseType: !440, size: 16, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !126, line: 19, baseType: !441)
!441 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !425, file: !426, line: 232, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!432, !354, !435, !147, !216}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !416, file: !344, line: 141, baseType: !447, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !416, file: !344, line: 142, baseType: !449, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !426, line: 84, size: 320, elements: !453)
!453 = !{!454, !455, !459, !1573, !1574}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !426, line: 85, baseType: !147, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !452, file: !426, line: 86, baseType: !456, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!440, !354, !435, !90}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !452, file: !426, line: 88, baseType: !460, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!440, !354, !463, !90}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !426, line: 168, size: 448, elements: !465)
!465 = !{!466, !467, !468, !469, !476, !477}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !464, file: !426, line: 169, baseType: !436, size: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !426, line: 170, baseType: !216, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !464, file: !426, line: 171, baseType: !221, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !464, file: !426, line: 172, baseType: !470, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!432, !473, !354, !463, !91, !212, !216}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !475, line: 526, flags: DIFlagFwdDecl)
!475 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !464, file: !426, line: 174, baseType: !470, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !464, file: !426, line: 176, baseType: !478, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!90, !473, !354, !463, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !483, line: 305, size: 1472, elements: !484)
!483 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!484 = !{!485, !486, !487, !488, !489, !497, !498, !1547, !1553, !1554, !1559, !1560, !1563, !1567, !1568, !1569, !1570, !1571}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !482, file: !483, line: 308, baseType: !107, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !482, file: !483, line: 309, baseType: !107, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !482, file: !483, line: 313, baseType: !481, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !482, file: !483, line: 313, baseType: !481, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !482, file: !483, line: 315, baseType: !490, size: 192, align: 64, offset: 256)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !491, line: 24, size: 192, align: 64, elements: !492)
!491 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!492 = !{!493, !494, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !490, file: !491, line: 25, baseType: !107, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !490, file: !491, line: 26, baseType: !495, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !490, file: !491, line: 27, baseType: !495, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !482, file: !483, line: 323, baseType: !107, size: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !482, file: !483, line: 327, baseType: !499, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !483, line: 388, size: 7296, elements: !501)
!501 = !{!502, !1543}
!502 = !DIDerivedType(tag: DW_TAG_member, scope: !500, file: !483, line: 389, baseType: !503, size: 7296)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !500, file: !483, line: 389, size: 7296, elements: !504)
!504 = !{!505, !506, !510, !511, !515, !516, !517, !518, !519, !527, !532, !533, !534, !535, !544, !545, !546, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !581, !589, !592, !624, !625, !1513, !1514, !1517, !1521, !1522, !1525, !1526, !1527, !1530, !1542}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !503, file: !483, line: 390, baseType: !481, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !503, file: !483, line: 391, baseType: !507, size: 64, offset: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !491, line: 31, size: 64, elements: !508)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !507, file: !491, line: 32, baseType: !495, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !503, file: !483, line: 392, baseType: !133, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !503, file: !483, line: 394, baseType: !512, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!107, !473, !107, !107, !107, !107}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !503, file: !483, line: 398, baseType: !107, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !503, file: !483, line: 399, baseType: !107, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !503, file: !483, line: 405, baseType: !107, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !503, file: !483, line: 406, baseType: !107, size: 64, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !503, file: !483, line: 407, baseType: !520, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !475, line: 286, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !475, line: 286, size: 64, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !522, file: !475, line: 286, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !526, line: 18, baseType: !107)
!526 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!527 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !503, file: !483, line: 416, baseType: !528, size: 32, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !126, line: 168, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 166, size: 32, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !529, file: !126, line: 167, baseType: !90, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !503, file: !483, line: 428, baseType: !528, size: 32, offset: 608)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !503, file: !483, line: 437, baseType: !528, size: 32, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !503, file: !483, line: 447, baseType: !528, size: 32, offset: 672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !503, file: !483, line: 450, baseType: !536, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !537, line: 13, baseType: !538)
!537 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !126, line: 175, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 173, size: 64, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !539, file: !126, line: 174, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !101, line: 22, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !103, line: 30, baseType: !215)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !503, file: !483, line: 452, baseType: !90, size: 32, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !503, file: !483, line: 454, baseType: !361, offset: 800)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !503, file: !483, line: 457, baseType: !547, size: 256, offset: 832)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !548, line: 35, size: 256, elements: !549)
!548 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!549 = !{!550, !551, !552, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !547, file: !548, line: 36, baseType: !536, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !547, file: !548, line: 42, baseType: !536, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !547, file: !548, line: 46, baseType: !553, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !362, line: 29, baseType: !369)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !547, file: !548, line: 47, baseType: !348, size: 128, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !503, file: !483, line: 459, baseType: !348, size: 128, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !503, file: !483, line: 466, baseType: !107, size: 64, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !503, file: !483, line: 467, baseType: !107, size: 64, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !503, file: !483, line: 469, baseType: !107, size: 64, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !503, file: !483, line: 470, baseType: !107, size: 64, offset: 1408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !503, file: !483, line: 471, baseType: !538, size: 64, offset: 1472)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !503, file: !483, line: 472, baseType: !107, size: 64, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !503, file: !483, line: 473, baseType: !107, size: 64, offset: 1600)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !503, file: !483, line: 474, baseType: !107, size: 64, offset: 1664)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !503, file: !483, line: 475, baseType: !107, size: 64, offset: 1728)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !503, file: !483, line: 477, baseType: !361, offset: 1792)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !503, file: !483, line: 478, baseType: !107, size: 64, offset: 1792)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !503, file: !483, line: 478, baseType: !107, size: 64, offset: 1856)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !503, file: !483, line: 478, baseType: !107, size: 64, offset: 1920)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !503, file: !483, line: 478, baseType: !107, size: 64, offset: 1984)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !503, file: !483, line: 479, baseType: !107, size: 64, offset: 2048)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !503, file: !483, line: 479, baseType: !107, size: 64, offset: 2112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !503, file: !483, line: 479, baseType: !107, size: 64, offset: 2176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !503, file: !483, line: 480, baseType: !107, size: 64, offset: 2240)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !503, file: !483, line: 480, baseType: !107, size: 64, offset: 2304)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !503, file: !483, line: 480, baseType: !107, size: 64, offset: 2368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !503, file: !483, line: 480, baseType: !107, size: 64, offset: 2432)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !503, file: !483, line: 482, baseType: !578, size: 2816, offset: 2496)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 2816, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 44)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !503, file: !483, line: 488, baseType: !582, size: 256, offset: 5312)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !583, line: 60, size: 256, elements: !584)
!583 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !582, file: !583, line: 61, baseType: !586, size: 256)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 256, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 4)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !503, file: !483, line: 490, baseType: !590, size: 64, offset: 5568)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !483, line: 490, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !503, file: !483, line: 493, baseType: !593, size: 896, offset: 5632)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !594, line: 53, baseType: !595)
!594 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 13, size: 896, elements: !596)
!596 = !{!597, !598, !599, !600, !603, !604, !611, !612, !616, !617, !620}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !595, file: !594, line: 18, baseType: !133, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !595, file: !594, line: 28, baseType: !538, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !595, file: !594, line: 31, baseType: !547, size: 256, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !595, file: !594, line: 32, baseType: !601, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !594, line: 32, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !595, file: !594, line: 37, baseType: !441, size: 16, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !595, file: !594, line: 40, baseType: !605, size: 192, offset: 512)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !606, line: 53, size: 192, elements: !607)
!606 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !605, file: !606, line: 54, baseType: !536, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !605, file: !606, line: 55, baseType: !361, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !605, file: !606, line: 59, baseType: !348, size: 128, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !595, file: !594, line: 41, baseType: !221, size: 64, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !595, file: !594, line: 42, baseType: !613, size: 64, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !594, line: 42, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !595, file: !594, line: 44, baseType: !528, size: 32, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !595, file: !594, line: 50, baseType: !618, size: 16, offset: 864)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !101, line: 19, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !103, line: 24, baseType: !441)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !595, file: !594, line: 51, baseType: !621, size: 16, offset: 880)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !101, line: 18, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !103, line: 23, baseType: !623)
!623 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !503, file: !483, line: 495, baseType: !107, size: 64, offset: 6528)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !503, file: !483, line: 497, baseType: !626, size: 64, offset: 6592)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !483, line: 381, size: 384, elements: !628)
!628 = !{!629, !630, !1512}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !627, file: !483, line: 382, baseType: !528, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !627, file: !483, line: 383, baseType: !631, size: 128, offset: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !483, line: 376, size: 128, elements: !632)
!632 = !{!633, !1510}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !631, file: !483, line: 377, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !636, line: 640, size: 48640, elements: !637)
!636 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!637 = !{!638, !644, !645, !646, !652, !653, !654, !655, !656, !657, !658, !659, !663, !681, !692, !784, !785, !786, !797, !798, !800, !801, !802, !803, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !882, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !938, !940, !941, !942, !954, !956, !957, !958, !959, !960, !966, !967, !968, !969, !970, !971, !972, !984, !989, !993, !994, !995, !998, !1002, !1005, !1008, !1011, !1014, !1017, !1020, !1023, !1029, !1030, !1031, !1037, !1038, !1039, !1040, !1041, !1050, !1051, !1052, !1053, !1054, !1059, !1060, !1061, !1064, !1065, !1068, !1071, !1074, !1077, !1080, !1083, !1084, !1164, !1167, !1170, !1171, !1174, !1175, !1176, !1182, !1183, !1184, !1197, !1198, !1199, !1209, !1214, !1217, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !635, file: !636, line: 646, baseType: !639, size: 128)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !640, line: 56, size: 128, elements: !641)
!640 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !639, file: !640, line: 57, baseType: !107, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !639, file: !640, line: 58, baseType: !129, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !635, file: !636, line: 649, baseType: !94, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !635, file: !636, line: 657, baseType: !221, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !635, file: !636, line: 658, baseType: !647, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !648, line: 113, baseType: !649)
!648 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !648, line: 111, size: 32, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !649, file: !648, line: 112, baseType: !528, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !635, file: !636, line: 660, baseType: !7, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !635, file: !636, line: 661, baseType: !7, size: 32, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !635, file: !636, line: 684, baseType: !90, size: 32, offset: 352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !635, file: !636, line: 686, baseType: !90, size: 32, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !635, file: !636, line: 687, baseType: !90, size: 32, offset: 416)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !635, file: !636, line: 688, baseType: !90, size: 32, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !635, file: !636, line: 689, baseType: !7, size: 32, offset: 480)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !635, file: !636, line: 691, baseType: !660, size: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !636, line: 691, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !635, file: !636, line: 692, baseType: !664, size: 832, offset: 576)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !636, line: 451, size: 832, elements: !665)
!665 = !{!666, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !664, file: !636, line: 453, baseType: !667, size: 128)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !636, line: 325, size: 128, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !667, file: !636, line: 326, baseType: !107, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !667, file: !636, line: 327, baseType: !129, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !664, file: !636, line: 454, baseType: !490, size: 192, align: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !664, file: !636, line: 455, baseType: !348, size: 128, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !664, file: !636, line: 456, baseType: !7, size: 32, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !664, file: !636, line: 458, baseType: !133, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !664, file: !636, line: 459, baseType: !133, size: 64, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !664, file: !636, line: 460, baseType: !133, size: 64, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !664, file: !636, line: 461, baseType: !133, size: 64, offset: 704)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !664, file: !636, line: 463, baseType: !133, size: 64, offset: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !664, file: !636, line: 465, baseType: !680, offset: 832)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !636, line: 415, elements: !375)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !635, file: !636, line: 693, baseType: !682, size: 384, offset: 1408)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !636, line: 489, size: 384, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !682, file: !636, line: 490, baseType: !348, size: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !682, file: !636, line: 491, baseType: !107, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !682, file: !636, line: 492, baseType: !107, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !682, file: !636, line: 493, baseType: !7, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !682, file: !636, line: 494, baseType: !441, size: 16, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !682, file: !636, line: 495, baseType: !441, size: 16, offset: 304)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !682, file: !636, line: 497, baseType: !691, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !635, file: !636, line: 697, baseType: !693, size: 1792, offset: 1792)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !636, line: 507, size: 1792, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !781, !782}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !693, file: !636, line: 508, baseType: !490, size: 192, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !693, file: !636, line: 515, baseType: !133, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !693, file: !636, line: 516, baseType: !133, size: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !693, file: !636, line: 517, baseType: !133, size: 64, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !693, file: !636, line: 518, baseType: !133, size: 64, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !693, file: !636, line: 519, baseType: !133, size: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !693, file: !636, line: 526, baseType: !542, size: 64, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !693, file: !636, line: 527, baseType: !133, size: 64, offset: 576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !636, line: 528, baseType: !7, size: 32, offset: 640)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !693, file: !636, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !693, file: !636, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !693, file: !636, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !693, file: !636, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !693, file: !636, line: 563, baseType: !709, size: 512, offset: 704)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !710)
!710 = !{!711, !719, !720, !725, !777, !778, !779, !780}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !709, file: !6, line: 119, baseType: !712, size: 256)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !713, line: 9, size: 256, elements: !714)
!713 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !712, file: !713, line: 10, baseType: !490, size: 192, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !712, file: !713, line: 11, baseType: !717, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !718, line: 29, baseType: !542)
!718 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !709, file: !6, line: 120, baseType: !717, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !709, file: !6, line: 121, baseType: !721, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!5, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !709, file: !6, line: 122, baseType: !726, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !728)
!728 = !{!729, !749, !750, !753, !763, !764, !772, !776}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !727, file: !6, line: 160, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !731, file: !6, line: 215, baseType: !553)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !731, file: !6, line: 216, baseType: !7, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !731, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !731, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !731, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !731, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !731, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !731, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !731, file: !6, line: 233, baseType: !717, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !731, file: !6, line: 234, baseType: !724, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !731, file: !6, line: 235, baseType: !717, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !731, file: !6, line: 236, baseType: !724, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !731, file: !6, line: 237, baseType: !746, size: 4096, offset: 512)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 4096, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 8)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !727, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !727, file: !6, line: 162, baseType: !751, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !126, line: 27, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !214, line: 96, baseType: !90)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !727, file: !6, line: 163, baseType: !754, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !755, line: 276, baseType: !756)
!755 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !755, line: 276, size: 32, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !756, file: !755, line: 276, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !755, line: 70, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !755, line: 65, size: 32, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !760, file: !755, line: 66, baseType: !7, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !727, file: !6, line: 164, baseType: !724, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !727, file: !6, line: 165, baseType: !765, size: 128, offset: 256)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !713, line: 14, size: 128, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !765, file: !713, line: 15, baseType: !768, size: 128)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !491, line: 125, size: 128, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !768, file: !491, line: 126, baseType: !507, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !768, file: !491, line: 127, baseType: !495, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !727, file: !6, line: 166, baseType: !773, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!717}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !727, file: !6, line: 167, baseType: !717, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !709, file: !6, line: 123, baseType: !100, size: 8, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !709, file: !6, line: 124, baseType: !100, size: 8, offset: 456)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !709, file: !6, line: 125, baseType: !100, size: 8, offset: 464)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !709, file: !6, line: 126, baseType: !100, size: 8, offset: 472)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !693, file: !636, line: 572, baseType: !709, size: 512, offset: 1216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !693, file: !636, line: 580, baseType: !783, size: 64, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !635, file: !636, line: 721, baseType: !7, size: 32, offset: 3584)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !635, file: !636, line: 722, baseType: !90, size: 32, offset: 3616)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !635, file: !636, line: 723, baseType: !787, size: 64, offset: 3648)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !790, line: 17, baseType: !791)
!790 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !790, line: 17, size: 64, elements: !792)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !791, file: !790, line: 17, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 1)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !635, file: !636, line: 724, baseType: !789, size: 64, offset: 3712)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !635, file: !636, line: 749, baseType: !799, offset: 3776)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !636, line: 290, elements: !375)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !635, file: !636, line: 751, baseType: !348, size: 128, offset: 3776)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !635, file: !636, line: 757, baseType: !499, size: 64, offset: 3904)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !635, file: !636, line: 758, baseType: !499, size: 64, offset: 3968)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !635, file: !636, line: 761, baseType: !804, size: 320, offset: 4032)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !583, line: 34, size: 320, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !804, file: !583, line: 35, baseType: !133, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !804, file: !583, line: 36, baseType: !808, size: 256, offset: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 256, elements: !587)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !635, file: !636, line: 766, baseType: !90, size: 32, offset: 4352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !635, file: !636, line: 767, baseType: !90, size: 32, offset: 4384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !635, file: !636, line: 768, baseType: !90, size: 32, offset: 4416)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !635, file: !636, line: 770, baseType: !90, size: 32, offset: 4448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !635, file: !636, line: 772, baseType: !107, size: 64, offset: 4480)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !635, file: !636, line: 775, baseType: !7, size: 32, offset: 4544)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !635, file: !636, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !635, file: !636, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !635, file: !636, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !635, file: !636, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !635, file: !636, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !635, file: !636, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !635, file: !636, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !635, file: !636, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !635, file: !636, line: 831, baseType: !107, size: 64, offset: 4672)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !635, file: !636, line: 833, baseType: !825, size: 384, offset: 4736)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !826)
!826 = !{!827, !832}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !825, file: !12, line: 26, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!95, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, scope: !825, file: !12, line: 27, baseType: !833, size: 320, offset: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !825, file: !12, line: 27, size: 320, elements: !834)
!834 = !{!835, !845, !872}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !833, file: !12, line: 36, baseType: !836, size: 320)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !833, file: !12, line: 29, size: 320, elements: !837)
!837 = !{!838, !840, !841, !842, !843, !844}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !836, file: !12, line: 30, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !836, file: !12, line: 31, baseType: !129, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !836, file: !12, line: 32, baseType: !129, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !836, file: !12, line: 33, baseType: !129, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !836, file: !12, line: 34, baseType: !133, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !836, file: !12, line: 35, baseType: !839, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !833, file: !12, line: 46, baseType: !846, size: 192)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !833, file: !12, line: 38, size: 192, elements: !847)
!847 = !{!848, !849, !850, !871}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !846, file: !12, line: 39, baseType: !751, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !846, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !12, line: 41, baseType: !851, size: 64, offset: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !846, file: !12, line: 41, size: 64, elements: !852)
!852 = !{!853, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !851, file: !12, line: 42, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !856, line: 7, size: 128, elements: !857)
!856 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!857 = !{!858, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !855, file: !856, line: 8, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !214, line: 93, baseType: !215)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !855, file: !856, line: 9, baseType: !215, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !851, file: !12, line: 43, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !864, line: 7, size: 64, elements: !865)
!864 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!865 = !{!866, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !863, file: !864, line: 8, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !864, line: 5, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !101, line: 20, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !103, line: 26, baseType: !90)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !863, file: !864, line: 9, baseType: !868, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !846, file: !12, line: 45, baseType: !133, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !833, file: !12, line: 54, baseType: !873, size: 256)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !833, file: !12, line: 48, size: 256, elements: !874)
!874 = !{!875, !878, !879, !880, !881}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !873, file: !12, line: 49, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !873, file: !12, line: 50, baseType: !90, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !873, file: !12, line: 51, baseType: !90, size: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !873, file: !12, line: 52, baseType: !107, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !873, file: !12, line: 53, baseType: !107, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !635, file: !636, line: 835, baseType: !883, size: 32, offset: 5120)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !126, line: 22, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !214, line: 28, baseType: !90)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !635, file: !636, line: 836, baseType: !883, size: 32, offset: 5152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !635, file: !636, line: 840, baseType: !107, size: 64, offset: 5184)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !635, file: !636, line: 849, baseType: !634, size: 64, offset: 5248)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !635, file: !636, line: 852, baseType: !634, size: 64, offset: 5312)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !635, file: !636, line: 857, baseType: !348, size: 128, offset: 5376)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !635, file: !636, line: 858, baseType: !348, size: 128, offset: 5504)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !635, file: !636, line: 859, baseType: !634, size: 64, offset: 5632)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !635, file: !636, line: 867, baseType: !348, size: 128, offset: 5696)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !635, file: !636, line: 868, baseType: !348, size: 128, offset: 5824)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !635, file: !636, line: 871, baseType: !895, size: 64, offset: 5952)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !897, line: 59, size: 768, elements: !898)
!897 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!898 = !{!899, !900, !901, !902, !913, !914, !921, !930}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !896, file: !897, line: 61, baseType: !647, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !896, file: !897, line: 62, baseType: !7, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !896, file: !897, line: 63, baseType: !361, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !896, file: !897, line: 65, baseType: !903, size: 256, offset: 64)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 256, elements: !587)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !126, line: 182, size: 64, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !904, file: !126, line: 183, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !126, line: 186, size: 128, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !908, file: !126, line: 187, baseType: !907, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !908, file: !126, line: 187, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !896, file: !897, line: 66, baseType: !904, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !896, file: !897, line: 68, baseType: !915, size: 128, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !916, line: 40, baseType: !917)
!916 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !916, line: 36, size: 128, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !917, file: !916, line: 37, baseType: !361)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !917, file: !916, line: 38, baseType: !348, size: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !896, file: !897, line: 69, baseType: !922, size: 128, align: 64, offset: 512)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !126, line: 216, size: 128, align: 64, elements: !923)
!923 = !{!924, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !126, line: 217, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !922, file: !126, line: 218, baseType: !927, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !925}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !896, file: !897, line: 70, baseType: !931, size: 128, offset: 640)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, elements: !795)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !897, line: 54, size: 128, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !932, file: !897, line: 55, baseType: !90, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !932, file: !897, line: 56, baseType: !936, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !897, line: 56, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !635, file: !636, line: 872, baseType: !939, size: 512, offset: 6016)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 512, elements: !587)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !635, file: !636, line: 873, baseType: !348, size: 128, offset: 6528)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !635, file: !636, line: 874, baseType: !348, size: 128, offset: 6656)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !635, file: !636, line: 876, baseType: !943, size: 64, offset: 6784)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !945, line: 26, size: 192, elements: !946)
!945 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !944, file: !945, line: 27, baseType: !7, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !944, file: !945, line: 28, baseType: !949, size: 128, offset: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !950, line: 43, size: 128, elements: !951)
!950 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !949, file: !950, line: 44, baseType: !553)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !949, file: !950, line: 45, baseType: !348, size: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !635, file: !636, line: 879, baseType: !955, size: 64, offset: 6848)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !635, file: !636, line: 882, baseType: !955, size: 64, offset: 6912)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !635, file: !636, line: 884, baseType: !133, size: 64, offset: 6976)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !635, file: !636, line: 885, baseType: !133, size: 64, offset: 7040)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !635, file: !636, line: 890, baseType: !133, size: 64, offset: 7104)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !635, file: !636, line: 891, baseType: !961, size: 128, offset: 7168)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !636, line: 242, size: 128, elements: !962)
!962 = !{!963, !964, !965}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !961, file: !636, line: 244, baseType: !133, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !961, file: !636, line: 245, baseType: !133, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !961, file: !636, line: 246, baseType: !553, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !635, file: !636, line: 900, baseType: !107, size: 64, offset: 7296)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !635, file: !636, line: 901, baseType: !107, size: 64, offset: 7360)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !635, file: !636, line: 904, baseType: !133, size: 64, offset: 7424)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !635, file: !636, line: 907, baseType: !133, size: 64, offset: 7488)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !635, file: !636, line: 910, baseType: !107, size: 64, offset: 7552)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !635, file: !636, line: 911, baseType: !107, size: 64, offset: 7616)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !635, file: !636, line: 914, baseType: !973, size: 640, offset: 7680)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !974, line: 123, size: 640, elements: !975)
!974 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!975 = !{!976, !982, !983}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !973, file: !974, line: 124, baseType: !977, size: 576)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 576, elements: !402)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !974, line: 108, size: 192, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !978, file: !974, line: 109, baseType: !133, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !978, file: !974, line: 110, baseType: !765, size: 128, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !973, file: !974, line: 125, baseType: !7, size: 32, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !973, file: !974, line: 126, baseType: !7, size: 32, offset: 608)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !635, file: !636, line: 917, baseType: !985, size: 192, offset: 8320)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !974, line: 134, size: 192, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !985, file: !974, line: 135, baseType: !922, size: 128, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !985, file: !974, line: 136, baseType: !7, size: 32, offset: 128)
