; ModuleID = '../bcout/drivers/mtd/nand/raw/nand_jedec.llvm.bc'
source_filename = "drivers/mtd/nand/raw/nand_jedec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.nand_chip = type { %struct.nand_device, %struct.nand_id, %struct.nand_parameters, %struct.nand_manufacturer, %struct.nand_chip_ops, %struct.nand_legacy, i32, %struct.nand_interface_config*, %struct.nand_interface_config*, i32, i32, i32, i32, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, i8*, i32, i32, i32, i32, i32, i8*, i8*, %struct.anon.44, i64, %struct.mutex, i8, i32, i32, %struct.nand_controller*, %struct.nand_ecc_ctrl, i8* }
%struct.nand_device = type { %struct.mtd_info, %struct.nand_memory_organization, %struct.nand_ecc, %struct.nand_row_converter, %struct.nand_bbt, %struct.nand_ops* }

!64 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !49, line: 90, baseType: !5, size: 32, elements: !68)
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_interface_type", file: !72, line: 481, baseType: !5, size: 32, elements: !73)
!72 = !DIFile(filename: "./include/linux/mtd/rawnand.h", directory: "/home/lizy2001/genbc/linux")
!73 = !{!74}
!74 = !DIEnumerator(name: "NAND_SDR_IFACE", value: 0, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_op_instr_type", file: !72, line: 570, baseType: !5, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIEnumerator(name: "NAND_OP_CMD_INSTR", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "NAND_OP_ADDR_INSTR", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "NAND_OP_DATA_IN_INSTR", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "NAND_OP_DATA_OUT_INSTR", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "NAND_OP_WAITRDY_INSTR", value: 4, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 10, baseType: !5, size: 32, elements: !84)
!83 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!84 = !{!85, !86}
!85 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !88, line: 305, baseType: !5, size: 32, elements: !89)
!88 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!89 = !{!90, !91, !92, !93}
!90 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!94 = !{!95, !97, !103, !105, !107, !108, !109}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !96, line: 148, baseType: !5)
!96 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !99, line: 17, baseType: !100)
!99 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !101, line: 21, baseType: !102)
!101 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !101, line: 24, baseType: !104)
!104 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !106, line: 29, baseType: !103)
!106 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !101, line: 27, baseType: !5)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !106, line: 31, baseType: !107)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!110 = !{i32 7, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{i32 1, !"wchar_size", i32 2}
!113 = !{i32 1, !"Code Model", i32 2}
!114 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!115 = distinct !DISubprogram(name: "nand_jedec_detect", scope: !1, file: !1, line: 24, type: !116, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !380)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !119}
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_chip", file: !72, line: 1096, size: 16704, elements: !121)
!121 = !{!122, !2410, !2416, !2440, !2533, !2603, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2749, !2750, !2751, !2752, !2753, !2754, !2756, !2806}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !120, file: !72, line: 1097, baseType: !123, size: 11200)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !49, line: 319, size: 11200, elements: !124)
!124 = !{!125, !2303, !2315, !2385, !2390, !2394}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !123, file: !49, line: 320, baseType: !126, size: 9664)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !127, line: 235, size: 9664, elements: !128)
!127 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!128 = !{!129, !131, !134, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !153, !154, !170, !191, !192, !193, !194, !204, !214, !230, !234, !239, !245, !246, !263, !264, !275, !276, !277, !278, !279, !280, !291, !295, !299, !300, !301, !305, !306, !307, !308, !312, !313, !314, !315, !316, !319, !331, !338, !339, !340, !344, !2273, !2274, !2282, !2286, !2287, !2288}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !127, line: 236, baseType: !130, size: 8)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !96, line: 79, baseType: !102)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !127, line: 237, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 104, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !99, line: 21, baseType: !107)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !127, line: 238, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !96, line: 107, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !99, line: 23, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !101, line: 31, baseType: !138)
!138 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !126, file: !127, line: 244, baseType: !132, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !126, file: !127, line: 252, baseType: !132, size: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !126, file: !127, line: 263, baseType: !132, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !126, file: !127, line: 265, baseType: !132, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !126, file: !127, line: 266, baseType: !132, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !126, file: !127, line: 272, baseType: !5, size: 32, offset: 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !126, file: !127, line: 273, baseType: !5, size: 32, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !126, file: !127, line: 275, baseType: !5, size: 32, offset: 352)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !126, file: !127, line: 276, baseType: !5, size: 32, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !126, file: !127, line: 285, baseType: !5, size: 32, offset: 416)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 288, baseType: !150, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !126, file: !127, line: 289, baseType: !118, size: 32, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !126, file: !127, line: 292, baseType: !155, size: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !127, line: 101, size: 128, elements: !158)
!158 = !{!159, !169}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !157, file: !127, line: 102, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!118, !163, !118, !164}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !127, line: 87, size: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !165, file: !127, line: 88, baseType: !133, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !165, file: !127, line: 89, baseType: !133, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !157, file: !127, line: 104, baseType: !160, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !126, file: !127, line: 295, baseType: !171, size: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !127, line: 176, size: 192, elements: !174)
!174 = !{!175, !176, !185}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !173, file: !127, line: 177, baseType: !118, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !173, file: !127, line: 178, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!118, !163, !118, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !127, line: 138, size: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !181, file: !127, line: 139, baseType: !118, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !181, file: !127, line: 140, baseType: !118, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !173, file: !127, line: 180, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!118, !163, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !126, file: !127, line: 298, baseType: !5, size: 32, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !126, file: !127, line: 301, baseType: !5, size: 32, offset: 736)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !126, file: !127, line: 306, baseType: !118, size: 32, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !126, file: !127, line: 307, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !127, line: 36, size: 192, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !196, file: !127, line: 37, baseType: !135, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !196, file: !127, line: 38, baseType: !132, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !196, file: !127, line: 39, baseType: !132, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !196, file: !127, line: 40, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !126, file: !127, line: 313, baseType: !205, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!118, !163, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !127, line: 30, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !209, file: !127, line: 31, baseType: !135, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !209, file: !127, line: 32, baseType: !135, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !209, file: !127, line: 33, baseType: !135, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !126, file: !127, line: 314, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!118, !163, !218, !222, !225, !226, !227}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !96, line: 46, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !220, line: 88, baseType: !221)
!220 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!221 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 55, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !220, line: 72, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !220, line: 16, baseType: !203)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !96, line: 158, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !96, line: 153, baseType: !136)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !126, file: !127, line: 316, baseType: !231, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!118, !163, !218, !222}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !126, file: !127, line: 317, baseType: !235, size: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!118, !163, !218, !222, !225, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !126, file: !127, line: 319, baseType: !240, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!118, !163, !218, !222, !225, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !126, file: !127, line: 321, baseType: !240, size: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !126, file: !127, line: 323, baseType: !247, size: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!118, !163, !218, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !127, line: 64, size: 512, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !262}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !251, file: !127, line: 65, baseType: !5, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !127, line: 66, baseType: !222, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !251, file: !127, line: 67, baseType: !222, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !251, file: !127, line: 68, baseType: !222, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !251, file: !127, line: 69, baseType: !222, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !251, file: !127, line: 70, baseType: !132, size: 32, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !251, file: !127, line: 71, baseType: !260, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !96, line: 102, baseType: !98)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !251, file: !127, line: 72, baseType: !260, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !126, file: !127, line: 325, baseType: !247, size: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !126, file: !127, line: 327, baseType: !265, size: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!118, !163, !222, !225, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !270, line: 146, size: 96, elements: !271)
!270 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !269, file: !270, line: 147, baseType: !107, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !269, file: !270, line: 148, baseType: !107, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !269, file: !270, line: 149, baseType: !107, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !126, file: !127, line: 329, baseType: !235, size: 64, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !126, file: !127, line: 331, baseType: !265, size: 64, offset: 1536)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !126, file: !127, line: 333, baseType: !235, size: 64, offset: 1600)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !126, file: !127, line: 335, baseType: !235, size: 64, offset: 1664)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !126, file: !127, line: 337, baseType: !231, size: 64, offset: 1728)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !126, file: !127, line: 339, baseType: !281, size: 64, offset: 1792)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!118, !163, !284, !203, !218, !225}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !287, line: 15, size: 128, elements: !288)
!287 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !286, file: !287, line: 16, baseType: !109, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !286, file: !287, line: 17, baseType: !222, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !126, file: !127, line: 341, baseType: !292, size: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !163}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !126, file: !127, line: 342, baseType: !296, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!118, !163, !218, !135}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !126, file: !127, line: 343, baseType: !296, size: 64, offset: 1984)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !126, file: !127, line: 344, baseType: !296, size: 64, offset: 2048)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !126, file: !127, line: 345, baseType: !302, size: 64, offset: 2112)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!118, !163, !218}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !126, file: !127, line: 346, baseType: !302, size: 64, offset: 2176)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !126, file: !127, line: 347, baseType: !302, size: 64, offset: 2240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !126, file: !127, line: 348, baseType: !231, size: 64, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !126, file: !127, line: 349, baseType: !309, size: 64, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!118, !163}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !126, file: !127, line: 350, baseType: !292, size: 64, offset: 2432)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !126, file: !127, line: 351, baseType: !292, size: 64, offset: 2496)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !126, file: !127, line: 356, baseType: !309, size: 64, offset: 2560)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !126, file: !127, line: 357, baseType: !292, size: 64, offset: 2624)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !126, file: !127, line: 363, baseType: !317, size: 8, offset: 2688)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !96, line: 30, baseType: !318)
!318 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !126, file: !127, line: 365, baseType: !320, size: 192, offset: 2752)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !321, line: 54, size: 192, elements: !322)
!321 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!322 = !{!323, !329, !330}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !320, file: !321, line: 55, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !321, line: 51, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!118, !328, !203, !109}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !321, line: 56, baseType: !328, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !320, file: !321, line: 57, baseType: !118, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !126, file: !127, line: 368, baseType: !332, size: 128, offset: 2944)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !270, line: 250, size: 128, elements: !333)
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !332, file: !270, line: 251, baseType: !107, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !332, file: !270, line: 252, baseType: !107, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !332, file: !270, line: 253, baseType: !107, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !332, file: !270, line: 254, baseType: !107, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !126, file: !127, line: 370, baseType: !118, size: 32, offset: 3072)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !126, file: !127, line: 372, baseType: !109, size: 64, offset: 3136)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !126, file: !127, line: 374, baseType: !341, size: 64, offset: 3200)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !343, line: 76, flags: DIFlagFwdDecl)
!343 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !126, file: !127, line: 375, baseType: !345, size: 5568, offset: 3264)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !28, line: 461, size: 5568, elements: !346)
!346 = !{!347, !1799, !1801, !1804, !1805, !1856, !1950, !1951, !1952, !1953, !1954, !1963, !2068, !2081, !2084, !2085, !2089, !2091, !2092, !2093, !2097, !2103, !2104, !2107, !2222, !2223, !2226, !2227, !2228, !2229, !2261, !2262, !2263, !2266, !2269, !2270, !2271, !2272}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !345, file: !28, line: 462, baseType: !348, size: 512)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !349, line: 64, size: 512, elements: !350)
!349 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!350 = !{!351, !352, !358, !360, !420, !1637, !1789, !1794, !1795, !1796, !1797, !1798}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !349, line: 65, baseType: !150, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !348, file: !349, line: 66, baseType: !353, size: 128, offset: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !96, line: 178, size: 128, elements: !354)
!354 = !{!355, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !96, line: 179, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !96, line: 179, baseType: !356, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !348, file: !349, line: 67, baseType: !359, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !348, file: !349, line: 68, baseType: !361, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !349, line: 192, size: 704, elements: !363)
!363 = !{!364, !365, !381, !382}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !362, file: !349, line: 193, baseType: !353, size: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !362, file: !349, line: 194, baseType: !366, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !367, line: 83, baseType: !368)
!367 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !367, line: 71, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 72, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 72, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !371, file: !367, line: 73, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !367, line: 20, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !374, file: !367, line: 21, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !378, line: 25, baseType: !379)
!378 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 25, elements: !380)
!380 = !{}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !362, file: !349, line: 195, baseType: !348, size: 512, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !362, file: !349, line: 196, baseType: !383, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !349, line: 156, size: 192, elements: !386)
!386 = !{!387, !392, !397}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !385, file: !349, line: 157, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!118, !361, !359}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !349, line: 158, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!150, !361, !359}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !385, file: !349, line: 159, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!118, !361, !359, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !349, line: 148, size: 20736, elements: !404)
!404 = !{!405, !410, !414, !415, !419}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !403, file: !349, line: 149, baseType: !406, size: 192)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 192, elements: !408)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!408 = !{!409}
!409 = !DISubrange(count: 3)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !403, file: !349, line: 150, baseType: !411, size: 4096, offset: 192)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 4096, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !403, file: !349, line: 151, baseType: !118, size: 32, offset: 4288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !403, file: !349, line: 152, baseType: !416, size: 16384, offset: 4320)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16384, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 2048)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !403, file: !349, line: 153, baseType: !118, size: 32, offset: 20704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !348, file: !349, line: 69, baseType: !421, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !349, line: 138, size: 448, elements: !423)
!423 = !{!424, !428, !452, !454, !1582, !1615, !1619}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !422, file: !349, line: 139, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !359}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !422, file: !349, line: 140, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !432, line: 230, size: 128, elements: !433)
!432 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!433 = !{!434, !448}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !431, file: !432, line: 231, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !359, !442, !407}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !96, line: 60, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !220, line: 73, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !220, line: 15, baseType: !441)
!441 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !432, line: 30, size: 128, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !432, line: 31, baseType: !150, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !443, file: !432, line: 32, baseType: !447, size: 16, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !96, line: 19, baseType: !104)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !431, file: !432, line: 232, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!438, !359, !442, !150, !222}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !422, file: !349, line: 141, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !422, file: !349, line: 142, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !432, line: 84, size: 320, elements: !459)
!459 = !{!460, !461, !465, !1579, !1580}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !432, line: 85, baseType: !150, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !458, file: !432, line: 86, baseType: !462, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!447, !359, !442, !118}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !458, file: !432, line: 88, baseType: !466, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!447, !359, !469, !118}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !432, line: 168, size: 448, elements: !471)
!471 = !{!472, !473, !474, !475, !482, !483}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !470, file: !432, line: 169, baseType: !443, size: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !470, file: !432, line: 170, baseType: !222, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !470, file: !432, line: 171, baseType: !109, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !470, file: !432, line: 172, baseType: !476, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!438, !479, !359, !469, !407, !218, !222}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !481, line: 526, flags: DIFlagFwdDecl)
!481 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !470, file: !432, line: 174, baseType: !476, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !470, file: !432, line: 176, baseType: !484, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!118, !479, !359, !469, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !489, line: 305, size: 1472, elements: !490)
!489 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!490 = !{!491, !492, !493, !494, !495, !503, !504, !1553, !1559, !1560, !1565, !1566, !1569, !1573, !1574, !1575, !1576, !1577}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !488, file: !489, line: 308, baseType: !203, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !488, file: !489, line: 309, baseType: !203, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !488, file: !489, line: 313, baseType: !487, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !488, file: !489, line: 313, baseType: !487, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !488, file: !489, line: 315, baseType: !496, size: 192, align: 64, offset: 256)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !497, line: 24, size: 192, align: 64, elements: !498)
!497 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!498 = !{!499, !500, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !496, file: !497, line: 25, baseType: !203, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !496, file: !497, line: 26, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !496, file: !497, line: 27, baseType: !501, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !488, file: !489, line: 323, baseType: !203, size: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !488, file: !489, line: 327, baseType: !505, size: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !489, line: 388, size: 7296, elements: !507)
!507 = !{!508, !1549}
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !489, line: 389, baseType: !509, size: 7296)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !489, line: 389, size: 7296, elements: !510)
!510 = !{!511, !512, !516, !517, !521, !522, !523, !524, !525, !533, !538, !539, !540, !541, !550, !551, !552, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !587, !595, !598, !629, !630, !1520, !1521, !1524, !1527, !1528, !1531, !1532, !1533, !1536, !1548}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !509, file: !489, line: 390, baseType: !487, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !509, file: !489, line: 391, baseType: !513, size: 64, offset: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !497, line: 31, size: 64, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !513, file: !497, line: 32, baseType: !501, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !509, file: !489, line: 392, baseType: !136, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !509, file: !489, line: 394, baseType: !518, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!203, !479, !203, !203, !203, !203}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !509, file: !489, line: 398, baseType: !203, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !509, file: !489, line: 399, baseType: !203, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !509, file: !489, line: 405, baseType: !203, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !509, file: !489, line: 406, baseType: !203, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !509, file: !489, line: 407, baseType: !526, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !481, line: 286, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !481, line: 286, size: 64, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !528, file: !481, line: 286, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !532, line: 18, baseType: !203)
!532 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!533 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !509, file: !489, line: 416, baseType: !534, size: 32, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !96, line: 168, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 166, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !535, file: !96, line: 167, baseType: !118, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !509, file: !489, line: 428, baseType: !534, size: 32, offset: 608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !509, file: !489, line: 437, baseType: !534, size: 32, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !509, file: !489, line: 447, baseType: !534, size: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !509, file: !489, line: 450, baseType: !542, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !543, line: 13, baseType: !544)
!543 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !96, line: 175, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 173, size: 64, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !545, file: !96, line: 174, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !99, line: 22, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !101, line: 30, baseType: !221)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !509, file: !489, line: 452, baseType: !118, size: 32, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !509, file: !489, line: 454, baseType: !366, offset: 800)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !509, file: !489, line: 457, baseType: !553, size: 256, offset: 832)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !554, line: 35, size: 256, elements: !555)
!554 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!555 = !{!556, !557, !558, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !553, file: !554, line: 36, baseType: !542, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !553, file: !554, line: 42, baseType: !542, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !553, file: !554, line: 46, baseType: !559, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !367, line: 29, baseType: !374)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !553, file: !554, line: 47, baseType: !353, size: 128, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !509, file: !489, line: 459, baseType: !353, size: 128, offset: 1088)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !509, file: !489, line: 466, baseType: !203, size: 64, offset: 1216)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !509, file: !489, line: 467, baseType: !203, size: 64, offset: 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !509, file: !489, line: 469, baseType: !203, size: 64, offset: 1344)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !509, file: !489, line: 470, baseType: !203, size: 64, offset: 1408)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !509, file: !489, line: 471, baseType: !544, size: 64, offset: 1472)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !509, file: !489, line: 472, baseType: !203, size: 64, offset: 1536)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !509, file: !489, line: 473, baseType: !203, size: 64, offset: 1600)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !509, file: !489, line: 474, baseType: !203, size: 64, offset: 1664)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !509, file: !489, line: 475, baseType: !203, size: 64, offset: 1728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !509, file: !489, line: 477, baseType: !366, offset: 1792)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !509, file: !489, line: 478, baseType: !203, size: 64, offset: 1792)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !509, file: !489, line: 478, baseType: !203, size: 64, offset: 1856)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !509, file: !489, line: 478, baseType: !203, size: 64, offset: 1920)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !509, file: !489, line: 478, baseType: !203, size: 64, offset: 1984)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !509, file: !489, line: 479, baseType: !203, size: 64, offset: 2048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !509, file: !489, line: 479, baseType: !203, size: 64, offset: 2112)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !509, file: !489, line: 479, baseType: !203, size: 64, offset: 2176)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !509, file: !489, line: 480, baseType: !203, size: 64, offset: 2240)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !509, file: !489, line: 480, baseType: !203, size: 64, offset: 2304)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !509, file: !489, line: 480, baseType: !203, size: 64, offset: 2368)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !509, file: !489, line: 480, baseType: !203, size: 64, offset: 2432)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !509, file: !489, line: 482, baseType: !584, size: 2816, offset: 2496)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 2816, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 44)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !509, file: !489, line: 488, baseType: !588, size: 256, offset: 5312)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !589, line: 60, size: 256, elements: !590)
!589 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !588, file: !589, line: 61, baseType: !592, size: 256)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 256, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 4)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !509, file: !489, line: 490, baseType: !596, size: 64, offset: 5568)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !489, line: 490, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !509, file: !489, line: 493, baseType: !599, size: 896, offset: 5632)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !600, line: 53, baseType: !601)
!600 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 13, size: 896, elements: !602)
!602 = !{!603, !604, !605, !606, !609, !610, !617, !618, !622, !623, !625}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !601, file: !600, line: 18, baseType: !136, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !601, file: !600, line: 28, baseType: !544, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !601, file: !600, line: 31, baseType: !553, size: 256, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !601, file: !600, line: 32, baseType: !607, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !600, line: 32, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !601, file: !600, line: 37, baseType: !104, size: 16, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !601, file: !600, line: 40, baseType: !611, size: 192, offset: 512)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !612, line: 53, size: 192, elements: !613)
!612 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!613 = !{!614, !615, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !611, file: !612, line: 54, baseType: !542, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !611, file: !612, line: 55, baseType: !366, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !611, file: !612, line: 59, baseType: !353, size: 128, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !601, file: !600, line: 41, baseType: !109, size: 64, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !601, file: !600, line: 42, baseType: !619, size: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !600, line: 42, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !601, file: !600, line: 44, baseType: !534, size: 32, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !601, file: !600, line: 50, baseType: !624, size: 16, offset: 864)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !99, line: 19, baseType: !103)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !601, file: !600, line: 51, baseType: !626, size: 16, offset: 880)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !99, line: 18, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !101, line: 23, baseType: !628)
!628 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !489, line: 495, baseType: !203, size: 64, offset: 6528)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !509, file: !489, line: 497, baseType: !631, size: 64, offset: 6592)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !489, line: 381, size: 384, elements: !633)
!633 = !{!634, !635, !1519}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !632, file: !489, line: 382, baseType: !534, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !632, file: !489, line: 383, baseType: !636, size: 128, offset: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !489, line: 376, size: 128, elements: !637)
!637 = !{!638, !1517}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !636, file: !489, line: 377, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !641, line: 640, size: 48640, elements: !642)
!641 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!642 = !{!643, !649, !651, !652, !658, !659, !660, !661, !662, !663, !664, !665, !669, !687, !698, !790, !791, !792, !803, !804, !806, !807, !808, !809, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !888, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !944, !946, !947, !948, !960, !962, !963, !964, !965, !966, !972, !973, !974, !975, !976, !977, !978, !990, !995, !999, !1000, !1001, !1004, !1008, !1011, !1014, !1017, !1020, !1023, !1026, !1029, !1035, !1036, !1037, !1043, !1044, !1045, !1046, !1047, !1056, !1057, !1058, !1059, !1060, !1065, !1066, !1067, !1070, !1071, !1074, !1077, !1080, !1083, !1086, !1089, !1090, !1170, !1173, !1176, !1177, !1180, !1181, !1182, !1188, !1189, !1190, !1203, !1204, !1205, !1215, !1220, !1223, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !640, file: !641, line: 646, baseType: !644, size: 128)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !645, line: 56, size: 128, elements: !646)
!645 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !644, file: !645, line: 57, baseType: !203, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !644, file: !645, line: 58, baseType: !133, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !640, file: !641, line: 649, baseType: !650, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !441)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !640, file: !641, line: 657, baseType: !109, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !640, file: !641, line: 658, baseType: !653, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !654, line: 113, baseType: !655)
!654 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !654, line: 111, size: 32, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !655, file: !654, line: 112, baseType: !534, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !640, file: !641, line: 660, baseType: !5, size: 32, offset: 288)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !640, file: !641, line: 661, baseType: !5, size: 32, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !640, file: !641, line: 684, baseType: !118, size: 32, offset: 352)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !640, file: !641, line: 686, baseType: !118, size: 32, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !640, file: !641, line: 687, baseType: !118, size: 32, offset: 416)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !640, file: !641, line: 688, baseType: !118, size: 32, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !640, file: !641, line: 689, baseType: !5, size: 32, offset: 480)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !640, file: !641, line: 691, baseType: !666, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !641, line: 691, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !640, file: !641, line: 692, baseType: !670, size: 832, offset: 576)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !641, line: 451, size: 832, elements: !671)
!671 = !{!672, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !670, file: !641, line: 453, baseType: !673, size: 128)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !641, line: 325, size: 128, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !673, file: !641, line: 326, baseType: !203, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !673, file: !641, line: 327, baseType: !133, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !670, file: !641, line: 454, baseType: !496, size: 192, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !670, file: !641, line: 455, baseType: !353, size: 128, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !670, file: !641, line: 456, baseType: !5, size: 32, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !670, file: !641, line: 458, baseType: !136, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !670, file: !641, line: 459, baseType: !136, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !670, file: !641, line: 460, baseType: !136, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !670, file: !641, line: 461, baseType: !136, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !670, file: !641, line: 463, baseType: !136, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !670, file: !641, line: 465, baseType: !686, offset: 832)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !641, line: 415, elements: !380)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !640, file: !641, line: 693, baseType: !688, size: 384, offset: 1408)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !641, line: 489, size: 384, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !688, file: !641, line: 490, baseType: !353, size: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !688, file: !641, line: 491, baseType: !203, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !688, file: !641, line: 492, baseType: !203, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !688, file: !641, line: 493, baseType: !5, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !688, file: !641, line: 494, baseType: !104, size: 16, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !688, file: !641, line: 495, baseType: !104, size: 16, offset: 304)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !688, file: !641, line: 497, baseType: !697, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !640, file: !641, line: 697, baseType: !699, size: 1792, offset: 1792)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !641, line: 507, size: 1792, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !787, !788}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !699, file: !641, line: 508, baseType: !496, size: 192, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !699, file: !641, line: 515, baseType: !136, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !699, file: !641, line: 516, baseType: !136, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !699, file: !641, line: 517, baseType: !136, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !699, file: !641, line: 518, baseType: !136, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !699, file: !641, line: 519, baseType: !136, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !699, file: !641, line: 526, baseType: !548, size: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !699, file: !641, line: 527, baseType: !136, size: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !699, file: !641, line: 528, baseType: !5, size: 32, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !699, file: !641, line: 554, baseType: !5, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !699, file: !641, line: 555, baseType: !5, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !699, file: !641, line: 556, baseType: !5, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !699, file: !641, line: 557, baseType: !5, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !699, file: !641, line: 563, baseType: !715, size: 512, offset: 704)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !4, line: 118, size: 512, elements: !716)
!716 = !{!717, !725, !726, !731, !783, !784, !785, !786}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !4, line: 119, baseType: !718, size: 256)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !719, line: 9, size: 256, elements: !720)
!719 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !718, file: !719, line: 10, baseType: !496, size: 192, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !718, file: !719, line: 11, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !724, line: 29, baseType: !548)
!724 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !715, file: !4, line: 120, baseType: !723, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !715, file: !4, line: 121, baseType: !727, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!3, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !715, file: !4, line: 122, baseType: !732, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !4, line: 159, size: 512, align: 512, elements: !734)
!734 = !{!735, !755, !756, !759, !769, !770, !778, !782}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !733, file: !4, line: 160, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !4, line: 214, size: 4608, align: 512, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !737, file: !4, line: 215, baseType: !559)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !737, file: !4, line: 216, baseType: !5, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !737, file: !4, line: 217, baseType: !5, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !737, file: !4, line: 218, baseType: !5, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !737, file: !4, line: 219, baseType: !5, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !737, file: !4, line: 220, baseType: !5, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !737, file: !4, line: 221, baseType: !5, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !737, file: !4, line: 222, baseType: !5, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !737, file: !4, line: 233, baseType: !723, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !737, file: !4, line: 234, baseType: !730, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !737, file: !4, line: 235, baseType: !723, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !737, file: !4, line: 236, baseType: !730, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !737, file: !4, line: 237, baseType: !752, size: 4096, offset: 512)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 4096, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 8)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !733, file: !4, line: 161, baseType: !5, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !733, file: !4, line: 162, baseType: !757, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !96, line: 27, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !220, line: 96, baseType: !118)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !733, file: !4, line: 163, baseType: !760, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !761, line: 276, baseType: !762)
!761 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !761, line: 276, size: 32, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !762, file: !761, line: 276, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !761, line: 70, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !761, line: 65, size: 32, elements: !767)
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !766, file: !761, line: 66, baseType: !5, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !733, file: !4, line: 164, baseType: !730, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !733, file: !4, line: 165, baseType: !771, size: 128, offset: 256)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !719, line: 14, size: 128, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !771, file: !719, line: 15, baseType: !774, size: 128)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !497, line: 125, size: 128, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !774, file: !497, line: 126, baseType: !513, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !774, file: !497, line: 127, baseType: !501, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !733, file: !4, line: 166, baseType: !779, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!723}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !733, file: !4, line: 167, baseType: !723, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !715, file: !4, line: 123, baseType: !98, size: 8, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !715, file: !4, line: 124, baseType: !98, size: 8, offset: 456)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !715, file: !4, line: 125, baseType: !98, size: 8, offset: 464)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !715, file: !4, line: 126, baseType: !98, size: 8, offset: 472)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !699, file: !641, line: 572, baseType: !715, size: 512, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !699, file: !641, line: 580, baseType: !789, size: 64, offset: 1728)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !640, file: !641, line: 721, baseType: !5, size: 32, offset: 3584)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !640, file: !641, line: 722, baseType: !118, size: 32, offset: 3616)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !640, file: !641, line: 723, baseType: !793, size: 64, offset: 3648)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !796, line: 17, baseType: !797)
!796 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !796, line: 17, size: 64, elements: !798)
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !797, file: !796, line: 17, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 1)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !640, file: !641, line: 724, baseType: !795, size: 64, offset: 3712)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !640, file: !641, line: 749, baseType: !805, offset: 3776)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !641, line: 290, elements: !380)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !640, file: !641, line: 751, baseType: !353, size: 128, offset: 3776)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !640, file: !641, line: 757, baseType: !505, size: 64, offset: 3904)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !640, file: !641, line: 758, baseType: !505, size: 64, offset: 3968)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !640, file: !641, line: 761, baseType: !810, size: 320, offset: 4032)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !589, line: 34, size: 320, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !810, file: !589, line: 35, baseType: !136, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !810, file: !589, line: 36, baseType: !814, size: 256, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 256, elements: !593)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !640, file: !641, line: 766, baseType: !118, size: 32, offset: 4352)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !640, file: !641, line: 767, baseType: !118, size: 32, offset: 4384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !640, file: !641, line: 768, baseType: !118, size: 32, offset: 4416)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !640, file: !641, line: 770, baseType: !118, size: 32, offset: 4448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !640, file: !641, line: 772, baseType: !203, size: 64, offset: 4480)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !640, file: !641, line: 775, baseType: !5, size: 32, offset: 4544)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !640, file: !641, line: 778, baseType: !5, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !640, file: !641, line: 779, baseType: !5, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !640, file: !641, line: 780, baseType: !5, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !640, file: !641, line: 803, baseType: !5, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !640, file: !641, line: 806, baseType: !5, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !640, file: !641, line: 807, baseType: !5, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !640, file: !641, line: 809, baseType: !5, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !640, file: !641, line: 815, baseType: !5, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !640, file: !641, line: 831, baseType: !203, size: 64, offset: 4672)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !640, file: !641, line: 833, baseType: !831, size: 384, offset: 4736)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !10, line: 25, size: 384, elements: !832)
!832 = !{!833, !838}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !831, file: !10, line: 26, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!441, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, scope: !831, file: !10, line: 27, baseType: !839, size: 320, offset: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !831, file: !10, line: 27, size: 320, elements: !840)
!840 = !{!841, !851, !878}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !839, file: !10, line: 36, baseType: !842, size: 320)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !10, line: 29, size: 320, elements: !843)
!843 = !{!844, !846, !847, !848, !849, !850}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !842, file: !10, line: 30, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !842, file: !10, line: 31, baseType: !133, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !842, file: !10, line: 32, baseType: !133, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !842, file: !10, line: 33, baseType: !133, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !842, file: !10, line: 34, baseType: !136, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !842, file: !10, line: 35, baseType: !845, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !839, file: !10, line: 46, baseType: !852, size: 192)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !10, line: 38, size: 192, elements: !853)
!853 = !{!854, !855, !856, !877}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !852, file: !10, line: 39, baseType: !757, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !10, line: 40, baseType: !9, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, scope: !852, file: !10, line: 41, baseType: !857, size: 64, offset: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !852, file: !10, line: 41, size: 64, elements: !858)
!858 = !{!859, !867}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !857, file: !10, line: 42, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !862, line: 7, size: 128, elements: !863)
!862 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!863 = !{!864, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !861, file: !862, line: 8, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !220, line: 93, baseType: !221)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !861, file: !862, line: 9, baseType: !221, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !857, file: !10, line: 43, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !870, line: 7, size: 64, elements: !871)
!870 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!871 = !{!872, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !869, file: !870, line: 8, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !870, line: 5, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !99, line: 20, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !101, line: 26, baseType: !118)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !869, file: !870, line: 9, baseType: !874, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !852, file: !10, line: 45, baseType: !136, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !839, file: !10, line: 54, baseType: !879, size: 256)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !10, line: 48, size: 256, elements: !880)
!880 = !{!881, !884, !885, !886, !887}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !879, file: !10, line: 49, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !10, line: 14, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !879, file: !10, line: 50, baseType: !118, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !879, file: !10, line: 51, baseType: !118, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !879, file: !10, line: 52, baseType: !203, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !879, file: !10, line: 53, baseType: !203, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !640, file: !641, line: 835, baseType: !889, size: 32, offset: 5120)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !96, line: 22, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !220, line: 28, baseType: !118)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !640, file: !641, line: 836, baseType: !889, size: 32, offset: 5152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !640, file: !641, line: 840, baseType: !203, size: 64, offset: 5184)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !640, file: !641, line: 849, baseType: !639, size: 64, offset: 5248)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !640, file: !641, line: 852, baseType: !639, size: 64, offset: 5312)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !640, file: !641, line: 857, baseType: !353, size: 128, offset: 5376)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !640, file: !641, line: 858, baseType: !353, size: 128, offset: 5504)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !640, file: !641, line: 859, baseType: !639, size: 64, offset: 5632)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !640, file: !641, line: 867, baseType: !353, size: 128, offset: 5696)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !640, file: !641, line: 868, baseType: !353, size: 128, offset: 5824)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !640, file: !641, line: 871, baseType: !901, size: 64, offset: 5952)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !903, line: 59, size: 768, elements: !904)
!903 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!904 = !{!905, !906, !907, !908, !919, !920, !927, !936}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !902, file: !903, line: 61, baseType: !653, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !902, file: !903, line: 62, baseType: !5, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !902, file: !903, line: 63, baseType: !366, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !902, file: !903, line: 65, baseType: !909, size: 256, offset: 64)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 256, elements: !593)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !96, line: 182, size: 64, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !910, file: !96, line: 183, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !96, line: 186, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !914, file: !96, line: 187, baseType: !913, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !914, file: !96, line: 187, baseType: !918, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !902, file: !903, line: 66, baseType: !910, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !902, file: !903, line: 68, baseType: !921, size: 128, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !922, line: 40, baseType: !923)
!922 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !922, line: 36, size: 128, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !923, file: !922, line: 37, baseType: !366)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !923, file: !922, line: 38, baseType: !353, size: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !902, file: !903, line: 69, baseType: !928, size: 128, align: 64, offset: 512)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !96, line: 216, size: 128, align: 64, elements: !929)
!929 = !{!930, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !928, file: !96, line: 217, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !928, file: !96, line: 218, baseType: !933, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !931}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !902, file: !903, line: 70, baseType: !937, size: 128, offset: 640)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 128, elements: !801)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !903, line: 54, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !938, file: !903, line: 55, baseType: !118, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !938, file: !903, line: 56, baseType: !942, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !903, line: 56, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !640, file: !641, line: 872, baseType: !945, size: 512, offset: 6016)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 512, elements: !593)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !640, file: !641, line: 873, baseType: !353, size: 128, offset: 6528)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !640, file: !641, line: 874, baseType: !353, size: 128, offset: 6656)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !640, file: !641, line: 876, baseType: !949, size: 64, offset: 6784)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !951, line: 26, size: 192, elements: !952)
!951 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !950, file: !951, line: 27, baseType: !5, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !950, file: !951, line: 28, baseType: !955, size: 128, offset: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !956, line: 43, size: 128, elements: !957)
!956 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !955, file: !956, line: 44, baseType: !559)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !955, file: !956, line: 45, baseType: !353, size: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !640, file: !641, line: 879, baseType: !961, size: 64, offset: 6848)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !640, file: !641, line: 882, baseType: !961, size: 64, offset: 6912)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !640, file: !641, line: 884, baseType: !136, size: 64, offset: 6976)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !640, file: !641, line: 885, baseType: !136, size: 64, offset: 7040)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !640, file: !641, line: 890, baseType: !136, size: 64, offset: 7104)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !640, file: !641, line: 891, baseType: !967, size: 128, offset: 7168)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !641, line: 242, size: 128, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !967, file: !641, line: 244, baseType: !136, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !967, file: !641, line: 245, baseType: !136, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !967, file: !641, line: 246, baseType: !559, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !640, file: !641, line: 900, baseType: !203, size: 64, offset: 7296)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !640, file: !641, line: 901, baseType: !203, size: 64, offset: 7360)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !640, file: !641, line: 904, baseType: !136, size: 64, offset: 7424)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !640, file: !641, line: 907, baseType: !136, size: 64, offset: 7488)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !640, file: !641, line: 910, baseType: !203, size: 64, offset: 7552)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !640, file: !641, line: 911, baseType: !203, size: 64, offset: 7616)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !640, file: !641, line: 914, baseType: !979, size: 640, offset: 7680)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !980, line: 123, size: 640, elements: !981)
!980 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!981 = !{!982, !988, !989}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !979, file: !980, line: 124, baseType: !983, size: 576)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 576, elements: !408)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !980, line: 108, size: 192, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !984, file: !980, line: 109, baseType: !136, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !984, file: !980, line: 110, baseType: !771, size: 128, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !979, file: !980, line: 125, baseType: !5, size: 32, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !979, file: !980, line: 126, baseType: !5, size: 32, offset: 608)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !640, file: !641, line: 917, baseType: !991, size: 192, offset: 8320)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !980, line: 134, size: 192, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !991, file: !980, line: 135, baseType: !928, size: 128, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !991, file: !980, line: 136, baseType: !5, size: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !640, file: !641, line: 923, baseType: !996, size: 64, offset: 8512)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !641, line: 923, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !640, file: !641, line: 926, baseType: !996, size: 64, offset: 8576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !640, file: !641, line: 929, baseType: !996, size: 64, offset: 8640)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !640, file: !641, line: 933, baseType: !1002, size: 64, offset: 8704)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !641, line: 933, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !640, file: !641, line: 943, baseType: !1005, size: 128, offset: 8768)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 16)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !640, file: !641, line: 945, baseType: !1009, size: 64, offset: 8896)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !641, line: 49, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !640, file: !641, line: 956, baseType: !1012, size: 64, offset: 8960)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !641, line: 45, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !640, file: !641, line: 959, baseType: !1015, size: 64, offset: 9024)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !641, line: 959, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !640, file: !641, line: 962, baseType: !1018, size: 64, offset: 9088)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
