; ModuleID = '../bcout/drivers/mtd/nand/raw/nand_hynix.llvm.bc'
source_filename = "drivers/mtd/nand/raw/nand_hynix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.nand_chip = type { %struct.nand_device, %struct.nand_id, %struct.nand_parameters, %struct.nand_manufacturer, %struct.nand_chip_ops, %struct.nand_legacy, i32, %struct.nand_interface_config*, %struct.nand_interface_config*, i32, i32, i32, i32, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, i8*, i32, i32, i32, i32, i32, i8*, i8*, %struct.anon.44, i64, %struct.mutex, i8, i32, i32, %struct.nand_controller*, %struct.nand_ecc_ctrl, i8* }
%struct.nand_device = type { %struct.mtd_info, %struct.nand_memory_organization, %struct.nand_ecc, %struct.nand_row_converter, %struct.nand_bbt, %struct.nand_ops* }

!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_engine_type", file: !51, line: 142, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/mtd/nand.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_INVALID", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_NONE", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_SOFT", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_HOST", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_DIE", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_placement", file: !51, line: 158, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_UNKNOWN", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_OOB", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_INTERLEAVED", value: 2, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_algo", file: !51, line: 171, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_UNKNOWN", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !51, line: 90, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_interface_type", file: !74, line: 481, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "./include/linux/mtd/rawnand.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76}
!76 = !DIEnumerator(name: "NAND_SDR_IFACE", value: 0, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_op_instr_type", file: !74, line: 570, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "NAND_OP_CMD_INSTR", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "NAND_OP_ADDR_INSTR", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "NAND_OP_DATA_IN_INSTR", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "NAND_OP_DATA_OUT_INSTR", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "NAND_OP_WAITRDY_INSTR", value: 4, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 10, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!86 = !{!87, !88}
!87 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !90, line: 305, baseType: !7, size: 32, elements: !91)
!90 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!91 = !{!92, !93, !94, !95}
!92 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!96 = !{!97, !99, !100, !101}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !98, line: 148, baseType: !7)
!98 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !102, line: 19, baseType: !103)
!102 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !104, line: 24, baseType: !105)
!104 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!105 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!106 = !{!0, !107, !115, !130, !135}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "hynix_1xnm_mlc_read_retry_regs", scope: !2, file: !3, line: 283, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !113)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !102, line: 17, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !104, line: 21, baseType: !112)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !{!114}
!114 = !DISubrange(count: 8)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "hynix_mlc_1xnm_rr_otps", scope: !2, file: !3, line: 355, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 512, elements: !128)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hynix_read_retry_otp", file: !3, line: 52, size: 256, elements: !120)
!120 = !{!121, !122, !125, !126, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nregs", scope: !119, file: !3, line: 53, baseType: !100, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !119, file: !3, line: 54, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !119, file: !3, line: 55, baseType: !123, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !119, file: !3, line: 56, baseType: !100, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !3, line: 57, baseType: !100, size: 32, offset: 224)
!128 = !{!129}
!129 = !DISubrange(count: 2)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "hynix_mlc_1xnm_rr_otp_regs", scope: !2, file: !3, line: 352, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "hynix_mlc_1xnm_rr_otp_values", scope: !2, file: !3, line: 353, type: !132, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_manufacturer_ops", file: !139, line: 47, size: 256, elements: !140)
!139 = !DIFile(filename: "drivers/mtd/nand/raw/internals.h", directory: "/home/lizy2001/genbc/linux")
!140 = !{!141, !2749, !2750, !2751}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !138, file: !139, line: 48, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_chip", file: !74, line: 1096, size: 16704, elements: !147)
!147 = !{!148, !2431, !2436, !2460, !2473, !2546, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2676, !2677, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2691, !2692, !2693, !2694, !2695, !2696, !2698, !2748}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !146, file: !74, line: 1097, baseType: !149, size: 11200)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !51, line: 319, size: 11200, elements: !150)
!150 = !{!151, !2324, !2336, !2406, !2411, !2415}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !149, file: !51, line: 320, baseType: !152, size: 9664)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !153, line: 235, size: 9664, elements: !154)
!153 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!154 = !{!155, !157, !161, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !180, !181, !197, !218, !219, !220, !221, !231, !241, !257, !261, !266, !272, !273, !290, !291, !302, !303, !304, !305, !306, !307, !318, !322, !326, !327, !328, !332, !333, !334, !335, !339, !340, !341, !342, !343, !346, !358, !365, !366, !367, !371, !2294, !2295, !2303, !2307, !2308, !2309}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !153, line: 236, baseType: !156, size: 8)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !98, line: 79, baseType: !112)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !153, line: 237, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !98, line: 104, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !102, line: 21, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !104, line: 27, baseType: !7)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !153, line: 238, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !98, line: 107, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !102, line: 23, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !104, line: 31, baseType: !165)
!165 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !152, file: !153, line: 244, baseType: !158, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !152, file: !153, line: 252, baseType: !158, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !152, file: !153, line: 263, baseType: !158, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !152, file: !153, line: 265, baseType: !158, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !152, file: !153, line: 266, baseType: !158, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !152, file: !153, line: 272, baseType: !7, size: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !152, file: !153, line: 273, baseType: !7, size: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !152, file: !153, line: 275, baseType: !7, size: 32, offset: 352)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !152, file: !153, line: 276, baseType: !7, size: 32, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !152, file: !153, line: 285, baseType: !7, size: 32, offset: 416)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 288, baseType: !177, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !152, file: !153, line: 289, baseType: !100, size: 32, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !152, file: !153, line: 292, baseType: !182, size: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !153, line: 101, size: 128, elements: !185)
!185 = !{!186, !196}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !184, file: !153, line: 102, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!100, !190, !100, !191}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !153, line: 87, size: 64, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !192, file: !153, line: 88, baseType: !159, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !192, file: !153, line: 89, baseType: !159, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !184, file: !153, line: 104, baseType: !187, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !152, file: !153, line: 295, baseType: !198, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !153, line: 176, size: 192, elements: !201)
!201 = !{!202, !203, !212}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !200, file: !153, line: 177, baseType: !100, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !200, file: !153, line: 178, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!100, !190, !100, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !153, line: 138, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !208, file: !153, line: 139, baseType: !100, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !208, file: !153, line: 140, baseType: !100, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !200, file: !153, line: 180, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!100, !190, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !152, file: !153, line: 298, baseType: !7, size: 32, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !152, file: !153, line: 301, baseType: !7, size: 32, offset: 736)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !152, file: !153, line: 306, baseType: !100, size: 32, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !152, file: !153, line: 307, baseType: !222, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !153, line: 36, size: 192, elements: !224)
!224 = !{!225, !226, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !223, file: !153, line: 37, baseType: !162, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !223, file: !153, line: 38, baseType: !158, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !223, file: !153, line: 39, baseType: !158, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !223, file: !153, line: 40, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !152, file: !153, line: 313, baseType: !232, size: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!100, !190, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !153, line: 30, size: 192, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !236, file: !153, line: 31, baseType: !162, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !153, line: 32, baseType: !162, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !236, file: !153, line: 33, baseType: !162, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !152, file: !153, line: 314, baseType: !242, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!100, !190, !245, !249, !252, !253, !254}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !98, line: 46, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !247, line: 88, baseType: !248)
!247 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!248 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !98, line: 55, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !247, line: 72, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !247, line: 16, baseType: !230)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !98, line: 158, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !98, line: 153, baseType: !163)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !152, file: !153, line: 316, baseType: !258, size: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!100, !190, !245, !249}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !152, file: !153, line: 317, baseType: !262, size: 64, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!100, !190, !245, !249, !252, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !152, file: !153, line: 319, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!100, !190, !245, !249, !252, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !152, file: !153, line: 321, baseType: !267, size: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !152, file: !153, line: 323, baseType: !274, size: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!100, !190, !245, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !153, line: 64, size: 512, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !289}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !278, file: !153, line: 65, baseType: !7, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !278, file: !153, line: 66, baseType: !249, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !278, file: !153, line: 67, baseType: !249, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !278, file: !153, line: 68, baseType: !249, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !278, file: !153, line: 69, baseType: !249, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !278, file: !153, line: 70, baseType: !158, size: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !278, file: !153, line: 71, baseType: !287, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !98, line: 102, baseType: !110)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !278, file: !153, line: 72, baseType: !287, size: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !152, file: !153, line: 325, baseType: !274, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !152, file: !153, line: 327, baseType: !292, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!100, !190, !249, !252, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !297, line: 146, size: 96, elements: !298)
!297 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!298 = !{!299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !296, file: !297, line: 147, baseType: !160, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !296, file: !297, line: 148, baseType: !160, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !296, file: !297, line: 149, baseType: !160, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !152, file: !153, line: 329, baseType: !262, size: 64, offset: 1472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !152, file: !153, line: 331, baseType: !292, size: 64, offset: 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !152, file: !153, line: 333, baseType: !262, size: 64, offset: 1600)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !152, file: !153, line: 335, baseType: !262, size: 64, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !152, file: !153, line: 337, baseType: !258, size: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !152, file: !153, line: 339, baseType: !308, size: 64, offset: 1792)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!100, !190, !311, !230, !245, !252}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !314, line: 15, size: 128, elements: !315)
!314 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !313, file: !314, line: 16, baseType: !99, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !313, file: !314, line: 17, baseType: !249, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !152, file: !153, line: 341, baseType: !319, size: 64, offset: 1856)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !190}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !152, file: !153, line: 342, baseType: !323, size: 64, offset: 1920)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!100, !190, !245, !162}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !152, file: !153, line: 343, baseType: !323, size: 64, offset: 1984)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !152, file: !153, line: 344, baseType: !323, size: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !152, file: !153, line: 345, baseType: !329, size: 64, offset: 2112)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!100, !190, !245}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !152, file: !153, line: 346, baseType: !329, size: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !152, file: !153, line: 347, baseType: !329, size: 64, offset: 2240)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !152, file: !153, line: 348, baseType: !258, size: 64, offset: 2304)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !152, file: !153, line: 349, baseType: !336, size: 64, offset: 2368)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!100, !190}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !152, file: !153, line: 350, baseType: !319, size: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !152, file: !153, line: 351, baseType: !319, size: 64, offset: 2496)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !152, file: !153, line: 356, baseType: !336, size: 64, offset: 2560)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !152, file: !153, line: 357, baseType: !319, size: 64, offset: 2624)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !152, file: !153, line: 363, baseType: !344, size: 8, offset: 2688)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !98, line: 30, baseType: !345)
!345 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !152, file: !153, line: 365, baseType: !347, size: 192, offset: 2752)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !348, line: 54, size: 192, elements: !349)
!348 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!349 = !{!350, !356, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !347, file: !348, line: 55, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !348, line: 51, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!100, !355, !230, !99}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !348, line: 56, baseType: !355, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !347, file: !348, line: 57, baseType: !100, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !152, file: !153, line: 368, baseType: !359, size: 128, offset: 2944)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !297, line: 250, size: 128, elements: !360)
!360 = !{!361, !362, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !359, file: !297, line: 251, baseType: !160, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !359, file: !297, line: 252, baseType: !160, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !359, file: !297, line: 253, baseType: !160, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !359, file: !297, line: 254, baseType: !160, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !152, file: !153, line: 370, baseType: !100, size: 32, offset: 3072)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !152, file: !153, line: 372, baseType: !99, size: 64, offset: 3136)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !152, file: !153, line: 374, baseType: !368, size: 64, offset: 3200)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !370, line: 76, flags: DIFlagFwdDecl)
!370 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !152, file: !153, line: 375, baseType: !372, size: 5568, offset: 3264)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !373)
!373 = !{!374, !1820, !1822, !1825, !1826, !1877, !1971, !1972, !1973, !1974, !1975, !1984, !2089, !2102, !2105, !2106, !2110, !2112, !2113, !2114, !2118, !2124, !2125, !2128, !2243, !2244, !2247, !2248, !2249, !2250, !2282, !2283, !2284, !2287, !2290, !2291, !2292, !2293}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !372, file: !30, line: 462, baseType: !375, size: 512)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !376, line: 64, size: 512, elements: !377)
!376 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!377 = !{!378, !379, !385, !387, !447, !1657, !1810, !1815, !1816, !1817, !1818, !1819}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !376, line: 65, baseType: !177, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !375, file: !376, line: 66, baseType: !380, size: 128, offset: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !98, line: 178, size: 128, elements: !381)
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !98, line: 179, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !380, file: !98, line: 179, baseType: !383, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !375, file: !376, line: 67, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !375, file: !376, line: 68, baseType: !388, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !376, line: 192, size: 704, elements: !390)
!390 = !{!391, !392, !408, !409}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !389, file: !376, line: 193, baseType: !380, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !389, file: !376, line: 194, baseType: !393, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !394, line: 83, baseType: !395)
!394 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !394, line: 71, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !394, line: 72, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !394, line: 72, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !398, file: !394, line: 73, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !394, line: 20, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !401, file: !394, line: 21, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !405, line: 25, baseType: !406)
!405 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 25, elements: !407)
!407 = !{}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !389, file: !376, line: 195, baseType: !375, size: 512, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !389, file: !376, line: 196, baseType: !410, size: 64, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !376, line: 156, size: 192, elements: !413)
!413 = !{!414, !419, !424}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !412, file: !376, line: 157, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!100, !388, !386}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !376, line: 158, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!177, !388, !386}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !412, file: !376, line: 159, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!100, !388, !386, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !376, line: 148, size: 20736, elements: !431)
!431 = !{!432, !437, !441, !442, !446}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !430, file: !376, line: 149, baseType: !433, size: 192)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 192, elements: !435)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!435 = !{!436}
!436 = !DISubrange(count: 3)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !430, file: !376, line: 150, baseType: !438, size: 4096, offset: 192)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 4096, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !430, file: !376, line: 151, baseType: !100, size: 32, offset: 4288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !430, file: !376, line: 152, baseType: !443, size: 16384, offset: 4320)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 16384, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 2048)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !430, file: !376, line: 153, baseType: !100, size: 32, offset: 20704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !375, file: !376, line: 69, baseType: !448, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !376, line: 138, size: 448, elements: !450)
!450 = !{!451, !455, !479, !481, !1602, !1635, !1639}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !449, file: !376, line: 139, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !386}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !449, file: !376, line: 140, baseType: !456, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !459, line: 230, size: 128, elements: !460)
!459 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!460 = !{!461, !475}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !458, file: !459, line: 231, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!465, !386, !469, !434}
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !98, line: 60, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !247, line: 73, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !247, line: 15, baseType: !468)
!468 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !459, line: 30, size: 128, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !470, file: !459, line: 31, baseType: !177, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !470, file: !459, line: 32, baseType: !474, size: 16, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !98, line: 19, baseType: !105)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !458, file: !459, line: 232, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!465, !386, !469, !177, !249}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !449, file: !376, line: 141, baseType: !480, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !449, file: !376, line: 142, baseType: !482, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !459, line: 84, size: 320, elements: !486)
!486 = !{!487, !488, !492, !1599, !1600}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !459, line: 85, baseType: !177, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !485, file: !459, line: 86, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!474, !386, !469, !100}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !485, file: !459, line: 88, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!474, !386, !496, !100}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !459, line: 168, size: 448, elements: !498)
!498 = !{!499, !500, !501, !502, !509, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !497, file: !459, line: 169, baseType: !470, size: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !497, file: !459, line: 170, baseType: !249, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !497, file: !459, line: 171, baseType: !99, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !497, file: !459, line: 172, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!465, !506, !386, !496, !434, !245, !249}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !508, line: 526, flags: DIFlagFwdDecl)
!508 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!509 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !497, file: !459, line: 174, baseType: !503, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !497, file: !459, line: 176, baseType: !511, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!100, !506, !386, !496, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !516, line: 305, size: 1472, elements: !517)
!516 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!517 = !{!518, !519, !520, !521, !522, !530, !531, !1573, !1579, !1580, !1585, !1586, !1589, !1593, !1594, !1595, !1596, !1597}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !515, file: !516, line: 308, baseType: !230, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !515, file: !516, line: 309, baseType: !230, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !515, file: !516, line: 313, baseType: !514, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !515, file: !516, line: 313, baseType: !514, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !515, file: !516, line: 315, baseType: !523, size: 192, align: 64, offset: 256)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !524, line: 24, size: 192, align: 64, elements: !525)
!524 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!525 = !{!526, !527, !529}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !523, file: !524, line: 25, baseType: !230, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !523, file: !524, line: 26, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !523, file: !524, line: 27, baseType: !528, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !515, file: !516, line: 323, baseType: !230, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !515, file: !516, line: 327, baseType: !532, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !516, line: 388, size: 7296, elements: !534)
!534 = !{!535, !1569}
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !516, line: 389, baseType: !536, size: 7296)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !533, file: !516, line: 389, size: 7296, elements: !537)
!537 = !{!538, !539, !543, !544, !548, !549, !550, !551, !552, !560, !565, !566, !567, !568, !577, !578, !579, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !614, !622, !625, !655, !656, !1540, !1541, !1544, !1547, !1548, !1551, !1552, !1553, !1556, !1568}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !536, file: !516, line: 390, baseType: !514, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !536, file: !516, line: 391, baseType: !540, size: 64, offset: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !524, line: 31, size: 64, elements: !541)
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !540, file: !524, line: 32, baseType: !528, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !536, file: !516, line: 392, baseType: !163, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !536, file: !516, line: 394, baseType: !545, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!230, !506, !230, !230, !230, !230}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !536, file: !516, line: 398, baseType: !230, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !536, file: !516, line: 399, baseType: !230, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !536, file: !516, line: 405, baseType: !230, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !536, file: !516, line: 406, baseType: !230, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !536, file: !516, line: 407, baseType: !553, size: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !508, line: 286, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 286, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !555, file: !508, line: 286, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !559, line: 18, baseType: !230)
!559 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !536, file: !516, line: 416, baseType: !561, size: 32, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !98, line: 168, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 166, size: 32, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !562, file: !98, line: 167, baseType: !100, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !536, file: !516, line: 428, baseType: !561, size: 32, offset: 608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !536, file: !516, line: 437, baseType: !561, size: 32, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !536, file: !516, line: 447, baseType: !561, size: 32, offset: 672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !536, file: !516, line: 450, baseType: !569, size: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !570, line: 13, baseType: !571)
!570 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !98, line: 175, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 173, size: 64, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !572, file: !98, line: 174, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !102, line: 22, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !104, line: 30, baseType: !248)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !536, file: !516, line: 452, baseType: !100, size: 32, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !536, file: !516, line: 454, baseType: !393, offset: 800)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !536, file: !516, line: 457, baseType: !580, size: 256, offset: 832)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !581, line: 35, size: 256, elements: !582)
!581 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!582 = !{!583, !584, !585, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !580, file: !581, line: 36, baseType: !569, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !580, file: !581, line: 42, baseType: !569, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !580, file: !581, line: 46, baseType: !586, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !394, line: 29, baseType: !401)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !580, file: !581, line: 47, baseType: !380, size: 128, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !536, file: !516, line: 459, baseType: !380, size: 128, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !536, file: !516, line: 466, baseType: !230, size: 64, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !536, file: !516, line: 467, baseType: !230, size: 64, offset: 1280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !536, file: !516, line: 469, baseType: !230, size: 64, offset: 1344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !536, file: !516, line: 470, baseType: !230, size: 64, offset: 1408)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !536, file: !516, line: 471, baseType: !571, size: 64, offset: 1472)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !536, file: !516, line: 472, baseType: !230, size: 64, offset: 1536)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !536, file: !516, line: 473, baseType: !230, size: 64, offset: 1600)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !536, file: !516, line: 474, baseType: !230, size: 64, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !536, file: !516, line: 475, baseType: !230, size: 64, offset: 1728)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !536, file: !516, line: 477, baseType: !393, offset: 1792)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !536, file: !516, line: 478, baseType: !230, size: 64, offset: 1792)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !536, file: !516, line: 478, baseType: !230, size: 64, offset: 1856)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !536, file: !516, line: 478, baseType: !230, size: 64, offset: 1920)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !536, file: !516, line: 478, baseType: !230, size: 64, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !536, file: !516, line: 479, baseType: !230, size: 64, offset: 2048)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !536, file: !516, line: 479, baseType: !230, size: 64, offset: 2112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !536, file: !516, line: 479, baseType: !230, size: 64, offset: 2176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !536, file: !516, line: 480, baseType: !230, size: 64, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !536, file: !516, line: 480, baseType: !230, size: 64, offset: 2304)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !536, file: !516, line: 480, baseType: !230, size: 64, offset: 2368)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !536, file: !516, line: 480, baseType: !230, size: 64, offset: 2432)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !536, file: !516, line: 482, baseType: !611, size: 2816, offset: 2496)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 2816, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 44)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !536, file: !516, line: 488, baseType: !615, size: 256, offset: 5312)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !616, line: 60, size: 256, elements: !617)
!616 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !615, file: !616, line: 61, baseType: !619, size: 256)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 256, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 4)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !536, file: !516, line: 490, baseType: !623, size: 64, offset: 5568)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !516, line: 490, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !536, file: !516, line: 493, baseType: !626, size: 896, offset: 5632)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !627, line: 53, baseType: !628)
!627 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 13, size: 896, elements: !629)
!629 = !{!630, !631, !632, !633, !636, !637, !644, !645, !649, !650, !651}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !628, file: !627, line: 18, baseType: !163, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !628, file: !627, line: 28, baseType: !571, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !628, file: !627, line: 31, baseType: !580, size: 256, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !628, file: !627, line: 32, baseType: !634, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !627, line: 32, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !628, file: !627, line: 37, baseType: !105, size: 16, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !628, file: !627, line: 40, baseType: !638, size: 192, offset: 512)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !639, line: 53, size: 192, elements: !640)
!639 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !638, file: !639, line: 54, baseType: !569, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !638, file: !639, line: 55, baseType: !393, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !638, file: !639, line: 59, baseType: !380, size: 128, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !628, file: !627, line: 41, baseType: !99, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !628, file: !627, line: 42, baseType: !646, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !627, line: 42, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !628, file: !627, line: 44, baseType: !561, size: 32, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !628, file: !627, line: 50, baseType: !101, size: 16, offset: 864)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !628, file: !627, line: 51, baseType: !652, size: 16, offset: 880)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !102, line: 18, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !104, line: 23, baseType: !654)
!654 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !536, file: !516, line: 495, baseType: !230, size: 64, offset: 6528)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !536, file: !516, line: 497, baseType: !657, size: 64, offset: 6592)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !516, line: 381, size: 384, elements: !659)
!659 = !{!660, !661, !1539}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !658, file: !516, line: 382, baseType: !561, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !658, file: !516, line: 383, baseType: !662, size: 128, offset: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !516, line: 376, size: 128, elements: !663)
!663 = !{!664, !1537}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !662, file: !516, line: 377, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !667, line: 640, size: 48640, elements: !668)
!667 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!668 = !{!669, !675, !677, !678, !684, !685, !686, !687, !688, !689, !690, !691, !695, !713, !724, !814, !815, !816, !825, !826, !828, !829, !830, !831, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !910, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !966, !968, !969, !970, !982, !984, !985, !986, !987, !988, !994, !995, !996, !997, !998, !999, !1000, !1012, !1017, !1021, !1022, !1023, !1026, !1030, !1033, !1036, !1039, !1042, !1045, !1048, !1051, !1057, !1058, !1059, !1065, !1066, !1067, !1068, !1069, !1078, !1079, !1080, !1081, !1082, !1087, !1088, !1089, !1092, !1093, !1096, !1099, !1102, !1105, !1108, !1111, !1112, !1192, !1195, !1198, !1199, !1202, !1203, !1204, !1208, !1209, !1210, !1223, !1224, !1225, !1235, !1240, !1243, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !666, file: !667, line: 646, baseType: !670, size: 128)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !671, line: 56, size: 128, elements: !672)
!671 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !670, file: !671, line: 57, baseType: !230, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !670, file: !671, line: 58, baseType: !159, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !666, file: !667, line: 649, baseType: !676, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !468)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !666, file: !667, line: 657, baseType: !99, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !666, file: !667, line: 658, baseType: !679, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !680, line: 113, baseType: !681)
!680 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !680, line: 111, size: 32, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !681, file: !680, line: 112, baseType: !561, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !666, file: !667, line: 660, baseType: !7, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !666, file: !667, line: 661, baseType: !7, size: 32, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !666, file: !667, line: 684, baseType: !100, size: 32, offset: 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !666, file: !667, line: 686, baseType: !100, size: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !666, file: !667, line: 687, baseType: !100, size: 32, offset: 416)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !666, file: !667, line: 688, baseType: !100, size: 32, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !666, file: !667, line: 689, baseType: !7, size: 32, offset: 480)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !666, file: !667, line: 691, baseType: !692, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !667, line: 691, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !666, file: !667, line: 692, baseType: !696, size: 832, offset: 576)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !667, line: 451, size: 832, elements: !697)
!697 = !{!698, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !696, file: !667, line: 453, baseType: !699, size: 128)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !667, line: 325, size: 128, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !699, file: !667, line: 326, baseType: !230, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !699, file: !667, line: 327, baseType: !159, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !696, file: !667, line: 454, baseType: !523, size: 192, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !696, file: !667, line: 455, baseType: !380, size: 128, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !696, file: !667, line: 456, baseType: !7, size: 32, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !696, file: !667, line: 458, baseType: !163, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !696, file: !667, line: 459, baseType: !163, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !696, file: !667, line: 460, baseType: !163, size: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !696, file: !667, line: 461, baseType: !163, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !696, file: !667, line: 463, baseType: !163, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !696, file: !667, line: 465, baseType: !712, offset: 832)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !667, line: 415, elements: !407)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !666, file: !667, line: 693, baseType: !714, size: 384, offset: 1408)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !667, line: 489, size: 384, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !714, file: !667, line: 490, baseType: !380, size: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !714, file: !667, line: 491, baseType: !230, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !714, file: !667, line: 492, baseType: !230, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !714, file: !667, line: 493, baseType: !7, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !714, file: !667, line: 494, baseType: !105, size: 16, offset: 288)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !714, file: !667, line: 495, baseType: !105, size: 16, offset: 304)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !714, file: !667, line: 497, baseType: !723, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !666, file: !667, line: 697, baseType: !725, size: 1792, offset: 1792)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !667, line: 507, size: 1792, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !811, !812}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !725, file: !667, line: 508, baseType: !523, size: 192, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !725, file: !667, line: 515, baseType: !163, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !725, file: !667, line: 516, baseType: !163, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !725, file: !667, line: 517, baseType: !163, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !725, file: !667, line: 518, baseType: !163, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !725, file: !667, line: 519, baseType: !163, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !725, file: !667, line: 526, baseType: !575, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !725, file: !667, line: 527, baseType: !163, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !667, line: 528, baseType: !7, size: 32, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !725, file: !667, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !725, file: !667, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !725, file: !667, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !725, file: !667, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !725, file: !667, line: 563, baseType: !741, size: 512, offset: 704)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !742)
!742 = !{!743, !751, !752, !757, !807, !808, !809, !810}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !741, file: !6, line: 119, baseType: !744, size: 256)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !745, line: 9, size: 256, elements: !746)
!745 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !745, line: 10, baseType: !523, size: 192, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !744, file: !745, line: 11, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !750, line: 29, baseType: !575)
!750 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !741, file: !6, line: 120, baseType: !749, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !741, file: !6, line: 121, baseType: !753, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!5, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !741, file: !6, line: 122, baseType: !758, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !760)
!760 = !{!761, !779, !780, !783, !793, !794, !802, !806}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !759, file: !6, line: 160, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !763, file: !6, line: 215, baseType: !586)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !763, file: !6, line: 216, baseType: !7, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !763, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !763, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !763, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !763, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !763, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !763, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !763, file: !6, line: 233, baseType: !749, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !763, file: !6, line: 234, baseType: !756, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !763, file: !6, line: 235, baseType: !749, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !763, file: !6, line: 236, baseType: !756, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !763, file: !6, line: 237, baseType: !778, size: 4096, offset: 512)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 4096, elements: !113)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !759, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !759, file: !6, line: 162, baseType: !781, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !98, line: 27, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !247, line: 96, baseType: !100)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !759, file: !6, line: 163, baseType: !784, size: 32, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !785, line: 276, baseType: !786)
!785 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !785, line: 276, size: 32, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !786, file: !785, line: 276, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !785, line: 70, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !785, line: 65, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !790, file: !785, line: 66, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !759, file: !6, line: 164, baseType: !756, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !759, file: !6, line: 165, baseType: !795, size: 128, offset: 256)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !745, line: 14, size: 128, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !795, file: !745, line: 15, baseType: !798, size: 128)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !524, line: 125, size: 128, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !798, file: !524, line: 126, baseType: !540, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !798, file: !524, line: 127, baseType: !528, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !759, file: !6, line: 166, baseType: !803, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!749}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !759, file: !6, line: 167, baseType: !749, size: 64, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !741, file: !6, line: 123, baseType: !110, size: 8, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !741, file: !6, line: 124, baseType: !110, size: 8, offset: 456)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !741, file: !6, line: 125, baseType: !110, size: 8, offset: 464)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !741, file: !6, line: 126, baseType: !110, size: 8, offset: 472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !725, file: !667, line: 572, baseType: !741, size: 512, offset: 1216)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !725, file: !667, line: 580, baseType: !813, size: 64, offset: 1728)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !666, file: !667, line: 721, baseType: !7, size: 32, offset: 3584)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !666, file: !667, line: 722, baseType: !100, size: 32, offset: 3616)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !666, file: !667, line: 723, baseType: !817, size: 64, offset: 3648)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !820, line: 17, baseType: !821)
!820 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !820, line: 17, size: 64, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !821, file: !820, line: 17, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 64, elements: !133)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !666, file: !667, line: 724, baseType: !819, size: 64, offset: 3712)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !666, file: !667, line: 749, baseType: !827, offset: 3776)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !667, line: 290, elements: !407)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !666, file: !667, line: 751, baseType: !380, size: 128, offset: 3776)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !666, file: !667, line: 757, baseType: !532, size: 64, offset: 3904)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !666, file: !667, line: 758, baseType: !532, size: 64, offset: 3968)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !666, file: !667, line: 761, baseType: !832, size: 320, offset: 4032)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !616, line: 34, size: 320, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !832, file: !616, line: 35, baseType: !163, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !832, file: !616, line: 36, baseType: !836, size: 256, offset: 64)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 256, elements: !620)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !666, file: !667, line: 766, baseType: !100, size: 32, offset: 4352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !666, file: !667, line: 767, baseType: !100, size: 32, offset: 4384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !666, file: !667, line: 768, baseType: !100, size: 32, offset: 4416)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !666, file: !667, line: 770, baseType: !100, size: 32, offset: 4448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !666, file: !667, line: 772, baseType: !230, size: 64, offset: 4480)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !666, file: !667, line: 775, baseType: !7, size: 32, offset: 4544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !666, file: !667, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !666, file: !667, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !666, file: !667, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !666, file: !667, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !666, file: !667, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !666, file: !667, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !666, file: !667, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !666, file: !667, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !666, file: !667, line: 831, baseType: !230, size: 64, offset: 4672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !666, file: !667, line: 833, baseType: !853, size: 384, offset: 4736)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !854)
!854 = !{!855, !860}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !853, file: !12, line: 26, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!468, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !12, line: 27, baseType: !861, size: 320, offset: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !853, file: !12, line: 27, size: 320, elements: !862)
!862 = !{!863, !873, !900}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !861, file: !12, line: 36, baseType: !864, size: 320)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !861, file: !12, line: 29, size: 320, elements: !865)
!865 = !{!866, !868, !869, !870, !871, !872}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !864, file: !12, line: 30, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !864, file: !12, line: 31, baseType: !159, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !864, file: !12, line: 32, baseType: !159, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !864, file: !12, line: 33, baseType: !159, size: 32, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !864, file: !12, line: 34, baseType: !163, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !864, file: !12, line: 35, baseType: !867, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !861, file: !12, line: 46, baseType: !874, size: 192)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !861, file: !12, line: 38, size: 192, elements: !875)
!875 = !{!876, !877, !878, !899}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !874, file: !12, line: 39, baseType: !781, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, scope: !874, file: !12, line: 41, baseType: !879, size: 64, offset: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !874, file: !12, line: 41, size: 64, elements: !880)
!880 = !{!881, !889}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !879, file: !12, line: 42, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !884, line: 7, size: 128, elements: !885)
!884 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!885 = !{!886, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !883, file: !884, line: 8, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !247, line: 93, baseType: !248)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !883, file: !884, line: 9, baseType: !248, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !879, file: !12, line: 43, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !892, line: 7, size: 64, elements: !893)
!892 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!893 = !{!894, !898}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !891, file: !892, line: 8, baseType: !895, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !892, line: 5, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !102, line: 20, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !104, line: 26, baseType: !100)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !891, file: !892, line: 9, baseType: !896, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !874, file: !12, line: 45, baseType: !163, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !861, file: !12, line: 54, baseType: !901, size: 256)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !861, file: !12, line: 48, size: 256, elements: !902)
!902 = !{!903, !906, !907, !908, !909}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !901, file: !12, line: 49, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !901, file: !12, line: 50, baseType: !100, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !901, file: !12, line: 51, baseType: !100, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !901, file: !12, line: 52, baseType: !230, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !901, file: !12, line: 53, baseType: !230, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !666, file: !667, line: 835, baseType: !911, size: 32, offset: 5120)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !98, line: 22, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !247, line: 28, baseType: !100)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !666, file: !667, line: 836, baseType: !911, size: 32, offset: 5152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !666, file: !667, line: 840, baseType: !230, size: 64, offset: 5184)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !666, file: !667, line: 849, baseType: !665, size: 64, offset: 5248)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !666, file: !667, line: 852, baseType: !665, size: 64, offset: 5312)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !666, file: !667, line: 857, baseType: !380, size: 128, offset: 5376)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !666, file: !667, line: 858, baseType: !380, size: 128, offset: 5504)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !666, file: !667, line: 859, baseType: !665, size: 64, offset: 5632)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !666, file: !667, line: 867, baseType: !380, size: 128, offset: 5696)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !666, file: !667, line: 868, baseType: !380, size: 128, offset: 5824)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !666, file: !667, line: 871, baseType: !923, size: 64, offset: 5952)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !925, line: 59, size: 768, elements: !926)
!925 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!926 = !{!927, !928, !929, !930, !941, !942, !949, !958}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !924, file: !925, line: 61, baseType: !679, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !924, file: !925, line: 62, baseType: !7, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !924, file: !925, line: 63, baseType: !393, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !924, file: !925, line: 65, baseType: !931, size: 256, offset: 64)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, elements: !620)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !98, line: 182, size: 64, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !932, file: !98, line: 183, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !98, line: 186, size: 128, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !98, line: 187, baseType: !935, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !936, file: !98, line: 187, baseType: !940, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !924, file: !925, line: 66, baseType: !932, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !924, file: !925, line: 68, baseType: !943, size: 128, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !944, line: 40, baseType: !945)
!944 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !944, line: 36, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !945, file: !944, line: 37, baseType: !393)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !945, file: !944, line: 38, baseType: !380, size: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !924, file: !925, line: 69, baseType: !950, size: 128, align: 64, offset: 512)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !98, line: 216, size: 128, align: 64, elements: !951)
!951 = !{!952, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !98, line: 217, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !950, file: !98, line: 218, baseType: !955, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !953}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !924, file: !925, line: 70, baseType: !959, size: 128, offset: 640)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 128, elements: !133)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !925, line: 54, size: 128, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !960, file: !925, line: 55, baseType: !100, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !960, file: !925, line: 56, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !925, line: 56, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !666, file: !667, line: 872, baseType: !967, size: 512, offset: 6016)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, elements: !620)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !666, file: !667, line: 873, baseType: !380, size: 128, offset: 6528)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !666, file: !667, line: 874, baseType: !380, size: 128, offset: 6656)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !666, file: !667, line: 876, baseType: !971, size: 64, offset: 6784)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !973, line: 26, size: 192, elements: !974)
!973 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !972, file: !973, line: 27, baseType: !7, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !972, file: !973, line: 28, baseType: !977, size: 128, offset: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !978, line: 43, size: 128, elements: !979)
!978 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !977, file: !978, line: 44, baseType: !586)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !977, file: !978, line: 45, baseType: !380, size: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !666, file: !667, line: 879, baseType: !983, size: 64, offset: 6848)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !666, file: !667, line: 882, baseType: !983, size: 64, offset: 6912)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !666, file: !667, line: 884, baseType: !163, size: 64, offset: 6976)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !666, file: !667, line: 885, baseType: !163, size: 64, offset: 7040)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !666, file: !667, line: 890, baseType: !163, size: 64, offset: 7104)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !666, file: !667, line: 891, baseType: !989, size: 128, offset: 7168)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !667, line: 242, size: 128, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !989, file: !667, line: 244, baseType: !163, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !989, file: !667, line: 245, baseType: !163, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !989, file: !667, line: 246, baseType: !586, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !666, file: !667, line: 900, baseType: !230, size: 64, offset: 7296)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !666, file: !667, line: 901, baseType: !230, size: 64, offset: 7360)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !666, file: !667, line: 904, baseType: !163, size: 64, offset: 7424)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !666, file: !667, line: 907, baseType: !163, size: 64, offset: 7488)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !666, file: !667, line: 910, baseType: !230, size: 64, offset: 7552)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !666, file: !667, line: 911, baseType: !230, size: 64, offset: 7616)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !666, file: !667, line: 914, baseType: !1001, size: 640, offset: 7680)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !1002, line: 123, size: 640, elements: !1003)
!1002 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!1003 = !{!1004, !1010, !1011}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !1001, file: !1002, line: 124, baseType: !1005, size: 576)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 576, elements: !435)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !1002, line: 108, size: 192, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !1006, file: !1002, line: 109, baseType: !163, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !1006, file: !1002, line: 110, baseType: !795, size: 128, offset: 64)
