; ModuleID = '../bcout/drivers/mtd/nand/raw/nand_bbt.llvm.bc'
source_filename = "drivers/mtd/nand/raw/nand_bbt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.nand_bbt_descr = type { i32, [8 x i32], i32, i32, [8 x i8], i32, i32, i32, i8* }
%struct.kmem_cache = type opaque
%struct.nand_chip = type { %struct.nand_device, %struct.nand_id, %struct.nand_parameters, %struct.nand_manufacturer, %struct.nand_chip_ops, %struct.nand_legacy, i32, %struct.nand_interface_config*, %struct.nand_interface_config*, i32, i32, i32, i32, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, %struct.nand_bbt_descr*, i8*, i32, i32, i32, i32, i32, i8*, i8*, %struct.anon.44, i64, %struct.mutex, i8, i32, i32, %struct.nand_controller*, %struct.nand_ecc_ctrl, i8* }
%struct.nand_device = type { %struct.mtd_info, %struct.nand_memory_organization, %struct.nand_ecc, %struct.nand_row_converter, %struct.nand_bbt, %struct.nand_ops* }

!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_algo", file: !51, line: 171, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_UNKNOWN", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !51, line: 90, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_interface_type", file: !74, line: 481, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "./include/linux/mtd/rawnand.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76}
!76 = !DIEnumerator(name: "NAND_SDR_IFACE", value: 0, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_op_instr_type", file: !74, line: 570, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "NAND_OP_CMD_INSTR", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "NAND_OP_ADDR_INSTR", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "NAND_OP_DATA_IN_INSTR", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "NAND_OP_DATA_OUT_INSTR", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "NAND_OP_WAITRDY_INSTR", value: 4, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !85, line: 305, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!86 = !{!87, !88, !89, !90}
!87 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 62, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "MTD_OPS_PLACE_OOB", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "MTD_OPS_AUTO_OOB", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "MTD_OPS_RAW", value: 2, isUnsigned: true)
!97 = !{!98, !99, !101, !102, !106, !107, !111, !115, !119}
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !100, line: 148, baseType: !7)
!100 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !100, line: 46, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !104, line: 88, baseType: !105)
!104 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!105 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !108, line: 23, baseType: !109)
!108 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !110, line: 31, baseType: !106)
!110 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 55, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !104, line: 72, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !104, line: 16, baseType: !114)
!114 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !100, line: 94, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !108, line: 16, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !110, line: 20, baseType: !118)
!118 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !100, line: 102, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !108, line: 17, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !110, line: 21, baseType: !122)
!122 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!123 = !{!0, !124, !129, !148, !150, !152, !154}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "bbt_pattern", scope: !2, file: !3, line: 1286, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 4)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "bbt_mirror_no_oob_descr", scope: !2, file: !3, line: 1319, type: !131, isLocal: true, isDefinition: true)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_bbt_descr", file: !132, line: 41, size: 576, elements: !133)
!132 = !DIFile(filename: "./include/linux/mtd/bbm.h", directory: "/home/lizy2001/genbc/linux")
!133 = !{!134, !135, !139, !140, !141, !143, !144, !145, !146}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !131, file: !132, line: 42, baseType: !98, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !131, file: !132, line: 43, baseType: !136, size: 256, offset: 32)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !131, file: !132, line: 44, baseType: !98, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "veroffs", scope: !131, file: !132, line: 45, baseType: !98, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !131, file: !132, line: 46, baseType: !142, size: 64, offset: 352)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !137)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !132, line: 47, baseType: !98, size: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "maxblocks", scope: !131, file: !132, line: 48, baseType: !98, size: 32, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_block_code", scope: !131, file: !132, line: 49, baseType: !98, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !131, file: !132, line: 50, baseType: !147, size: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "mirror_pattern", scope: !2, file: !3, line: 1287, type: !126, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "bbt_main_descr", scope: !2, file: !3, line: 1289, type: !131, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "bbt_mirror_descr", scope: !2, file: !3, line: 1299, type: !131, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "scan_ff_pattern", scope: !2, file: !3, line: 1283, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 16, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 2)
!159 = !{i32 7, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{i32 1, !"wchar_size", i32 2}
!162 = !{i32 1, !"Code Model", i32 2}
!163 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!164 = distinct !DISubprogram(name: "nand_create_bbt", scope: !3, file: !3, line: 1365, type: !165, scopeLine: 1366, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !415)
!165 = !DISubroutineType(types: !166)
!166 = !{!98, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_chip", file: !74, line: 1096, size: 16704, elements: !169)
!169 = !{!170, !2452, !2458, !2482, !2577, !2647, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2780, !2781, !2782, !2783, !2784, !2785, !2787, !2837}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !168, file: !74, line: 1097, baseType: !171, size: 11200)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !51, line: 319, size: 11200, elements: !172)
!172 = !{!173, !2345, !2357, !2427, !2432, !2436}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !171, file: !51, line: 320, baseType: !174, size: 9664)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !175, line: 235, size: 9664, elements: !176)
!175 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!176 = !{!177, !179, !183, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !199, !200, !216, !237, !238, !239, !240, !249, !259, !268, !272, !277, !283, !284, !299, !300, !310, !311, !312, !313, !314, !315, !326, !330, !334, !335, !336, !340, !341, !342, !343, !347, !348, !349, !350, !351, !354, !366, !373, !374, !375, !379, !2315, !2316, !2324, !2328, !2329, !2330}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !175, line: 236, baseType: !178, size: 8)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !100, line: 79, baseType: !122)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !175, line: 237, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !100, line: 104, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !108, line: 21, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !110, line: 27, baseType: !7)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !175, line: 238, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !100, line: 107, baseType: !107)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !174, file: !175, line: 244, baseType: !180, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !174, file: !175, line: 252, baseType: !180, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !174, file: !175, line: 263, baseType: !180, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !174, file: !175, line: 265, baseType: !180, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !174, file: !175, line: 266, baseType: !180, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !174, file: !175, line: 272, baseType: !7, size: 32, offset: 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !174, file: !175, line: 273, baseType: !7, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !174, file: !175, line: 275, baseType: !7, size: 32, offset: 352)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !174, file: !175, line: 276, baseType: !7, size: 32, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !174, file: !175, line: 285, baseType: !7, size: 32, offset: 416)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !175, line: 288, baseType: !196, size: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !174, file: !175, line: 289, baseType: !98, size: 32, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !174, file: !175, line: 292, baseType: !201, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !175, line: 101, size: 128, elements: !204)
!204 = !{!205, !215}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !203, file: !175, line: 102, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!98, !209, !98, !210}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !175, line: 87, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !211, file: !175, line: 88, baseType: !181, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !211, file: !175, line: 89, baseType: !181, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !203, file: !175, line: 104, baseType: !206, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !174, file: !175, line: 295, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !175, line: 176, size: 192, elements: !220)
!220 = !{!221, !222, !231}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !219, file: !175, line: 177, baseType: !98, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !219, file: !175, line: 178, baseType: !223, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!98, !209, !98, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !175, line: 138, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !227, file: !175, line: 139, baseType: !98, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !227, file: !175, line: 140, baseType: !98, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !219, file: !175, line: 180, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!98, !209, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !174, file: !175, line: 298, baseType: !7, size: 32, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !174, file: !175, line: 301, baseType: !7, size: 32, offset: 736)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !174, file: !175, line: 306, baseType: !98, size: 32, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !174, file: !175, line: 307, baseType: !241, size: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !175, line: 36, size: 192, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !242, file: !175, line: 37, baseType: !184, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !242, file: !175, line: 38, baseType: !180, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !242, file: !175, line: 39, baseType: !180, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !242, file: !175, line: 40, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !174, file: !175, line: 313, baseType: !250, size: 64, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!98, !209, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !175, line: 30, size: 192, elements: !255)
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !254, file: !175, line: 31, baseType: !184, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !175, line: 32, baseType: !184, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !254, file: !175, line: 33, baseType: !184, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !174, file: !175, line: 314, baseType: !260, size: 64, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!98, !209, !102, !111, !263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !100, line: 158, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !100, line: 153, baseType: !107)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !174, file: !175, line: 316, baseType: !269, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!98, !209, !102, !111}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !174, file: !175, line: 317, baseType: !273, size: 64, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!98, !209, !102, !111, !263, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !174, file: !175, line: 319, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!98, !209, !102, !111, !263, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !174, file: !175, line: 321, baseType: !278, size: 64, offset: 1216)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !174, file: !175, line: 323, baseType: !285, size: 64, offset: 1280)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!98, !209, !102, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !175, line: 64, size: 512, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !289, file: !175, line: 65, baseType: !7, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !289, file: !175, line: 66, baseType: !111, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !289, file: !175, line: 67, baseType: !111, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !289, file: !175, line: 68, baseType: !111, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !289, file: !175, line: 69, baseType: !111, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !289, file: !175, line: 70, baseType: !180, size: 32, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !289, file: !175, line: 71, baseType: !147, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !289, file: !175, line: 72, baseType: !147, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !174, file: !175, line: 325, baseType: !285, size: 64, offset: 1344)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !174, file: !175, line: 327, baseType: !301, size: 64, offset: 1408)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!98, !209, !111, !263, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !92, line: 146, size: 96, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !305, file: !92, line: 147, baseType: !182, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !305, file: !92, line: 148, baseType: !182, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !305, file: !92, line: 149, baseType: !182, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !174, file: !175, line: 329, baseType: !273, size: 64, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !174, file: !175, line: 331, baseType: !301, size: 64, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !174, file: !175, line: 333, baseType: !273, size: 64, offset: 1600)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !174, file: !175, line: 335, baseType: !273, size: 64, offset: 1664)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !174, file: !175, line: 337, baseType: !269, size: 64, offset: 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !174, file: !175, line: 339, baseType: !316, size: 64, offset: 1792)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!98, !209, !319, !114, !102, !263}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !322, line: 15, size: 128, elements: !323)
!322 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !321, file: !322, line: 16, baseType: !101, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !321, file: !322, line: 17, baseType: !111, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !174, file: !175, line: 341, baseType: !327, size: 64, offset: 1856)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !209}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !175, line: 342, baseType: !331, size: 64, offset: 1920)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!98, !209, !102, !184}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !174, file: !175, line: 343, baseType: !331, size: 64, offset: 1984)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !174, file: !175, line: 344, baseType: !331, size: 64, offset: 2048)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !174, file: !175, line: 345, baseType: !337, size: 64, offset: 2112)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!98, !209, !102}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !174, file: !175, line: 346, baseType: !337, size: 64, offset: 2176)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !174, file: !175, line: 347, baseType: !337, size: 64, offset: 2240)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !174, file: !175, line: 348, baseType: !269, size: 64, offset: 2304)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !174, file: !175, line: 349, baseType: !344, size: 64, offset: 2368)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!98, !209}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !174, file: !175, line: 350, baseType: !327, size: 64, offset: 2432)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !174, file: !175, line: 351, baseType: !327, size: 64, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !174, file: !175, line: 356, baseType: !344, size: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !174, file: !175, line: 357, baseType: !327, size: 64, offset: 2624)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !174, file: !175, line: 363, baseType: !352, size: 8, offset: 2688)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !100, line: 30, baseType: !353)
!353 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !174, file: !175, line: 365, baseType: !355, size: 192, offset: 2752)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !356, line: 54, size: 192, elements: !357)
!356 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!357 = !{!358, !364, !365}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !355, file: !356, line: 55, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !356, line: 51, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!98, !363, !114, !101}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !356, line: 56, baseType: !363, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !355, file: !356, line: 57, baseType: !98, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !174, file: !175, line: 368, baseType: !367, size: 128, offset: 2944)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !92, line: 250, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !367, file: !92, line: 251, baseType: !182, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !367, file: !92, line: 252, baseType: !182, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !367, file: !92, line: 253, baseType: !182, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !367, file: !92, line: 254, baseType: !182, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !174, file: !175, line: 370, baseType: !98, size: 32, offset: 3072)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !174, file: !175, line: 372, baseType: !101, size: 64, offset: 3136)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !174, file: !175, line: 374, baseType: !376, size: 64, offset: 3200)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !378, line: 76, flags: DIFlagFwdDecl)
!378 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !174, file: !175, line: 375, baseType: !380, size: 5568, offset: 3264)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !381)
!381 = !{!382, !1841, !1843, !1846, !1847, !1898, !1992, !1993, !1994, !1995, !1996, !2005, !2110, !2123, !2126, !2127, !2131, !2133, !2134, !2135, !2139, !2145, !2146, !2149, !2264, !2265, !2268, !2269, !2270, !2271, !2303, !2304, !2305, !2308, !2311, !2312, !2313, !2314}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !380, file: !30, line: 462, baseType: !383, size: 512)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !384, line: 64, size: 512, elements: !385)
!384 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!385 = !{!386, !387, !393, !395, !455, !1678, !1831, !1836, !1837, !1838, !1839, !1840}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 65, baseType: !196, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !383, file: !384, line: 66, baseType: !388, size: 128, offset: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !100, line: 178, size: 128, elements: !389)
!389 = !{!390, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !100, line: 179, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !388, file: !100, line: 179, baseType: !391, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !383, file: !384, line: 67, baseType: !394, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !383, file: !384, line: 68, baseType: !396, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !384, line: 192, size: 704, elements: !398)
!398 = !{!399, !400, !416, !417}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !397, file: !384, line: 193, baseType: !388, size: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !397, file: !384, line: 194, baseType: !401, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !402, line: 83, baseType: !403)
!402 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !402, line: 71, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !402, line: 72, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !402, line: 72, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !406, file: !402, line: 73, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !402, line: 20, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !409, file: !402, line: 21, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !413, line: 25, baseType: !414)
!413 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 25, elements: !415)
!415 = !{}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !397, file: !384, line: 195, baseType: !383, size: 512, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !397, file: !384, line: 196, baseType: !418, size: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !384, line: 156, size: 192, elements: !421)
!421 = !{!422, !427, !432}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !420, file: !384, line: 157, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!98, !396, !394}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !384, line: 158, baseType: !428, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!196, !396, !394}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !420, file: !384, line: 159, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!98, !396, !394, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !384, line: 148, size: 20736, elements: !439)
!439 = !{!440, !445, !449, !450, !454}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !438, file: !384, line: 149, baseType: !441, size: 192)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 192, elements: !443)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!443 = !{!444}
!444 = !DISubrange(count: 3)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !438, file: !384, line: 150, baseType: !446, size: 4096, offset: 192)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 4096, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !438, file: !384, line: 151, baseType: !98, size: 32, offset: 4288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !438, file: !384, line: 152, baseType: !451, size: 16384, offset: 4320)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 16384, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 2048)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !438, file: !384, line: 153, baseType: !98, size: 32, offset: 20704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !383, file: !384, line: 69, baseType: !456, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !384, line: 138, size: 448, elements: !458)
!458 = !{!459, !463, !488, !490, !1625, !1656, !1660}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !457, file: !384, line: 139, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !394}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !457, file: !384, line: 140, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !467, line: 230, size: 128, elements: !468)
!467 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!468 = !{!469, !484}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !466, file: !467, line: 231, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !394, !477, !442}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !100, line: 60, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !104, line: 73, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !104, line: 15, baseType: !476)
!476 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !467, line: 30, size: 128, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !478, file: !467, line: 31, baseType: !196, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !478, file: !467, line: 32, baseType: !482, size: 16, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !100, line: 19, baseType: !483)
!483 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !466, file: !467, line: 232, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!473, !394, !477, !196, !111}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !457, file: !384, line: 141, baseType: !489, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !457, file: !384, line: 142, baseType: !491, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !467, line: 84, size: 320, elements: !495)
!495 = !{!496, !497, !501, !1622, !1623}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !467, line: 85, baseType: !196, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !494, file: !467, line: 86, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!482, !394, !477, !98}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !494, file: !467, line: 88, baseType: !502, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!482, !394, !505, !98}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !467, line: 168, size: 448, elements: !507)
!507 = !{!508, !509, !510, !511, !518, !519}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !506, file: !467, line: 169, baseType: !478, size: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !467, line: 170, baseType: !111, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !506, file: !467, line: 171, baseType: !101, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !506, file: !467, line: 172, baseType: !512, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!473, !515, !394, !505, !442, !102, !111}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !517, line: 526, flags: DIFlagFwdDecl)
!517 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !506, file: !467, line: 174, baseType: !512, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !506, file: !467, line: 176, baseType: !520, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!98, !515, !394, !505, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !525, line: 305, size: 1472, elements: !526)
!525 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!526 = !{!527, !528, !529, !530, !531, !539, !540, !1596, !1602, !1603, !1608, !1609, !1612, !1616, !1617, !1618, !1619, !1620}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !524, file: !525, line: 308, baseType: !114, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !524, file: !525, line: 309, baseType: !114, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !524, file: !525, line: 313, baseType: !523, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !524, file: !525, line: 313, baseType: !523, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !524, file: !525, line: 315, baseType: !532, size: 192, align: 64, offset: 256)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !533, line: 24, size: 192, align: 64, elements: !534)
!533 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!534 = !{!535, !536, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !532, file: !533, line: 25, baseType: !114, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !532, file: !533, line: 26, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !532, file: !533, line: 27, baseType: !537, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !524, file: !525, line: 323, baseType: !114, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !524, file: !525, line: 327, baseType: !541, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !525, line: 388, size: 7296, elements: !543)
!543 = !{!544, !1592}
!544 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !525, line: 389, baseType: !545, size: 7296)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !525, line: 389, size: 7296, elements: !546)
!546 = !{!547, !548, !552, !553, !557, !558, !559, !560, !561, !569, !574, !575, !576, !577, !586, !587, !588, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !623, !629, !632, !664, !665, !1563, !1564, !1567, !1570, !1571, !1574, !1575, !1576, !1579, !1591}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !545, file: !525, line: 390, baseType: !523, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !545, file: !525, line: 391, baseType: !549, size: 64, offset: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !533, line: 31, size: 64, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !549, file: !533, line: 32, baseType: !537, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !545, file: !525, line: 392, baseType: !107, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !545, file: !525, line: 394, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!114, !515, !114, !114, !114, !114}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !545, file: !525, line: 398, baseType: !114, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !545, file: !525, line: 399, baseType: !114, size: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !545, file: !525, line: 405, baseType: !114, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !545, file: !525, line: 406, baseType: !114, size: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !545, file: !525, line: 407, baseType: !562, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !517, line: 286, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 286, size: 64, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !564, file: !517, line: 286, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !568, line: 18, baseType: !114)
!568 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!569 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !545, file: !525, line: 416, baseType: !570, size: 32, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !100, line: 168, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 166, size: 32, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !571, file: !100, line: 167, baseType: !98, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !545, file: !525, line: 428, baseType: !570, size: 32, offset: 608)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !545, file: !525, line: 437, baseType: !570, size: 32, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !545, file: !525, line: 447, baseType: !570, size: 32, offset: 672)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !545, file: !525, line: 450, baseType: !578, size: 64, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !579, line: 13, baseType: !580)
!579 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !100, line: 175, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 173, size: 64, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !581, file: !100, line: 174, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !108, line: 22, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !110, line: 30, baseType: !105)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !545, file: !525, line: 452, baseType: !98, size: 32, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !545, file: !525, line: 454, baseType: !401, offset: 800)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !545, file: !525, line: 457, baseType: !589, size: 256, offset: 832)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !590, line: 35, size: 256, elements: !591)
!590 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!591 = !{!592, !593, !594, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !589, file: !590, line: 36, baseType: !578, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !589, file: !590, line: 42, baseType: !578, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !589, file: !590, line: 46, baseType: !595, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !402, line: 29, baseType: !409)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !589, file: !590, line: 47, baseType: !388, size: 128, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !545, file: !525, line: 459, baseType: !388, size: 128, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !545, file: !525, line: 466, baseType: !114, size: 64, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !545, file: !525, line: 467, baseType: !114, size: 64, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !545, file: !525, line: 469, baseType: !114, size: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !545, file: !525, line: 470, baseType: !114, size: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !545, file: !525, line: 471, baseType: !580, size: 64, offset: 1472)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !545, file: !525, line: 472, baseType: !114, size: 64, offset: 1536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !545, file: !525, line: 473, baseType: !114, size: 64, offset: 1600)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !545, file: !525, line: 474, baseType: !114, size: 64, offset: 1664)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !545, file: !525, line: 475, baseType: !114, size: 64, offset: 1728)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !545, file: !525, line: 477, baseType: !401, offset: 1792)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !545, file: !525, line: 478, baseType: !114, size: 64, offset: 1792)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !545, file: !525, line: 478, baseType: !114, size: 64, offset: 1856)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !545, file: !525, line: 478, baseType: !114, size: 64, offset: 1920)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !545, file: !525, line: 478, baseType: !114, size: 64, offset: 1984)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !545, file: !525, line: 479, baseType: !114, size: 64, offset: 2048)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !545, file: !525, line: 479, baseType: !114, size: 64, offset: 2112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !545, file: !525, line: 479, baseType: !114, size: 64, offset: 2176)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !545, file: !525, line: 480, baseType: !114, size: 64, offset: 2240)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !545, file: !525, line: 480, baseType: !114, size: 64, offset: 2304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !545, file: !525, line: 480, baseType: !114, size: 64, offset: 2368)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !545, file: !525, line: 480, baseType: !114, size: 64, offset: 2432)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !545, file: !525, line: 482, baseType: !620, size: 2816, offset: 2496)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2816, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 44)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !545, file: !525, line: 488, baseType: !624, size: 256, offset: 5312)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !625, line: 60, size: 256, elements: !626)
!625 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !624, file: !625, line: 61, baseType: !628, size: 256)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 256, elements: !127)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !545, file: !525, line: 490, baseType: !630, size: 64, offset: 5568)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !525, line: 490, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !545, file: !525, line: 493, baseType: !633, size: 896, offset: 5632)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !634, line: 53, baseType: !635)
!634 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 13, size: 896, elements: !636)
!636 = !{!637, !638, !639, !640, !643, !644, !651, !652, !656, !657, !660}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !635, file: !634, line: 18, baseType: !107, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !635, file: !634, line: 28, baseType: !580, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !635, file: !634, line: 31, baseType: !589, size: 256, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !635, file: !634, line: 32, baseType: !641, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !634, line: 32, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !635, file: !634, line: 37, baseType: !483, size: 16, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !635, file: !634, line: 40, baseType: !645, size: 192, offset: 512)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !646, line: 53, size: 192, elements: !647)
!646 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !645, file: !646, line: 54, baseType: !578, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !645, file: !646, line: 55, baseType: !401, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !645, file: !646, line: 59, baseType: !388, size: 128, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !635, file: !634, line: 41, baseType: !101, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !635, file: !634, line: 42, baseType: !653, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !634, line: 42, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !635, file: !634, line: 44, baseType: !570, size: 32, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !635, file: !634, line: 50, baseType: !658, size: 16, offset: 864)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !108, line: 19, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !110, line: 24, baseType: !483)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !635, file: !634, line: 51, baseType: !661, size: 16, offset: 880)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !108, line: 18, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !110, line: 23, baseType: !663)
!663 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !525, line: 495, baseType: !114, size: 64, offset: 6528)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !545, file: !525, line: 497, baseType: !666, size: 64, offset: 6592)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !525, line: 381, size: 384, elements: !668)
!668 = !{!669, !670, !1562}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !667, file: !525, line: 382, baseType: !570, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !667, file: !525, line: 383, baseType: !671, size: 128, offset: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !525, line: 376, size: 128, elements: !672)
!672 = !{!673, !1560}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !671, file: !525, line: 377, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !676, line: 640, size: 48640, elements: !677)
!676 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!677 = !{!678, !684, !686, !687, !693, !694, !695, !696, !697, !698, !699, !700, !704, !722, !733, !823, !824, !825, !836, !837, !839, !840, !841, !842, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !921, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !977, !979, !980, !981, !993, !995, !996, !997, !998, !999, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1023, !1028, !1032, !1033, !1034, !1037, !1041, !1044, !1047, !1050, !1053, !1056, !1059, !1062, !1068, !1069, !1070, !1076, !1077, !1078, !1079, !1080, !1089, !1090, !1091, !1092, !1093, !1098, !1099, !1100, !1103, !1104, !1107, !1110, !1113, !1116, !1119, !1122, !1123, !1203, !1206, !1209, !1210, !1213, !1214, !1215, !1219, !1220, !1221, !1234, !1235, !1236, !1246, !1251, !1254, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !675, file: !676, line: 646, baseType: !679, size: 128)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !680, line: 56, size: 128, elements: !681)
!680 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !679, file: !680, line: 57, baseType: !114, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !679, file: !680, line: 58, baseType: !181, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !675, file: !676, line: 649, baseType: !685, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !476)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !675, file: !676, line: 657, baseType: !101, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !675, file: !676, line: 658, baseType: !688, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !689, line: 113, baseType: !690)
!689 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !689, line: 111, size: 32, elements: !691)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !690, file: !689, line: 112, baseType: !570, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !676, line: 660, baseType: !7, size: 32, offset: 288)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !675, file: !676, line: 661, baseType: !7, size: 32, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !675, file: !676, line: 684, baseType: !98, size: 32, offset: 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !675, file: !676, line: 686, baseType: !98, size: 32, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !675, file: !676, line: 687, baseType: !98, size: 32, offset: 416)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !675, file: !676, line: 688, baseType: !98, size: 32, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !675, file: !676, line: 689, baseType: !7, size: 32, offset: 480)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !675, file: !676, line: 691, baseType: !701, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !676, line: 691, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !675, file: !676, line: 692, baseType: !705, size: 832, offset: 576)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !676, line: 451, size: 832, elements: !706)
!706 = !{!707, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !705, file: !676, line: 453, baseType: !708, size: 128)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !676, line: 325, size: 128, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !708, file: !676, line: 326, baseType: !114, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !708, file: !676, line: 327, baseType: !181, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !705, file: !676, line: 454, baseType: !532, size: 192, align: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !705, file: !676, line: 455, baseType: !388, size: 128, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !705, file: !676, line: 456, baseType: !7, size: 32, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !705, file: !676, line: 458, baseType: !107, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !705, file: !676, line: 459, baseType: !107, size: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !705, file: !676, line: 460, baseType: !107, size: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !705, file: !676, line: 461, baseType: !107, size: 64, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !705, file: !676, line: 463, baseType: !107, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !705, file: !676, line: 465, baseType: !721, offset: 832)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !676, line: 415, elements: !415)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !675, file: !676, line: 693, baseType: !723, size: 384, offset: 1408)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !676, line: 489, size: 384, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !723, file: !676, line: 490, baseType: !388, size: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !723, file: !676, line: 491, baseType: !114, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !723, file: !676, line: 492, baseType: !114, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !723, file: !676, line: 493, baseType: !7, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !723, file: !676, line: 494, baseType: !483, size: 16, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !723, file: !676, line: 495, baseType: !483, size: 16, offset: 304)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !723, file: !676, line: 497, baseType: !732, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !675, file: !676, line: 697, baseType: !734, size: 1792, offset: 1792)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !676, line: 507, size: 1792, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !820, !821}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !734, file: !676, line: 508, baseType: !532, size: 192, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !734, file: !676, line: 515, baseType: !107, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !734, file: !676, line: 516, baseType: !107, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !734, file: !676, line: 517, baseType: !107, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !734, file: !676, line: 518, baseType: !107, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !734, file: !676, line: 519, baseType: !107, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !734, file: !676, line: 526, baseType: !584, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !734, file: !676, line: 527, baseType: !107, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !676, line: 528, baseType: !7, size: 32, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !734, file: !676, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !734, file: !676, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !734, file: !676, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !734, file: !676, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !734, file: !676, line: 563, baseType: !750, size: 512, offset: 704)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !751)
!751 = !{!752, !760, !761, !766, !816, !817, !818, !819}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !750, file: !6, line: 119, baseType: !753, size: 256)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !754, line: 9, size: 256, elements: !755)
!754 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !753, file: !754, line: 10, baseType: !532, size: 192, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !753, file: !754, line: 11, baseType: !758, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !759, line: 29, baseType: !584)
!759 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !750, file: !6, line: 120, baseType: !758, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !750, file: !6, line: 121, baseType: !762, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!5, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !750, file: !6, line: 122, baseType: !767, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !769)
!769 = !{!770, !788, !789, !792, !802, !803, !811, !815}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !768, file: !6, line: 160, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !772, file: !6, line: 215, baseType: !595)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !772, file: !6, line: 216, baseType: !7, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !772, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !772, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !772, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !772, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !772, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !772, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !772, file: !6, line: 233, baseType: !758, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !772, file: !6, line: 234, baseType: !765, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !772, file: !6, line: 235, baseType: !758, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !772, file: !6, line: 236, baseType: !765, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !772, file: !6, line: 237, baseType: !787, size: 4096, offset: 512)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 4096, elements: !137)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !768, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !768, file: !6, line: 162, baseType: !790, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !100, line: 27, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !104, line: 96, baseType: !98)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !768, file: !6, line: 163, baseType: !793, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !794, line: 276, baseType: !795)
!794 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !794, line: 276, size: 32, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !795, file: !794, line: 276, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !794, line: 70, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !794, line: 65, size: 32, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !799, file: !794, line: 66, baseType: !7, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !768, file: !6, line: 164, baseType: !765, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !768, file: !6, line: 165, baseType: !804, size: 128, offset: 256)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !754, line: 14, size: 128, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !804, file: !754, line: 15, baseType: !807, size: 128)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !533, line: 125, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !807, file: !533, line: 126, baseType: !549, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !807, file: !533, line: 127, baseType: !537, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !768, file: !6, line: 166, baseType: !812, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!758}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !768, file: !6, line: 167, baseType: !758, size: 64, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !750, file: !6, line: 123, baseType: !120, size: 8, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !750, file: !6, line: 124, baseType: !120, size: 8, offset: 456)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !750, file: !6, line: 125, baseType: !120, size: 8, offset: 464)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !750, file: !6, line: 126, baseType: !120, size: 8, offset: 472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !734, file: !676, line: 572, baseType: !750, size: 512, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !734, file: !676, line: 580, baseType: !822, size: 64, offset: 1728)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !675, file: !676, line: 721, baseType: !7, size: 32, offset: 3584)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !675, file: !676, line: 722, baseType: !98, size: 32, offset: 3616)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !675, file: !676, line: 723, baseType: !826, size: 64, offset: 3648)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !829, line: 17, baseType: !830)
!829 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !829, line: 17, size: 64, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !830, file: !829, line: 17, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 1)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !675, file: !676, line: 724, baseType: !828, size: 64, offset: 3712)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !675, file: !676, line: 749, baseType: !838, offset: 3776)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !676, line: 290, elements: !415)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !675, file: !676, line: 751, baseType: !388, size: 128, offset: 3776)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !675, file: !676, line: 757, baseType: !541, size: 64, offset: 3904)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !675, file: !676, line: 758, baseType: !541, size: 64, offset: 3968)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !675, file: !676, line: 761, baseType: !843, size: 320, offset: 4032)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !625, line: 34, size: 320, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !843, file: !625, line: 35, baseType: !107, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !843, file: !625, line: 36, baseType: !847, size: 256, offset: 64)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 256, elements: !127)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !675, file: !676, line: 766, baseType: !98, size: 32, offset: 4352)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !675, file: !676, line: 767, baseType: !98, size: 32, offset: 4384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !675, file: !676, line: 768, baseType: !98, size: 32, offset: 4416)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !675, file: !676, line: 770, baseType: !98, size: 32, offset: 4448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !675, file: !676, line: 772, baseType: !114, size: 64, offset: 4480)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !675, file: !676, line: 775, baseType: !7, size: 32, offset: 4544)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !675, file: !676, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !675, file: !676, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !675, file: !676, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !675, file: !676, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !675, file: !676, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !675, file: !676, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !675, file: !676, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !675, file: !676, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !675, file: !676, line: 831, baseType: !114, size: 64, offset: 4672)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !675, file: !676, line: 833, baseType: !864, size: 384, offset: 4736)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !865)
!865 = !{!866, !871}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !864, file: !12, line: 26, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!476, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !12, line: 27, baseType: !872, size: 320, offset: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !864, file: !12, line: 27, size: 320, elements: !873)
!873 = !{!874, !884, !911}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !872, file: !12, line: 36, baseType: !875, size: 320)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !12, line: 29, size: 320, elements: !876)
!876 = !{!877, !879, !880, !881, !882, !883}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !875, file: !12, line: 30, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !875, file: !12, line: 31, baseType: !181, size: 32, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !12, line: 32, baseType: !181, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !875, file: !12, line: 33, baseType: !181, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !875, file: !12, line: 34, baseType: !107, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !875, file: !12, line: 35, baseType: !878, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !872, file: !12, line: 46, baseType: !885, size: 192)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !12, line: 38, size: 192, elements: !886)
!886 = !{!887, !888, !889, !910}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !885, file: !12, line: 39, baseType: !790, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !885, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, scope: !885, file: !12, line: 41, baseType: !890, size: 64, offset: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !885, file: !12, line: 41, size: 64, elements: !891)
!891 = !{!892, !900}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !890, file: !12, line: 42, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !895, line: 7, size: 128, elements: !896)
!895 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!896 = !{!897, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !894, file: !895, line: 8, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !104, line: 93, baseType: !105)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !894, file: !895, line: 9, baseType: !105, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !890, file: !12, line: 43, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !903, line: 7, size: 64, elements: !904)
!903 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!904 = !{!905, !909}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !902, file: !903, line: 8, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !903, line: 5, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !108, line: 20, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !110, line: 26, baseType: !98)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !902, file: !903, line: 9, baseType: !907, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !885, file: !12, line: 45, baseType: !107, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !872, file: !12, line: 54, baseType: !912, size: 256)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !12, line: 48, size: 256, elements: !913)
!913 = !{!914, !917, !918, !919, !920}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !912, file: !12, line: 49, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !912, file: !12, line: 50, baseType: !98, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !912, file: !12, line: 51, baseType: !98, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !912, file: !12, line: 52, baseType: !114, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !912, file: !12, line: 53, baseType: !114, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !675, file: !676, line: 835, baseType: !922, size: 32, offset: 5120)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !100, line: 22, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !104, line: 28, baseType: !98)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !675, file: !676, line: 836, baseType: !922, size: 32, offset: 5152)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !675, file: !676, line: 840, baseType: !114, size: 64, offset: 5184)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !675, file: !676, line: 849, baseType: !674, size: 64, offset: 5248)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !675, file: !676, line: 852, baseType: !674, size: 64, offset: 5312)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !675, file: !676, line: 857, baseType: !388, size: 128, offset: 5376)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !675, file: !676, line: 858, baseType: !388, size: 128, offset: 5504)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !675, file: !676, line: 859, baseType: !674, size: 64, offset: 5632)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !675, file: !676, line: 867, baseType: !388, size: 128, offset: 5696)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !675, file: !676, line: 868, baseType: !388, size: 128, offset: 5824)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !675, file: !676, line: 871, baseType: !934, size: 64, offset: 5952)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !936, line: 59, size: 768, elements: !937)
!936 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!937 = !{!938, !939, !940, !941, !952, !953, !960, !969}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !935, file: !936, line: 61, baseType: !688, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !935, file: !936, line: 62, baseType: !7, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !935, file: !936, line: 63, baseType: !401, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !935, file: !936, line: 65, baseType: !942, size: 256, offset: 64)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, elements: !127)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !100, line: 182, size: 64, elements: !944)
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !943, file: !100, line: 183, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !100, line: 186, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !100, line: 187, baseType: !946, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !947, file: !100, line: 187, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !935, file: !936, line: 66, baseType: !943, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !935, file: !936, line: 68, baseType: !954, size: 128, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !955, line: 40, baseType: !956)
!955 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !955, line: 36, size: 128, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !956, file: !955, line: 37, baseType: !401)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !956, file: !955, line: 38, baseType: !388, size: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !935, file: !936, line: 69, baseType: !961, size: 128, align: 64, offset: 512)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !100, line: 216, size: 128, align: 64, elements: !962)
!962 = !{!963, !965}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !961, file: !100, line: 217, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !961, file: !100, line: 218, baseType: !966, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !964}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !935, file: !936, line: 70, baseType: !970, size: 128, offset: 640)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, elements: !834)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !936, line: 54, size: 128, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !971, file: !936, line: 55, baseType: !98, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !971, file: !936, line: 56, baseType: !975, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !936, line: 56, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !675, file: !676, line: 872, baseType: !978, size: 512, offset: 6016)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, elements: !127)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !675, file: !676, line: 873, baseType: !388, size: 128, offset: 6528)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !675, file: !676, line: 874, baseType: !388, size: 128, offset: 6656)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !675, file: !676, line: 876, baseType: !982, size: 64, offset: 6784)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !984, line: 26, size: 192, elements: !985)
!984 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !983, file: !984, line: 27, baseType: !7, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !983, file: !984, line: 28, baseType: !988, size: 128, offset: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !989, line: 43, size: 128, elements: !990)
!989 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !988, file: !989, line: 44, baseType: !595)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !988, file: !989, line: 45, baseType: !388, size: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !675, file: !676, line: 879, baseType: !994, size: 64, offset: 6848)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !675, file: !676, line: 882, baseType: !994, size: 64, offset: 6912)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !675, file: !676, line: 884, baseType: !107, size: 64, offset: 6976)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !675, file: !676, line: 885, baseType: !107, size: 64, offset: 7040)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !675, file: !676, line: 890, baseType: !107, size: 64, offset: 7104)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !675, file: !676, line: 891, baseType: !1000, size: 128, offset: 7168)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !676, line: 242, size: 128, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !1000, file: !676, line: 244, baseType: !107, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !1000, file: !676, line: 245, baseType: !107, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1000, file: !676, line: 246, baseType: !595, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !675, file: !676, line: 900, baseType: !114, size: 64, offset: 7296)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !675, file: !676, line: 901, baseType: !114, size: 64, offset: 7360)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !675, file: !676, line: 904, baseType: !107, size: 64, offset: 7424)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !675, file: !676, line: 907, baseType: !107, size: 64, offset: 7488)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !675, file: !676, line: 910, baseType: !114, size: 64, offset: 7552)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !675, file: !676, line: 911, baseType: !114, size: 64, offset: 7616)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !675, file: !676, line: 914, baseType: !1012, size: 640, offset: 7680)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !1013, line: 123, size: 640, elements: !1014)
!1013 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!1014 = !{!1015, !1021, !1022}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !1012, file: !1013, line: 124, baseType: !1016, size: 576)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 576, elements: !443)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !1013, line: 108, size: 192, elements: !1018)
!1018 = !{!1019, !1020}
