; ModuleID = '../bcout/drivers/rtc/rtc-mc146818-lib.llvm.bc'
source_filename = "drivers/rtc/rtc-mc146818-lib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.acpi_table_fadt = type <{ %struct.acpi_table_header, i32, i32, i8, i8, i16, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i8, i8, i8, i16, i8, i32, %struct.acpi_generic_address, i8, i16, i8, i64, i64, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, i64 }>
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/rtc/rtc-mc146818-lib.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{}
!3 = !{!4, !9}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !5, line: 17, baseType: !6)
!5 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !7, line: 21, baseType: !8)
!7 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !{!"rsp"}
!11 = !{i32 7, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 1, !"wchar_size", i32 2}
!14 = !{i32 1, !"Code Model", i32 2}
!15 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!16 = distinct !DISubprogram(name: "mc146818_get_time", scope: !1, file: !1, line: 25, type: !17, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !20}
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtc_time", file: !22, line: 24, size: 288, elements: !23)
!22 = !DIFile(filename: "./include/uapi/linux/rtc.h", directory: "/home/lizy2001/genbc/linux")
!23 = !{!24, !26, !27, !28, !29, !30, !31, !32, !33}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !21, file: !22, line: 25, baseType: !25, size: 32)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !21, file: !22, line: 26, baseType: !25, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !21, file: !22, line: 27, baseType: !25, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !21, file: !22, line: 28, baseType: !25, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !21, file: !22, line: 29, baseType: !25, size: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !21, file: !22, line: 30, baseType: !25, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !21, file: !22, line: 31, baseType: !25, size: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !21, file: !22, line: 32, baseType: !25, size: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !21, file: !22, line: 33, baseType: !25, size: 32, offset: 256)
!34 = !DILocalVariable(name: "lock", arg: 1, scope: !35, file: !36, line: 407, type: !39)
!35 = distinct !DISubprogram(name: "spin_unlock_irqrestore", scope: !36, file: !36, line: 407, type: !37, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!36 = !DIFile(filename: "./include/linux/spinlock.h", directory: "/home/lizy2001/genbc/linux")
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !9}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !41, line: 83, baseType: !42)
!41 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !41, line: 71, elements: !43)
!43 = !{!44}
!44 = !DIDerivedType(tag: DW_TAG_member, scope: !42, file: !41, line: 72, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !42, file: !41, line: 72, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !45, file: !41, line: 73, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !41, line: 20, elements: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !48, file: !41, line: 21, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !52, line: 25, baseType: !53)
!52 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 25, elements: !2)
!54 = !DILocation(line: 407, column: 64, scope: !35, inlinedAt: !55)
!55 = distinct !DILocation(line: 69, column: 2, scope: !16)
!56 = !DILocalVariable(name: "flags", arg: 2, scope: !35, file: !36, line: 407, type: !9)
!57 = !DILocation(line: 407, column: 84, scope: !35, inlinedAt: !55)
!58 = !DILocalVariable(name: "lock", arg: 1, scope: !59, file: !36, line: 327, type: !39)
!59 = distinct !DISubprogram(name: "spinlock_check", scope: !36, file: !36, line: 327, type: !60, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !39}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !41, line: 29, baseType: !48)
!64 = !DILocation(line: 327, column: 67, scope: !59, inlinedAt: !65)
!65 = distinct !DILocation(line: 53, column: 2, scope: !66)
!66 = distinct !DILexicalBlock(scope: !67, file: !1, line: 53, column: 2)
!67 = distinct !DILexicalBlock(scope: !68, file: !1, line: 53, column: 2)
!68 = distinct !DILexicalBlock(scope: !69, file: !1, line: 53, column: 2)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 53, column: 2)
!70 = distinct !DILexicalBlock(scope: !16, file: !1, line: 53, column: 2)
!71 = !DILocalVariable(name: "time", arg: 1, scope: !16, file: !1, line: 25, type: !20)
!72 = !DILocation(line: 25, column: 49, scope: !16)
!73 = !DILocalVariable(name: "ctrl", scope: !16, file: !1, line: 27, type: !8)
!74 = !DILocation(line: 27, column: 16, scope: !16)
!75 = !DILocalVariable(name: "flags", scope: !16, file: !1, line: 28, type: !9)
!76 = !DILocation(line: 28, column: 16, scope: !16)
!77 = !DILocalVariable(name: "century", scope: !16, file: !1, line: 29, type: !8)
!78 = !DILocation(line: 29, column: 16, scope: !16)
!79 = !DILocation(line: 44, column: 6, scope: !80)
!80 = distinct !DILexicalBlock(scope: !16, file: !1, line: 44, column: 6)
!81 = !DILocation(line: 44, column: 6, scope: !16)
!82 = !DILocalVariable(name: "__ms", scope: !83, file: !1, line: 45, type: !9)
