; ModuleID = '../bcout/drivers/net/phy/phylink.llvm.bc'
source_filename = "drivers/net/phy/phylink.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.lock_class_key = type {}
%struct.kmem_cache = type opaque
%struct.workqueue_struct = type opaque
%struct.sfp_upstream_ops = type { void (i8*, %struct.sfp_bus*)*, void (i8*, %struct.sfp_bus*)*, i32 (i8*, %struct.sfp_eeprom_id*)*, void (i8*)*, i32 (i8*)*, void (i8*)*, void (i8*)*, void (i8*)*, i32 (i8*, %struct.phy_device*)*, void (i8*)* }
%struct.sfp_bus = type opaque
%struct.sfp_eeprom_id = type { %struct.sfp_eeprom_base, %struct.sfp_eeprom_ext }
%struct.sfp_eeprom_base = type <{ i8, i8, i8, i64, i8, i8, i8, [6 x i8], [16 x i8], i8, [3 x i8], [16 x i8], [4 x i8], %union.anon.128, i8, i8 }>
%union.anon.128 = type { i16 }
%struct.sfp_eeprom_ext = type { i16, i8, i8, [16 x i8], [8 x i8], i8, i8, i8, i8 }
%struct.phy_device = type { %struct.mdio_device, %struct.phy_driver*, i32, %struct.phy_c45_device_ids, i16, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, [2 x i64], [2 x i64], [2 x i64], [2 x i64], i32, i32, i8*, %struct.phy_package_shared*, %struct.sk_buff*, i8*, %struct.nlattr*, %struct.delayed_work, %struct.mutex, i8, %struct.sfp_bus*, %struct.phylink*, %struct.net_device*, %struct.mii_timestamper*, i8, i8, void (%struct.phy_device*, i1)*, void (%struct.net_device*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__key", scope: !2, file: !3, line: 811, type: !1367, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "phylink_create", scope: !3, file: !3, line: 799, type: !4, scopeLine: 803, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7536, retainedNodes: !1369)
!3 = !DIFile(filename: "drivers/net/phy/phylink.c", directory: "/home/lizy2001/genbc/linux")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7431, !6885, !7304, !7422}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phylink", file: !3, line: 40, size: 3072, elements: !8)
!8 = !{!9, !7421, !7482, !7508, !7509, !7510, !7511, !7512, !7513, !7514, !7515, !7516, !7517, !7518, !7519, !7520, !7521, !7522, !7523, !7524, !7528, !7529, !7530, !7531, !7532, !7533, !7534, !7535}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "netdev", scope: !7, file: !3, line: 42, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !12, line: 1858, size: 15808, elements: !13)
!12 = !DIFile(filename: "./include/linux/netdevice.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !19, !41, !58, !60, !61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !76, !84, !85, !86, !87, !88, !89, !90, !91, !92, !118, !128, !129, !130, !135, !136, !140, !143, !5466, !6031, !6035, !6075, !6076, !6077, !6078, !6079, !6080, !6081, !6082, !6083, !6084, !6085, !6086, !6087, !6088, !6089, !6090, !6091, !6092, !6093, !6094, !6095, !6096, !6097, !6098, !6099, !6100, !6101, !6106, !6107, !6108, !6390, !6391, !6392, !6393, !6396, !6399, !6402, !6405, !6408, !6409, !6422, !6423, !6424, !6425, !6426, !6427, !6440, !6441, !6475, !6476, !6477, !6478, !6479, !6480, !6481, !6482, !6483, !6486, !6487, !6488, !6489, !6490, !6491, !6492, !6501, !6502, !6507, !6508, !6509, !6514, !6551, !7035, !7037, !7038, !7042, !7043, !7044, !7045, !7051, !7053, !7399, !7400, !7402, !7403, !7404, !7405, !7406, !7410, !7413}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !12, line: 1859, baseType: !15, size: 128)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18}
!18 = !DISubrange(count: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !11, file: !12, line: 1860, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !12, line: 938, size: 384, elements: !22)
!22 = !{!23, !31, !37, !38}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !21, file: !12, line: 939, baseType: !24, size: 128)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !25, line: 186, size: 128, elements: !26)
!25 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !25, line: 187, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !24, file: !25, line: 187, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !21, file: !12, line: 940, baseType: !32, size: 128, offset: 128)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !25, line: 178, size: 128, elements: !33)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !32, file: !25, line: 179, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !32, file: !25, line: 179, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !21, file: !12, line: 941, baseType: !10, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !12, line: 942, baseType: !39, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !11, file: !12, line: 1861, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !12, line: 930, size: 128, elements: !44)
!44 = !{!45, !54}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !43, file: !12, line: 931, baseType: !46, size: 128, align: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !25, line: 216, size: 128, align: 64, elements: !47)
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !25, line: 217, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !46, file: !25, line: 218, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !49}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !43, file: !12, line: 932, baseType: !55, offset: 128)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: -1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !11, file: !12, line: 1866, baseType: !59, size: 64, offset: 256)
!59 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !11, file: !12, line: 1867, baseType: !59, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !11, file: !12, line: 1868, baseType: !59, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !11, file: !12, line: 1869, baseType: !63, size: 32, offset: 448)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !12, line: 1877, baseType: !59, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !11, file: !12, line: 1879, baseType: !32, size: 128, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !11, file: !12, line: 1880, baseType: !32, size: 128, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !11, file: !12, line: 1881, baseType: !32, size: 128, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !11, file: !12, line: 1882, baseType: !32, size: 128, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !11, file: !12, line: 1883, baseType: !32, size: 128, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !11, file: !12, line: 1884, baseType: !32, size: 128, offset: 1216)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !11, file: !12, line: 1889, baseType: !72, size: 256, offset: 1344)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !12, line: 1886, size: 256, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !72, file: !12, line: 1887, baseType: !32, size: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !72, file: !12, line: 1888, baseType: !32, size: 128, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !11, file: !12, line: 1891, baseType: !77, size: 64, offset: 1600)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !78, line: 12, baseType: !79)
!78 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !80, line: 23, baseType: !81)
!80 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !82, line: 31, baseType: !83)
!82 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!83 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !11, file: !12, line: 1892, baseType: !77, size: 64, offset: 1664)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !11, file: !12, line: 1893, baseType: !77, size: 64, offset: 1728)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !11, file: !12, line: 1894, baseType: !77, size: 64, offset: 1792)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !11, file: !12, line: 1895, baseType: !77, size: 64, offset: 1856)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !11, file: !12, line: 1896, baseType: !77, size: 64, offset: 1920)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !11, file: !12, line: 1897, baseType: !77, size: 64, offset: 1984)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !11, file: !12, line: 1899, baseType: !63, size: 32, offset: 2048)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !11, file: !12, line: 1900, baseType: !63, size: 32, offset: 2080)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !11, file: !12, line: 1902, baseType: !93, size: 1472, offset: 2112)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !12, line: 169, size: 1472, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !93, file: !12, line: 170, baseType: !59, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !93, file: !12, line: 171, baseType: !59, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !93, file: !12, line: 172, baseType: !59, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !93, file: !12, line: 173, baseType: !59, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !93, file: !12, line: 174, baseType: !59, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !93, file: !12, line: 175, baseType: !59, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !93, file: !12, line: 176, baseType: !59, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !93, file: !12, line: 177, baseType: !59, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !93, file: !12, line: 178, baseType: !59, size: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !93, file: !12, line: 179, baseType: !59, size: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !93, file: !12, line: 180, baseType: !59, size: 64, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !93, file: !12, line: 181, baseType: !59, size: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !93, file: !12, line: 182, baseType: !59, size: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !93, file: !12, line: 183, baseType: !59, size: 64, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !93, file: !12, line: 184, baseType: !59, size: 64, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !93, file: !12, line: 185, baseType: !59, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !93, file: !12, line: 186, baseType: !59, size: 64, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !93, file: !12, line: 187, baseType: !59, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !93, file: !12, line: 188, baseType: !59, size: 64, offset: 1152)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !93, file: !12, line: 189, baseType: !59, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !93, file: !12, line: 190, baseType: !59, size: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !93, file: !12, line: 191, baseType: !59, size: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !93, file: !12, line: 192, baseType: !59, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !11, file: !12, line: 1904, baseType: !119, size: 64, offset: 3584)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !120, line: 13, baseType: !121)
!120 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !25, line: 175, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 173, size: 64, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !122, file: !25, line: 174, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !80, line: 22, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !82, line: 30, baseType: !127)
!127 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !11, file: !12, line: 1905, baseType: !119, size: 64, offset: 3648)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !11, file: !12, line: 1906, baseType: !119, size: 64, offset: 3712)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !11, file: !12, line: 1909, baseType: !131, size: 32, offset: 3776)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !25, line: 168, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 166, size: 32, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !132, file: !25, line: 167, baseType: !63, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !11, file: !12, line: 1910, baseType: !131, size: 32, offset: 3808)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !11, file: !12, line: 1913, baseType: !137, size: 64, offset: 3840)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !12, line: 1913, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !11, file: !12, line: 1914, baseType: !141, size: 64, offset: 3904)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !12, line: 1914, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !11, file: !12, line: 1916, baseType: !144, size: 64, offset: 3968)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !12, line: 1283, size: 4416, elements: !147)
!147 = !{!148, !152, !156, !157, !158, !327, !331, !336, !340, !341, !346, !347, !470, !475, !479, !485, !489, !521, !529, !533, !538, !542, !543, !549, !553, !557, !561, !562, !584, !588, !603, !614, !618, !627, !631, !632, !656, !677, !681, !685, !689, !693, !700, !704, !722, !726, !776, !780, !785, !789, !793, !797, !807, !808, !817, !823, !824, !828, !832, !836, !840, !841, !845, !846, !5426, !5446, !5450, !5456, !5462}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !146, file: !12, line: 1284, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!63, !10}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !146, file: !12, line: 1285, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !10}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !146, file: !12, line: 1286, baseType: !149, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !146, file: !12, line: 1287, baseType: !149, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !146, file: !12, line: 1288, baseType: !159, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !168, !10}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !12, line: 120, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "netdev_tx", file: !12, line: 115, baseType: !63, size: 32, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIEnumerator(name: "__NETDEV_TX_MIN", value: -2147483648)
!166 = !DIEnumerator(name: "NETDEV_TX_OK", value: 0)
!167 = !DIEnumerator(name: "NETDEV_TX_BUSY", value: 16)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !170, line: 713, size: 1600, elements: !171)
!170 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!171 = !{!172, !194, !202, !209, !213, !225, !227, !228, !231, !232, !233, !239, !240, !241, !242, !243, !244, !245, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !285, !286, !287, !288, !290, !291, !296, !301, !306, !307, !308, !309, !310, !311, !312, !313, !314, !316, !317, !319, !320, !321}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 714, baseType: !173, size: 192)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 714, size: 192, elements: !174)
!174 = !{!175, !185, !193}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !170, line: 715, baseType: !176, size: 192)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !170, line: 715, size: 192, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !170, line: 717, baseType: !168, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !170, line: 718, baseType: !168, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !176, file: !170, line: 720, baseType: !181, size: 64, offset: 128)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !170, line: 720, size: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !181, file: !170, line: 721, baseType: !10, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !181, file: !170, line: 726, baseType: !59, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !173, file: !170, line: 729, baseType: !186, size: 192, align: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !187, line: 24, size: 192, align: 64, elements: !188)
!187 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!188 = !{!189, !190, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !186, file: !187, line: 25, baseType: !59, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !186, file: !187, line: 26, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !186, file: !187, line: 27, baseType: !191, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !173, file: !170, line: 730, baseType: !32, size: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 733, baseType: !195, size: 64, offset: 192)
!195 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 733, size: 64, elements: !196)
!196 = !{!197, !201}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !195, file: !170, line: 734, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !200, line: 124, flags: DIFlagFwdDecl)
!200 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !195, file: !170, line: 735, baseType: !63, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 738, baseType: !203, size: 64, offset: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 738, size: 64, elements: !204)
!204 = !{!205, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !203, file: !170, line: 739, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !207, line: 29, baseType: !125)
!207 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !203, file: !170, line: 740, baseType: !79, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !169, file: !170, line: 748, baseType: !210, size: 384, align: 64, offset: 320)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 384, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 48)
!213 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 750, baseType: !214, size: 128, offset: 704)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 750, size: 128, elements: !215)
!215 = !{!216, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !170, line: 751, baseType: !217, size: 128)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !170, line: 751, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !217, file: !170, line: 752, baseType: !59, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !217, file: !170, line: 753, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !168}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !214, file: !170, line: 755, baseType: !32, size: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !170, line: 761, baseType: !226, size: 32, offset: 832)
!226 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !169, file: !170, line: 762, baseType: !226, size: 32, offset: 864)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !169, file: !170, line: 763, baseType: !229, size: 16, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !82, line: 24, baseType: !230)
!230 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !169, file: !170, line: 764, baseType: !229, size: 16, offset: 912)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !169, file: !170, line: 769, baseType: !229, size: 16, offset: 928)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !169, file: !170, line: 780, baseType: !234, offset: 944)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, elements: !237)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !82, line: 21, baseType: !236)
!236 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!237 = !{!238}
!238 = !DISubrange(count: 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !169, file: !170, line: 782, baseType: !235, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !169, file: !170, line: 783, baseType: !235, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !169, file: !170, line: 784, baseType: !235, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !169, file: !170, line: 785, baseType: !235, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !169, file: !170, line: 786, baseType: !235, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !169, file: !170, line: 787, baseType: !235, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !169, file: !170, line: 795, baseType: !246, offset: 960)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, elements: !237)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !82, line: 27, baseType: !226)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !169, file: !170, line: 807, baseType: !234, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !169, file: !170, line: 809, baseType: !235, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !169, file: !170, line: 810, baseType: !235, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !169, file: !170, line: 811, baseType: !235, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !169, file: !170, line: 812, baseType: !235, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !169, file: !170, line: 813, baseType: !235, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !169, file: !170, line: 815, baseType: !235, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !169, file: !170, line: 816, baseType: !235, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !169, file: !170, line: 817, baseType: !235, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !169, file: !170, line: 818, baseType: !235, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !169, file: !170, line: 819, baseType: !235, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !169, file: !170, line: 821, baseType: !235, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !169, file: !170, line: 822, baseType: !235, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !169, file: !170, line: 823, baseType: !235, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !169, file: !170, line: 832, baseType: !234, offset: 976)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !169, file: !170, line: 834, baseType: !235, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !169, file: !170, line: 835, baseType: !235, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !169, file: !170, line: 836, baseType: !235, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !169, file: !170, line: 837, baseType: !235, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !169, file: !170, line: 838, baseType: !235, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !169, file: !170, line: 840, baseType: !235, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !169, file: !170, line: 843, baseType: !235, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !169, file: !170, line: 844, baseType: !235, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !169, file: !170, line: 845, baseType: !235, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !169, file: !170, line: 847, baseType: !235, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !169, file: !170, line: 848, baseType: !235, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!274 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 866, baseType: !275, size: 32, offset: 992)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 866, size: 32, elements: !276)
!276 = !{!277, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !275, file: !170, line: 867, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !279, line: 37, baseType: !247)
!279 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !170, line: 868, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !170, line: 868, size: 32, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !281, file: !170, line: 869, baseType: !229, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !281, file: !170, line: 870, baseType: !229, size: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !169, file: !170, line: 873, baseType: !247, size: 32, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !169, file: !170, line: 874, baseType: !63, size: 32, offset: 1056)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !169, file: !170, line: 875, baseType: !247, size: 32, offset: 1088)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !169, file: !170, line: 876, baseType: !289, size: 16, offset: 1120)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !279, line: 30, baseType: !229)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !169, file: !170, line: 877, baseType: !229, size: 16, offset: 1136)
!291 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 879, baseType: !292, size: 32, offset: 1152)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 879, size: 32, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !292, file: !170, line: 880, baseType: !226, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !292, file: !170, line: 881, baseType: !226, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 888, baseType: !297, size: 32, offset: 1184)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 888, size: 32, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !297, file: !170, line: 889, baseType: !247, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !297, file: !170, line: 890, baseType: !247, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !170, line: 893, baseType: !302, size: 16, offset: 1216)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 893, size: 16, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !302, file: !170, line: 894, baseType: !289, size: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !302, file: !170, line: 895, baseType: !235, size: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !169, file: !170, line: 898, baseType: !229, size: 16, offset: 1232)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !169, file: !170, line: 899, baseType: !229, size: 16, offset: 1248)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !169, file: !170, line: 900, baseType: !229, size: 16, offset: 1264)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !169, file: !170, line: 902, baseType: !289, size: 16, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !169, file: !170, line: 903, baseType: !229, size: 16, offset: 1296)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !169, file: !170, line: 904, baseType: !229, size: 16, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !169, file: !170, line: 905, baseType: !229, size: 16, offset: 1328)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !169, file: !170, line: 908, baseType: !246, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !169, file: !170, line: 912, baseType: !315, size: 32, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !170, line: 606, baseType: !226)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !169, file: !170, line: 913, baseType: !315, size: 32, offset: 1376)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !169, file: !170, line: 914, baseType: !318, size: 64, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !170, line: 915, baseType: !318, size: 64, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !169, file: !170, line: 916, baseType: !226, size: 32, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !169, file: !170, line: 917, baseType: !322, size: 32, offset: 1568)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !323, line: 113, baseType: !324)
!323 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !323, line: 111, size: 32, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !324, file: !323, line: 112, baseType: !131, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !146, file: !12, line: 1290, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!77, !168, !10, !77}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !146, file: !12, line: 1293, baseType: !332, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !10, !168, !10}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !80, line: 19, baseType: !229)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !146, file: !12, line: 1296, baseType: !337, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !10, !63}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !146, file: !12, line: 1298, baseType: !153, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !146, file: !12, line: 1299, baseType: !342, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!63, !10, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !146, file: !12, line: 1301, baseType: !149, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !146, file: !12, line: 1302, baseType: !348, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!63, !10, !351, !63}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !353, line: 234, size: 320, elements: !354)
!353 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!354 = !{!355, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !352, file: !353, line: 239, baseType: !356, size: 128)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !353, line: 236, size: 128, elements: !357)
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !356, file: !353, line: 238, baseType: !15, size: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !352, file: !353, line: 255, baseType: !360, size: 192, offset: 128)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !353, line: 241, size: 192, elements: !361)
!361 = !{!362, !374, !375, !376, !377, !378, !380, !381, !382, !391, !392, !393, !394}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !360, file: !353, line: 242, baseType: !363, size: 128)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !364, line: 32, size: 128, elements: !365)
!364 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!365 = !{!366, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !363, file: !364, line: 33, baseType: !367, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !364, line: 26, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !369, line: 10, baseType: !230)
!369 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !363, file: !364, line: 34, baseType: !371, size: 112, offset: 16)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 112, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 14)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !360, file: !353, line: 243, baseType: !363, size: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !360, file: !353, line: 244, baseType: !363, size: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !360, file: !353, line: 245, baseType: !363, size: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !360, file: !353, line: 246, baseType: !363, size: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !360, file: !353, line: 247, baseType: !379, size: 16)
!379 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !360, file: !353, line: 248, baseType: !63, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !360, file: !353, line: 249, baseType: !63, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !360, file: !353, line: 250, baseType: !383, size: 192)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !353, line: 196, size: 192, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !383, file: !353, line: 197, baseType: !59, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !383, file: !353, line: 198, baseType: !59, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !383, file: !353, line: 199, baseType: !230, size: 16, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !383, file: !353, line: 200, baseType: !236, size: 8, offset: 144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !383, file: !353, line: 201, baseType: !236, size: 8, offset: 152)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !383, file: !353, line: 202, baseType: !236, size: 8, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !360, file: !353, line: 251, baseType: !15, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !360, file: !353, line: 252, baseType: !15, size: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !360, file: !353, line: 253, baseType: !345, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !360, file: !353, line: 254, baseType: !395, size: 128)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !353, line: 207, size: 128, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !353, line: 208, baseType: !226, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !395, file: !353, line: 209, baseType: !226, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !395, file: !353, line: 222, baseType: !400, size: 64, offset: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !353, line: 210, size: 64, elements: !401)
!401 = !{!402, !410, !417, !429, !435, !442, !453, !461}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !400, file: !353, line: 212, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !405, line: 56, baseType: !406)
!405 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 53, size: 32, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !406, file: !405, line: 54, baseType: !230, size: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !406, file: !405, line: 55, baseType: !230, size: 16, offset: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !400, file: !353, line: 213, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !405, line: 80, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 77, size: 64, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !413, file: !405, line: 78, baseType: !226, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !413, file: !405, line: 79, baseType: !226, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !400, file: !353, line: 214, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !405, line: 66, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 58, size: 192, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !420, file: !405, line: 59, baseType: !226, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !420, file: !405, line: 60, baseType: !226, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !420, file: !405, line: 61, baseType: !226, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !420, file: !405, line: 62, baseType: !226, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !420, file: !405, line: 63, baseType: !226, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !420, file: !405, line: 64, baseType: !230, size: 16, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !420, file: !405, line: 65, baseType: !230, size: 16, offset: 176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !400, file: !353, line: 215, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !405, line: 70, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 68, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !432, file: !405, line: 69, baseType: !226, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !400, file: !353, line: 216, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !405, line: 75, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 72, size: 160, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !438, file: !405, line: 73, baseType: !226, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !438, file: !405, line: 74, baseType: !15, size: 128, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !400, file: !353, line: 217, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !405, line: 89, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 82, size: 192, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !445, file: !405, line: 83, baseType: !230, size: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !445, file: !405, line: 84, baseType: !226, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !445, file: !405, line: 85, baseType: !226, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !445, file: !405, line: 86, baseType: !226, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !445, file: !405, line: 87, baseType: !226, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !445, file: !405, line: 88, baseType: !226, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !400, file: !353, line: 220, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !405, line: 44, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 40, size: 96, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !456, file: !405, line: 41, baseType: !226, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !456, file: !405, line: 42, baseType: !226, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !456, file: !405, line: 43, baseType: !230, size: 16, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !400, file: !353, line: 221, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !405, line: 51, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 46, size: 128, elements: !465)
!465 = !{!466, !467, !468, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !464, file: !405, line: 47, baseType: !226, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !464, file: !405, line: 48, baseType: !226, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !464, file: !405, line: 49, baseType: !230, size: 16, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !464, file: !405, line: 50, baseType: !226, size: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !146, file: !12, line: 1304, baseType: !471, size: 64, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!63, !10, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !146, file: !12, line: 1306, baseType: !476, size: 64, offset: 832)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!63, !10, !63}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !146, file: !12, line: 1308, baseType: !480, size: 64, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!63, !10, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !12, line: 206, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !146, file: !12, line: 1310, baseType: !486, size: 64, offset: 960)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !10, !226}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !146, file: !12, line: 1313, baseType: !490, size: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !10, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !495, line: 214, size: 1536, elements: !496)
!495 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !494, file: !495, line: 215, baseType: !81, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !494, file: !495, line: 216, baseType: !81, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !494, file: !495, line: 217, baseType: !81, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !494, file: !495, line: 218, baseType: !81, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !494, file: !495, line: 219, baseType: !81, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !494, file: !495, line: 220, baseType: !81, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !494, file: !495, line: 221, baseType: !81, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !494, file: !495, line: 222, baseType: !81, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !494, file: !495, line: 223, baseType: !81, size: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !494, file: !495, line: 224, baseType: !81, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !494, file: !495, line: 227, baseType: !81, size: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !494, file: !495, line: 228, baseType: !81, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !494, file: !495, line: 229, baseType: !81, size: 64, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !494, file: !495, line: 230, baseType: !81, size: 64, offset: 832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !494, file: !495, line: 231, baseType: !81, size: 64, offset: 896)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !494, file: !495, line: 232, baseType: !81, size: 64, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !494, file: !495, line: 235, baseType: !81, size: 64, offset: 1024)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !494, file: !495, line: 236, baseType: !81, size: 64, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !494, file: !495, line: 237, baseType: !81, size: 64, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !494, file: !495, line: 238, baseType: !81, size: 64, offset: 1216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !494, file: !495, line: 239, baseType: !81, size: 64, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !494, file: !495, line: 242, baseType: !81, size: 64, offset: 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !494, file: !495, line: 243, baseType: !81, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !494, file: !495, line: 244, baseType: !81, size: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !146, file: !12, line: 1315, baseType: !522, size: 64, offset: 1088)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !527, !63}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !25, line: 30, baseType: !526)
!526 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !146, file: !12, line: 1316, baseType: !530, size: 64, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!63, !63, !527, !345}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !146, file: !12, line: 1319, baseType: !534, size: 64, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !10}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !146, file: !12, line: 1321, baseType: !539, size: 64, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!63, !10, !289, !335}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !146, file: !12, line: 1323, baseType: !539, size: 64, offset: 1344)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !146, file: !12, line: 1331, baseType: !544, size: 64, offset: 1408)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!63, !10, !63, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !80, line: 17, baseType: !235)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !146, file: !12, line: 1333, baseType: !550, size: 64, offset: 1472)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!63, !10, !63, !335, !548, !289}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !146, file: !12, line: 1336, baseType: !554, size: 64, offset: 1536)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!63, !10, !63, !63, !63}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !146, file: !12, line: 1339, baseType: !558, size: 64, offset: 1600)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!63, !10, !63, !525}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !146, file: !12, line: 1341, baseType: !558, size: 64, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !146, file: !12, line: 1343, baseType: !563, size: 64, offset: 1728)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!63, !10, !63, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !568, line: 20, size: 576, elements: !569)
!568 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!569 = !{!570, !571, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !567, file: !568, line: 21, baseType: !247, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !567, file: !568, line: 22, baseType: !572, size: 256, offset: 32)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 256, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !567, file: !568, line: 23, baseType: !247, size: 32, offset: 288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !567, file: !568, line: 24, baseType: !247, size: 32, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !567, file: !568, line: 25, baseType: !247, size: 32, offset: 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !567, file: !568, line: 26, baseType: !247, size: 32, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !567, file: !568, line: 27, baseType: !247, size: 32, offset: 416)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !567, file: !568, line: 28, baseType: !247, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !567, file: !568, line: 29, baseType: !247, size: 32, offset: 480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !567, file: !568, line: 30, baseType: !247, size: 32, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !567, file: !568, line: 31, baseType: !289, size: 16, offset: 544)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !146, file: !12, line: 1346, baseType: !585, size: 64, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!63, !10, !63, !63}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !146, file: !12, line: 1348, baseType: !589, size: 64, offset: 1856)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!63, !10, !63, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !568, line: 9, size: 512, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !593, file: !568, line: 10, baseType: !81, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !593, file: !568, line: 11, baseType: !81, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !593, file: !568, line: 12, baseType: !81, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !593, file: !568, line: 13, baseType: !81, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !593, file: !568, line: 14, baseType: !81, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !593, file: !568, line: 15, baseType: !81, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !593, file: !568, line: 16, baseType: !81, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !593, file: !568, line: 17, baseType: !81, size: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !146, file: !12, line: 1352, baseType: !604, size: 64, offset: 1920)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!63, !10, !63, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !610, line: 213, size: 32, elements: !611)
!610 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !609, file: !610, line: 214, baseType: !229, size: 16)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !609, file: !610, line: 215, baseType: !229, size: 16, offset: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !146, file: !12, line: 1355, baseType: !615, size: 64, offset: 1984)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!63, !10, !63, !168}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !146, file: !12, line: 1357, baseType: !619, size: 64, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!63, !10, !63, !622, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !495, line: 956, size: 128, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !623, file: !495, line: 957, baseType: !247, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !623, file: !495, line: 958, baseType: !81, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !146, file: !12, line: 1361, baseType: !628, size: 64, offset: 2112)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!63, !10, !63, !79, !63}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !146, file: !12, line: 1364, baseType: !558, size: 64, offset: 2176)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !146, file: !12, line: 1367, baseType: !633, size: 64, offset: 2240)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!63, !10, !636, !345}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tc_setup_type", file: !12, line: 836, baseType: !226, size: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!638 = !DIEnumerator(name: "TC_SETUP_QDISC_MQPRIO", value: 0, isUnsigned: true)
!639 = !DIEnumerator(name: "TC_SETUP_CLSU32", value: 1, isUnsigned: true)
!640 = !DIEnumerator(name: "TC_SETUP_CLSFLOWER", value: 2, isUnsigned: true)
!641 = !DIEnumerator(name: "TC_SETUP_CLSMATCHALL", value: 3, isUnsigned: true)
!642 = !DIEnumerator(name: "TC_SETUP_CLSBPF", value: 4, isUnsigned: true)
!643 = !DIEnumerator(name: "TC_SETUP_BLOCK", value: 5, isUnsigned: true)
!644 = !DIEnumerator(name: "TC_SETUP_QDISC_CBS", value: 6, isUnsigned: true)
!645 = !DIEnumerator(name: "TC_SETUP_QDISC_RED", value: 7, isUnsigned: true)
!646 = !DIEnumerator(name: "TC_SETUP_QDISC_PRIO", value: 8, isUnsigned: true)
!647 = !DIEnumerator(name: "TC_SETUP_QDISC_MQ", value: 9, isUnsigned: true)
!648 = !DIEnumerator(name: "TC_SETUP_QDISC_ETF", value: 10, isUnsigned: true)
!649 = !DIEnumerator(name: "TC_SETUP_ROOT_QDISC", value: 11, isUnsigned: true)
!650 = !DIEnumerator(name: "TC_SETUP_QDISC_GRED", value: 12, isUnsigned: true)
!651 = !DIEnumerator(name: "TC_SETUP_QDISC_TAPRIO", value: 13, isUnsigned: true)
!652 = !DIEnumerator(name: "TC_SETUP_FT", value: 14, isUnsigned: true)
!653 = !DIEnumerator(name: "TC_SETUP_QDISC_ETS", value: 15, isUnsigned: true)
!654 = !DIEnumerator(name: "TC_SETUP_QDISC_TBF", value: 16, isUnsigned: true)
!655 = !DIEnumerator(name: "TC_SETUP_QDISC_FIFO", value: 17, isUnsigned: true)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !146, file: !12, line: 1400, baseType: !657, size: 64, offset: 2304)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!63, !10, !10, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !662, line: 75, size: 384, elements: !663)
!662 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!663 = !{!664, !665, !668, !672, !676}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !661, file: !662, line: 76, baseType: !39, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !661, file: !662, line: 77, baseType: !666, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !661, file: !662, line: 78, baseType: !669, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !662, line: 78, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !661, file: !662, line: 79, baseType: !673, size: 160, offset: 192)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 160, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 20)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !661, file: !662, line: 80, baseType: !548, size: 8, offset: 352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !146, file: !12, line: 1403, baseType: !678, size: 64, offset: 2368)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!63, !10, !10}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !146, file: !12, line: 1405, baseType: !682, size: 64, offset: 2432)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!10, !10, !168, !525}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !146, file: !12, line: 1408, baseType: !686, size: 64, offset: 2496)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!77, !10, !77}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !146, file: !12, line: 1410, baseType: !690, size: 64, offset: 2560)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!63, !10, !77}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !146, file: !12, line: 1412, baseType: !694, size: 64, offset: 2624)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!63, !10, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !699, line: 35, flags: DIFlagFwdDecl)
!699 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !146, file: !12, line: 1414, baseType: !701, size: 64, offset: 2688)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !10, !697}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !146, file: !12, line: 1417, baseType: !705, size: 64, offset: 2752)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!63, !708, !607, !10, !720, !335, !335, !660}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !710, line: 8, size: 96, elements: !711)
!710 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!711 = !{!712, !713, !714, !715, !717, !718, !719}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !709, file: !710, line: 9, baseType: !235, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !709, file: !710, line: 10, baseType: !235, size: 8, offset: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !709, file: !710, line: 11, baseType: !229, size: 16, offset: 16)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !709, file: !710, line: 12, baseType: !716, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !82, line: 26, baseType: !63)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !709, file: !710, line: 13, baseType: !229, size: 16, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !709, file: !710, line: 14, baseType: !235, size: 8, offset: 80)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !709, file: !710, line: 15, baseType: !235, size: 8, offset: 88)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !146, file: !12, line: 1424, baseType: !723, size: 64, offset: 2816)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!63, !708, !607, !10, !720, !335}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !146, file: !12, line: 1429, baseType: !727, size: 64, offset: 2880)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!63, !168, !730, !10, !10, !775}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !662, line: 203, size: 1024, elements: !732)
!732 = !{!733, !734, !744, !748, !752, !753, !757, !758, !759, !760, !762, !763, !764, !765}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !731, file: !662, line: 204, baseType: !168, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !731, file: !662, line: 205, baseType: !735, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !610, line: 44, size: 128, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !737, file: !610, line: 45, baseType: !247, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !737, file: !610, line: 46, baseType: !229, size: 16, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !737, file: !610, line: 47, baseType: !229, size: 16, offset: 48)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !737, file: !610, line: 48, baseType: !247, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !737, file: !610, line: 49, baseType: !247, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !731, file: !662, line: 206, baseType: !745, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!63, !168, !730}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !731, file: !662, line: 208, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!63, !730}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !731, file: !662, line: 209, baseType: !345, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !731, file: !662, line: 211, baseType: !754, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !756, line: 76, flags: DIFlagFwdDecl)
!756 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!757 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !731, file: !662, line: 212, baseType: !660, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !731, file: !662, line: 213, baseType: !335, size: 16, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !731, file: !662, line: 214, baseType: !335, size: 16, offset: 464)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !731, file: !662, line: 215, baseType: !761, size: 32, offset: 480)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !80, line: 21, baseType: !247)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !731, file: !662, line: 216, baseType: !226, size: 32, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !731, file: !662, line: 216, baseType: !226, size: 32, offset: 544)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !731, file: !662, line: 217, baseType: !525, size: 8, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, scope: !731, file: !662, line: 218, baseType: !766, size: 384, offset: 640)
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !731, file: !662, line: 218, size: 384, elements: !767)
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !766, file: !662, line: 219, baseType: !769, size: 384)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 384, elements: !211)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !766, file: !662, line: 224, baseType: !771, size: 384)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 384, elements: !773)
!772 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!773 = !{!774}
!774 = !DISubrange(count: 6)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !146, file: !12, line: 1434, baseType: !777, size: 64, offset: 2944)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!63, !168, !607, !10, !720, !335, !761, !761, !660}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !146, file: !12, line: 1440, baseType: !781, size: 64, offset: 3008)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!63, !10, !784, !335, !660}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !146, file: !12, line: 1444, baseType: !786, size: 64, offset: 3072)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!63, !168, !761, !761, !10, !761, !63}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !146, file: !12, line: 1449, baseType: !790, size: 64, offset: 3136)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!63, !10, !784, !335}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !146, file: !12, line: 1452, baseType: !794, size: 64, offset: 3200)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!63, !10, !525}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !146, file: !12, line: 1454, baseType: !798, size: 64, offset: 3264)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!63, !10, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !12, line: 820, size: 264, elements: !803)
!803 = !{!804, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !802, file: !12, line: 821, baseType: !805, size: 256)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 256, elements: !573)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !802, file: !12, line: 822, baseType: !236, size: 8, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !146, file: !12, line: 1456, baseType: !798, size: 64, offset: 3328)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !146, file: !12, line: 1458, baseType: !809, size: 64, offset: 3392)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!63, !10, !812, !813}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 55, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !815, line: 72, baseType: !816)
!815 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !815, line: 16, baseType: !59)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !146, file: !12, line: 1460, baseType: !818, size: 64, offset: 3456)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !10, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !12, line: 67, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !146, file: !12, line: 1462, baseType: !818, size: 64, offset: 3520)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !146, file: !12, line: 1464, baseType: !825, size: 64, offset: 3584)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!345, !10, !10}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !146, file: !12, line: 1466, baseType: !829, size: 64, offset: 3648)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !10, !345}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !146, file: !12, line: 1469, baseType: !833, size: 64, offset: 3712)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!63, !10, !63, !761}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !146, file: !12, line: 1472, baseType: !837, size: 64, offset: 3776)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!63, !527}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !146, file: !12, line: 1473, baseType: !794, size: 64, offset: 3840)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !146, file: !12, line: 1475, baseType: !842, size: 64, offset: 3904)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!63, !10, !168}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !146, file: !12, line: 1477, baseType: !337, size: 64, offset: 3968)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !146, file: !12, line: 1479, baseType: !847, size: 64, offset: 4032)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!63, !10, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !12, line: 894, size: 256, elements: !852)
!852 = !{!853, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !851, file: !12, line: 895, baseType: !854, size: 32)
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_netdev_command", file: !12, line: 860, baseType: !226, size: 32, elements: !855)
!855 = !{!856, !857, !858, !859, !860}
!856 = !DIEnumerator(name: "XDP_SETUP_PROG", value: 0, isUnsigned: true)
!857 = !DIEnumerator(name: "XDP_SETUP_PROG_HW", value: 1, isUnsigned: true)
!858 = !DIEnumerator(name: "BPF_OFFLOAD_MAP_ALLOC", value: 2, isUnsigned: true)
!859 = !DIEnumerator(name: "BPF_OFFLOAD_MAP_FREE", value: 3, isUnsigned: true)
!860 = !DIEnumerator(name: "XDP_SETUP_XSK_POOL", value: 4, isUnsigned: true)
!861 = !DIDerivedType(tag: DW_TAG_member, scope: !851, file: !12, line: 896, baseType: !862, size: 192, offset: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !851, file: !12, line: 896, size: 192, elements: !863)
!863 = !{!864, !873, !5419}
!864 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !12, line: 898, baseType: !865, size: 192)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !862, file: !12, line: 898, size: 192, elements: !866)
!866 = !{!867, !868, !872}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !865, file: !12, line: 899, baseType: !761, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !865, file: !12, line: 900, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !871, line: 11, flags: DIFlagFwdDecl)
!871 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !865, file: !12, line: 901, baseType: !660, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !12, line: 904, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !862, file: !12, line: 904, size: 64, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !874, file: !12, line: 905, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !879, line: 222, size: 2560, elements: !880)
!879 = !DIFile(filename: "./include/linux/bpf.h", directory: "/home/lizy2001/genbc/linux")
!880 = !{!881, !5398, !5399, !5417, !5418}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !878, file: !879, line: 223, baseType: !882, size: 2048)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !879, line: 141, size: 2048, elements: !883)
!883 = !{!884, !5341, !5342, !5374, !5375, !5376, !5377, !5378, !5379, !5380, !5381, !5382, !5383, !5384, !5389, !5390, !5391, !5392, !5393, !5394, !5395, !5396, !5397}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !882, file: !879, line: 145, baseType: !885, size: 64, align: 512)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !879, line: 54, size: 2368, elements: !888)
!888 = !{!889, !1089, !1094, !4902, !4906, !4910, !4911, !4915, !4921, !4922, !4923, !4924, !4925, !4929, !4933, !4937, !4938, !4939, !4943, !4944, !4956, !4960, !4964, !4976, !5276, !5280, !5284, !5289, !5293, !5297, !5301, !5307, !5311, !5318, !5322, !5324, !5325}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !887, file: !879, line: 56, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!63, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !895, line: 483, size: 960, align: 64, elements: !896)
!895 = !DIFile(filename: "./include/uapi/linux/bpf.h", directory: "/home/lizy2001/genbc/linux")
!896 = !{!897, !913, !924, !935, !959, !965, !973, !990, !1003, !1009, !1018, !1023, !1031, !1043, !1063, !1070, !1074, !1078, !1083}
!897 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !895, line: 484, baseType: !898, size: 512)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !895, line: 484, size: 512, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !898, file: !895, line: 485, baseType: !247, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !898, file: !895, line: 486, baseType: !247, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !898, file: !895, line: 487, baseType: !247, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !898, file: !895, line: 488, baseType: !247, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !898, file: !895, line: 489, baseType: !247, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !898, file: !895, line: 492, baseType: !247, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !898, file: !895, line: 493, baseType: !247, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !898, file: !895, line: 496, baseType: !15, size: 128, offset: 224)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !898, file: !895, line: 497, baseType: !247, size: 32, offset: 352)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !898, file: !895, line: 498, baseType: !247, size: 32, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !898, file: !895, line: 499, baseType: !247, size: 32, offset: 416)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !898, file: !895, line: 500, baseType: !247, size: 32, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !898, file: !895, line: 501, baseType: !247, size: 32, offset: 480)
!913 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !895, line: 507, baseType: !914, size: 256)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !895, line: 507, size: 256, elements: !915)
!915 = !{!916, !917, !918, !923}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !914, file: !895, line: 508, baseType: !247, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !914, file: !895, line: 509, baseType: !81, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, scope: !914, file: !895, line: 510, baseType: !919, size: 64, offset: 128)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !914, file: !895, line: 510, size: 64, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !919, file: !895, line: 511, baseType: !81, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !919, file: !895, line: 512, baseType: !81, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !914, file: !895, line: 514, baseType: !81, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !894, file: !895, line: 532, baseType: !925, size: 448)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !895, line: 517, size: 448, elements: !926)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !925, file: !895, line: 518, baseType: !81, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !925, file: !895, line: 521, baseType: !81, size: 64, align: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !925, file: !895, line: 522, baseType: !81, size: 64, align: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !925, file: !895, line: 523, baseType: !81, size: 64, align: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !925, file: !895, line: 524, baseType: !247, size: 32, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !925, file: !895, line: 529, baseType: !247, size: 32, offset: 288)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !925, file: !895, line: 530, baseType: !81, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !925, file: !895, line: 531, baseType: !81, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !895, line: 534, baseType: !936, size: 960)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !895, line: 534, size: 960, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !936, file: !895, line: 535, baseType: !247, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !936, file: !895, line: 536, baseType: !247, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !936, file: !895, line: 537, baseType: !81, size: 64, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !936, file: !895, line: 538, baseType: !81, size: 64, align: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !936, file: !895, line: 539, baseType: !247, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !936, file: !895, line: 540, baseType: !247, size: 32, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !936, file: !895, line: 541, baseType: !81, size: 64, align: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !936, file: !895, line: 542, baseType: !247, size: 32, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !936, file: !895, line: 543, baseType: !247, size: 32, offset: 352)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !936, file: !895, line: 544, baseType: !15, size: 128, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !936, file: !895, line: 545, baseType: !247, size: 32, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !936, file: !895, line: 550, baseType: !247, size: 32, offset: 544)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !936, file: !895, line: 551, baseType: !247, size: 32, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !936, file: !895, line: 552, baseType: !247, size: 32, offset: 608)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !936, file: !895, line: 553, baseType: !81, size: 64, align: 64, offset: 640)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !936, file: !895, line: 554, baseType: !247, size: 32, offset: 704)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !936, file: !895, line: 555, baseType: !247, size: 32, offset: 736)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !936, file: !895, line: 556, baseType: !81, size: 64, align: 64, offset: 768)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_cnt", scope: !936, file: !895, line: 557, baseType: !247, size: 32, offset: 832)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "attach_btf_id", scope: !936, file: !895, line: 558, baseType: !247, size: 32, offset: 864)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "attach_prog_fd", scope: !936, file: !895, line: 559, baseType: !247, size: 32, offset: 896)
!959 = !DIDerivedType(tag: DW_TAG_member, scope: !894, file: !895, line: 562, baseType: !960, size: 128)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !895, line: 562, size: 128, elements: !961)
!961 = !{!962, !963, !964}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !960, file: !895, line: 563, baseType: !81, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_fd", scope: !960, file: !895, line: 564, baseType: !247, size: 32, offset: 64)
