; ModuleID = '../bcout/drivers/isdn/mISDN/fsm.llvm.bc'
source_filename = "drivers/isdn/mISDN/fsm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.Fsm = type { void (%struct.FsmInst*, i32, i8*)**, i32, i32, i8**, i8** }
%struct.FsmInst = type { %struct.Fsm*, i32, i32, i8*, i32, void (%struct.FsmInst*, i8*, ...)* }
%struct.FsmNode = type { i32, i32, void (%struct.FsmInst*, i32, i8*)* }
%struct.FsmTimer = type { %struct.FsmInst*, %struct.timer_list, i32, i8* }
%struct.timer_list = type { %struct.hlist_node, i64, void (%struct.timer_list*)*, i32 }
%struct.hlist_node = type { %struct.hlist_node*, %struct.hlist_node** }
%struct.lock_class_key = type {}

@.str = private unnamed_addr constant [50 x i8] c"\013mISDN_FsmNew Error: %d st(%ld/%ld) ev(%ld/%ld)\0A\00", align 1
@.str.1 = private unnamed_addr constant [47 x i8] c"\013mISDN_FsmEvent Error st(%ld/%ld) ev(%d/%ld)\0A\00", align 1
@.str.2 = private unnamed_addr constant [18 x i8] c"State %s Event %s\00", align 1
@.str.3 = private unnamed_addr constant [28 x i8] c"State %s Event %s no action\00", align 1
@.str.4 = private unnamed_addr constant [15 x i8] c"ChangeState %s\00", align 1
@.str.5 = private unnamed_addr constant [44 x i8] c"\014mISDN_FsmAddTimer: timer already active!\0A\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"mISDN_FsmAddTimer already active!\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/isdn/mISDN/fsm.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !4, line: 305, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!11 = !{!12, !14, !15, !16, !46, !51, !79}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !13, line: 148, baseType: !5)
!13 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSMFNPTR", file: !17, line: 20, baseType: !18)
!17 = !DIFile(filename: "drivers/isdn/mISDN/fsm.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !31, !14}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FsmInst", file: !17, line: 28, size: 320, elements: !23)
!23 = !{!24, !38, !39, !40, !41, !42}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !22, file: !17, line: 29, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Fsm", file: !17, line: 22, size: 256, elements: !27)
!27 = !{!28, !30, !32, !33, !37}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "jumpmatrix", scope: !26, file: !17, line: 23, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !26, file: !17, line: 24, baseType: !31, size: 32, offset: 64)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "event_count", scope: !26, file: !17, line: 24, baseType: !31, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "strEvent", scope: !26, file: !17, line: 25, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "strState", scope: !26, file: !17, line: 25, baseType: !34, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !17, line: 30, baseType: !31, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !22, file: !17, line: 31, baseType: !31, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !22, file: !17, line: 32, baseType: !14, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "userint", scope: !22, file: !17, line: 33, baseType: !31, size: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "printdebug", scope: !22, file: !17, line: 34, baseType: !43, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !21, !35, null}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 55, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !48, line: 72, baseType: !49)
!48 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !48, line: 16, baseType: !50)
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FsmTimer", file: !17, line: 42, size: 512, elements: !53)
!53 = !{!54, !55, !77, !78}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "fi", scope: !52, file: !17, line: 43, baseType: !21, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tl", scope: !52, file: !17, line: 44, baseType: !56, size: 320, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_list", file: !57, line: 11, size: 320, elements: !58)
!57 = !DIFile(filename: "./include/linux/timer.h", directory: "/home/lizy2001/genbc/linux")
!58 = !{!59, !66, !67, !72}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !56, file: !57, line: 16, baseType: !60, size: 128)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !13, line: 186, size: 128, elements: !61)
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !13, line: 187, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !60, file: !13, line: 187, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !56, file: !57, line: 17, baseType: !50, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !56, file: !57, line: 18, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !57, line: 19, baseType: !73, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !74, line: 21, baseType: !75)
!74 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !76, line: 27, baseType: !5)
!76 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !52, file: !17, line: 45, baseType: !31, size: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !52, file: !17, line: 46, baseType: !14, size: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!82 = !{i32 7, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 2}
!85 = !{i32 1, !"Code Model", i32 2}
!86 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!87 = distinct !DISubprogram(name: "mISDN_FsmNew", scope: !1, file: !1, line: 21, type: !88, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!88 = !DISubroutineType(types: !89)
!89 = !{!31, !25, !90, !31}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FsmNode", file: !17, line: 37, size: 128, elements: !92)
!92 = !{!93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !91, file: !17, line: 38, baseType: !31, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !91, file: !17, line: 38, baseType: !31, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !91, file: !17, line: 39, baseType: !18, size: 64, offset: 64)
!96 = !{}
!97 = !DILocalVariable(name: "fsm", arg: 1, scope: !87, file: !1, line: 21, type: !25)
!98 = !DILocation(line: 21, column: 26, scope: !87)
!99 = !DILocalVariable(name: "fnlist", arg: 2, scope: !87, file: !1, line: 22, type: !90)
!100 = !DILocation(line: 22, column: 23, scope: !87)
!101 = !DILocalVariable(name: "fncount", arg: 3, scope: !87, file: !1, line: 22, type: !31)
!102 = !DILocation(line: 22, column: 35, scope: !87)
!103 = !DILocalVariable(name: "i", scope: !87, file: !1, line: 24, type: !31)
!104 = !DILocation(line: 24, column: 6, scope: !87)
!105 = !DILocation(line: 27, column: 41, scope: !87)
!106 = !DILocation(line: 27, column: 46, scope: !87)
!107 = !DILocation(line: 28, column: 9, scope: !87)
!108 = !DILocation(line: 28, column: 14, scope: !87)
!109 = !DILocation(line: 27, column: 11, scope: !87)
!110 = !DILocation(line: 27, column: 3, scope: !87)
!111 = !DILocation(line: 26, column: 2, scope: !87)
!112 = !DILocation(line: 26, column: 7, scope: !87)
!113 = !DILocation(line: 26, column: 18, scope: !87)
!114 = !DILocation(line: 30, column: 6, scope: !115)
!115 = distinct !DILexicalBlock(scope: !87, file: !1, line: 30, column: 6)
!116 = !DILocation(line: 30, column: 11, scope: !115)
!117 = !DILocation(line: 30, column: 22, scope: !115)
!118 = !DILocation(line: 30, column: 6, scope: !87)
!119 = !DILocation(line: 31, column: 3, scope: !115)
!120 = !DILocation(line: 33, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !87, file: !1, line: 33, column: 2)
!122 = !DILocation(line: 33, column: 7, scope: !121)
!123 = !DILocation(line: 33, column: 14, scope: !124)
!124 = distinct !DILexicalBlock(scope: !121, file: !1, line: 33, column: 2)
!125 = !DILocation(line: 33, column: 18, scope: !124)
!126 = !DILocation(line: 33, column: 16, scope: !124)
!127 = !DILocation(line: 33, column: 2, scope: !121)
!128 = !DILocation(line: 34, column: 8, scope: !129)
!129 = distinct !DILexicalBlock(scope: !124, file: !1, line: 34, column: 7)
!130 = !DILocation(line: 34, column: 15, scope: !129)
!131 = !DILocation(line: 34, column: 18, scope: !129)
!132 = !DILocation(line: 34, column: 27, scope: !129)
!133 = !DILocation(line: 34, column: 32, scope: !129)
!134 = !DILocation(line: 34, column: 24, scope: !129)
!135 = !DILocation(line: 34, column: 45, scope: !129)
!136 = !DILocation(line: 35, column: 8, scope: !129)
!137 = !DILocation(line: 35, column: 15, scope: !129)
!138 = !DILocation(line: 35, column: 18, scope: !129)
!139 = !DILocation(line: 35, column: 27, scope: !129)
!140 = !DILocation(line: 35, column: 32, scope: !129)
!141 = !DILocation(line: 35, column: 24, scope: !129)
!142 = !DILocation(line: 34, column: 7, scope: !124)
!143 = !DILocation(line: 38, column: 11, scope: !144)
!144 = distinct !DILexicalBlock(scope: !129, file: !1, line: 35, column: 46)
!145 = !DILocation(line: 38, column: 20, scope: !144)
!146 = !DILocation(line: 38, column: 27, scope: !144)
!147 = !DILocation(line: 38, column: 30, scope: !144)
!148 = !DILocation(line: 38, column: 14, scope: !144)
!149 = !DILocation(line: 38, column: 43, scope: !144)
!150 = !DILocation(line: 38, column: 48, scope: !144)
!151 = !DILocation(line: 38, column: 37, scope: !144)
!152 = !DILocation(line: 39, column: 17, scope: !144)
!153 = !DILocation(line: 39, column: 24, scope: !144)
!154 = !DILocation(line: 39, column: 27, scope: !144)
!155 = !DILocation(line: 39, column: 11, scope: !144)
!156 = !DILocation(line: 39, column: 40, scope: !144)
!157 = !DILocation(line: 39, column: 45, scope: !144)
!158 = !DILocation(line: 39, column: 34, scope: !144)
!159 = !DILocation(line: 36, column: 4, scope: !144)
!160 = !DILocation(line: 40, column: 3, scope: !144)
!161 = !DILocation(line: 42, column: 36, scope: !129)
!162 = !DILocation(line: 42, column: 43, scope: !129)
!163 = !DILocation(line: 42, column: 46, scope: !129)
!164 = !DILocation(line: 41, column: 4, scope: !129)
