; ModuleID = '../bcout/drivers/base/power/generic_ops.llvm.bc'
source_filename = "drivers/base/power/generic_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.device = type { %struct.kobject, %struct.device*, %struct.device_private*, i8*, %struct.device_type*, %struct.bus_type*, %struct.device_driver*, i8*, i8*, %struct.mutex, %struct.dev_links_info, %struct.dev_pm_info, %struct.dev_pm_domain*, %struct.irq_domain*, %struct.list_head, %struct.dma_map_ops*, i64*, i64, i64, %struct.bus_dma_region*, %struct.device_dma_parameters*, %struct.list_head, %struct.dev_archdata, %struct.device_node*, %struct.fwnode_handle*, i32, i32, %struct.spinlock, %struct.list_head, %struct.class*, %struct.attribute_group**, void (%struct.device*)*, %struct.iommu_group*, %struct.dev_iommu*, i8 }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }
%struct.kset_uevent_ops = type { i32 (%struct.kset*, %struct.kobject*)*, i8* (%struct.kset*, %struct.kobject*)*, i32 (%struct.kset*, %struct.kobject*, %struct.kobj_uevent_env*)* }
%struct.kobj_uevent_env = type { [3 x i8*], [64 x i8*], i32, [2048 x i8], i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/base/power/generic_ops.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3, !9, !15, !21, !27, !34, !42}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !4, line: 65, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !10, line: 16, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !16, line: 26, baseType: !5, size: 32, elements: !17)
!16 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !22, line: 44, baseType: !5, size: 32, elements: !23)
!22 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !28, line: 343, baseType: !5, size: 32, elements: !29)
!28 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !35, line: 524, baseType: !5, size: 32, elements: !36)
!35 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !35, line: 502, baseType: !5, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 2}
!51 = !{i32 1, !"Code Model", i32 2}
!52 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!53 = distinct !DISubprogram(name: "pm_generic_runtime_suspend", scope: !1, file: !1, line: 20, type: !54, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !97)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !57}
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !28, line: 461, size: 5568, elements: !59)
!59 = !{!60, !1540, !1541, !1544, !1545, !1594, !1672, !1673, !1674, !1675, !1676, !1685, !1790, !1803, !1806, !1807, !1811, !1813, !1814, !1815, !1819, !1825, !1826, !1829, !1833, !1836, !1839, !1840, !1841, !1842, !1874, !1875, !1876, !1879, !1882, !1883, !1884, !1885}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !58, file: !28, line: 462, baseType: !61, size: 512)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !62, line: 64, size: 512, elements: !63)
!62 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!63 = !{!64, !68, !75, !77, !137, !1376, !1530, !1535, !1536, !1537, !1538, !1539}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !62, line: 65, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !61, file: !62, line: 66, baseType: !69, size: 128, offset: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !70, line: 178, size: 128, elements: !71)
!70 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !70, line: 179, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !69, file: !70, line: 179, baseType: !73, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !61, file: !62, line: 67, baseType: !76, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !61, file: !62, line: 68, baseType: !78, size: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !62, line: 192, size: 704, elements: !80)
!80 = !{!81, !82, !98, !99}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !79, file: !62, line: 193, baseType: !69, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !79, file: !62, line: 194, baseType: !83, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !84, line: 83, baseType: !85)
!84 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !84, line: 71, elements: !86)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, scope: !85, file: !84, line: 72, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !85, file: !84, line: 72, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !88, file: !84, line: 73, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !84, line: 20, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !91, file: !84, line: 21, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !95, line: 25, baseType: !96)
!95 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 25, elements: !97)
!97 = !{}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !79, file: !62, line: 195, baseType: !61, size: 512, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !79, file: !62, line: 196, baseType: !100, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !62, line: 156, size: 192, elements: !103)
!103 = !{!104, !109, !114}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !102, file: !62, line: 157, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!56, !78, !76}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !62, line: 158, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!65, !78, !76}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !102, file: !62, line: 159, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!56, !78, !76, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !62, line: 148, size: 20736, elements: !121)
!121 = !{!122, !127, !131, !132, !136}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !120, file: !62, line: 149, baseType: !123, size: 192)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 192, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!125 = !{!126}
!126 = !DISubrange(count: 3)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !120, file: !62, line: 150, baseType: !128, size: 4096, offset: 192)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 4096, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !120, file: !62, line: 151, baseType: !56, size: 32, offset: 4288)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !120, file: !62, line: 152, baseType: !133, size: 16384, offset: 4320)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 16384, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 2048)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !120, file: !62, line: 153, baseType: !56, size: 32, offset: 20704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !61, file: !62, line: 69, baseType: !138, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !62, line: 138, size: 448, elements: !140)
!140 = !{!141, !145, !175, !177, !1322, !1355, !1359}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !139, file: !62, line: 139, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !76}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !139, file: !62, line: 140, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !149, line: 230, size: 128, elements: !150)
!149 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!150 = !{!151, !167}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !148, file: !149, line: 231, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !76, !160, !124}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !70, line: 60, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !157, line: 73, baseType: !158)
!157 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !157, line: 15, baseType: !159)
!159 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !149, line: 30, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !149, line: 31, baseType: !65, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !161, file: !149, line: 32, baseType: !165, size: 16, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !70, line: 19, baseType: !166)
!166 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !148, file: !149, line: 232, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!155, !76, !160, !65, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 55, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !157, line: 72, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !157, line: 16, baseType: !174)
!174 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !139, file: !62, line: 141, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !139, file: !62, line: 142, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !149, line: 84, size: 320, elements: !182)
!182 = !{!183, !184, !188, !1319, !1320}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !149, line: 85, baseType: !65, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !181, file: !149, line: 86, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!165, !76, !160, !56}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !181, file: !149, line: 88, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!165, !76, !192, !56}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !149, line: 168, size: 448, elements: !194)
!194 = !{!195, !196, !197, !199, !209, !210}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !193, file: !149, line: 169, baseType: !161, size: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !149, line: 170, baseType: !171, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !193, file: !149, line: 171, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !193, file: !149, line: 172, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!155, !203, !76, !192, !124, !206, !171}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !205, line: 526, flags: DIFlagFwdDecl)
!205 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !70, line: 46, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !157, line: 88, baseType: !208)
!208 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !193, file: !149, line: 174, baseType: !200, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !193, file: !149, line: 176, baseType: !211, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!56, !203, !76, !192, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !216, line: 305, size: 1472, elements: !217)
!216 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!217 = !{!218, !219, !220, !221, !222, !230, !231, !1293, !1299, !1300, !1305, !1306, !1309, !1313, !1314, !1315, !1316, !1317}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !215, file: !216, line: 308, baseType: !174, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !215, file: !216, line: 309, baseType: !174, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !215, file: !216, line: 313, baseType: !214, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !215, file: !216, line: 313, baseType: !214, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !215, file: !216, line: 315, baseType: !223, size: 192, align: 64, offset: 256)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !224, line: 24, size: 192, align: 64, elements: !225)
!224 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!225 = !{!226, !227, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !223, file: !224, line: 25, baseType: !174, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !223, file: !224, line: 26, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !223, file: !224, line: 27, baseType: !228, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !215, file: !216, line: 323, baseType: !174, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !215, file: !216, line: 327, baseType: !232, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !216, line: 388, size: 7296, elements: !234)
!234 = !{!235, !1289}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !216, line: 389, baseType: !236, size: 7296)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !216, line: 389, size: 7296, elements: !237)
!237 = !{!238, !239, !243, !249, !253, !254, !255, !256, !257, !265, !270, !271, !272, !273, !282, !283, !284, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !327, !330, !362, !363, !1259, !1260, !1263, !1267, !1268, !1271, !1272, !1273, !1276, !1288}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !236, file: !216, line: 390, baseType: !214, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !236, file: !216, line: 391, baseType: !240, size: 64, offset: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !224, line: 31, size: 64, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !240, file: !224, line: 32, baseType: !228, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !236, file: !216, line: 392, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !245, line: 23, baseType: !246)
!245 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !247, line: 31, baseType: !248)
!247 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!248 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !236, file: !216, line: 394, baseType: !250, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!174, !203, !174, !174, !174, !174}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !236, file: !216, line: 398, baseType: !174, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !236, file: !216, line: 399, baseType: !174, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !236, file: !216, line: 405, baseType: !174, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !236, file: !216, line: 406, baseType: !174, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !236, file: !216, line: 407, baseType: !258, size: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !205, line: 286, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 286, size: 64, elements: !261)
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !260, file: !205, line: 286, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !264, line: 18, baseType: !174)
!264 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!265 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !236, file: !216, line: 416, baseType: !266, size: 32, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !70, line: 168, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 166, size: 32, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !267, file: !70, line: 167, baseType: !56, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !236, file: !216, line: 428, baseType: !266, size: 32, offset: 608)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !236, file: !216, line: 437, baseType: !266, size: 32, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !236, file: !216, line: 447, baseType: !266, size: 32, offset: 672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !236, file: !216, line: 450, baseType: !274, size: 64, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !275, line: 13, baseType: !276)
!275 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !70, line: 175, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 173, size: 64, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !277, file: !70, line: 174, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !245, line: 22, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !247, line: 30, baseType: !208)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !236, file: !216, line: 452, baseType: !56, size: 32, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !236, file: !216, line: 454, baseType: !83, offset: 800)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !236, file: !216, line: 457, baseType: !285, size: 256, offset: 832)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !286, line: 35, size: 256, elements: !287)
!286 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!287 = !{!288, !289, !290, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !285, file: !286, line: 36, baseType: !274, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !285, file: !286, line: 42, baseType: !274, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !285, file: !286, line: 46, baseType: !291, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !84, line: 29, baseType: !91)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !285, file: !286, line: 47, baseType: !69, size: 128, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !236, file: !216, line: 459, baseType: !69, size: 128, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !236, file: !216, line: 466, baseType: !174, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !236, file: !216, line: 467, baseType: !174, size: 64, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !236, file: !216, line: 469, baseType: !174, size: 64, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !236, file: !216, line: 470, baseType: !174, size: 64, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !236, file: !216, line: 471, baseType: !276, size: 64, offset: 1472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !236, file: !216, line: 472, baseType: !174, size: 64, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !236, file: !216, line: 473, baseType: !174, size: 64, offset: 1600)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !236, file: !216, line: 474, baseType: !174, size: 64, offset: 1664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !236, file: !216, line: 475, baseType: !174, size: 64, offset: 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !236, file: !216, line: 477, baseType: !83, offset: 1792)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !236, file: !216, line: 478, baseType: !174, size: 64, offset: 1792)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !236, file: !216, line: 478, baseType: !174, size: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !236, file: !216, line: 478, baseType: !174, size: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !236, file: !216, line: 478, baseType: !174, size: 64, offset: 1984)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !236, file: !216, line: 479, baseType: !174, size: 64, offset: 2048)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !236, file: !216, line: 479, baseType: !174, size: 64, offset: 2112)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !236, file: !216, line: 479, baseType: !174, size: 64, offset: 2176)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !236, file: !216, line: 480, baseType: !174, size: 64, offset: 2240)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !236, file: !216, line: 480, baseType: !174, size: 64, offset: 2304)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !236, file: !216, line: 480, baseType: !174, size: 64, offset: 2368)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !236, file: !216, line: 480, baseType: !174, size: 64, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !236, file: !216, line: 482, baseType: !316, size: 2816, offset: 2496)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 2816, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 44)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !236, file: !216, line: 488, baseType: !320, size: 256, offset: 5312)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !321, line: 60, size: 256, elements: !322)
!321 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !320, file: !321, line: 61, baseType: !324, size: 256)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 256, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 4)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !236, file: !216, line: 490, baseType: !328, size: 64, offset: 5568)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !216, line: 490, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !236, file: !216, line: 493, baseType: !331, size: 896, offset: 5632)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !332, line: 53, baseType: !333)
!332 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 13, size: 896, elements: !334)
!334 = !{!335, !336, !337, !338, !341, !342, !349, !350, !354, !355, !358}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !333, file: !332, line: 18, baseType: !244, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !333, file: !332, line: 28, baseType: !276, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !333, file: !332, line: 31, baseType: !285, size: 256, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !333, file: !332, line: 32, baseType: !339, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !332, line: 32, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !333, file: !332, line: 37, baseType: !166, size: 16, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !333, file: !332, line: 40, baseType: !343, size: 192, offset: 512)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !344, line: 53, size: 192, elements: !345)
!344 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!345 = !{!346, !347, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !343, file: !344, line: 54, baseType: !274, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !343, file: !344, line: 55, baseType: !83, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !343, file: !344, line: 59, baseType: !69, size: 128, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !333, file: !332, line: 41, baseType: !198, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !333, file: !332, line: 42, baseType: !351, size: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !332, line: 42, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !333, file: !332, line: 44, baseType: !266, size: 32, offset: 832)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !333, file: !332, line: 50, baseType: !356, size: 16, offset: 864)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !245, line: 19, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !247, line: 24, baseType: !166)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !333, file: !332, line: 51, baseType: !359, size: 16, offset: 880)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !245, line: 18, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !247, line: 23, baseType: !361)
!361 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !236, file: !216, line: 495, baseType: !174, size: 64, offset: 6528)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !236, file: !216, line: 497, baseType: !364, size: 64, offset: 6592)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !216, line: 381, size: 384, elements: !366)
!366 = !{!367, !368, !1258}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !365, file: !216, line: 382, baseType: !266, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !365, file: !216, line: 383, baseType: !369, size: 128, offset: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !216, line: 376, size: 128, elements: !370)
!370 = !{!371, !1256}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !369, file: !216, line: 377, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !374, line: 640, size: 48640, elements: !375)
!374 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!375 = !{!376, !384, !386, !387, !393, !394, !395, !396, !397, !398, !399, !400, !404, !422, !433, !528, !529, !530, !541, !542, !544, !545, !546, !547, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !626, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !682, !684, !685, !686, !698, !700, !701, !702, !703, !704, !710, !711, !712, !713, !714, !715, !716, !728, !733, !737, !738, !739, !742, !746, !749, !752, !755, !758, !761, !764, !767, !773, !774, !775, !781, !782, !783, !784, !785, !794, !795, !796, !797, !798, !803, !804, !805, !808, !809, !812, !815, !818, !821, !824, !827, !828, !908, !911, !914, !915, !918, !919, !920, !926, !927, !928, !941, !942, !943, !955, !960, !963, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !373, file: !374, line: 646, baseType: !377, size: 128)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !378, line: 56, size: 128, elements: !379)
!378 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !378, line: 57, baseType: !174, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !377, file: !378, line: 58, baseType: !382, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !245, line: 21, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !247, line: 27, baseType: !5)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !373, file: !374, line: 649, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !373, file: !374, line: 657, baseType: !198, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !373, file: !374, line: 658, baseType: !388, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !389, line: 113, baseType: !390)
!389 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !389, line: 111, size: 32, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !390, file: !389, line: 112, baseType: !266, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !373, file: !374, line: 660, baseType: !5, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !373, file: !374, line: 661, baseType: !5, size: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !373, file: !374, line: 684, baseType: !56, size: 32, offset: 352)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !373, file: !374, line: 686, baseType: !56, size: 32, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !373, file: !374, line: 687, baseType: !56, size: 32, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !373, file: !374, line: 688, baseType: !56, size: 32, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !373, file: !374, line: 689, baseType: !5, size: 32, offset: 480)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !373, file: !374, line: 691, baseType: !401, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !374, line: 691, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !373, file: !374, line: 692, baseType: !405, size: 832, offset: 576)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !374, line: 451, size: 832, elements: !406)
!406 = !{!407, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !405, file: !374, line: 453, baseType: !408, size: 128)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !374, line: 325, size: 128, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !408, file: !374, line: 326, baseType: !174, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !408, file: !374, line: 327, baseType: !382, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !405, file: !374, line: 454, baseType: !223, size: 192, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !405, file: !374, line: 455, baseType: !69, size: 128, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !405, file: !374, line: 456, baseType: !5, size: 32, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !405, file: !374, line: 458, baseType: !244, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !405, file: !374, line: 459, baseType: !244, size: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !405, file: !374, line: 460, baseType: !244, size: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !405, file: !374, line: 461, baseType: !244, size: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !405, file: !374, line: 463, baseType: !244, size: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !405, file: !374, line: 465, baseType: !421, offset: 832)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !374, line: 415, elements: !97)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !373, file: !374, line: 693, baseType: !423, size: 384, offset: 1408)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !374, line: 489, size: 384, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !423, file: !374, line: 490, baseType: !69, size: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !423, file: !374, line: 491, baseType: !174, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !423, file: !374, line: 492, baseType: !174, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !423, file: !374, line: 493, baseType: !5, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !423, file: !374, line: 494, baseType: !166, size: 16, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !423, file: !374, line: 495, baseType: !166, size: 16, offset: 304)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !423, file: !374, line: 497, baseType: !432, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !373, file: !374, line: 697, baseType: !434, size: 1792, offset: 1792)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !374, line: 507, size: 1792, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !525, !526}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !434, file: !374, line: 508, baseType: !223, size: 192, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !434, file: !374, line: 515, baseType: !244, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !434, file: !374, line: 516, baseType: !244, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !434, file: !374, line: 517, baseType: !244, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !434, file: !374, line: 518, baseType: !244, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !434, file: !374, line: 519, baseType: !244, size: 64, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !434, file: !374, line: 526, baseType: !280, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !434, file: !374, line: 527, baseType: !244, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !434, file: !374, line: 528, baseType: !5, size: 32, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !434, file: !374, line: 554, baseType: !5, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !434, file: !374, line: 555, baseType: !5, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !434, file: !374, line: 556, baseType: !5, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !434, file: !374, line: 557, baseType: !5, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !434, file: !374, line: 563, baseType: !450, size: 512, offset: 704)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !4, line: 118, size: 512, elements: !451)
!451 = !{!452, !460, !461, !466, !518, !522, !523, !524}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !450, file: !4, line: 119, baseType: !453, size: 256)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !454, line: 9, size: 256, elements: !455)
!454 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !453, file: !454, line: 10, baseType: !223, size: 192, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !453, file: !454, line: 11, baseType: !458, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !459, line: 29, baseType: !280)
!459 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !450, file: !4, line: 120, baseType: !458, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !450, file: !4, line: 121, baseType: !462, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!3, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !450, file: !4, line: 122, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !4, line: 159, size: 512, align: 512, elements: !469)
!469 = !{!470, !490, !491, !494, !504, !505, !513, !517}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !468, file: !4, line: 160, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !4, line: 214, size: 4608, align: 512, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !472, file: !4, line: 215, baseType: !291)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !472, file: !4, line: 216, baseType: !5, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !472, file: !4, line: 217, baseType: !5, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !472, file: !4, line: 218, baseType: !5, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !472, file: !4, line: 219, baseType: !5, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !472, file: !4, line: 220, baseType: !5, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !472, file: !4, line: 221, baseType: !5, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !472, file: !4, line: 222, baseType: !5, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !472, file: !4, line: 233, baseType: !458, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !472, file: !4, line: 234, baseType: !465, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !472, file: !4, line: 235, baseType: !458, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !472, file: !4, line: 236, baseType: !465, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !472, file: !4, line: 237, baseType: !487, size: 4096, offset: 512)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 4096, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !468, file: !4, line: 161, baseType: !5, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !468, file: !4, line: 162, baseType: !492, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !70, line: 27, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !157, line: 96, baseType: !56)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !468, file: !4, line: 163, baseType: !495, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !496, line: 276, baseType: !497)
!496 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !496, line: 276, size: 32, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !497, file: !496, line: 276, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !496, line: 70, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !496, line: 65, size: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !501, file: !496, line: 66, baseType: !5, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !468, file: !4, line: 164, baseType: !465, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !468, file: !4, line: 165, baseType: !506, size: 128, offset: 256)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !454, line: 14, size: 128, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !506, file: !454, line: 15, baseType: !509, size: 128)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !224, line: 125, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !509, file: !224, line: 126, baseType: !240, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !509, file: !224, line: 127, baseType: !228, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !468, file: !4, line: 166, baseType: !514, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!458}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !468, file: !4, line: 167, baseType: !458, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !450, file: !4, line: 123, baseType: !519, size: 8, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !245, line: 17, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !247, line: 21, baseType: !521)
!521 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !450, file: !4, line: 124, baseType: !519, size: 8, offset: 456)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !450, file: !4, line: 125, baseType: !519, size: 8, offset: 464)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !450, file: !4, line: 126, baseType: !519, size: 8, offset: 472)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !434, file: !374, line: 572, baseType: !450, size: 512, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !434, file: !374, line: 580, baseType: !527, size: 64, offset: 1728)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !373, file: !374, line: 721, baseType: !5, size: 32, offset: 3584)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !373, file: !374, line: 722, baseType: !56, size: 32, offset: 3616)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !373, file: !374, line: 723, baseType: !531, size: 64, offset: 3648)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !534, line: 17, baseType: !535)
!534 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !534, line: 17, size: 64, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !535, file: !534, line: 17, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 1)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !373, file: !374, line: 724, baseType: !533, size: 64, offset: 3712)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !373, file: !374, line: 749, baseType: !543, offset: 3776)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !374, line: 290, elements: !97)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !373, file: !374, line: 751, baseType: !69, size: 128, offset: 3776)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !373, file: !374, line: 757, baseType: !232, size: 64, offset: 3904)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !373, file: !374, line: 758, baseType: !232, size: 64, offset: 3968)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !373, file: !374, line: 761, baseType: !548, size: 320, offset: 4032)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !321, line: 34, size: 320, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !548, file: !321, line: 35, baseType: !244, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !548, file: !321, line: 36, baseType: !552, size: 256, offset: 64)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 256, elements: !325)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !373, file: !374, line: 766, baseType: !56, size: 32, offset: 4352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !373, file: !374, line: 767, baseType: !56, size: 32, offset: 4384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !373, file: !374, line: 768, baseType: !56, size: 32, offset: 4416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !373, file: !374, line: 770, baseType: !56, size: 32, offset: 4448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !373, file: !374, line: 772, baseType: !174, size: 64, offset: 4480)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !373, file: !374, line: 775, baseType: !5, size: 32, offset: 4544)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !373, file: !374, line: 778, baseType: !5, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !373, file: !374, line: 779, baseType: !5, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !373, file: !374, line: 780, baseType: !5, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !373, file: !374, line: 803, baseType: !5, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !373, file: !374, line: 806, baseType: !5, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !373, file: !374, line: 807, baseType: !5, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !373, file: !374, line: 809, baseType: !5, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !373, file: !374, line: 815, baseType: !5, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !373, file: !374, line: 831, baseType: !174, size: 64, offset: 4672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !373, file: !374, line: 833, baseType: !569, size: 384, offset: 4736)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !10, line: 25, size: 384, elements: !570)
!570 = !{!571, !576}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !569, file: !10, line: 26, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!159, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !10, line: 27, baseType: !577, size: 320, offset: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !569, file: !10, line: 27, size: 320, elements: !578)
!578 = !{!579, !589, !616}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !577, file: !10, line: 36, baseType: !580, size: 320)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !10, line: 29, size: 320, elements: !581)
!581 = !{!582, !584, !585, !586, !587, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !580, file: !10, line: 30, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !580, file: !10, line: 31, baseType: !382, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !10, line: 32, baseType: !382, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !580, file: !10, line: 33, baseType: !382, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !580, file: !10, line: 34, baseType: !244, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !580, file: !10, line: 35, baseType: !583, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !577, file: !10, line: 46, baseType: !590, size: 192)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !10, line: 38, size: 192, elements: !591)
!591 = !{!592, !593, !594, !615}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !590, file: !10, line: 39, baseType: !492, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !590, file: !10, line: 40, baseType: !9, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !590, file: !10, line: 41, baseType: !595, size: 64, offset: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !590, file: !10, line: 41, size: 64, elements: !596)
!596 = !{!597, !605}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !595, file: !10, line: 42, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !600, line: 7, size: 128, elements: !601)
!600 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!601 = !{!602, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !599, file: !600, line: 8, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !157, line: 93, baseType: !208)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !599, file: !600, line: 9, baseType: !208, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !595, file: !10, line: 43, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !608, line: 7, size: 64, elements: !609)
!608 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!609 = !{!610, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !607, file: !608, line: 8, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !608, line: 5, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !245, line: 20, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !247, line: 26, baseType: !56)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !607, file: !608, line: 9, baseType: !612, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !590, file: !10, line: 45, baseType: !244, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !577, file: !10, line: 54, baseType: !617, size: 256)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !10, line: 48, size: 256, elements: !618)
!618 = !{!619, !622, !623, !624, !625}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !617, file: !10, line: 49, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !10, line: 14, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !617, file: !10, line: 50, baseType: !56, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !617, file: !10, line: 51, baseType: !56, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !617, file: !10, line: 52, baseType: !174, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !617, file: !10, line: 53, baseType: !174, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !373, file: !374, line: 835, baseType: !627, size: 32, offset: 5120)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !70, line: 22, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !157, line: 28, baseType: !56)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !373, file: !374, line: 836, baseType: !627, size: 32, offset: 5152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !373, file: !374, line: 840, baseType: !174, size: 64, offset: 5184)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !373, file: !374, line: 849, baseType: !372, size: 64, offset: 5248)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !373, file: !374, line: 852, baseType: !372, size: 64, offset: 5312)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !373, file: !374, line: 857, baseType: !69, size: 128, offset: 5376)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !373, file: !374, line: 858, baseType: !69, size: 128, offset: 5504)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !373, file: !374, line: 859, baseType: !372, size: 64, offset: 5632)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !373, file: !374, line: 867, baseType: !69, size: 128, offset: 5696)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !373, file: !374, line: 868, baseType: !69, size: 128, offset: 5824)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !373, file: !374, line: 871, baseType: !639, size: 64, offset: 5952)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !641, line: 59, size: 768, elements: !642)
!641 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!642 = !{!643, !644, !645, !646, !657, !658, !665, !674}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !640, file: !641, line: 61, baseType: !388, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !640, file: !641, line: 62, baseType: !5, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !640, file: !641, line: 63, baseType: !83, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !640, file: !641, line: 65, baseType: !647, size: 256, offset: 64)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 256, elements: !325)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !70, line: 182, size: 64, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !648, file: !70, line: 183, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !70, line: 186, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !70, line: 187, baseType: !651, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !652, file: !70, line: 187, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !640, file: !641, line: 66, baseType: !648, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !640, file: !641, line: 68, baseType: !659, size: 128, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !660, line: 40, baseType: !661)
!660 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !660, line: 36, size: 128, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !661, file: !660, line: 37, baseType: !83)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !661, file: !660, line: 38, baseType: !69, size: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !640, file: !641, line: 69, baseType: !666, size: 128, align: 64, offset: 512)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !70, line: 216, size: 128, align: 64, elements: !667)
!667 = !{!668, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !666, file: !70, line: 217, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !666, file: !70, line: 218, baseType: !671, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !669}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !640, file: !641, line: 70, baseType: !675, size: 128, offset: 640)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 128, elements: !539)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !641, line: 54, size: 128, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !676, file: !641, line: 55, baseType: !56, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !676, file: !641, line: 56, baseType: !680, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !641, line: 56, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !373, file: !374, line: 872, baseType: !683, size: 512, offset: 6016)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 512, elements: !325)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !373, file: !374, line: 873, baseType: !69, size: 128, offset: 6528)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !373, file: !374, line: 874, baseType: !69, size: 128, offset: 6656)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !373, file: !374, line: 876, baseType: !687, size: 64, offset: 6784)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !689, line: 26, size: 192, elements: !690)
!689 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !688, file: !689, line: 27, baseType: !5, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !688, file: !689, line: 28, baseType: !693, size: 128, offset: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !694, line: 43, size: 128, elements: !695)
!694 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !693, file: !694, line: 44, baseType: !291)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !693, file: !694, line: 45, baseType: !69, size: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !373, file: !374, line: 879, baseType: !699, size: 64, offset: 6848)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !373, file: !374, line: 882, baseType: !699, size: 64, offset: 6912)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !373, file: !374, line: 884, baseType: !244, size: 64, offset: 6976)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !373, file: !374, line: 885, baseType: !244, size: 64, offset: 7040)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !373, file: !374, line: 890, baseType: !244, size: 64, offset: 7104)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !373, file: !374, line: 891, baseType: !705, size: 128, offset: 7168)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !374, line: 242, size: 128, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !705, file: !374, line: 244, baseType: !244, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !705, file: !374, line: 245, baseType: !244, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !705, file: !374, line: 246, baseType: !291, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !373, file: !374, line: 900, baseType: !174, size: 64, offset: 7296)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !373, file: !374, line: 901, baseType: !174, size: 64, offset: 7360)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !373, file: !374, line: 904, baseType: !244, size: 64, offset: 7424)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !373, file: !374, line: 907, baseType: !244, size: 64, offset: 7488)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !373, file: !374, line: 910, baseType: !174, size: 64, offset: 7552)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !373, file: !374, line: 911, baseType: !174, size: 64, offset: 7616)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !373, file: !374, line: 914, baseType: !717, size: 640, offset: 7680)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !718, line: 123, size: 640, elements: !719)
!718 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!719 = !{!720, !726, !727}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !717, file: !718, line: 124, baseType: !721, size: 576)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 576, elements: !125)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !718, line: 108, size: 192, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !722, file: !718, line: 109, baseType: !244, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !722, file: !718, line: 110, baseType: !506, size: 128, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !717, file: !718, line: 125, baseType: !5, size: 32, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !717, file: !718, line: 126, baseType: !5, size: 32, offset: 608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !373, file: !374, line: 917, baseType: !729, size: 192, offset: 8320)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !718, line: 134, size: 192, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !729, file: !718, line: 135, baseType: !666, size: 128, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !729, file: !718, line: 136, baseType: !5, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !373, file: !374, line: 923, baseType: !734, size: 64, offset: 8512)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !374, line: 923, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !373, file: !374, line: 926, baseType: !734, size: 64, offset: 8576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !373, file: !374, line: 929, baseType: !734, size: 64, offset: 8640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !373, file: !374, line: 933, baseType: !740, size: 64, offset: 8704)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !374, line: 933, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !373, file: !374, line: 943, baseType: !743, size: 128, offset: 8768)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 16)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !373, file: !374, line: 945, baseType: !747, size: 64, offset: 8896)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !374, line: 49, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !373, file: !374, line: 956, baseType: !750, size: 64, offset: 8960)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !374, line: 45, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !373, file: !374, line: 959, baseType: !753, size: 64, offset: 9024)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !374, line: 959, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !373, file: !374, line: 962, baseType: !756, size: 64, offset: 9088)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !374, line: 66, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !373, file: !374, line: 966, baseType: !759, size: 64, offset: 9152)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !374, line: 50, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !373, file: !374, line: 969, baseType: !762, size: 64, offset: 9216)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !718, line: 223, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !373, file: !374, line: 970, baseType: !765, size: 64, offset: 9280)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !374, line: 62, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !373, file: !374, line: 971, baseType: !768, size: 64, offset: 9344)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !769, line: 25, baseType: !770)
!769 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 23, size: 64, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !770, file: !769, line: 24, baseType: !538, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !373, file: !374, line: 972, baseType: !768, size: 64, offset: 9408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !373, file: !374, line: 974, baseType: !768, size: 64, offset: 9472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !373, file: !374, line: 975, baseType: !776, size: 192, offset: 9536)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !777, line: 30, size: 192, elements: !778)
!777 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !776, file: !777, line: 31, baseType: !69, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !776, file: !777, line: 32, baseType: !768, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !373, file: !374, line: 976, baseType: !174, size: 64, offset: 9728)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !373, file: !374, line: 977, baseType: !171, size: 64, offset: 9792)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !373, file: !374, line: 978, baseType: !5, size: 32, offset: 9856)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !373, file: !374, line: 980, baseType: !669, size: 64, offset: 9920)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !373, file: !374, line: 989, baseType: !786, size: 128, offset: 9984)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !787, line: 35, size: 128, elements: !788)
!787 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !786, file: !787, line: 36, baseType: !56, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !786, file: !787, line: 37, baseType: !266, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !786, file: !787, line: 38, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !787, line: 23, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !373, file: !374, line: 992, baseType: !244, size: 64, offset: 10112)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !373, file: !374, line: 993, baseType: !244, size: 64, offset: 10176)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !373, file: !374, line: 996, baseType: !83, offset: 10240)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !373, file: !374, line: 999, baseType: !291, offset: 10240)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !373, file: !374, line: 1001, baseType: !799, size: 64, offset: 10240)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !374, line: 636, size: 64, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !799, file: !374, line: 637, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !373, file: !374, line: 1005, baseType: !509, size: 128, offset: 10304)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !373, file: !374, line: 1007, baseType: !372, size: 64, offset: 10432)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !373, file: !374, line: 1009, baseType: !806, size: 64, offset: 10496)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !374, line: 1009, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !373, file: !374, line: 1043, baseType: !198, size: 64, offset: 10560)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !373, file: !374, line: 1046, baseType: !810, size: 64, offset: 10624)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !374, line: 41, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !373, file: !374, line: 1050, baseType: !813, size: 64, offset: 10688)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !374, line: 42, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !373, file: !374, line: 1054, baseType: !816, size: 64, offset: 10752)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !374, line: 55, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !373, file: !374, line: 1056, baseType: !819, size: 64, offset: 10816)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !374, line: 40, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !373, file: !374, line: 1058, baseType: !822, size: 64, offset: 10880)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !374, line: 47, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !373, file: !374, line: 1061, baseType: !825, size: 64, offset: 10944)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !374, line: 43, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !373, file: !374, line: 1064, baseType: !174, size: 64, offset: 11008)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !373, file: !374, line: 1065, baseType: !829, size: 64, offset: 11072)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !777, line: 14, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !777, line: 12, size: 384, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, scope: !831, file: !777, line: 13, baseType: !834, size: 384)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !831, file: !777, line: 13, size: 384, elements: !835)
!835 = !{!836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !834, file: !777, line: 13, baseType: !56, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !834, file: !777, line: 13, baseType: !56, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !834, file: !777, line: 13, baseType: !56, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !834, file: !777, line: 13, baseType: !840, size: 256, offset: 128)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !841, line: 32, size: 256, elements: !842)
!841 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!842 = !{!843, !849, !862, !868, !877, !897, !902}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !840, file: !841, line: 37, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 34, size: 64, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !844, file: !841, line: 35, baseType: !628, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !844, file: !841, line: 36, baseType: !848, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !157, line: 49, baseType: !5)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !840, file: !841, line: 45, baseType: !850, size: 192)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 40, size: 192, elements: !851)
!851 = !{!852, !854, !855, !861}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !850, file: !841, line: 41, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !157, line: 95, baseType: !56)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !850, file: !841, line: 42, baseType: !56, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !850, file: !841, line: 43, baseType: !856, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !841, line: 11, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !841, line: 8, size: 64, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !857, file: !841, line: 9, baseType: !56, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !857, file: !841, line: 10, baseType: !198, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !850, file: !841, line: 44, baseType: !56, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !840, file: !841, line: 52, baseType: !863, size: 128)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 48, size: 128, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !863, file: !841, line: 49, baseType: !628, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !863, file: !841, line: 50, baseType: !848, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !863, file: !841, line: 51, baseType: !856, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !840, file: !841, line: 61, baseType: !869, size: 256)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 55, size: 256, elements: !870)
!870 = !{!871, !872, !873, !874, !876}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !869, file: !841, line: 56, baseType: !628, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !869, file: !841, line: 57, baseType: !848, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !869, file: !841, line: 58, baseType: !56, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !869, file: !841, line: 59, baseType: !875, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !157, line: 94, baseType: !158)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !869, file: !841, line: 60, baseType: !875, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !840, file: !841, line: 95, baseType: !878, size: 256)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 64, size: 256, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !878, file: !841, line: 65, baseType: !198, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, scope: !878, file: !841, line: 77, baseType: !882, size: 192, offset: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !878, file: !841, line: 77, size: 192, elements: !883)
!883 = !{!884, !885, !892}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !882, file: !841, line: 82, baseType: !361, size: 16)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !882, file: !841, line: 88, baseType: !886, size: 192)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !841, line: 84, size: 192, elements: !887)
!887 = !{!888, !890, !891}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !886, file: !841, line: 85, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !488)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !886, file: !841, line: 86, baseType: !198, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !886, file: !841, line: 87, baseType: !198, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !882, file: !841, line: 93, baseType: !893, size: 96)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !841, line: 90, size: 96, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !893, file: !841, line: 91, baseType: !889, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !893, file: !841, line: 92, baseType: !383, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !840, file: !841, line: 101, baseType: !898, size: 128)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 98, size: 128, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !898, file: !841, line: 99, baseType: !159, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !898, file: !841, line: 100, baseType: !56, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !840, file: !841, line: 108, baseType: !903, size: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !841, line: 104, size: 128, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !903, file: !841, line: 105, baseType: !198, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !903, file: !841, line: 106, baseType: !56, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !903, file: !841, line: 107, baseType: !5, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ioac", scope: !373, file: !374, line: 1067, baseType: !909, offset: 11136)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_io_accounting", file: !910, line: 12, elements: !97)
!910 = !DIFile(filename: "./include/linux/task_io_accounting.h", directory: "/home/lizy2001/genbc/linux")
!911 = !DIDerivedType(tag: DW_TAG_member, name: "robust_list", scope: !373, file: !374, line: 1099, baseType: !912, size: 64, offset: 11136)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "robust_list_head", file: !374, line: 56, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_list", scope: !373, file: !374, line: 1103, baseType: !69, size: 128, offset: 11200)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_cache", scope: !373, file: !374, line: 1104, baseType: !916, size: 64, offset: 11328)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "futex_pi_state", file: !374, line: 46, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "futex_exit_mutex", scope: !373, file: !374, line: 1105, baseType: !343, size: 192, offset: 11392)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "futex_state", scope: !373, file: !374, line: 1106, baseType: !5, size: 32, offset: 11584)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_ctxp", scope: !373, file: !374, line: 1109, baseType: !921, size: 128, offset: 11648)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 128, elements: !924)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_context", file: !374, line: 51, flags: DIFlagFwdDecl)
!924 = !{!925}
!925 = !DISubrange(count: 2)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_mutex", scope: !373, file: !374, line: 1110, baseType: !343, size: 192, offset: 11776)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_list", scope: !373, file: !374, line: 1111, baseType: !69, size: 128, offset: 11968)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rseq", scope: !373, file: !374, line: 1173, baseType: !929, size: 64, offset: 12096)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rseq", file: !931, line: 62, size: 256, align: 256, elements: !932)
!931 = !DIFile(filename: "./include/uapi/linux/rseq.h", directory: "/home/lizy2001/genbc/linux")
!932 = !{!933, !934, !935, !940}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id_start", scope: !930, file: !931, line: 75, baseType: !383, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id", scope: !930, file: !931, line: 90, baseType: !383, size: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rseq_cs", scope: !930, file: !931, line: 124, baseType: !936, size: 64, offset: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !930, file: !931, line: 109, size: 64, elements: !937)
!937 = !{!938, !939}
