; ModuleID = '../bcout/drivers/base/power/sysfs.llvm.bc'
source_filename = "drivers/base/power/sysfs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.attribute_group = type { i8*, i16 (%struct.kobject*, %struct.attribute*, i32)*, i16 (%struct.kobject*, %struct.bin_attribute*, i32)*, %struct.attribute**, %struct.bin_attribute** }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.kset_uevent_ops = type { i32 (%struct.kset*, %struct.kobject*)*, i8* (%struct.kset*, %struct.kobject*)*, i32 (%struct.kset*, %struct.kobject*, %struct.kobj_uevent_env*)* }
%struct.kobj_uevent_env = type { [3 x i8*], [64 x i8*], i32, [2048 x i8], i32 }
%struct.kobj_type = type { void (%struct.kobject*)*, %struct.sysfs_ops*, %struct.attribute**, %struct.attribute_group**, %struct.kobj_ns_type_operations* (%struct.kobject*)*, i8* (%struct.kobject*)*, void (%struct.kobject*, %struct.kuid_t*, %struct.kgid_t*)* }

!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_qos_type", file: !51, line: 41, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/pm_qos.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PM_QOS_UNITIALIZED", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PM_QOS_MAX", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PM_QOS_MIN", value: 2, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_pm_qos_req_type", file: !51, line: 99, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIEnumerator(name: "DEV_PM_QOS_RESUME_LATENCY", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "DEV_PM_QOS_LATENCY_TOLERANCE", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "DEV_PM_QOS_MIN_FREQUENCY", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "DEV_PM_QOS_MAX_FREQUENCY", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "DEV_PM_QOS_FLAGS", value: 5, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "freq_qos_req_type", file: !51, line: 80, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "FREQ_QOS_MIN", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "FREQ_QOS_MAX", value: 2, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobject_action", file: !68, line: 53, baseType: !7, size: 32, elements: !69)
!68 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77}
!70 = !DIEnumerator(name: "KOBJ_ADD", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "KOBJ_REMOVE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "KOBJ_CHANGE", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "KOBJ_MOVE", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "KOBJ_ONLINE", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "KOBJ_OFFLINE", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "KOBJ_BIND", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "KOBJ_UNBIND", value: 7, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 10, baseType: !7, size: 32, elements: !80)
!79 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!80 = !{!81, !82}
!81 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!83 = !{!84, !91, !92, !94, !96}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !85, line: 107, baseType: !86)
!85 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !87, line: 23, baseType: !88)
!87 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !89, line: 31, baseType: !90)
!89 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!90 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !87, line: 20, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !89, line: 26, baseType: !91)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !87, line: 21, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !89, line: 27, baseType: !7)
!98 = !{!0, !99, !1568, !1571, !1573, !1576, !2020, !2022, !2027, !2030, !2032, !2034, !2036, !2038, !2043, !2045, !2048, !2053, !2055, !2057, !2059, !2061, !2063, !2065, !2067, !2069, !2071, !2074, !2076, !2078, !2080, !2082, !2084, !2086}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "pm_attr_group", scope: !2, file: !3, line: 625, type: !101, isLocal: true, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !103, line: 84, size: 320, elements: !104)
!103 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!104 = !{!105, !109, !1546, !1565, !1566}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !103, line: 85, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !102, file: !103, line: 86, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !115, !208, !91}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !85, line: 19, baseType: !114)
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !68, line: 64, size: 512, elements: !117)
!117 = !{!118, !119, !125, !126, !186, !285, !1536, !1541, !1542, !1543, !1544, !1545}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !68, line: 65, baseType: !106, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !116, file: !68, line: 66, baseType: !120, size: 128, offset: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !85, line: 178, size: 128, elements: !121)
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !85, line: 179, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !85, line: 179, baseType: !123, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !116, file: !68, line: 67, baseType: !115, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !116, file: !68, line: 68, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !68, line: 192, size: 704, elements: !129)
!129 = !{!130, !131, !147, !148}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !128, file: !68, line: 193, baseType: !120, size: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !128, file: !68, line: 194, baseType: !132, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !133, line: 83, baseType: !134)
!133 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !133, line: 71, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 72, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 72, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !137, file: !133, line: 73, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !133, line: 20, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !140, file: !133, line: 21, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !144, line: 25, baseType: !145)
!144 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 25, elements: !146)
!146 = !{}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !128, file: !68, line: 195, baseType: !116, size: 512, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !128, file: !68, line: 196, baseType: !149, size: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !68, line: 156, size: 192, elements: !152)
!152 = !{!153, !158, !163}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !151, file: !68, line: 157, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!91, !127, !115}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !68, line: 158, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!106, !127, !115}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !151, file: !68, line: 159, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!91, !127, !115, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !68, line: 148, size: 20736, elements: !170)
!170 = !{!171, !176, !180, !181, !185}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !169, file: !68, line: 149, baseType: !172, size: 192)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 192, elements: !174)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !169, file: !68, line: 150, baseType: !177, size: 4096, offset: 192)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 4096, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !169, file: !68, line: 151, baseType: !91, size: 32, offset: 4288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !169, file: !68, line: 152, baseType: !182, size: 16384, offset: 4320)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16384, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 2048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !169, file: !68, line: 153, baseType: !91, size: 32, offset: 20704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !116, file: !68, line: 69, baseType: !187, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !68, line: 138, size: 448, elements: !189)
!189 = !{!190, !194, !221, !223, !226, !262, !266}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !188, file: !68, line: 139, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !115}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !188, file: !68, line: 140, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !103, line: 230, size: 128, elements: !198)
!198 = !{!199, !213}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !197, file: !103, line: 231, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !115, !208, !173}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !85, line: 60, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !205, line: 73, baseType: !206)
!205 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !205, line: 15, baseType: !207)
!207 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !103, line: 30, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !103, line: 31, baseType: !106, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !209, file: !103, line: 32, baseType: !113, size: 16, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !197, file: !103, line: 232, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!203, !115, !208, !106, !217}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 55, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !205, line: 72, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !205, line: 16, baseType: !220)
!220 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !188, file: !68, line: 141, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !188, file: !68, line: 142, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !188, file: !68, line: 143, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !115}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !18, line: 39, size: 384, elements: !233)
!233 = !{!234, !235, !241, !246, !254, !258}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !232, file: !18, line: 40, baseType: !17, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !232, file: !18, line: 41, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !85, line: 30, baseType: !240)
!240 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !232, file: !18, line: 42, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !232, file: !18, line: 43, baseType: !247, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !252}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !18, line: 19, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !232, file: !18, line: 44, baseType: !255, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!250}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !232, file: !18, line: 45, baseType: !259, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !245}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !188, file: !68, line: 144, baseType: !263, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!250, !115}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !188, file: !68, line: 145, baseType: !267, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !115, !270, !278}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !272, line: 23, baseType: !273)
!272 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !272, line: 21, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !273, file: !272, line: 22, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !85, line: 32, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !205, line: 49, baseType: !7)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !272, line: 28, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !272, line: 26, size: 32, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !280, file: !272, line: 27, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !85, line: 33, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !205, line: 50, baseType: !7)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !116, file: !68, line: 70, baseType: !286, size: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !288, line: 123, size: 1024, elements: !289)
!288 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!289 = !{!290, !295, !296, !297, !298, !306, !307, !308, !1529, !1530, !1531, !1532, !1533}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !287, file: !288, line: 124, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !85, line: 168, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 166, size: 32, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !292, file: !85, line: 167, baseType: !91, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !287, file: !288, line: 125, baseType: !291, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !287, file: !288, line: 135, baseType: !286, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !287, file: !288, line: 136, baseType: !106, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !287, file: !288, line: 138, baseType: !299, size: 192, align: 64, offset: 192)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !300, line: 24, size: 192, align: 64, elements: !301)
!300 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!301 = !{!302, !303, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !299, file: !300, line: 25, baseType: !220, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !299, file: !300, line: 26, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !299, file: !300, line: 27, baseType: !304, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !287, file: !288, line: 140, baseType: !250, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !287, file: !288, line: 141, baseType: !7, size: 32, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !288, line: 142, baseType: !309, size: 256, offset: 512)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !288, line: 142, size: 256, elements: !310)
!310 = !{!311, !376, !380}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !309, file: !288, line: 143, baseType: !312, size: 192)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !288, line: 91, size: 192, elements: !313)
!313 = !{!314, !315, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !312, file: !288, line: 92, baseType: !220, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !312, file: !288, line: 94, baseType: !316, size: 64, offset: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !300, line: 31, size: 64, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !316, file: !300, line: 32, baseType: !304, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !312, file: !288, line: 100, baseType: !320, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !288, line: 180, size: 704, elements: !322)
!322 = !{!323, !324, !325, !339, !340, !341, !368, !369}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !321, file: !288, line: 182, baseType: !286, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !288, line: 183, baseType: !7, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !321, file: !288, line: 186, baseType: !326, size: 192, offset: 128)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !327, line: 19, size: 192, elements: !328)
!327 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!328 = !{!329, !337, !338}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !326, file: !327, line: 20, baseType: !330, size: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !331, line: 292, size: 128, elements: !332)
!331 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!332 = !{!333, !334, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !330, file: !331, line: 293, baseType: !132)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !330, file: !331, line: 295, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !85, line: 148, baseType: !7)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !330, file: !331, line: 296, baseType: !245, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !326, file: !327, line: 21, baseType: !7, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !326, file: !327, line: 22, baseType: !7, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !321, file: !288, line: 187, baseType: !96, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !321, file: !288, line: 188, baseType: !96, size: 32, offset: 352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !321, file: !288, line: 189, baseType: !342, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !288, line: 168, size: 320, elements: !344)
!344 = !{!345, !352, !356, !360, !364}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !343, file: !288, line: 169, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!91, !349, !320}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !351, line: 539, flags: DIFlagFwdDecl)
!351 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !343, file: !288, line: 171, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!91, !286, !106, !113}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !343, file: !288, line: 173, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!91, !286}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !343, file: !288, line: 174, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!91, !286, !286, !106}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !343, file: !288, line: 176, baseType: !365, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!91, !349, !286, !320}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !321, file: !288, line: 192, baseType: !120, size: 128, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !321, file: !288, line: 194, baseType: !370, size: 128, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !371, line: 40, baseType: !372)
!371 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !371, line: 36, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !372, file: !371, line: 37, baseType: !132)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !372, file: !371, line: 38, baseType: !120, size: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !309, file: !288, line: 144, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_symlink", file: !288, line: 103, size: 64, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "target_kn", scope: !377, file: !288, line: 104, baseType: !286, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !309, file: !288, line: 145, baseType: !381, size: 256)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_attr", file: !288, line: 107, size: 256, elements: !382)
!382 = !{!383, !1524, !1527, !1528}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !381, file: !288, line: 108, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_ops", file: !288, line: 217, size: 768, elements: !387)
!387 = !{!388, !428, !432, !436, !443, !447, !451, !455, !456, !457, !458, !466}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !386, file: !288, line: 222, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!91, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_file", file: !288, line: 197, size: 1088, elements: !394)
!394 = !{!395, !396, !399, !400, !401, !416, !417, !418, !419, !420, !421, !422, !423}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !393, file: !288, line: 199, baseType: !286, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !393, file: !288, line: 200, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !351, line: 526, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "seq_file", scope: !393, file: !288, line: 201, baseType: !349, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !393, file: !288, line: 202, baseType: !245, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !393, file: !288, line: 205, baseType: !402, size: 192, offset: 256)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !403, line: 53, size: 192, elements: !404)
!403 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!404 = !{!405, !414, !415}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !402, file: !403, line: 54, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !407, line: 13, baseType: !408)
!407 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !85, line: 175, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 173, size: 64, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !409, file: !85, line: 174, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !87, line: 22, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !89, line: 30, baseType: !93)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !402, file: !403, line: 55, baseType: !132, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !402, file: !403, line: 59, baseType: !120, size: 128, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_mutex", scope: !393, file: !288, line: 206, baseType: !402, size: 192, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !393, file: !288, line: 207, baseType: !91, size: 32, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !393, file: !288, line: 208, baseType: !120, size: 128, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_buf", scope: !393, file: !288, line: 209, baseType: !173, size: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !393, file: !288, line: 211, baseType: !217, size: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mmapped", scope: !393, file: !288, line: 212, baseType: !239, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "released", scope: !393, file: !288, line: 213, baseType: !239, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !393, file: !288, line: 214, baseType: !424, size: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !427, line: 356, flags: DIFlagFwdDecl)
!427 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !386, file: !288, line: 223, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !392}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "seq_show", scope: !386, file: !288, line: 236, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!91, !349, !245}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "seq_start", scope: !386, file: !288, line: 238, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!245, !349, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !85, line: 46, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !205, line: 88, baseType: !93)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "seq_next", scope: !386, file: !288, line: 239, baseType: !444, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!245, !349, !245, !440}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "seq_stop", scope: !386, file: !288, line: 240, baseType: !448, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !349, !245}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !386, file: !288, line: 242, baseType: !452, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!203, !392, !173, !217, !441}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !386, file: !288, line: 252, baseType: !217, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !386, file: !288, line: 259, baseType: !239, size: 8, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !386, file: !288, line: 260, baseType: !452, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !386, file: !288, line: 263, baseType: !459, size: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!462, !392, !464}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !463, line: 52, baseType: !7)
!463 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !288, line: 27, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !386, file: !288, line: 266, baseType: !467, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!91, !392, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !427, line: 305, size: 1472, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !1501, !1507, !1508, !1513, !1514, !1517, !1518, !1519, !1520, !1521, !1522}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !471, file: !427, line: 308, baseType: !220, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !471, file: !427, line: 309, baseType: !220, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !471, file: !427, line: 313, baseType: !470, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !471, file: !427, line: 313, baseType: !470, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !471, file: !427, line: 315, baseType: !299, size: 192, align: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !471, file: !427, line: 323, baseType: !220, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !471, file: !427, line: 327, baseType: !480, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !427, line: 388, size: 7296, elements: !482)
!482 = !{!483, !1497}
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !427, line: 389, baseType: !484, size: 7296)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !427, line: 389, size: 7296, elements: !485)
!485 = !{!486, !487, !488, !489, !493, !494, !495, !496, !497, !505, !506, !507, !508, !509, !510, !511, !512, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !547, !555, !558, !584, !585, !1468, !1469, !1472, !1475, !1476, !1479, !1480, !1481, !1484, !1496}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !484, file: !427, line: 390, baseType: !470, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !484, file: !427, line: 391, baseType: !316, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !484, file: !427, line: 392, baseType: !86, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !484, file: !427, line: 394, baseType: !490, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!220, !397, !220, !220, !220, !220}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !484, file: !427, line: 398, baseType: !220, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !484, file: !427, line: 399, baseType: !220, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !484, file: !427, line: 405, baseType: !220, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !484, file: !427, line: 406, baseType: !220, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !484, file: !427, line: 407, baseType: !498, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !351, line: 286, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 286, size: 64, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !500, file: !351, line: 286, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !504, line: 18, baseType: !220)
!504 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !484, file: !427, line: 416, baseType: !291, size: 32, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !484, file: !427, line: 428, baseType: !291, size: 32, offset: 608)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !484, file: !427, line: 437, baseType: !291, size: 32, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !484, file: !427, line: 447, baseType: !291, size: 32, offset: 672)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !484, file: !427, line: 450, baseType: !406, size: 64, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !484, file: !427, line: 452, baseType: !91, size: 32, offset: 768)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !484, file: !427, line: 454, baseType: !132, offset: 800)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !484, file: !427, line: 457, baseType: !513, size: 256, offset: 832)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !514, line: 35, size: 256, elements: !515)
!514 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!515 = !{!516, !517, !518, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !513, file: !514, line: 36, baseType: !406, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !513, file: !514, line: 42, baseType: !406, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !513, file: !514, line: 46, baseType: !519, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !133, line: 29, baseType: !140)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !513, file: !514, line: 47, baseType: !120, size: 128, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !484, file: !427, line: 459, baseType: !120, size: 128, offset: 1088)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !484, file: !427, line: 466, baseType: !220, size: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !484, file: !427, line: 467, baseType: !220, size: 64, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !484, file: !427, line: 469, baseType: !220, size: 64, offset: 1344)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !484, file: !427, line: 470, baseType: !220, size: 64, offset: 1408)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !484, file: !427, line: 471, baseType: !408, size: 64, offset: 1472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !484, file: !427, line: 472, baseType: !220, size: 64, offset: 1536)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !484, file: !427, line: 473, baseType: !220, size: 64, offset: 1600)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !484, file: !427, line: 474, baseType: !220, size: 64, offset: 1664)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !484, file: !427, line: 475, baseType: !220, size: 64, offset: 1728)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !484, file: !427, line: 477, baseType: !132, offset: 1792)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !484, file: !427, line: 478, baseType: !220, size: 64, offset: 1792)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !484, file: !427, line: 478, baseType: !220, size: 64, offset: 1856)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !484, file: !427, line: 478, baseType: !220, size: 64, offset: 1920)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !484, file: !427, line: 478, baseType: !220, size: 64, offset: 1984)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !484, file: !427, line: 479, baseType: !220, size: 64, offset: 2048)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !484, file: !427, line: 479, baseType: !220, size: 64, offset: 2112)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !484, file: !427, line: 479, baseType: !220, size: 64, offset: 2176)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !484, file: !427, line: 480, baseType: !220, size: 64, offset: 2240)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !484, file: !427, line: 480, baseType: !220, size: 64, offset: 2304)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !484, file: !427, line: 480, baseType: !220, size: 64, offset: 2368)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !484, file: !427, line: 480, baseType: !220, size: 64, offset: 2432)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !484, file: !427, line: 482, baseType: !544, size: 2816, offset: 2496)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 2816, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 44)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !484, file: !427, line: 488, baseType: !548, size: 256, offset: 5312)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !549, line: 60, size: 256, elements: !550)
!549 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !548, file: !549, line: 61, baseType: !552, size: 256)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 256, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 4)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !484, file: !427, line: 490, baseType: !556, size: 64, offset: 5568)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !427, line: 490, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !484, file: !427, line: 493, baseType: !559, size: 896, offset: 5632)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !560, line: 53, baseType: !561)
!560 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 13, size: 896, elements: !562)
!562 = !{!563, !564, !565, !566, !569, !570, !571, !572, !576, !577, !580}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !561, file: !560, line: 18, baseType: !86, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !561, file: !560, line: 28, baseType: !408, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !561, file: !560, line: 31, baseType: !513, size: 256, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !561, file: !560, line: 32, baseType: !567, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !560, line: 32, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !561, file: !560, line: 37, baseType: !114, size: 16, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !561, file: !560, line: 40, baseType: !402, size: 192, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !561, file: !560, line: 41, baseType: !245, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !561, file: !560, line: 42, baseType: !573, size: 64, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !560, line: 42, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !561, file: !560, line: 44, baseType: !291, size: 32, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !561, file: !560, line: 50, baseType: !578, size: 16, offset: 864)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !87, line: 19, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !89, line: 24, baseType: !114)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !561, file: !560, line: 51, baseType: !581, size: 16, offset: 880)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !87, line: 18, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !89, line: 23, baseType: !583)
!583 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !484, file: !427, line: 495, baseType: !220, size: 64, offset: 6528)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !484, file: !427, line: 497, baseType: !586, size: 64, offset: 6592)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !427, line: 381, size: 384, elements: !588)
!588 = !{!589, !590, !1467}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !587, file: !427, line: 382, baseType: !291, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !587, file: !427, line: 383, baseType: !591, size: 128, offset: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !427, line: 376, size: 128, elements: !592)
!592 = !{!593, !1465}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !591, file: !427, line: 377, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !596, line: 640, size: 48640, elements: !597)
!596 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!597 = !{!598, !604, !606, !607, !613, !614, !615, !616, !617, !618, !619, !620, !624, !642, !653, !748, !749, !750, !761, !762, !764, !765, !766, !767, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !844, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !894, !896, !897, !898, !910, !912, !913, !914, !915, !916, !922, !923, !924, !925, !926, !927, !928, !940, !945, !949, !950, !951, !954, !958, !961, !964, !967, !970, !973, !976, !979, !985, !986, !987, !993, !994, !995, !996, !997, !1006, !1007, !1008, !1009, !1010, !1015, !1016, !1017, !1020, !1021, !1024, !1027, !1030, !1033, !1036, !1039, !1040, !1119, !1122, !1125, !1126, !1129, !1130, !1131, !1137, !1138, !1139, !1152, !1153, !1154, !1164, !1169, !1172, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !595, file: !596, line: 646, baseType: !599, size: 128)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !600, line: 56, size: 128, elements: !601)
!600 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !600, line: 57, baseType: !220, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !599, file: !600, line: 58, baseType: !96, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !595, file: !596, line: 649, baseType: !605, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !207)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !595, file: !596, line: 657, baseType: !245, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !595, file: !596, line: 658, baseType: !608, size: 32, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !609, line: 113, baseType: !610)
!609 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !609, line: 111, size: 32, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !610, file: !609, line: 112, baseType: !291, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !595, file: !596, line: 660, baseType: !7, size: 32, offset: 288)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !595, file: !596, line: 661, baseType: !7, size: 32, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !595, file: !596, line: 684, baseType: !91, size: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !595, file: !596, line: 686, baseType: !91, size: 32, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !595, file: !596, line: 687, baseType: !91, size: 32, offset: 416)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !595, file: !596, line: 688, baseType: !91, size: 32, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !595, file: !596, line: 689, baseType: !7, size: 32, offset: 480)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !595, file: !596, line: 691, baseType: !621, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !596, line: 691, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !595, file: !596, line: 692, baseType: !625, size: 832, offset: 576)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !596, line: 451, size: 832, elements: !626)
!626 = !{!627, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !625, file: !596, line: 453, baseType: !628, size: 128)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !596, line: 325, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !628, file: !596, line: 326, baseType: !220, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !628, file: !596, line: 327, baseType: !96, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !625, file: !596, line: 454, baseType: !299, size: 192, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !625, file: !596, line: 455, baseType: !120, size: 128, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !625, file: !596, line: 456, baseType: !7, size: 32, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !625, file: !596, line: 458, baseType: !86, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !625, file: !596, line: 459, baseType: !86, size: 64, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !625, file: !596, line: 460, baseType: !86, size: 64, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !625, file: !596, line: 461, baseType: !86, size: 64, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !625, file: !596, line: 463, baseType: !86, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !625, file: !596, line: 465, baseType: !641, offset: 832)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !596, line: 415, elements: !146)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !595, file: !596, line: 693, baseType: !643, size: 384, offset: 1408)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !596, line: 489, size: 384, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !643, file: !596, line: 490, baseType: !120, size: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !643, file: !596, line: 491, baseType: !220, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !643, file: !596, line: 492, baseType: !220, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !643, file: !596, line: 493, baseType: !7, size: 32, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !643, file: !596, line: 494, baseType: !114, size: 16, offset: 288)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !643, file: !596, line: 495, baseType: !114, size: 16, offset: 304)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !643, file: !596, line: 497, baseType: !652, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !595, file: !596, line: 697, baseType: !654, size: 1792, offset: 1792)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !596, line: 507, size: 1792, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !745, !746}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !654, file: !596, line: 508, baseType: !299, size: 192, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !654, file: !596, line: 515, baseType: !86, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !654, file: !596, line: 516, baseType: !86, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !654, file: !596, line: 517, baseType: !86, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !654, file: !596, line: 518, baseType: !86, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !654, file: !596, line: 519, baseType: !86, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !654, file: !596, line: 526, baseType: !412, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !654, file: !596, line: 527, baseType: !86, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !596, line: 528, baseType: !7, size: 32, offset: 640)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !654, file: !596, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !654, file: !596, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !654, file: !596, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !654, file: !596, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !654, file: !596, line: 563, baseType: !670, size: 512, offset: 704)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !671)
!671 = !{!672, !680, !681, !686, !738, !742, !743, !744}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !670, file: !6, line: 119, baseType: !673, size: 256)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !674, line: 9, size: 256, elements: !675)
!674 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !673, file: !674, line: 10, baseType: !299, size: 192, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !673, file: !674, line: 11, baseType: !678, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !679, line: 29, baseType: !412)
!679 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !670, file: !6, line: 120, baseType: !678, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !670, file: !6, line: 121, baseType: !682, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!5, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !670, file: !6, line: 122, baseType: !687, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !689)
!689 = !{!690, !710, !711, !714, !724, !725, !733, !737}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !688, file: !6, line: 160, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !692, file: !6, line: 215, baseType: !519)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !692, file: !6, line: 216, baseType: !7, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !692, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !692, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !692, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !692, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !692, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !692, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !692, file: !6, line: 233, baseType: !678, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !692, file: !6, line: 234, baseType: !685, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !692, file: !6, line: 235, baseType: !678, size: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !692, file: !6, line: 236, baseType: !685, size: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !692, file: !6, line: 237, baseType: !707, size: 4096, offset: 512)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 4096, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !688, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !688, file: !6, line: 162, baseType: !712, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !85, line: 27, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !205, line: 96, baseType: !91)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !688, file: !6, line: 163, baseType: !715, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !716, line: 276, baseType: !717)
!716 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !716, line: 276, size: 32, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !717, file: !716, line: 276, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !716, line: 70, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !716, line: 65, size: 32, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !721, file: !716, line: 66, baseType: !7, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !688, file: !6, line: 164, baseType: !685, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !688, file: !6, line: 165, baseType: !726, size: 128, offset: 256)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !674, line: 14, size: 128, elements: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !726, file: !674, line: 15, baseType: !729, size: 128)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !300, line: 125, size: 128, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !729, file: !300, line: 126, baseType: !316, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !729, file: !300, line: 127, baseType: !304, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !688, file: !6, line: 166, baseType: !734, size: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!678}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !688, file: !6, line: 167, baseType: !678, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !670, file: !6, line: 123, baseType: !739, size: 8, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !87, line: 17, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !89, line: 21, baseType: !741)
!741 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !670, file: !6, line: 124, baseType: !739, size: 8, offset: 456)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !670, file: !6, line: 125, baseType: !739, size: 8, offset: 464)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !670, file: !6, line: 126, baseType: !739, size: 8, offset: 472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !654, file: !596, line: 572, baseType: !670, size: 512, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !654, file: !596, line: 580, baseType: !747, size: 64, offset: 1728)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !595, file: !596, line: 721, baseType: !7, size: 32, offset: 3584)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !595, file: !596, line: 722, baseType: !91, size: 32, offset: 3616)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !595, file: !596, line: 723, baseType: !751, size: 64, offset: 3648)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !754, line: 17, baseType: !755)
!754 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !754, line: 17, size: 64, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !755, file: !754, line: 17, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 64, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 1)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !595, file: !596, line: 724, baseType: !753, size: 64, offset: 3712)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !595, file: !596, line: 749, baseType: !763, offset: 3776)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !596, line: 290, elements: !146)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !595, file: !596, line: 751, baseType: !120, size: 128, offset: 3776)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !595, file: !596, line: 757, baseType: !480, size: 64, offset: 3904)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !595, file: !596, line: 758, baseType: !480, size: 64, offset: 3968)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !595, file: !596, line: 761, baseType: !768, size: 320, offset: 4032)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !549, line: 34, size: 320, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !768, file: !549, line: 35, baseType: !86, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !768, file: !549, line: 36, baseType: !772, size: 256, offset: 64)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 256, elements: !553)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !595, file: !596, line: 766, baseType: !91, size: 32, offset: 4352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !595, file: !596, line: 767, baseType: !91, size: 32, offset: 4384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !595, file: !596, line: 768, baseType: !91, size: 32, offset: 4416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !595, file: !596, line: 770, baseType: !91, size: 32, offset: 4448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !595, file: !596, line: 772, baseType: !220, size: 64, offset: 4480)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !595, file: !596, line: 775, baseType: !7, size: 32, offset: 4544)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !595, file: !596, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !595, file: !596, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !595, file: !596, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !595, file: !596, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !595, file: !596, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !595, file: !596, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !595, file: !596, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !595, file: !596, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !595, file: !596, line: 831, baseType: !220, size: 64, offset: 4672)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !595, file: !596, line: 833, baseType: !789, size: 384, offset: 4736)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !790)
!790 = !{!791, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !789, file: !12, line: 26, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!207, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, scope: !789, file: !12, line: 27, baseType: !797, size: 320, offset: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !789, file: !12, line: 27, size: 320, elements: !798)
!798 = !{!799, !809, !834}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !797, file: !12, line: 36, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !12, line: 29, size: 320, elements: !801)
!801 = !{!802, !804, !805, !806, !807, !808}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !800, file: !12, line: 30, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !800, file: !12, line: 31, baseType: !96, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !800, file: !12, line: 32, baseType: !96, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !800, file: !12, line: 33, baseType: !96, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !800, file: !12, line: 34, baseType: !86, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !800, file: !12, line: 35, baseType: !803, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !797, file: !12, line: 46, baseType: !810, size: 192)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !12, line: 38, size: 192, elements: !811)
!811 = !{!812, !813, !814, !833}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !810, file: !12, line: 39, baseType: !712, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, scope: !810, file: !12, line: 41, baseType: !815, size: 64, offset: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !810, file: !12, line: 41, size: 64, elements: !816)
!816 = !{!817, !825}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !815, file: !12, line: 42, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !820, line: 7, size: 128, elements: !821)
!820 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!821 = !{!822, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !819, file: !820, line: 8, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !205, line: 93, baseType: !93)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !819, file: !820, line: 9, baseType: !93, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !815, file: !12, line: 43, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !828, line: 7, size: 64, elements: !829)
!828 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!829 = !{!830, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !827, file: !828, line: 8, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !828, line: 5, baseType: !94)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !827, file: !828, line: 9, baseType: !94, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !810, file: !12, line: 45, baseType: !86, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !797, file: !12, line: 54, baseType: !835, size: 256)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !12, line: 48, size: 256, elements: !836)
!836 = !{!837, !840, !841, !842, !843}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !835, file: !12, line: 49, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !835, file: !12, line: 50, baseType: !91, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !835, file: !12, line: 51, baseType: !91, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !835, file: !12, line: 52, baseType: !220, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !835, file: !12, line: 53, baseType: !220, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !595, file: !596, line: 835, baseType: !845, size: 32, offset: 5120)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !85, line: 22, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !205, line: 28, baseType: !91)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !595, file: !596, line: 836, baseType: !845, size: 32, offset: 5152)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !595, file: !596, line: 840, baseType: !220, size: 64, offset: 5184)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !595, file: !596, line: 849, baseType: !594, size: 64, offset: 5248)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !595, file: !596, line: 852, baseType: !594, size: 64, offset: 5312)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !595, file: !596, line: 857, baseType: !120, size: 128, offset: 5376)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !595, file: !596, line: 858, baseType: !120, size: 128, offset: 5504)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !595, file: !596, line: 859, baseType: !594, size: 64, offset: 5632)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !595, file: !596, line: 867, baseType: !120, size: 128, offset: 5696)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !595, file: !596, line: 868, baseType: !120, size: 128, offset: 5824)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !595, file: !596, line: 871, baseType: !857, size: 64, offset: 5952)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !859, line: 59, size: 768, elements: !860)
!859 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862, !863, !864, !875, !876, !877, !886}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !858, file: !859, line: 61, baseType: !608, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !858, file: !859, line: 62, baseType: !7, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !858, file: !859, line: 63, baseType: !132, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !858, file: !859, line: 65, baseType: !865, size: 256, offset: 64)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 256, elements: !553)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !85, line: 182, size: 64, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !866, file: !85, line: 183, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !85, line: 186, size: 128, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !85, line: 187, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !870, file: !85, line: 187, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !858, file: !859, line: 66, baseType: !866, size: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !858, file: !859, line: 68, baseType: !370, size: 128, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !858, file: !859, line: 69, baseType: !878, size: 128, align: 64, offset: 512)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !85, line: 216, size: 128, align: 64, elements: !879)
!879 = !{!880, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !878, file: !85, line: 217, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !878, file: !85, line: 218, baseType: !883, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !881}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !858, file: !859, line: 70, baseType: !887, size: 128, offset: 640)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, elements: !759)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !859, line: 54, size: 128, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !888, file: !859, line: 55, baseType: !91, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !888, file: !859, line: 56, baseType: !892, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !859, line: 56, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !595, file: !596, line: 872, baseType: !895, size: 512, offset: 6016)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 512, elements: !553)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !595, file: !596, line: 873, baseType: !120, size: 128, offset: 6528)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !595, file: !596, line: 874, baseType: !120, size: 128, offset: 6656)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !595, file: !596, line: 876, baseType: !899, size: 64, offset: 6784)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !901, line: 26, size: 192, elements: !902)
!901 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !900, file: !901, line: 27, baseType: !7, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !900, file: !901, line: 28, baseType: !905, size: 128, offset: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !906, line: 43, size: 128, elements: !907)
!906 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !905, file: !906, line: 44, baseType: !519)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !905, file: !906, line: 45, baseType: !120, size: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !595, file: !596, line: 879, baseType: !911, size: 64, offset: 6848)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !595, file: !596, line: 882, baseType: !911, size: 64, offset: 6912)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !595, file: !596, line: 884, baseType: !86, size: 64, offset: 6976)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !595, file: !596, line: 885, baseType: !86, size: 64, offset: 7040)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !595, file: !596, line: 890, baseType: !86, size: 64, offset: 7104)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !595, file: !596, line: 891, baseType: !917, size: 128, offset: 7168)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !596, line: 242, size: 128, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !917, file: !596, line: 244, baseType: !86, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !917, file: !596, line: 245, baseType: !86, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !917, file: !596, line: 246, baseType: !519, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !595, file: !596, line: 900, baseType: !220, size: 64, offset: 7296)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !595, file: !596, line: 901, baseType: !220, size: 64, offset: 7360)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !595, file: !596, line: 904, baseType: !86, size: 64, offset: 7424)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !595, file: !596, line: 907, baseType: !86, size: 64, offset: 7488)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !595, file: !596, line: 910, baseType: !220, size: 64, offset: 7552)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !595, file: !596, line: 911, baseType: !220, size: 64, offset: 7616)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !595, file: !596, line: 914, baseType: !929, size: 640, offset: 7680)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !930, line: 123, size: 640, elements: !931)
!930 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!931 = !{!932, !938, !939}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !929, file: !930, line: 124, baseType: !933, size: 576)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 576, elements: !174)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !930, line: 108, size: 192, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !934, file: !930, line: 109, baseType: !86, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !934, file: !930, line: 110, baseType: !726, size: 128, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !929, file: !930, line: 125, baseType: !7, size: 32, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !929, file: !930, line: 126, baseType: !7, size: 32, offset: 608)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !595, file: !596, line: 917, baseType: !941, size: 192, offset: 8320)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !930, line: 134, size: 192, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !941, file: !930, line: 135, baseType: !878, size: 128, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !941, file: !930, line: 136, baseType: !7, size: 32, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !595, file: !596, line: 923, baseType: !946, size: 64, offset: 8512)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !596, line: 923, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !595, file: !596, line: 926, baseType: !946, size: 64, offset: 8576)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !595, file: !596, line: 929, baseType: !946, size: 64, offset: 8640)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !595, file: !596, line: 933, baseType: !952, size: 64, offset: 8704)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !596, line: 933, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !595, file: !596, line: 943, baseType: !955, size: 128, offset: 8768)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 16)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !595, file: !596, line: 945, baseType: !959, size: 64, offset: 8896)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !596, line: 49, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !595, file: !596, line: 956, baseType: !962, size: 64, offset: 8960)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !596, line: 45, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !595, file: !596, line: 959, baseType: !965, size: 64, offset: 9024)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !596, line: 959, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !595, file: !596, line: 962, baseType: !968, size: 64, offset: 9088)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !596, line: 66, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !595, file: !596, line: 966, baseType: !971, size: 64, offset: 9152)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !596, line: 50, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !595, file: !596, line: 969, baseType: !974, size: 64, offset: 9216)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !930, line: 223, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !595, file: !596, line: 970, baseType: !977, size: 64, offset: 9280)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !596, line: 62, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !595, file: !596, line: 971, baseType: !980, size: 64, offset: 9344)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !981, line: 25, baseType: !982)
!981 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !981, line: 23, size: 64, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !982, file: !981, line: 24, baseType: !758, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !595, file: !596, line: 972, baseType: !980, size: 64, offset: 9408)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !595, file: !596, line: 974, baseType: !980, size: 64, offset: 9472)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !595, file: !596, line: 975, baseType: !988, size: 192, offset: 9536)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !989, line: 30, size: 192, elements: !990)
!989 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !988, file: !989, line: 31, baseType: !120, size: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !988, file: !989, line: 32, baseType: !980, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !595, file: !596, line: 976, baseType: !220, size: 64, offset: 9728)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !595, file: !596, line: 977, baseType: !217, size: 64, offset: 9792)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !595, file: !596, line: 978, baseType: !7, size: 32, offset: 9856)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !595, file: !596, line: 980, baseType: !881, size: 64, offset: 9920)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !595, file: !596, line: 989, baseType: !998, size: 128, offset: 9984)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !999, line: 35, size: 128, elements: !1000)
!999 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !998, file: !999, line: 36, baseType: !91, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !998, file: !999, line: 37, baseType: !291, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !998, file: !999, line: 38, baseType: !1004, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
