; ModuleID = '../bcout/drivers/base/power/wakeup_stats.llvm.bc'
source_filename = "drivers/base/power/wakeup_stats.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall2.init\22, \22a\22\09"
module asm "__initcall_wakeup_sources_sysfs_init2:\09\09\09"
module asm ".long\09wakeup_sources_sysfs_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.class = type { i8*, %struct.module*, %struct.attribute_group**, %struct.attribute_group**, %struct.kobject*, i32 (%struct.device*, %struct.kobj_uevent_env*)*, i8* (%struct.device*, i16*)*, void (%struct.class*)*, void (%struct.device*)*, i32 (%struct.device*)*, %struct.kobj_ns_type_operations*, i8* (%struct.device*)*, void (%struct.device*, %struct.kuid_t*, %struct.kgid_t*)*, %struct.dev_pm_ops*, %struct.subsys_private* }
%struct.module = type opaque
%struct.attribute_group = type { i8*, i16 (%struct.kobject*, %struct.attribute*, i32)*, i16 (%struct.kobject*, %struct.bin_attribute*, i32)*, %struct.attribute**, %struct.bin_attribute** }
%struct.attribute = type { i8*, i16 }
%struct.bin_attribute = type { %struct.attribute, i64, i8*, i64 (%struct.file*, %struct.kobject*, %struct.bin_attribute*, i8*, i64, i64)*, i64 (%struct.file*, %struct.kobject*, %struct.bin_attribute*, i8*, i64, i64)*, i32 (%struct.file*, %struct.kobject*, %struct.bin_attribute*, %struct.vm_area_struct*)* }
%struct.file = type opaque

!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_qos_type", file: !51, line: 41, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/pm_qos.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PM_QOS_UNITIALIZED", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PM_QOS_MAX", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PM_QOS_MIN", value: 2, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_pm_qos_req_type", file: !51, line: 99, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIEnumerator(name: "DEV_PM_QOS_RESUME_LATENCY", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "DEV_PM_QOS_LATENCY_TOLERANCE", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "DEV_PM_QOS_MIN_FREQUENCY", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "DEV_PM_QOS_MAX_FREQUENCY", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "DEV_PM_QOS_FLAGS", value: 5, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "freq_qos_req_type", file: !51, line: 80, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "FREQ_QOS_MIN", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "FREQ_QOS_MAX", value: 2, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !68, line: 305, baseType: !7, size: 32, elements: !69)
!68 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!69 = !{!70, !71, !72, !73}
!70 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 10, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!76 = !{!77, !78}
!77 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!79 = !{!80, !82, !83, !84, !85}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !81, line: 148, baseType: !7)
!81 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !87, line: 76, flags: DIFlagFwdDecl)
!87 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!0, !89, !1993, !1996, !1998, !2003, !2017, !2019, !2021, !2023, !2025, !2027, !2029, !2031, !2033, !2035}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "wakeup_class", scope: !2, file: !3, line: 21, type: !91, isLocal: true, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "class", file: !93, line: 54, size: 960, elements: !94)
!93 = !DIFile(filename: "./include/linux/device/class.h", directory: "/home/lizy2001/genbc/linux")
!94 = !{!95, !99, !100, !1573, !1574, !1575, !1972, !1976, !1980, !1981, !1982, !1983, !1987, !1991, !1992}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !93, line: 55, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !92, file: !93, line: 56, baseType: !85, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "class_groups", scope: !92, file: !93, line: 58, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !105, line: 84, size: 320, elements: !106)
!105 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!106 = !{!107, !108, !1551, !1570, !1571}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !105, line: 85, baseType: !96, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !104, file: !105, line: 86, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !114, !208, !158}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !81, line: 19, baseType: !113)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !116, line: 64, size: 512, elements: !117)
!116 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!117 = !{!118, !119, !125, !126, !187, !281, !1541, !1546, !1547, !1548, !1549, !1550}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !116, line: 65, baseType: !96, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !115, file: !116, line: 66, baseType: !120, size: 128, offset: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !81, line: 178, size: 128, elements: !121)
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !81, line: 179, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !81, line: 179, baseType: !123, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !115, file: !116, line: 67, baseType: !114, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !115, file: !116, line: 68, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !116, line: 192, size: 704, elements: !129)
!129 = !{!130, !131, !147, !148}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !128, file: !116, line: 193, baseType: !120, size: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !128, file: !116, line: 194, baseType: !132, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !133, line: 83, baseType: !134)
!133 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !133, line: 71, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !133, line: 72, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !133, line: 72, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !137, file: !133, line: 73, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !133, line: 20, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !140, file: !133, line: 21, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !144, line: 25, baseType: !145)
!144 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 25, elements: !146)
!146 = !{}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !128, file: !116, line: 195, baseType: !115, size: 512, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !128, file: !116, line: 196, baseType: !149, size: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !116, line: 156, size: 192, elements: !152)
!152 = !{!153, !159, !164}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !151, file: !116, line: 157, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !127, !114}
!158 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !116, line: 158, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!96, !127, !114}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !151, file: !116, line: 159, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!158, !127, !114, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !116, line: 148, size: 20736, elements: !171)
!171 = !{!172, !177, !181, !182, !186}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !170, file: !116, line: 149, baseType: !173, size: 192)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 192, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !170, file: !116, line: 150, baseType: !178, size: 4096, offset: 192)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 4096, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !170, file: !116, line: 151, baseType: !158, size: 32, offset: 4288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !170, file: !116, line: 152, baseType: !183, size: 16384, offset: 4320)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 16384, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !170, file: !116, line: 153, baseType: !158, size: 32, offset: 20704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !115, file: !116, line: 69, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !116, line: 138, size: 448, elements: !190)
!190 = !{!191, !195, !220, !222, !223, !258, !262}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !189, file: !116, line: 139, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !114}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !189, file: !116, line: 140, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !105, line: 230, size: 128, elements: !199)
!199 = !{!200, !213}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !198, file: !105, line: 231, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !114, !208, !174}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !81, line: 60, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !206, line: 73, baseType: !207)
!206 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !206, line: 15, baseType: !84)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !105, line: 30, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !105, line: 31, baseType: !96, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !209, file: !105, line: 32, baseType: !112, size: 16, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !198, file: !105, line: 232, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!204, !114, !208, !96, !217}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 55, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !206, line: 72, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !206, line: 16, baseType: !83)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !189, file: !116, line: 141, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !189, file: !116, line: 142, baseType: !101, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !189, file: !116, line: 143, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !114}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !18, line: 39, size: 384, elements: !230)
!230 = !{!231, !232, !238, !242, !250, !254}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !18, line: 40, baseType: !17, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !229, file: !18, line: 41, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !81, line: 30, baseType: !237)
!237 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !229, file: !18, line: 42, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!82}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !229, file: !18, line: 43, baseType: !243, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !18, line: 19, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !229, file: !18, line: 44, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!246}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !229, file: !18, line: 45, baseType: !255, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !82}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !189, file: !116, line: 144, baseType: !259, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!246, !114}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !189, file: !116, line: 145, baseType: !263, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !114, !266, !274}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !268, line: 23, baseType: !269)
!268 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 21, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !269, file: !268, line: 22, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !81, line: 32, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !206, line: 49, baseType: !7)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !268, line: 28, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 26, size: 32, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !276, file: !268, line: 27, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !81, line: 33, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !206, line: 50, baseType: !7)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !115, file: !116, line: 70, baseType: !282, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !284, line: 123, size: 1024, elements: !285)
!284 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!285 = !{!286, !291, !292, !293, !294, !302, !303, !304, !1534, !1535, !1536, !1537, !1538}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !283, file: !284, line: 124, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !81, line: 168, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 166, size: 32, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !288, file: !81, line: 167, baseType: !158, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !283, file: !284, line: 125, baseType: !287, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !283, file: !284, line: 135, baseType: !282, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !284, line: 136, baseType: !96, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !283, file: !284, line: 138, baseType: !295, size: 192, align: 64, offset: 192)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !296, line: 24, size: 192, align: 64, elements: !297)
!296 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !299, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !295, file: !296, line: 25, baseType: !83, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !295, file: !296, line: 26, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !295, file: !296, line: 27, baseType: !300, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !283, file: !284, line: 140, baseType: !246, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !283, file: !284, line: 141, baseType: !7, size: 32, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !284, line: 142, baseType: !305, size: 256, offset: 512)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !283, file: !284, line: 142, size: 256, elements: !306)
!306 = !{!307, !375, !379}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !305, file: !284, line: 143, baseType: !308, size: 192)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !284, line: 91, size: 192, elements: !309)
!309 = !{!310, !311, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !308, file: !284, line: 92, baseType: !83, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !308, file: !284, line: 94, baseType: !312, size: 64, offset: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !296, line: 31, size: 64, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !312, file: !296, line: 32, baseType: !300, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !308, file: !284, line: 100, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !284, line: 180, size: 704, elements: !318)
!318 = !{!319, !320, !321, !334, !339, !340, !367, !368}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !317, file: !284, line: 182, baseType: !282, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !284, line: 183, baseType: !7, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !317, file: !284, line: 186, baseType: !322, size: 192, offset: 128)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !323, line: 19, size: 192, elements: !324)
!323 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!324 = !{!325, !332, !333}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !322, file: !323, line: 20, baseType: !326, size: 128)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !327, line: 292, size: 128, elements: !328)
!327 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !326, file: !327, line: 293, baseType: !132)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !326, file: !327, line: 295, baseType: !80, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !326, file: !327, line: 296, baseType: !82, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !322, file: !323, line: 21, baseType: !7, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !322, file: !323, line: 22, baseType: !7, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !317, file: !284, line: 187, baseType: !335, size: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !336, line: 21, baseType: !337)
!336 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !338, line: 27, baseType: !7)
!338 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !317, file: !284, line: 188, baseType: !335, size: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !317, file: !284, line: 189, baseType: !341, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !284, line: 168, size: 320, elements: !343)
!343 = !{!344, !351, !355, !359, !363}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !342, file: !284, line: 169, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!158, !348, !316}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !350, line: 539, flags: DIFlagFwdDecl)
!350 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !342, file: !284, line: 171, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!158, !282, !96, !112}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !342, file: !284, line: 173, baseType: !356, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!158, !282}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !342, file: !284, line: 174, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!158, !282, !282, !96}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !342, file: !284, line: 176, baseType: !364, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!158, !348, !282, !316}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !317, file: !284, line: 192, baseType: !120, size: 128, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !317, file: !284, line: 194, baseType: !369, size: 128, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !370, line: 40, baseType: !371)
!370 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !370, line: 36, size: 128, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !371, file: !370, line: 37, baseType: !132)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !370, line: 38, baseType: !120, size: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !305, file: !284, line: 144, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_symlink", file: !284, line: 103, size: 64, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "target_kn", scope: !376, file: !284, line: 104, baseType: !282, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !305, file: !284, line: 145, baseType: !380, size: 256)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_attr", file: !284, line: 107, size: 256, elements: !381)
!381 = !{!382, !1529, !1532, !1533}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !380, file: !284, line: 108, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_ops", file: !284, line: 217, size: 768, elements: !386)
!386 = !{!387, !428, !432, !436, !443, !447, !451, !455, !456, !457, !458, !466}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !385, file: !284, line: 222, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!158, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_file", file: !284, line: 197, size: 1088, elements: !393)
!393 = !{!394, !395, !398, !399, !400, !416, !417, !418, !419, !420, !421, !422, !423}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !392, file: !284, line: 199, baseType: !282, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !392, file: !284, line: 200, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !350, line: 526, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "seq_file", scope: !392, file: !284, line: 201, baseType: !348, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !392, file: !284, line: 202, baseType: !82, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !392, file: !284, line: 205, baseType: !401, size: 192, offset: 256)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !402, line: 53, size: 192, elements: !403)
!402 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!403 = !{!404, !414, !415}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !401, file: !402, line: 54, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !406, line: 13, baseType: !407)
!406 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !81, line: 175, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 173, size: 64, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !408, file: !81, line: 174, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !336, line: 22, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !338, line: 30, baseType: !413)
!413 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !401, file: !402, line: 55, baseType: !132, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !401, file: !402, line: 59, baseType: !120, size: 128, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_mutex", scope: !392, file: !284, line: 206, baseType: !401, size: 192, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !392, file: !284, line: 207, baseType: !158, size: 32, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !392, file: !284, line: 208, baseType: !120, size: 128, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_buf", scope: !392, file: !284, line: 209, baseType: !174, size: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !392, file: !284, line: 211, baseType: !217, size: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mmapped", scope: !392, file: !284, line: 212, baseType: !236, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "released", scope: !392, file: !284, line: 213, baseType: !236, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !392, file: !284, line: 214, baseType: !424, size: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !427, line: 356, flags: DIFlagFwdDecl)
!427 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !385, file: !284, line: 223, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !391}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "seq_show", scope: !385, file: !284, line: 236, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!158, !348, !82}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "seq_start", scope: !385, file: !284, line: 238, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!82, !348, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !81, line: 46, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !206, line: 88, baseType: !413)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "seq_next", scope: !385, file: !284, line: 239, baseType: !444, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!82, !348, !82, !440}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "seq_stop", scope: !385, file: !284, line: 240, baseType: !448, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !348, !82}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !385, file: !284, line: 242, baseType: !452, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!204, !391, !174, !217, !441}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !385, file: !284, line: 252, baseType: !217, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !385, file: !284, line: 259, baseType: !236, size: 8, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !385, file: !284, line: 260, baseType: !452, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !385, file: !284, line: 263, baseType: !459, size: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!462, !391, !464}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !463, line: 52, baseType: !7)
!463 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !284, line: 27, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !385, file: !284, line: 266, baseType: !467, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!158, !391, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !427, line: 305, size: 1472, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !1506, !1512, !1513, !1518, !1519, !1522, !1523, !1524, !1525, !1526, !1527}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !471, file: !427, line: 308, baseType: !83, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !471, file: !427, line: 309, baseType: !83, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !471, file: !427, line: 313, baseType: !470, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !471, file: !427, line: 313, baseType: !470, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !471, file: !427, line: 315, baseType: !295, size: 192, align: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !471, file: !427, line: 323, baseType: !83, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !471, file: !427, line: 327, baseType: !480, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !427, line: 388, size: 7296, elements: !482)
!482 = !{!483, !1502}
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !427, line: 389, baseType: !484, size: 7296)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !427, line: 389, size: 7296, elements: !485)
!485 = !{!486, !487, !488, !492, !496, !497, !498, !499, !500, !508, !509, !510, !511, !512, !513, !514, !515, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !550, !558, !561, !587, !588, !1473, !1474, !1477, !1480, !1481, !1484, !1485, !1486, !1489, !1501}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !484, file: !427, line: 390, baseType: !470, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !484, file: !427, line: 391, baseType: !312, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !484, file: !427, line: 392, baseType: !489, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !336, line: 23, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !338, line: 31, baseType: !491)
!491 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !484, file: !427, line: 394, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!83, !396, !83, !83, !83, !83}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !484, file: !427, line: 398, baseType: !83, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !484, file: !427, line: 399, baseType: !83, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !484, file: !427, line: 405, baseType: !83, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !484, file: !427, line: 406, baseType: !83, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !484, file: !427, line: 407, baseType: !501, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !350, line: 286, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 286, size: 64, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !503, file: !350, line: 286, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !507, line: 18, baseType: !83)
!507 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !484, file: !427, line: 416, baseType: !287, size: 32, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !484, file: !427, line: 428, baseType: !287, size: 32, offset: 608)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !484, file: !427, line: 437, baseType: !287, size: 32, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !484, file: !427, line: 447, baseType: !287, size: 32, offset: 672)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !484, file: !427, line: 450, baseType: !405, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !484, file: !427, line: 452, baseType: !158, size: 32, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !484, file: !427, line: 454, baseType: !132, offset: 800)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !484, file: !427, line: 457, baseType: !516, size: 256, offset: 832)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !517, line: 35, size: 256, elements: !518)
!517 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!518 = !{!519, !520, !521, !523}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !516, file: !517, line: 36, baseType: !405, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !516, file: !517, line: 42, baseType: !405, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !516, file: !517, line: 46, baseType: !522, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !133, line: 29, baseType: !140)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !516, file: !517, line: 47, baseType: !120, size: 128, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !484, file: !427, line: 459, baseType: !120, size: 128, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !484, file: !427, line: 466, baseType: !83, size: 64, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !484, file: !427, line: 467, baseType: !83, size: 64, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !484, file: !427, line: 469, baseType: !83, size: 64, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !484, file: !427, line: 470, baseType: !83, size: 64, offset: 1408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !484, file: !427, line: 471, baseType: !407, size: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !484, file: !427, line: 472, baseType: !83, size: 64, offset: 1536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !484, file: !427, line: 473, baseType: !83, size: 64, offset: 1600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !484, file: !427, line: 474, baseType: !83, size: 64, offset: 1664)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !484, file: !427, line: 475, baseType: !83, size: 64, offset: 1728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !484, file: !427, line: 477, baseType: !132, offset: 1792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !484, file: !427, line: 478, baseType: !83, size: 64, offset: 1792)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !484, file: !427, line: 478, baseType: !83, size: 64, offset: 1856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !484, file: !427, line: 478, baseType: !83, size: 64, offset: 1920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !484, file: !427, line: 478, baseType: !83, size: 64, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !484, file: !427, line: 479, baseType: !83, size: 64, offset: 2048)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !484, file: !427, line: 479, baseType: !83, size: 64, offset: 2112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !484, file: !427, line: 479, baseType: !83, size: 64, offset: 2176)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !484, file: !427, line: 480, baseType: !83, size: 64, offset: 2240)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !484, file: !427, line: 480, baseType: !83, size: 64, offset: 2304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !484, file: !427, line: 480, baseType: !83, size: 64, offset: 2368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !484, file: !427, line: 480, baseType: !83, size: 64, offset: 2432)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !484, file: !427, line: 482, baseType: !547, size: 2816, offset: 2496)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2816, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 44)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !484, file: !427, line: 488, baseType: !551, size: 256, offset: 5312)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !552, line: 60, size: 256, elements: !553)
!552 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !551, file: !552, line: 61, baseType: !555, size: 256)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 256, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 4)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !484, file: !427, line: 490, baseType: !559, size: 64, offset: 5568)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !427, line: 490, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !484, file: !427, line: 493, baseType: !562, size: 896, offset: 5632)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !563, line: 53, baseType: !564)
!563 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 13, size: 896, elements: !565)
!565 = !{!566, !567, !568, !569, !572, !573, !574, !575, !579, !580, !583}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !564, file: !563, line: 18, baseType: !489, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !564, file: !563, line: 28, baseType: !407, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !564, file: !563, line: 31, baseType: !516, size: 256, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !564, file: !563, line: 32, baseType: !570, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !563, line: 32, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !564, file: !563, line: 37, baseType: !113, size: 16, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !564, file: !563, line: 40, baseType: !401, size: 192, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !564, file: !563, line: 41, baseType: !82, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !564, file: !563, line: 42, baseType: !576, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !563, line: 42, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !564, file: !563, line: 44, baseType: !287, size: 32, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !564, file: !563, line: 50, baseType: !581, size: 16, offset: 864)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !336, line: 19, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !338, line: 24, baseType: !113)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !564, file: !563, line: 51, baseType: !584, size: 16, offset: 880)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !336, line: 18, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !338, line: 23, baseType: !586)
!586 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !484, file: !427, line: 495, baseType: !83, size: 64, offset: 6528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !484, file: !427, line: 497, baseType: !589, size: 64, offset: 6592)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !427, line: 381, size: 384, elements: !591)
!591 = !{!592, !593, !1472}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !590, file: !427, line: 382, baseType: !287, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !590, file: !427, line: 383, baseType: !594, size: 128, offset: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !427, line: 376, size: 128, elements: !595)
!595 = !{!596, !1470}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !594, file: !427, line: 377, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !599, line: 640, size: 48640, elements: !600)
!599 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!600 = !{!601, !607, !609, !610, !616, !617, !618, !619, !620, !621, !622, !623, !627, !645, !656, !751, !752, !753, !764, !765, !767, !768, !769, !770, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !849, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !899, !901, !902, !903, !915, !917, !918, !919, !920, !921, !927, !928, !929, !930, !931, !932, !933, !945, !950, !954, !955, !956, !959, !963, !966, !969, !972, !975, !978, !981, !984, !990, !991, !992, !998, !999, !1000, !1001, !1002, !1011, !1012, !1013, !1014, !1015, !1020, !1021, !1022, !1025, !1026, !1029, !1032, !1035, !1038, !1041, !1044, !1045, !1124, !1127, !1130, !1131, !1134, !1135, !1136, !1142, !1143, !1144, !1157, !1158, !1159, !1169, !1174, !1177, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !598, file: !599, line: 646, baseType: !602, size: 128)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !603, line: 56, size: 128, elements: !604)
!603 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !603, line: 57, baseType: !83, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !602, file: !603, line: 58, baseType: !335, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !598, file: !599, line: 649, baseType: !608, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !84)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !598, file: !599, line: 657, baseType: !82, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !598, file: !599, line: 658, baseType: !611, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !612, line: 113, baseType: !613)
!612 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !612, line: 111, size: 32, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !613, file: !612, line: 112, baseType: !287, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !598, file: !599, line: 660, baseType: !7, size: 32, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !598, file: !599, line: 661, baseType: !7, size: 32, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !598, file: !599, line: 684, baseType: !158, size: 32, offset: 352)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !598, file: !599, line: 686, baseType: !158, size: 32, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !598, file: !599, line: 687, baseType: !158, size: 32, offset: 416)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !598, file: !599, line: 688, baseType: !158, size: 32, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !598, file: !599, line: 689, baseType: !7, size: 32, offset: 480)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !598, file: !599, line: 691, baseType: !624, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !599, line: 691, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !598, file: !599, line: 692, baseType: !628, size: 832, offset: 576)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !599, line: 451, size: 832, elements: !629)
!629 = !{!630, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !628, file: !599, line: 453, baseType: !631, size: 128)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !599, line: 325, size: 128, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !631, file: !599, line: 326, baseType: !83, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !631, file: !599, line: 327, baseType: !335, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !628, file: !599, line: 454, baseType: !295, size: 192, align: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !628, file: !599, line: 455, baseType: !120, size: 128, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !628, file: !599, line: 456, baseType: !7, size: 32, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !628, file: !599, line: 458, baseType: !489, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !628, file: !599, line: 459, baseType: !489, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !628, file: !599, line: 460, baseType: !489, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !628, file: !599, line: 461, baseType: !489, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !628, file: !599, line: 463, baseType: !489, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !628, file: !599, line: 465, baseType: !644, offset: 832)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !599, line: 415, elements: !146)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !598, file: !599, line: 693, baseType: !646, size: 384, offset: 1408)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !599, line: 489, size: 384, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !646, file: !599, line: 490, baseType: !120, size: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !646, file: !599, line: 491, baseType: !83, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !646, file: !599, line: 492, baseType: !83, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !646, file: !599, line: 493, baseType: !7, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !646, file: !599, line: 494, baseType: !113, size: 16, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !646, file: !599, line: 495, baseType: !113, size: 16, offset: 304)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !646, file: !599, line: 497, baseType: !655, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !598, file: !599, line: 697, baseType: !657, size: 1792, offset: 1792)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !599, line: 507, size: 1792, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !748, !749}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !657, file: !599, line: 508, baseType: !295, size: 192, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !657, file: !599, line: 515, baseType: !489, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !657, file: !599, line: 516, baseType: !489, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !657, file: !599, line: 517, baseType: !489, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !657, file: !599, line: 518, baseType: !489, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !657, file: !599, line: 519, baseType: !489, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !657, file: !599, line: 526, baseType: !411, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !657, file: !599, line: 527, baseType: !489, size: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !657, file: !599, line: 528, baseType: !7, size: 32, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !657, file: !599, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !657, file: !599, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !657, file: !599, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !657, file: !599, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !657, file: !599, line: 563, baseType: !673, size: 512, offset: 704)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !674)
!674 = !{!675, !683, !684, !689, !741, !745, !746, !747}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !673, file: !6, line: 119, baseType: !676, size: 256)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !677, line: 9, size: 256, elements: !678)
!677 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !676, file: !677, line: 10, baseType: !295, size: 192, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !676, file: !677, line: 11, baseType: !681, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !682, line: 29, baseType: !411)
!682 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !673, file: !6, line: 120, baseType: !681, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !673, file: !6, line: 121, baseType: !685, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!5, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !673, file: !6, line: 122, baseType: !690, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !692)
!692 = !{!693, !713, !714, !717, !727, !728, !736, !740}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !691, file: !6, line: 160, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !695, file: !6, line: 215, baseType: !522)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !695, file: !6, line: 216, baseType: !7, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !695, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !695, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !695, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !695, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !695, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !695, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !695, file: !6, line: 233, baseType: !681, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !695, file: !6, line: 234, baseType: !688, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !695, file: !6, line: 235, baseType: !681, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !695, file: !6, line: 236, baseType: !688, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !695, file: !6, line: 237, baseType: !710, size: 4096, offset: 512)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 4096, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !691, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !691, file: !6, line: 162, baseType: !715, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !81, line: 27, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !206, line: 96, baseType: !158)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !691, file: !6, line: 163, baseType: !718, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !719, line: 276, baseType: !720)
!719 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !719, line: 276, size: 32, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !720, file: !719, line: 276, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !719, line: 70, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !719, line: 65, size: 32, elements: !725)
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !724, file: !719, line: 66, baseType: !7, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !691, file: !6, line: 164, baseType: !688, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !691, file: !6, line: 165, baseType: !729, size: 128, offset: 256)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !677, line: 14, size: 128, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !729, file: !677, line: 15, baseType: !732, size: 128)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !296, line: 125, size: 128, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !732, file: !296, line: 126, baseType: !312, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !732, file: !296, line: 127, baseType: !300, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !691, file: !6, line: 166, baseType: !737, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!681}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !691, file: !6, line: 167, baseType: !681, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !673, file: !6, line: 123, baseType: !742, size: 8, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !336, line: 17, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !338, line: 21, baseType: !744)
!744 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !673, file: !6, line: 124, baseType: !742, size: 8, offset: 456)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !673, file: !6, line: 125, baseType: !742, size: 8, offset: 464)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !673, file: !6, line: 126, baseType: !742, size: 8, offset: 472)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !657, file: !599, line: 572, baseType: !673, size: 512, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !657, file: !599, line: 580, baseType: !750, size: 64, offset: 1728)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !598, file: !599, line: 721, baseType: !7, size: 32, offset: 3584)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !598, file: !599, line: 722, baseType: !158, size: 32, offset: 3616)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !598, file: !599, line: 723, baseType: !754, size: 64, offset: 3648)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !757, line: 17, baseType: !758)
!757 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !757, line: 17, size: 64, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !758, file: !757, line: 17, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 1)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !598, file: !599, line: 724, baseType: !756, size: 64, offset: 3712)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !598, file: !599, line: 749, baseType: !766, offset: 3776)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !599, line: 290, elements: !146)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !598, file: !599, line: 751, baseType: !120, size: 128, offset: 3776)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !598, file: !599, line: 757, baseType: !480, size: 64, offset: 3904)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !598, file: !599, line: 758, baseType: !480, size: 64, offset: 3968)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !598, file: !599, line: 761, baseType: !771, size: 320, offset: 4032)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !552, line: 34, size: 320, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !771, file: !552, line: 35, baseType: !489, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !771, file: !552, line: 36, baseType: !775, size: 256, offset: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 256, elements: !556)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !598, file: !599, line: 766, baseType: !158, size: 32, offset: 4352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !598, file: !599, line: 767, baseType: !158, size: 32, offset: 4384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !598, file: !599, line: 768, baseType: !158, size: 32, offset: 4416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !598, file: !599, line: 770, baseType: !158, size: 32, offset: 4448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !598, file: !599, line: 772, baseType: !83, size: 64, offset: 4480)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !598, file: !599, line: 775, baseType: !7, size: 32, offset: 4544)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !598, file: !599, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !598, file: !599, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !598, file: !599, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !598, file: !599, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !598, file: !599, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !598, file: !599, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !598, file: !599, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !598, file: !599, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !598, file: !599, line: 831, baseType: !83, size: 64, offset: 4672)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !598, file: !599, line: 833, baseType: !792, size: 384, offset: 4736)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !793)
!793 = !{!794, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !792, file: !12, line: 26, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!84, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, scope: !792, file: !12, line: 27, baseType: !800, size: 320, offset: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !12, line: 27, size: 320, elements: !801)
!801 = !{!802, !812, !839}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !800, file: !12, line: 36, baseType: !803, size: 320)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !12, line: 29, size: 320, elements: !804)
!804 = !{!805, !807, !808, !809, !810, !811}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !803, file: !12, line: 30, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !803, file: !12, line: 31, baseType: !335, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !12, line: 32, baseType: !335, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !803, file: !12, line: 33, baseType: !335, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !803, file: !12, line: 34, baseType: !489, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !803, file: !12, line: 35, baseType: !806, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !800, file: !12, line: 46, baseType: !813, size: 192)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !12, line: 38, size: 192, elements: !814)
!814 = !{!815, !816, !817, !838}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !813, file: !12, line: 39, baseType: !715, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !813, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, scope: !813, file: !12, line: 41, baseType: !818, size: 64, offset: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !813, file: !12, line: 41, size: 64, elements: !819)
!819 = !{!820, !828}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !818, file: !12, line: 42, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !823, line: 7, size: 128, elements: !824)
!823 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!824 = !{!825, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !822, file: !823, line: 8, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !206, line: 93, baseType: !413)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !822, file: !823, line: 9, baseType: !413, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !818, file: !12, line: 43, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !831, line: 7, size: 64, elements: !832)
!831 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!832 = !{!833, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !830, file: !831, line: 8, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !831, line: 5, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !336, line: 20, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !338, line: 26, baseType: !158)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !830, file: !831, line: 9, baseType: !835, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !813, file: !12, line: 45, baseType: !489, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !800, file: !12, line: 54, baseType: !840, size: 256)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !800, file: !12, line: 48, size: 256, elements: !841)
!841 = !{!842, !845, !846, !847, !848}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !840, file: !12, line: 49, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !840, file: !12, line: 50, baseType: !158, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !840, file: !12, line: 51, baseType: !158, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !840, file: !12, line: 52, baseType: !83, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !840, file: !12, line: 53, baseType: !83, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !598, file: !599, line: 835, baseType: !850, size: 32, offset: 5120)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !81, line: 22, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !206, line: 28, baseType: !158)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !598, file: !599, line: 836, baseType: !850, size: 32, offset: 5152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !598, file: !599, line: 840, baseType: !83, size: 64, offset: 5184)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !598, file: !599, line: 849, baseType: !597, size: 64, offset: 5248)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !598, file: !599, line: 852, baseType: !597, size: 64, offset: 5312)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !598, file: !599, line: 857, baseType: !120, size: 128, offset: 5376)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !598, file: !599, line: 858, baseType: !120, size: 128, offset: 5504)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !598, file: !599, line: 859, baseType: !597, size: 64, offset: 5632)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !598, file: !599, line: 867, baseType: !120, size: 128, offset: 5696)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !598, file: !599, line: 868, baseType: !120, size: 128, offset: 5824)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !598, file: !599, line: 871, baseType: !862, size: 64, offset: 5952)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !864, line: 59, size: 768, elements: !865)
!864 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!865 = !{!866, !867, !868, !869, !880, !881, !882, !891}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !863, file: !864, line: 61, baseType: !611, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !863, file: !864, line: 62, baseType: !7, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !863, file: !864, line: 63, baseType: !132, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !863, file: !864, line: 65, baseType: !870, size: 256, offset: 64)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 256, elements: !556)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !81, line: 182, size: 64, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !871, file: !81, line: 183, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !81, line: 186, size: 128, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !875, file: !81, line: 187, baseType: !874, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !875, file: !81, line: 187, baseType: !879, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !863, file: !864, line: 66, baseType: !871, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !863, file: !864, line: 68, baseType: !369, size: 128, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !863, file: !864, line: 69, baseType: !883, size: 128, align: 64, offset: 512)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !81, line: 216, size: 128, align: 64, elements: !884)
!884 = !{!885, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !81, line: 217, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !883, file: !81, line: 218, baseType: !888, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !886}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !863, file: !864, line: 70, baseType: !892, size: 128, offset: 640)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 128, elements: !762)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !864, line: 54, size: 128, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !893, file: !864, line: 55, baseType: !158, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !893, file: !864, line: 56, baseType: !897, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !864, line: 56, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !598, file: !599, line: 872, baseType: !900, size: 512, offset: 6016)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 512, elements: !556)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !598, file: !599, line: 873, baseType: !120, size: 128, offset: 6528)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !598, file: !599, line: 874, baseType: !120, size: 128, offset: 6656)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !598, file: !599, line: 876, baseType: !904, size: 64, offset: 6784)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !906, line: 26, size: 192, elements: !907)
!906 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !905, file: !906, line: 27, baseType: !7, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !905, file: !906, line: 28, baseType: !910, size: 128, offset: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !911, line: 43, size: 128, elements: !912)
!911 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !910, file: !911, line: 44, baseType: !522)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !910, file: !911, line: 45, baseType: !120, size: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !598, file: !599, line: 879, baseType: !916, size: 64, offset: 6848)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !598, file: !599, line: 882, baseType: !916, size: 64, offset: 6912)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !598, file: !599, line: 884, baseType: !489, size: 64, offset: 6976)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !598, file: !599, line: 885, baseType: !489, size: 64, offset: 7040)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !598, file: !599, line: 890, baseType: !489, size: 64, offset: 7104)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !598, file: !599, line: 891, baseType: !922, size: 128, offset: 7168)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !599, line: 242, size: 128, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !922, file: !599, line: 244, baseType: !489, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !922, file: !599, line: 245, baseType: !489, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !922, file: !599, line: 246, baseType: !522, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !598, file: !599, line: 900, baseType: !83, size: 64, offset: 7296)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !598, file: !599, line: 901, baseType: !83, size: 64, offset: 7360)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !598, file: !599, line: 904, baseType: !489, size: 64, offset: 7424)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !598, file: !599, line: 907, baseType: !489, size: 64, offset: 7488)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !598, file: !599, line: 910, baseType: !83, size: 64, offset: 7552)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !598, file: !599, line: 911, baseType: !83, size: 64, offset: 7616)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !598, file: !599, line: 914, baseType: !934, size: 640, offset: 7680)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !935, line: 123, size: 640, elements: !936)
!935 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!936 = !{!937, !943, !944}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !934, file: !935, line: 124, baseType: !938, size: 576)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 576, elements: !175)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !935, line: 108, size: 192, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !939, file: !935, line: 109, baseType: !489, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !939, file: !935, line: 110, baseType: !729, size: 128, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !934, file: !935, line: 125, baseType: !7, size: 32, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !934, file: !935, line: 126, baseType: !7, size: 32, offset: 608)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !598, file: !599, line: 917, baseType: !946, size: 192, offset: 8320)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !935, line: 134, size: 192, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !946, file: !935, line: 135, baseType: !883, size: 128, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !946, file: !935, line: 136, baseType: !7, size: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !598, file: !599, line: 923, baseType: !951, size: 64, offset: 8512)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !599, line: 923, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !598, file: !599, line: 926, baseType: !951, size: 64, offset: 8576)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !598, file: !599, line: 929, baseType: !951, size: 64, offset: 8640)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !598, file: !599, line: 933, baseType: !957, size: 64, offset: 8704)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !599, line: 933, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !598, file: !599, line: 943, baseType: !960, size: 128, offset: 8768)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 16)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !598, file: !599, line: 945, baseType: !964, size: 64, offset: 8896)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !599, line: 49, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !598, file: !599, line: 956, baseType: !967, size: 64, offset: 8960)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !599, line: 45, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !598, file: !599, line: 959, baseType: !970, size: 64, offset: 9024)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !599, line: 959, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !598, file: !599, line: 962, baseType: !973, size: 64, offset: 9088)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !599, line: 66, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !598, file: !599, line: 966, baseType: !976, size: 64, offset: 9152)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !599, line: 50, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !598, file: !599, line: 969, baseType: !979, size: 64, offset: 9216)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !935, line: 223, flags: DIFlagFwdDecl)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !598, file: !599, line: 970, baseType: !982, size: 64, offset: 9280)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !599, line: 62, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !598, file: !599, line: 971, baseType: !985, size: 64, offset: 9344)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !986, line: 25, baseType: !987)
!986 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !986, line: 23, size: 64, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !987, file: !986, line: 24, baseType: !761, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !598, file: !599, line: 972, baseType: !985, size: 64, offset: 9408)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !598, file: !599, line: 974, baseType: !985, size: 64, offset: 9472)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !598, file: !599, line: 975, baseType: !993, size: 192, offset: 9536)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !994, line: 30, size: 192, elements: !995)
!994 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !993, file: !994, line: 31, baseType: !120, size: 128)
