; ModuleID = '../bcout/drivers/cpuidle/governors/ladder.llvm.bc'
source_filename = "drivers/cpuidle/governors/ladder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall2.init\22, \22a\22\09"
module asm "__initcall_init_ladder2:\09\09\09"
module asm ".long\09init_ladder - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.cpuidle_governor = type { [16 x i8], %struct.list_head, i32, i32 (%struct.cpuidle_driver*, %struct.cpuidle_device*)*, void (%struct.cpuidle_driver*, %struct.cpuidle_device*)*, i32 (%struct.cpuidle_driver*, %struct.cpuidle_device*, i8*)*, void (%struct.cpuidle_device*, i32)* }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.cpuidle_driver = type { i8*, %struct.module*, i8, [10 x %struct.cpuidle_state], i32, i32, %struct.cpumask*, i8* }
%struct.module = type opaque
%struct.cpuidle_state = type { [16 x i8], [32 x i8], i64, i64, i32, i32, i32, i32, i32 (%struct.cpuidle_device*, %struct.cpuidle_driver*, i32)*, i32 (%struct.cpuidle_device*, i32)*, i32 (%struct.cpuidle_device*, %struct.cpuidle_driver*, i32)* }
%struct.cpumask = type { [1 x i64] }
%struct.cpuidle_device = type { i8, i32, i64, i32, i64, i64, i64, [10 x %struct.cpuidle_state_usage], [10 x %struct.cpuidle_state_kobj*], %struct.cpuidle_driver_kobj*, %struct.cpuidle_device_kobj*, %struct.list_head }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_init_ladder161", scope: !2, file: !3, line: 197, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !37, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/cpuidle/governors/ladder.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !36}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ladder_device", file: !3, line: 39, size: 2560, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !7, file: !3, line: 40, baseType: !10, size: 2560)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2560, elements: !34)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ladder_device_state", file: !3, line: 26, size: 256, elements: !12)
!12 = !{!13, !28}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !11, file: !3, line: 32, baseType: !14, size: 192)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !3, line: 27, size: 192, elements: !15)
!15 = !{!16, !22, !23, !27}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "promotion_count", scope: !14, file: !3, line: 28, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !18, line: 21, baseType: !19)
!18 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !21)
!20 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "demotion_count", scope: !14, file: !3, line: 29, baseType: !17, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "promotion_time_ns", scope: !14, file: !3, line: 30, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !18, line: 23, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !26)
!26 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "demotion_time_ns", scope: !14, file: !3, line: 31, baseType: !24, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !11, file: !3, line: 36, baseType: !29, size: 64, offset: 192)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !3, line: 33, size: 64, elements: !30)
!30 = !{!31, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "promotion_count", scope: !29, file: !3, line: 34, baseType: !32, size: 32)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "demotion_count", scope: !29, file: !3, line: 35, baseType: !32, size: 32, offset: 32)
!34 = !{!35}
!35 = !DISubrange(count: 10)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !{!0, !38, !163}
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "ladder_governor", scope: !2, file: !3, line: 173, type: !40, isLocal: true, isDefinition: true)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_governor", file: !41, line: 258, size: 576, elements: !42)
!41 = !DIFile(filename: "./include/linux/cpuidle.h", directory: "/home/lizy2001/genbc/linux")
!42 = !{!43, !48, !55, !56, !148, !152, !159}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 259, baseType: !44, size: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !46)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !{!47}
!47 = !DISubrange(count: 16)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "governor_list", scope: !40, file: !41, line: 260, baseType: !49, size: 128, offset: 128)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !50, line: 178, size: 128, elements: !51)
!50 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !50, line: 179, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !49, file: !50, line: 179, baseType: !53, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !40, file: !41, line: 261, baseType: !21, size: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !40, file: !41, line: 263, baseType: !57, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!32, !60, !90}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_driver", file: !41, line: 122, size: 8704, elements: !62)
!62 = !{!63, !66, !70, !71, !135, !136, !137, !147}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !41, line: 123, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !61, file: !41, line: 124, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !69, line: 76, flags: DIFlagFwdDecl)
!69 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "bctimer", scope: !61, file: !41, line: 127, baseType: !21, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !61, file: !41, line: 129, baseType: !72, size: 8320, offset: 192)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8320, elements: !34)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state", file: !41, line: 48, size: 832, elements: !74)
!74 = !{!75, !76, !80, !81, !82, !83, !84, !85, !86, !130, !134}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !41, line: 49, baseType: !44, size: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !73, file: !41, line: 50, baseType: !77, size: 256, offset: 128)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 256, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_ns", scope: !73, file: !41, line: 52, baseType: !24, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "target_residency_ns", scope: !73, file: !41, line: 53, baseType: !24, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !41, line: 54, baseType: !21, size: 32, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency", scope: !73, file: !41, line: 55, baseType: !21, size: 32, offset: 544)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "power_usage", scope: !73, file: !41, line: 56, baseType: !32, size: 32, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "target_residency", scope: !73, file: !41, line: 57, baseType: !21, size: 32, offset: 608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "enter", scope: !73, file: !41, line: 59, baseType: !87, size: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!32, !90, !60, !32}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_device", file: !41, line: 92, size: 6400, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !103, !104, !105, !106, !107, !119, !123, !126, !129}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "registered", scope: !91, file: !41, line: 93, baseType: !21, size: 1, flags: DIFlagBitField, extraData: i64 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !91, file: !41, line: 94, baseType: !21, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "poll_time_limit", scope: !91, file: !41, line: 95, baseType: !21, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !91, file: !41, line: 96, baseType: !21, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next_hrtimer", scope: !91, file: !41, line: 97, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !99, line: 29, baseType: !100)
!99 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !18, line: 22, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !20, line: 30, baseType: !102)
!102 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "last_state_idx", scope: !91, file: !41, line: 99, baseType: !32, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "last_residency_ns", scope: !91, file: !41, line: 100, baseType: !24, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "poll_limit_ns", scope: !91, file: !41, line: 101, baseType: !24, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "forced_idle_latency_limit_ns", scope: !91, file: !41, line: 102, baseType: !24, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "states_usage", scope: !91, file: !41, line: 103, baseType: !108, size: 5120, offset: 384)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 5120, elements: !34)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state_usage", file: !41, line: 35, size: 512, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !109, file: !41, line: 36, baseType: !26, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !109, file: !41, line: 37, baseType: !26, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !109, file: !41, line: 38, baseType: !24, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !109, file: !41, line: 39, baseType: !26, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "below", scope: !109, file: !41, line: 40, baseType: !26, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rejected", scope: !109, file: !41, line: 41, baseType: !26, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "s2idle_usage", scope: !109, file: !41, line: 43, baseType: !26, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "s2idle_time", scope: !109, file: !41, line: 44, baseType: !26, size: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "kobjs", scope: !91, file: !41, line: 104, baseType: !120, size: 640, offset: 5504)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 640, elements: !34)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state_kobj", file: !41, line: 89, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_driver", scope: !91, file: !41, line: 105, baseType: !124, size: 64, offset: 6144)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_driver_kobj", file: !41, line: 90, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_dev", scope: !91, file: !41, line: 106, baseType: !127, size: 64, offset: 6208)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_device_kobj", file: !41, line: 88, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !91, file: !41, line: 107, baseType: !49, size: 128, offset: 6272)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "enter_dead", scope: !73, file: !41, line: 63, baseType: !131, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!32, !90, !32}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "enter_s2idle", scope: !73, file: !41, line: 73, baseType: !87, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !61, file: !41, line: 130, baseType: !32, size: 32, offset: 8512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "safe_state_index", scope: !61, file: !41, line: 131, baseType: !32, size: 32, offset: 8544)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cpumask", scope: !61, file: !41, line: 134, baseType: !138, size: 64, offset: 8576)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !140, line: 17, size: 64, elements: !141)
!140 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !139, file: !140, line: 17, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !145)
!144 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!145 = !{!146}
!146 = !DISubrange(count: 1)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "governor", scope: !61, file: !41, line: 137, baseType: !64, size: 64, offset: 8640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !40, file: !41, line: 265, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !60, !90}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !40, file: !41, line: 268, baseType: !153, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!32, !60, !90, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !50, line: 30, baseType: !158)
!158 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !40, file: !41, line: 271, baseType: !160, size: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !90, !32}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "ladder_devices", scope: !2, file: !3, line: 43, type: !7, isLocal: true, isDefinition: true)
!165 = !{i32 7, !"Dwarf Version", i32 4}
!166 = !{i32 2, !"Debug Info Version", i32 3}
!167 = !{i32 1, !"wchar_size", i32 2}
!168 = !{i32 1, !"Code Model", i32 2}
!169 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!170 = distinct !DISubprogram(name: "init_ladder", scope: !3, file: !3, line: 184, type: !171, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!171 = !DISubroutineType(types: !172)
!172 = !{!32}
!173 = !DILocation(line: 192, column: 26, scope: !174)
!174 = distinct !DILexicalBlock(scope: !170, file: !3, line: 191, column: 6)
!175 = !DILocation(line: 194, column: 9, scope: !170)
!176 = !DILocation(line: 194, column: 2, scope: !170)
!177 = distinct !DISubprogram(name: "ladder_enable_device", scope: !3, file: !3, line: 132, type: !58, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!178 = !DILocalVariable(name: "drv", arg: 1, scope: !177, file: !3, line: 132, type: !60)
!179 = !DILocation(line: 132, column: 56, scope: !177)
!180 = !DILocalVariable(name: "dev", arg: 2, scope: !177, file: !3, line: 133, type: !90)
!181 = !DILocation(line: 133, column: 28, scope: !177)
!182 = !DILocalVariable(name: "i", scope: !177, file: !3, line: 135, type: !32)
!183 = !DILocation(line: 135, column: 6, scope: !177)
!184 = !DILocalVariable(name: "first_idx", scope: !177, file: !3, line: 136, type: !32)
!185 = !DILocation(line: 136, column: 6, scope: !177)
!186 = !DILocation(line: 136, column: 18, scope: !177)
!187 = !DILocation(line: 136, column: 23, scope: !177)
!188 = !DILocation(line: 136, column: 33, scope: !177)
!189 = !DILocation(line: 136, column: 39, scope: !177)
!190 = !DILocalVariable(name: "ldev", scope: !177, file: !3, line: 137, type: !6)
!191 = !DILocation(line: 137, column: 24, scope: !177)
!192 = !DILocation(line: 137, column: 32, scope: !193)
!193 = distinct !DILexicalBlock(scope: !177, file: !3, line: 137, column: 32)
!194 = !DILocation(line: 137, column: 32, scope: !195)
!195 = distinct !DILexicalBlock(scope: !193, file: !3, line: 137, column: 32)
!196 = !DILocalVariable(name: "__vpp_verify", scope: !197, file: !3, line: 137, type: !198)
!197 = distinct !DILexicalBlock(scope: !195, file: !3, line: 137, column: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DILocation(line: 137, column: 32, scope: !197)
!201 = !DILocalVariable(name: "lstate", scope: !177, file: !3, line: 138, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!203 = !DILocation(line: 138, column: 30, scope: !177)
!204 = !DILocalVariable(name: "state", scope: !177, file: !3, line: 139, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!206 = !DILocation(line: 139, column: 24, scope: !177)
!207 = !DILocation(line: 141, column: 24, scope: !177)
!208 = !DILocation(line: 141, column: 2, scope: !177)
!209 = !DILocation(line: 141, column: 7, scope: !177)
!210 = !DILocation(line: 141, column: 22, scope: !177)
!211 = !DILocation(line: 143, column: 11, scope: !212)
!212 = distinct !DILexicalBlock(scope: !177, file: !3, line: 143, column: 2)
!213 = !DILocation(line: 143, column: 9, scope: !212)
!214 = !DILocation(line: 143, column: 7, scope: !212)
!215 = !DILocation(line: 143, column: 22, scope: !216)
