; ModuleID = '../bcout/drivers/media/usb/dvb-usb-v2/mxl111sf-i2c.llvm.bc'
source_filename = "drivers/media/usb/dvb-usb-v2/mxl111sf-i2c.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.i2c_adapter = type { %struct.module*, i32, %struct.i2c_algorithm*, i8*, %struct.i2c_lock_operations*, %struct.rt_mutex, %struct.rt_mutex, i32, i32, %struct.device, i64, i32, [48 x i8], %struct.completion, %struct.mutex, %struct.list_head, %struct.i2c_bus_recovery_info*, %struct.i2c_adapter_quirks*, %struct.irq_domain* }
%struct.module = type opaque
%struct.i2c_algorithm = type { {}*, {}*, i32 (%struct.i2c_adapter*, i16, i16, i8, i8, i32, %union.i2c_smbus_data*)*, i32 (%struct.i2c_adapter*, i16, i16, i8, i8, i32, %union.i2c_smbus_data*)*, i32 (%struct.i2c_adapter*)* }
%union.i2c_smbus_data = type { i16, [32 x i8] }
%struct.i2c_lock_operations = type { void (%struct.i2c_adapter*, i32)*, i32 (%struct.i2c_adapter*, i32)*, void (%struct.i2c_adapter*, i32)* }
%struct.rt_mutex = type { %struct.raw_spinlock, %struct.rb_root_cached, %struct.task_struct* }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.rb_root_cached = type { %struct.rb_root, %struct.rb_node* }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }

!251 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!252 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !243, line: 602, baseType: !5, size: 32, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262}
!257 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!258 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!259 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!260 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!261 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!262 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !243, line: 615, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268}
!265 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!267 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!268 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !243, line: 626, baseType: !5, size: 32, elements: !270)
!270 = !{!271, !272, !273, !274, !275}
!271 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!272 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!273 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!274 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!275 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !243, line: 638, baseType: !5, size: 32, elements: !277)
!277 = !{!278, !279}
!278 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !243, line: 647, baseType: !5, size: 32, elements: !281)
!281 = !{!282, !283}
!282 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !285, line: 54, baseType: !5, size: 32, elements: !286)
!285 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!286 = !{!287, !288, !289, !290}
!287 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !65, line: 423, baseType: !5, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !298, file: !65, line: 2085, baseType: !5, size: 32, elements: !7227)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !65, line: 1858, size: 15808, elements: !299)
!299 = !{!300, !305, !328, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !362, !370, !371, !372, !373, !374, !375, !376, !377, !378, !404, !414, !415, !416, !421, !422, !426, !429, !5823, !6339, !6343, !6383, !6384, !6385, !6386, !6387, !6388, !6389, !6390, !6391, !6392, !6393, !6394, !6395, !6396, !6397, !6398, !6399, !6400, !6401, !6402, !6403, !6404, !6405, !6406, !6407, !6408, !6409, !6414, !6415, !6416, !6417, !6418, !6419, !6420, !6423, !6472, !6475, !6478, !6481, !6482, !6495, !6496, !6497, !6498, !6499, !6500, !6507, !6508, !6542, !6543, !6544, !6545, !6546, !6547, !6548, !6549, !6550, !6553, !6554, !6555, !6556, !6557, !6558, !6559, !6560, !6561, !6566, !6567, !6568, !6573, !6610, !7182, !7184, !7185, !7189, !7190, !7191, !7192, !7198, !7200, !7203, !7206, !7208, !7209, !7210, !7211, !7212, !7216, !7219}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !65, line: 1859, baseType: !301, size: 128)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !303)
!302 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!303 = !{!304}
!304 = !DISubrange(count: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !298, file: !65, line: 1860, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !65, line: 938, size: 384, elements: !308)
!308 = !{!309, !317, !323, !325}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !307, file: !65, line: 939, baseType: !310, size: 128)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !311, line: 186, size: 128, elements: !312)
!311 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !311, line: 187, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !310, file: !311, line: 187, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !65, line: 940, baseType: !318, size: 128, offset: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !311, line: 178, size: 128, elements: !319)
!319 = !{!320, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !311, line: 179, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !311, line: 179, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !307, file: !65, line: 941, baseType: !324, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !65, line: 942, baseType: !326, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !298, file: !65, line: 1861, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !65, line: 930, size: 128, elements: !331)
!331 = !{!332, !341}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !330, file: !65, line: 931, baseType: !333, size: 128, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !311, line: 216, size: 128, align: 64, elements: !334)
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !311, line: 217, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !333, file: !311, line: 218, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !336}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !330, file: !65, line: 932, baseType: !342, offset: 128)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: -1)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !298, file: !65, line: 1866, baseType: !346, size: 64, offset: 256)
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !298, file: !65, line: 1867, baseType: !346, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !298, file: !65, line: 1868, baseType: !346, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !298, file: !65, line: 1869, baseType: !66, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !298, file: !65, line: 1877, baseType: !346, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !298, file: !65, line: 1879, baseType: !318, size: 128, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !298, file: !65, line: 1880, baseType: !318, size: 128, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !298, file: !65, line: 1881, baseType: !318, size: 128, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !298, file: !65, line: 1882, baseType: !318, size: 128, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !298, file: !65, line: 1883, baseType: !318, size: 128, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !298, file: !65, line: 1884, baseType: !318, size: 128, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !298, file: !65, line: 1889, baseType: !358, size: 256, offset: 1344)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !298, file: !65, line: 1886, size: 256, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !358, file: !65, line: 1887, baseType: !318, size: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !358, file: !65, line: 1888, baseType: !318, size: 128, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !298, file: !65, line: 1891, baseType: !363, size: 64, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !364, line: 12, baseType: !365)
!364 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !366, line: 23, baseType: !367)
!366 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !368, line: 31, baseType: !369)
!368 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!369 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !298, file: !65, line: 1892, baseType: !363, size: 64, offset: 1664)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !298, file: !65, line: 1893, baseType: !363, size: 64, offset: 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !298, file: !65, line: 1894, baseType: !363, size: 64, offset: 1792)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !298, file: !65, line: 1895, baseType: !363, size: 64, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !298, file: !65, line: 1896, baseType: !363, size: 64, offset: 1920)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !298, file: !65, line: 1897, baseType: !363, size: 64, offset: 1984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !298, file: !65, line: 1899, baseType: !66, size: 32, offset: 2048)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !298, file: !65, line: 1900, baseType: !66, size: 32, offset: 2080)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !298, file: !65, line: 1902, baseType: !379, size: 1472, offset: 2112)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !65, line: 169, size: 1472, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !379, file: !65, line: 170, baseType: !346, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !379, file: !65, line: 171, baseType: !346, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !379, file: !65, line: 172, baseType: !346, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !379, file: !65, line: 173, baseType: !346, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !379, file: !65, line: 174, baseType: !346, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !379, file: !65, line: 175, baseType: !346, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !379, file: !65, line: 176, baseType: !346, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !379, file: !65, line: 177, baseType: !346, size: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !379, file: !65, line: 178, baseType: !346, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !379, file: !65, line: 179, baseType: !346, size: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !379, file: !65, line: 180, baseType: !346, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !379, file: !65, line: 181, baseType: !346, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !379, file: !65, line: 182, baseType: !346, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !379, file: !65, line: 183, baseType: !346, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !379, file: !65, line: 184, baseType: !346, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !379, file: !65, line: 185, baseType: !346, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !379, file: !65, line: 186, baseType: !346, size: 64, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !379, file: !65, line: 187, baseType: !346, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !379, file: !65, line: 188, baseType: !346, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !379, file: !65, line: 189, baseType: !346, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !379, file: !65, line: 190, baseType: !346, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !379, file: !65, line: 191, baseType: !346, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !379, file: !65, line: 192, baseType: !346, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !298, file: !65, line: 1904, baseType: !405, size: 64, offset: 3584)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !406, line: 13, baseType: !407)
!406 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !311, line: 175, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 173, size: 64, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !408, file: !311, line: 174, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !366, line: 22, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !368, line: 30, baseType: !413)
!413 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !298, file: !65, line: 1905, baseType: !405, size: 64, offset: 3648)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !298, file: !65, line: 1906, baseType: !405, size: 64, offset: 3712)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !298, file: !65, line: 1909, baseType: !417, size: 32, offset: 3776)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !311, line: 168, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 166, size: 32, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !418, file: !311, line: 167, baseType: !66, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !298, file: !65, line: 1910, baseType: !417, size: 32, offset: 3808)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !298, file: !65, line: 1913, baseType: !423, size: 64, offset: 3840)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !65, line: 1913, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !298, file: !65, line: 1914, baseType: !427, size: 64, offset: 3904)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !65, line: 1914, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !298, file: !65, line: 1916, baseType: !430, size: 64, offset: 3968)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !65, line: 1283, size: 4416, elements: !433)
!433 = !{!434, !438, !442, !443, !444, !606, !610, !615, !619, !620, !625, !626, !749, !754, !758, !764, !768, !800, !808, !812, !817, !821, !822, !828, !832, !836, !840, !841, !863, !867, !882, !893, !897, !906, !910, !911, !915, !936, !940, !944, !948, !952, !959, !963, !981, !985, !1035, !1039, !1044, !1048, !1052, !1056, !1066, !1067, !1076, !1082, !1083, !1087, !1091, !1095, !1099, !1100, !1104, !1105, !5783, !5803, !5807, !5813, !5819}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !432, file: !65, line: 1284, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!66, !324}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !432, file: !65, line: 1285, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !324}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !432, file: !65, line: 1286, baseType: !435, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !432, file: !65, line: 1287, baseType: !435, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !432, file: !65, line: 1288, baseType: !445, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !449, !324}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !65, line: 120, baseType: !64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !451, line: 713, size: 1600, elements: !452)
!451 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!452 = !{!453, !475, !482, !489, !493, !505, !506, !507, !510, !511, !512, !518, !519, !520, !521, !522, !523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !564, !565, !566, !567, !569, !570, !575, !580, !585, !586, !587, !588, !589, !590, !591, !592, !593, !595, !596, !598, !599, !600}
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 714, baseType: !454, size: 192)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 714, size: 192, elements: !455)
!455 = !{!456, !466, !474}
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !454, file: !451, line: 715, baseType: !457, size: 192)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !454, file: !451, line: 715, size: 192, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !451, line: 717, baseType: !449, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !451, line: 718, baseType: !449, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !457, file: !451, line: 720, baseType: !462, size: 64, offset: 128)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !457, file: !451, line: 720, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !462, file: !451, line: 721, baseType: !324, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !462, file: !451, line: 726, baseType: !346, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !454, file: !451, line: 729, baseType: !467, size: 192, align: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !468, line: 24, size: 192, align: 64, elements: !469)
!468 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!469 = !{!470, !471, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !467, file: !468, line: 25, baseType: !346, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !467, file: !468, line: 26, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !467, file: !468, line: 27, baseType: !472, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !454, file: !451, line: 730, baseType: !318, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 733, baseType: !476, size: 64, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 733, size: 64, elements: !477)
!477 = !{!478, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !476, file: !451, line: 734, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !33, line: 19, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !476, file: !451, line: 735, baseType: !66, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 738, baseType: !483, size: 64, offset: 256)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 738, size: 64, elements: !484)
!484 = !{!485, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !483, file: !451, line: 739, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !487, line: 29, baseType: !411)
!487 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!488 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !483, file: !451, line: 740, baseType: !365, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !450, file: !451, line: 748, baseType: !490, size: 384, align: 64, offset: 320)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 384, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 48)
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 750, baseType: !494, size: 128, offset: 704)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 750, size: 128, elements: !495)
!495 = !{!496, !504}
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !494, file: !451, line: 751, baseType: !497, size: 128)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !451, line: 751, size: 128, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !497, file: !451, line: 752, baseType: !346, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !497, file: !451, line: 753, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !449}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !494, file: !451, line: 755, baseType: !318, size: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !450, file: !451, line: 761, baseType: !5, size: 32, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !450, file: !451, line: 762, baseType: !5, size: 32, offset: 864)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !450, file: !451, line: 763, baseType: !508, size: 16, offset: 896)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !368, line: 24, baseType: !509)
!509 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !450, file: !451, line: 764, baseType: !508, size: 16, offset: 912)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !450, file: !451, line: 769, baseType: !508, size: 16, offset: 928)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !450, file: !451, line: 780, baseType: !513, offset: 944)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, elements: !516)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !368, line: 21, baseType: !515)
!515 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!516 = !{!517}
!517 = !DISubrange(count: 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !450, file: !451, line: 782, baseType: !514, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !450, file: !451, line: 783, baseType: !514, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !450, file: !451, line: 784, baseType: !514, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !450, file: !451, line: 785, baseType: !514, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !450, file: !451, line: 786, baseType: !514, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !450, file: !451, line: 787, baseType: !514, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !450, file: !451, line: 795, baseType: !525, offset: 960)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, elements: !516)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !368, line: 27, baseType: !5)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !450, file: !451, line: 807, baseType: !513, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !450, file: !451, line: 809, baseType: !514, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !450, file: !451, line: 810, baseType: !514, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !450, file: !451, line: 811, baseType: !514, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !450, file: !451, line: 812, baseType: !514, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !450, file: !451, line: 813, baseType: !514, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !450, file: !451, line: 815, baseType: !514, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !450, file: !451, line: 816, baseType: !514, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !450, file: !451, line: 817, baseType: !514, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !450, file: !451, line: 818, baseType: !514, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !450, file: !451, line: 819, baseType: !514, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !450, file: !451, line: 821, baseType: !514, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !450, file: !451, line: 822, baseType: !514, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !450, file: !451, line: 823, baseType: !514, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !450, file: !451, line: 832, baseType: !513, offset: 976)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !450, file: !451, line: 834, baseType: !514, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !450, file: !451, line: 835, baseType: !514, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !450, file: !451, line: 836, baseType: !514, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !450, file: !451, line: 837, baseType: !514, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !450, file: !451, line: 838, baseType: !514, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !450, file: !451, line: 840, baseType: !514, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !450, file: !451, line: 843, baseType: !514, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !450, file: !451, line: 844, baseType: !514, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !450, file: !451, line: 845, baseType: !514, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !450, file: !451, line: 847, baseType: !514, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !450, file: !451, line: 848, baseType: !514, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!553 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 866, baseType: !554, size: 32, offset: 992)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 866, size: 32, elements: !555)
!555 = !{!556, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !554, file: !451, line: 867, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !558, line: 37, baseType: !526)
!558 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !554, file: !451, line: 868, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !451, line: 868, size: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !560, file: !451, line: 869, baseType: !508, size: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !560, file: !451, line: 870, baseType: !508, size: 16, offset: 16)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !450, file: !451, line: 873, baseType: !526, size: 32, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !450, file: !451, line: 874, baseType: !66, size: 32, offset: 1056)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !450, file: !451, line: 875, baseType: !526, size: 32, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !450, file: !451, line: 876, baseType: !568, size: 16, offset: 1120)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !558, line: 30, baseType: !508)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !450, file: !451, line: 877, baseType: !508, size: 16, offset: 1136)
!570 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 879, baseType: !571, size: 32, offset: 1152)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 879, size: 32, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !571, file: !451, line: 880, baseType: !5, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !571, file: !451, line: 881, baseType: !5, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 888, baseType: !576, size: 32, offset: 1184)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 888, size: 32, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !576, file: !451, line: 889, baseType: !526, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !576, file: !451, line: 890, baseType: !526, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 893, baseType: !581, size: 16, offset: 1216)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 893, size: 16, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !581, file: !451, line: 894, baseType: !568, size: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !581, file: !451, line: 895, baseType: !514, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !450, file: !451, line: 898, baseType: !508, size: 16, offset: 1232)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !450, file: !451, line: 899, baseType: !508, size: 16, offset: 1248)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !450, file: !451, line: 900, baseType: !508, size: 16, offset: 1264)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !450, file: !451, line: 902, baseType: !568, size: 16, offset: 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !450, file: !451, line: 903, baseType: !508, size: 16, offset: 1296)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !450, file: !451, line: 904, baseType: !508, size: 16, offset: 1312)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !450, file: !451, line: 905, baseType: !508, size: 16, offset: 1328)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !450, file: !451, line: 908, baseType: !525, offset: 1344)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !450, file: !451, line: 912, baseType: !594, size: 32, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !451, line: 606, baseType: !5)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !450, file: !451, line: 913, baseType: !594, size: 32, offset: 1376)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !450, file: !451, line: 914, baseType: !597, size: 64, offset: 1408)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !451, line: 915, baseType: !597, size: 64, offset: 1472)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !450, file: !451, line: 916, baseType: !5, size: 32, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !450, file: !451, line: 917, baseType: !601, size: 32, offset: 1568)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !602, line: 113, baseType: !603)
!602 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !602, line: 111, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !603, file: !602, line: 112, baseType: !417, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !432, file: !65, line: 1290, baseType: !607, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!363, !449, !324, !363}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !432, file: !65, line: 1293, baseType: !611, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!614, !324, !449, !324}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !366, line: 19, baseType: !508)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !432, file: !65, line: 1296, baseType: !616, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !324, !66}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !432, file: !65, line: 1298, baseType: !439, size: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !432, file: !65, line: 1299, baseType: !621, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!66, !324, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !432, file: !65, line: 1301, baseType: !435, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !432, file: !65, line: 1302, baseType: !627, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!66, !324, !630, !66}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !632, line: 234, size: 320, elements: !633)
!632 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!633 = !{!634, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !631, file: !632, line: 239, baseType: !635, size: 128)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !631, file: !632, line: 236, size: 128, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !635, file: !632, line: 238, baseType: !301, size: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !631, file: !632, line: 255, baseType: !639, size: 192, offset: 128)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !631, file: !632, line: 241, size: 192, elements: !640)
!640 = !{!641, !653, !654, !655, !656, !657, !659, !660, !661, !670, !671, !672, !673}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !639, file: !632, line: 242, baseType: !642, size: 128)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !643, line: 32, size: 128, elements: !644)
!643 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!644 = !{!645, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !642, file: !643, line: 33, baseType: !646, size: 16)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !643, line: 26, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !648, line: 10, baseType: !509)
!648 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !642, file: !643, line: 34, baseType: !650, size: 112, offset: 16)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 112, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 14)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !639, file: !632, line: 243, baseType: !642, size: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !639, file: !632, line: 244, baseType: !642, size: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !639, file: !632, line: 245, baseType: !642, size: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !639, file: !632, line: 246, baseType: !642, size: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !639, file: !632, line: 247, baseType: !658, size: 16)
!658 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !639, file: !632, line: 248, baseType: !66, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !639, file: !632, line: 249, baseType: !66, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !639, file: !632, line: 250, baseType: !662, size: 192)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !632, line: 196, size: 192, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !662, file: !632, line: 197, baseType: !346, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !662, file: !632, line: 198, baseType: !346, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !662, file: !632, line: 199, baseType: !509, size: 16, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !662, file: !632, line: 200, baseType: !515, size: 8, offset: 144)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !662, file: !632, line: 201, baseType: !515, size: 8, offset: 152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !662, file: !632, line: 202, baseType: !515, size: 8, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !639, file: !632, line: 251, baseType: !301, size: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !639, file: !632, line: 252, baseType: !301, size: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !639, file: !632, line: 253, baseType: !624, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !639, file: !632, line: 254, baseType: !674, size: 128)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !632, line: 207, size: 128, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !674, file: !632, line: 208, baseType: !5, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !674, file: !632, line: 209, baseType: !5, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !674, file: !632, line: 222, baseType: !679, size: 64, offset: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !674, file: !632, line: 210, size: 64, elements: !680)
!680 = !{!681, !689, !696, !708, !714, !721, !732, !740}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !679, file: !632, line: 212, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !684, line: 56, baseType: !685)
!684 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 53, size: 32, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !685, file: !684, line: 54, baseType: !509, size: 16)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !685, file: !684, line: 55, baseType: !509, size: 16, offset: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !679, file: !632, line: 213, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !684, line: 80, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 77, size: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !692, file: !684, line: 78, baseType: !5, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !692, file: !684, line: 79, baseType: !5, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !679, file: !632, line: 214, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !684, line: 66, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 58, size: 192, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !699, file: !684, line: 59, baseType: !5, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !699, file: !684, line: 60, baseType: !5, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !699, file: !684, line: 61, baseType: !5, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !699, file: !684, line: 62, baseType: !5, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !699, file: !684, line: 63, baseType: !5, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !699, file: !684, line: 64, baseType: !509, size: 16, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !699, file: !684, line: 65, baseType: !509, size: 16, offset: 176)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !679, file: !632, line: 215, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !684, line: 70, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 68, size: 32, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !711, file: !684, line: 69, baseType: !5, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !679, file: !632, line: 216, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !684, line: 75, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 72, size: 160, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !717, file: !684, line: 73, baseType: !5, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !717, file: !684, line: 74, baseType: !301, size: 128, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !679, file: !632, line: 217, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !684, line: 89, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 82, size: 192, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !724, file: !684, line: 83, baseType: !509, size: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !724, file: !684, line: 84, baseType: !5, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !724, file: !684, line: 85, baseType: !5, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !724, file: !684, line: 86, baseType: !5, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !724, file: !684, line: 87, baseType: !5, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !724, file: !684, line: 88, baseType: !5, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !679, file: !632, line: 220, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !684, line: 44, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 40, size: 96, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !735, file: !684, line: 41, baseType: !5, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !735, file: !684, line: 42, baseType: !5, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !735, file: !684, line: 43, baseType: !509, size: 16, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !679, file: !632, line: 221, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !684, line: 51, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 46, size: 128, elements: !744)
!744 = !{!745, !746, !747, !748}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !743, file: !684, line: 47, baseType: !5, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !743, file: !684, line: 48, baseType: !5, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !743, file: !684, line: 49, baseType: !509, size: 16, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !743, file: !684, line: 50, baseType: !5, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !432, file: !65, line: 1304, baseType: !750, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!66, !324, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !432, file: !65, line: 1306, baseType: !755, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!66, !324, !66}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !432, file: !65, line: 1308, baseType: !759, size: 64, offset: 896)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!66, !324, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !65, line: 206, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !432, file: !65, line: 1310, baseType: !765, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !324, !5}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !432, file: !65, line: 1313, baseType: !769, size: 64, offset: 1024)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !324, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !774, line: 214, size: 1536, elements: !775)
!774 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !773, file: !774, line: 215, baseType: !367, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !773, file: !774, line: 216, baseType: !367, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !773, file: !774, line: 217, baseType: !367, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !773, file: !774, line: 218, baseType: !367, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !773, file: !774, line: 219, baseType: !367, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !773, file: !774, line: 220, baseType: !367, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !773, file: !774, line: 221, baseType: !367, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !773, file: !774, line: 222, baseType: !367, size: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !773, file: !774, line: 223, baseType: !367, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !773, file: !774, line: 224, baseType: !367, size: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !773, file: !774, line: 227, baseType: !367, size: 64, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !773, file: !774, line: 228, baseType: !367, size: 64, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !773, file: !774, line: 229, baseType: !367, size: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !773, file: !774, line: 230, baseType: !367, size: 64, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !773, file: !774, line: 231, baseType: !367, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !773, file: !774, line: 232, baseType: !367, size: 64, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !773, file: !774, line: 235, baseType: !367, size: 64, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !773, file: !774, line: 236, baseType: !367, size: 64, offset: 1088)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !773, file: !774, line: 237, baseType: !367, size: 64, offset: 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !773, file: !774, line: 238, baseType: !367, size: 64, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !773, file: !774, line: 239, baseType: !367, size: 64, offset: 1280)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !773, file: !774, line: 242, baseType: !367, size: 64, offset: 1344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !773, file: !774, line: 243, baseType: !367, size: 64, offset: 1408)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !773, file: !774, line: 244, baseType: !367, size: 64, offset: 1472)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !432, file: !65, line: 1315, baseType: !801, size: 64, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !806, !66}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !311, line: 30, baseType: !805)
!805 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !432, file: !65, line: 1316, baseType: !809, size: 64, offset: 1152)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!66, !66, !806, !624}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !432, file: !65, line: 1319, baseType: !813, size: 64, offset: 1216)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!816, !324}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !432, file: !65, line: 1321, baseType: !818, size: 64, offset: 1280)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!66, !324, !568, !614}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !432, file: !65, line: 1323, baseType: !818, size: 64, offset: 1344)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !432, file: !65, line: 1331, baseType: !823, size: 64, offset: 1408)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!66, !324, !66, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !366, line: 17, baseType: !514)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !432, file: !65, line: 1333, baseType: !829, size: 64, offset: 1472)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!66, !324, !66, !614, !827, !568}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !432, file: !65, line: 1336, baseType: !833, size: 64, offset: 1536)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!66, !324, !66, !66, !66}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !432, file: !65, line: 1339, baseType: !837, size: 64, offset: 1600)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!66, !324, !66, !804}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !432, file: !65, line: 1341, baseType: !837, size: 64, offset: 1664)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !432, file: !65, line: 1343, baseType: !842, size: 64, offset: 1728)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!66, !324, !66, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !847, line: 20, size: 576, elements: !848)
!847 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!848 = !{!849, !850, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !846, file: !847, line: 21, baseType: !526, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !846, file: !847, line: 22, baseType: !851, size: 256, offset: 32)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 256, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !846, file: !847, line: 23, baseType: !526, size: 32, offset: 288)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !846, file: !847, line: 24, baseType: !526, size: 32, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !846, file: !847, line: 25, baseType: !526, size: 32, offset: 352)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !846, file: !847, line: 26, baseType: !526, size: 32, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !846, file: !847, line: 27, baseType: !526, size: 32, offset: 416)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !846, file: !847, line: 28, baseType: !526, size: 32, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !846, file: !847, line: 29, baseType: !526, size: 32, offset: 480)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !846, file: !847, line: 30, baseType: !526, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !846, file: !847, line: 31, baseType: !568, size: 16, offset: 544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !432, file: !65, line: 1346, baseType: !864, size: 64, offset: 1792)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!66, !324, !66, !66}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !432, file: !65, line: 1348, baseType: !868, size: 64, offset: 1856)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!66, !324, !66, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !847, line: 9, size: 512, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !872, file: !847, line: 10, baseType: !367, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !872, file: !847, line: 11, baseType: !367, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !872, file: !847, line: 12, baseType: !367, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !872, file: !847, line: 13, baseType: !367, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !872, file: !847, line: 14, baseType: !367, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !872, file: !847, line: 15, baseType: !367, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !872, file: !847, line: 16, baseType: !367, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !872, file: !847, line: 17, baseType: !367, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !432, file: !65, line: 1352, baseType: !883, size: 64, offset: 1920)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!66, !324, !66, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !889, line: 213, size: 32, elements: !890)
!889 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !888, file: !889, line: 214, baseType: !508, size: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !888, file: !889, line: 215, baseType: !508, size: 16, offset: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !432, file: !65, line: 1355, baseType: !894, size: 64, offset: 1984)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!66, !324, !66, !449}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !432, file: !65, line: 1357, baseType: !898, size: 64, offset: 2048)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!66, !324, !66, !901, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !774, line: 956, size: 128, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !902, file: !774, line: 957, baseType: !526, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !902, file: !774, line: 958, baseType: !367, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !432, file: !65, line: 1361, baseType: !907, size: 64, offset: 2112)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!66, !324, !66, !365, !66}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !432, file: !65, line: 1364, baseType: !837, size: 64, offset: 2176)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !432, file: !65, line: 1367, baseType: !912, size: 64, offset: 2240)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!66, !324, !71, !624}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !432, file: !65, line: 1400, baseType: !916, size: 64, offset: 2304)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!66, !324, !324, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !921, line: 75, size: 384, elements: !922)
!921 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!922 = !{!923, !924, !927, !931, !935}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !920, file: !921, line: 76, baseType: !326, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !920, file: !921, line: 77, baseType: !925, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !920, file: !921, line: 78, baseType: !928, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !921, line: 78, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !920, file: !921, line: 79, baseType: !932, size: 160, offset: 192)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 160, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 20)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !920, file: !921, line: 80, baseType: !827, size: 8, offset: 352)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !432, file: !65, line: 1403, baseType: !937, size: 64, offset: 2368)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!66, !324, !324}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !432, file: !65, line: 1405, baseType: !941, size: 64, offset: 2432)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!324, !324, !449, !804}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !432, file: !65, line: 1408, baseType: !945, size: 64, offset: 2496)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!363, !324, !363}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !432, file: !65, line: 1410, baseType: !949, size: 64, offset: 2560)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!66, !324, !363}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !432, file: !65, line: 1412, baseType: !953, size: 64, offset: 2624)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!66, !324, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !958, line: 35, flags: DIFlagFwdDecl)
!958 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !432, file: !65, line: 1414, baseType: !960, size: 64, offset: 2688)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !324, !956}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !432, file: !65, line: 1417, baseType: !964, size: 64, offset: 2752)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!66, !967, !886, !324, !979, !614, !614, !919}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !969, line: 8, size: 96, elements: !970)
!969 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!970 = !{!971, !972, !973, !974, !976, !977, !978}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !968, file: !969, line: 9, baseType: !514, size: 8)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !968, file: !969, line: 10, baseType: !514, size: 8, offset: 8)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !968, file: !969, line: 11, baseType: !508, size: 16, offset: 16)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !968, file: !969, line: 12, baseType: !975, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !368, line: 26, baseType: !66)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !968, file: !969, line: 13, baseType: !508, size: 16, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !968, file: !969, line: 14, baseType: !514, size: 8, offset: 80)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !968, file: !969, line: 15, baseType: !514, size: 8, offset: 88)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !432, file: !65, line: 1424, baseType: !982, size: 64, offset: 2816)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!66, !967, !886, !324, !979, !614}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !432, file: !65, line: 1429, baseType: !986, size: 64, offset: 2880)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!66, !449, !989, !324, !324, !1034}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !921, line: 203, size: 1024, elements: !991)
!991 = !{!992, !993, !1003, !1007, !1011, !1012, !1016, !1017, !1018, !1019, !1021, !1022, !1023, !1024}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !990, file: !921, line: 204, baseType: !449, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !990, file: !921, line: 205, baseType: !994, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !889, line: 44, size: 128, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !996, file: !889, line: 45, baseType: !526, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !996, file: !889, line: 46, baseType: !508, size: 16, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !996, file: !889, line: 47, baseType: !508, size: 16, offset: 48)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !996, file: !889, line: 48, baseType: !526, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !996, file: !889, line: 49, baseType: !526, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !990, file: !921, line: 206, baseType: !1004, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!66, !449, !989}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !990, file: !921, line: 208, baseType: !1008, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!66, !989}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !990, file: !921, line: 209, baseType: !624, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !990, file: !921, line: 211, baseType: !1013, size: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1015, line: 76, flags: DIFlagFwdDecl)
!1015 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !990, file: !921, line: 212, baseType: !919, size: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !990, file: !921, line: 213, baseType: !614, size: 16, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !990, file: !921, line: 214, baseType: !614, size: 16, offset: 464)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !990, file: !921, line: 215, baseType: !1020, size: 32, offset: 480)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !366, line: 21, baseType: !526)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !990, file: !921, line: 216, baseType: !5, size: 32, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !990, file: !921, line: 216, baseType: !5, size: 32, offset: 544)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !990, file: !921, line: 217, baseType: !804, size: 8, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, scope: !990, file: !921, line: 218, baseType: !1025, size: 384, offset: 640)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !990, file: !921, line: 218, size: 384, elements: !1026)
!1026 = !{!1027, !1029}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1025, file: !921, line: 219, baseType: !1028, size: 384)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 384, elements: !491)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1025, file: !921, line: 224, baseType: !1030, size: 384)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 384, elements: !1032)
!1031 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1032 = !{!1033}
!1033 = !DISubrange(count: 6)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !432, file: !65, line: 1434, baseType: !1036, size: 64, offset: 2944)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!66, !449, !886, !324, !979, !614, !1020, !1020, !919}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !432, file: !65, line: 1440, baseType: !1040, size: 64, offset: 3008)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!66, !324, !1043, !614, !919}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !432, file: !65, line: 1444, baseType: !1045, size: 64, offset: 3072)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!66, !449, !1020, !1020, !324, !1020, !66}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !432, file: !65, line: 1449, baseType: !1049, size: 64, offset: 3136)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!66, !324, !1043, !614}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !432, file: !65, line: 1452, baseType: !1053, size: 64, offset: 3200)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!66, !324, !804}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !432, file: !65, line: 1454, baseType: !1057, size: 64, offset: 3264)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!66, !324, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !65, line: 820, size: 264, elements: !1062)
!1062 = !{!1063, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1061, file: !65, line: 821, baseType: !1064, size: 256)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 256, elements: !852)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1061, file: !65, line: 822, baseType: !515, size: 8, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !432, file: !65, line: 1456, baseType: !1057, size: 64, offset: 3328)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !432, file: !65, line: 1458, baseType: !1068, size: 64, offset: 3392)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!66, !324, !1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !311, line: 55, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1074, line: 72, baseType: !1075)
!1074 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1074, line: 16, baseType: !346)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !432, file: !65, line: 1460, baseType: !1077, size: 64, offset: 3456)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !324, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !65, line: 67, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !432, file: !65, line: 1462, baseType: !1077, size: 64, offset: 3520)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !432, file: !65, line: 1464, baseType: !1084, size: 64, offset: 3584)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!624, !324, !324}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !432, file: !65, line: 1466, baseType: !1088, size: 64, offset: 3648)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !324, !624}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !432, file: !65, line: 1469, baseType: !1092, size: 64, offset: 3712)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!66, !324, !66, !1020}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !432, file: !65, line: 1472, baseType: !1096, size: 64, offset: 3776)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!66, !806}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !432, file: !65, line: 1473, baseType: !1053, size: 64, offset: 3840)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !432, file: !65, line: 1475, baseType: !1101, size: 64, offset: 3904)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!66, !324, !449}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !432, file: !65, line: 1477, baseType: !616, size: 64, offset: 3968)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !432, file: !65, line: 1479, baseType: !1106, size: 64, offset: 4032)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!66, !324, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !65, line: 894, size: 256, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1110, file: !65, line: 895, baseType: !91, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, scope: !1110, file: !65, line: 896, baseType: !1114, size: 192, offset: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1110, file: !65, line: 896, size: 192, elements: !1115)
!1115 = !{!1116, !1125, !5776}
!1116 = !DIDerivedType(tag: DW_TAG_member, scope: !1114, file: !65, line: 898, baseType: !1117, size: 192)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1114, file: !65, line: 898, size: 192, elements: !1118)
!1118 = !{!1119, !1120, !1124}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1117, file: !65, line: 899, baseType: !1020, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1117, file: !65, line: 900, baseType: !1121, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1123, line: 11, flags: DIFlagFwdDecl)
!1123 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1117, file: !65, line: 901, baseType: !919, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, scope: !1114, file: !65, line: 904, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1114, file: !65, line: 904, size: 64, elements: !1127)
!1127 = !{!1128}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1126, file: !65, line: 905, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !99, line: 222, size: 2560, elements: !1131)
!1131 = !{!1132, !5755, !5756, !5774, !5775}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1130, file: !99, line: 223, baseType: !1133, size: 2048)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !99, line: 141, size: 2048, elements: !1134)
!1134 = !{!1135, !5729, !5730, !5731, !5732, !5733, !5734, !5735, !5736, !5737, !5738, !5739, !5740, !5741, !5746, !5747, !5748, !5749, !5750, !5751, !5752, !5753, !5754}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1133, file: !99, line: 145, baseType: !1136, size: 64, align: 512)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !99, line: 54, size: 2368, elements: !1139)
!1139 = !{!1140, !1339, !1344, !5401, !5405, !5409, !5410, !5414, !5420, !5421, !5422, !5423, !5424, !5428, !5432, !5436, !5437, !5438, !5442, !5443, !5455, !5459, !5463, !5475, !5664, !5668, !5672, !5677, !5681, !5685, !5689, !5695, !5699, !5706, !5710, !5712, !5713}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1138, file: !99, line: 56, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!66, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !130, line: 483, size: 960, align: 64, elements: !1146)
!1146 = !{!1147, !1163, !1174, !1185, !1209, !1215, !1223, !1240, !1253, !1259, !1268, !1273, !1281, !1293, !1313, !1320, !1324, !1328, !1333}
!1147 = !DIDerivedType(tag: DW_TAG_member, scope: !1145, file: !130, line: 484, baseType: !1148, size: 512)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1145, file: !130, line: 484, size: 512, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1148, file: !130, line: 485, baseType: !526, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1148, file: !130, line: 486, baseType: !526, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1148, file: !130, line: 487, baseType: !526, size: 32, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1148, file: !130, line: 488, baseType: !526, size: 32, offset: 96)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1148, file: !130, line: 489, baseType: !526, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1148, file: !130, line: 492, baseType: !526, size: 32, offset: 160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1148, file: !130, line: 493, baseType: !526, size: 32, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1148, file: !130, line: 496, baseType: !301, size: 128, offset: 224)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1148, file: !130, line: 497, baseType: !526, size: 32, offset: 352)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1148, file: !130, line: 498, baseType: !526, size: 32, offset: 384)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1148, file: !130, line: 499, baseType: !526, size: 32, offset: 416)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1148, file: !130, line: 500, baseType: !526, size: 32, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1148, file: !130, line: 501, baseType: !526, size: 32, offset: 480)
!1163 = !DIDerivedType(tag: DW_TAG_member, scope: !1145, file: !130, line: 507, baseType: !1164, size: 256)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1145, file: !130, line: 507, size: 256, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1173}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1164, file: !130, line: 508, baseType: !526, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1164, file: !130, line: 509, baseType: !367, size: 64, align: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, scope: !1164, file: !130, line: 510, baseType: !1169, size: 64, offset: 128)
!1169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1164, file: !130, line: 510, size: 64, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1169, file: !130, line: 511, baseType: !367, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1169, file: !130, line: 512, baseType: !367, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !130, line: 514, baseType: !367, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1145, file: !130, line: 532, baseType: !1175, size: 448)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1145, file: !130, line: 517, size: 448, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1175, file: !130, line: 518, baseType: !367, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1175, file: !130, line: 521, baseType: !367, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1175, file: !130, line: 522, baseType: !367, size: 64, align: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1175, file: !130, line: 523, baseType: !367, size: 64, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1175, file: !130, line: 524, baseType: !526, size: 32, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1175, file: !130, line: 529, baseType: !526, size: 32, offset: 288)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1175, file: !130, line: 530, baseType: !367, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1175, file: !130, line: 531, baseType: !367, size: 64, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, scope: !1145, file: !130, line: 534, baseType: !1186, size: 960)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1145, file: !130, line: 534, size: 960, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1186, file: !130, line: 535, baseType: !526, size: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1186, file: !130, line: 536, baseType: !526, size: 32, offset: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1186, file: !130, line: 537, baseType: !367, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1186, file: !130, line: 538, baseType: !367, size: 64, align: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1186, file: !130, line: 539, baseType: !526, size: 32, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1186, file: !130, line: 540, baseType: !526, size: 32, offset: 224)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1186, file: !130, line: 541, baseType: !367, size: 64, align: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1186, file: !130, line: 542, baseType: !526, size: 32, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1186, file: !130, line: 543, baseType: !526, size: 32, offset: 352)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1186, file: !130, line: 544, baseType: !301, size: 128, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1186, file: !130, line: 545, baseType: !526, size: 32, offset: 512)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1186, file: !130, line: 550, baseType: !526, size: 32, offset: 544)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1186, file: !130, line: 551, baseType: !526, size: 32, offset: 576)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1186, file: !130, line: 552, baseType: !526, size: 32, offset: 608)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1186, file: !130, line: 553, baseType: !367, size: 64, align: 64, offset: 640)
