; ModuleID = '../bcout/drivers/acpi/x86/apple.llvm.bc'
source_filename = "drivers/acpi/x86/apple.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.guid_t = type { [16 x i8] }
%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>

!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 10, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !70, line: 305, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!76 = !{!77, !79, !86, !87, !83, !7, !90}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !78, line: 148, baseType: !7)
!78 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !80, line: 127, baseType: !81)
!80 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !82, line: 23, baseType: !83)
!82 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !84, line: 31, baseType: !85)
!84 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!85 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !89)
!89 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!90 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !{!0}
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "guid_t", file: !94, line: 25, baseType: !95)
!94 = !DIFile(filename: "./include/uapi/linux/uuid.h", directory: "/home/lizy2001/genbc/linux")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 23, size: 128, elements: !96)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !95, file: !94, line: 24, baseType: !98, size: 128)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !101)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !84, line: 21, baseType: !100)
!100 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!101 = !{!102}
!102 = !DISubrange(count: 16)
!103 = !{!"rsp"}
!104 = !{i32 7, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{i32 1, !"wchar_size", i32 2}
!107 = !{i32 1, !"Code Model", i32 2}
!108 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!109 = distinct !DISubprogram(name: "acpi_extract_apple_properties", scope: !3, file: !3, line: 27, type: !110, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !193)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !114, line: 351, size: 10880, elements: !115)
!114 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!115 = !{!116, !118, !120, !2172, !2173, !2174, !2175, !2176, !2177, !2186, !2203, !2277, !2306, !2330, !2351, !2357, !2366, !2396, !2410, !2432, !2436, !2437, !2438, !2439, !2440, !2441, !2442}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !113, file: !114, line: 352, baseType: !117, size: 32)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !113, file: !114, line: 353, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !80, line: 424, baseType: !86)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !113, file: !114, line: 354, baseType: !121, size: 192, offset: 128)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !122, line: 17, size: 192, elements: !123)
!122 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!123 = !{!124, !126, !2171}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !121, file: !122, line: 18, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !121, file: !122, line: 19, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !122, line: 110, size: 1152, elements: !130)
!130 = !{!131, !135, !139, !147, !2113, !2117, !2121, !2126, !2130, !2131, !2135, !2139, !2143, !2154, !2155, !2156, !2157, !2167}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !129, file: !122, line: 111, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!125, !125}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !129, file: !122, line: 112, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !125}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !129, file: !122, line: 113, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !78, line: 30, baseType: !144)
!144 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !129, file: !122, line: 114, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !145, !153}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !156)
!156 = !{!157, !1646, !1648, !1651, !1652, !1703, !1800, !1801, !1802, !1803, !1804, !1813, !1918, !1931, !2038, !2039, !2043, !2045, !2046, !2047, !2051, !2057, !2058, !2061, !2062, !2063, !2066, !2067, !2068, !2069, !2101, !2102, !2103, !2106, !2109, !2110, !2111, !2112}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !155, file: !30, line: 462, baseType: !158, size: 512)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !159, line: 64, size: 512, elements: !160)
!159 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!160 = !{!161, !165, !171, !173, !233, !1483, !1636, !1641, !1642, !1643, !1644, !1645}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !159, line: 65, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !158, file: !159, line: 66, baseType: !166, size: 128, offset: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !78, line: 178, size: 128, elements: !167)
!167 = !{!168, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !78, line: 179, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !78, line: 179, baseType: !169, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !158, file: !159, line: 67, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !158, file: !159, line: 68, baseType: !174, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !159, line: 192, size: 704, elements: !176)
!176 = !{!177, !178, !194, !195}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !175, file: !159, line: 193, baseType: !166, size: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !175, file: !159, line: 194, baseType: !179, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !180, line: 83, baseType: !181)
!180 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !180, line: 71, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !180, line: 72, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !180, line: 72, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !184, file: !180, line: 73, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !180, line: 20, elements: !188)
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !187, file: !180, line: 21, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !191, line: 25, baseType: !192)
!191 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 25, elements: !193)
!193 = !{}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !175, file: !159, line: 195, baseType: !158, size: 512, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !175, file: !159, line: 196, baseType: !196, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !159, line: 156, size: 192, elements: !199)
!199 = !{!200, !205, !210}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !198, file: !159, line: 157, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!117, !174, !172}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !159, line: 158, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!162, !174, !172}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !198, file: !159, line: 159, baseType: !211, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!117, !174, !172, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !159, line: 148, size: 20736, elements: !217)
!217 = !{!218, !223, !227, !228, !232}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !216, file: !159, line: 149, baseType: !219, size: 192)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 192, elements: !221)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!221 = !{!222}
!222 = !DISubrange(count: 3)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !216, file: !159, line: 150, baseType: !224, size: 4096, offset: 192)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 4096, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !216, file: !159, line: 151, baseType: !117, size: 32, offset: 4288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !216, file: !159, line: 152, baseType: !229, size: 16384, offset: 4320)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 16384, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 2048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !216, file: !159, line: 153, baseType: !117, size: 32, offset: 20704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !158, file: !159, line: 69, baseType: !234, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !159, line: 138, size: 448, elements: !236)
!236 = !{!237, !241, !269, !271, !1430, !1461, !1465}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !235, file: !159, line: 139, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !172}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !235, file: !159, line: 140, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !245, line: 230, size: 128, elements: !246)
!245 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!246 = !{!247, !262}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !244, file: !245, line: 231, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !172, !255, !220}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 60, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !253, line: 73, baseType: !254)
!253 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !253, line: 15, baseType: !89)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !245, line: 30, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !245, line: 31, baseType: !162, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !256, file: !245, line: 32, baseType: !260, size: 16, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !78, line: 19, baseType: !261)
!261 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !244, file: !245, line: 232, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!251, !172, !255, !162, !266}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 55, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !253, line: 72, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !253, line: 16, baseType: !90)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !235, file: !159, line: 141, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !235, file: !159, line: 142, baseType: !272, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !245, line: 84, size: 320, elements: !276)
!276 = !{!277, !278, !282, !1427, !1428}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !245, line: 85, baseType: !162, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !275, file: !245, line: 86, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!260, !172, !255, !117}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !275, file: !245, line: 88, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!260, !172, !286, !117}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !245, line: 168, size: 448, elements: !288)
!288 = !{!289, !290, !291, !292, !302, !303}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !287, file: !245, line: 169, baseType: !256, size: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !287, file: !245, line: 170, baseType: !266, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !287, file: !245, line: 171, baseType: !86, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !287, file: !245, line: 172, baseType: !293, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!251, !296, !172, !286, !220, !299, !266}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !298, line: 526, flags: DIFlagFwdDecl)
!298 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !78, line: 46, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !253, line: 88, baseType: !301)
!301 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !287, file: !245, line: 174, baseType: !293, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !287, file: !245, line: 176, baseType: !304, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!117, !296, !172, !286, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !309, line: 305, size: 1472, elements: !310)
!309 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!310 = !{!311, !312, !313, !314, !315, !323, !324, !1401, !1407, !1408, !1413, !1414, !1417, !1421, !1422, !1423, !1424, !1425}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !308, file: !309, line: 308, baseType: !90, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !308, file: !309, line: 309, baseType: !90, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !308, file: !309, line: 313, baseType: !307, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !308, file: !309, line: 313, baseType: !307, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !308, file: !309, line: 315, baseType: !316, size: 192, align: 64, offset: 256)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !317, line: 24, size: 192, align: 64, elements: !318)
!317 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!318 = !{!319, !320, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !316, file: !317, line: 25, baseType: !90, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !316, file: !317, line: 26, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !316, file: !317, line: 27, baseType: !321, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !308, file: !309, line: 323, baseType: !90, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !308, file: !309, line: 327, baseType: !325, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !309, line: 388, size: 7296, elements: !327)
!327 = !{!328, !1397}
!328 = !DIDerivedType(tag: DW_TAG_member, scope: !326, file: !309, line: 389, baseType: !329, size: 7296)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !309, line: 389, size: 7296, elements: !330)
!330 = !{!331, !332, !336, !337, !341, !342, !343, !344, !345, !353, !358, !359, !360, !361, !370, !371, !372, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !407, !415, !418, !466, !467, !1368, !1369, !1372, !1375, !1376, !1379, !1380, !1381, !1384, !1396}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !329, file: !309, line: 390, baseType: !307, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !329, file: !309, line: 391, baseType: !333, size: 64, offset: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !317, line: 31, size: 64, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !333, file: !317, line: 32, baseType: !321, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !329, file: !309, line: 392, baseType: !81, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !329, file: !309, line: 394, baseType: !338, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!90, !296, !90, !90, !90, !90}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !329, file: !309, line: 398, baseType: !90, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !329, file: !309, line: 399, baseType: !90, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !329, file: !309, line: 405, baseType: !90, size: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !329, file: !309, line: 406, baseType: !90, size: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !329, file: !309, line: 407, baseType: !346, size: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !298, line: 286, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 286, size: 64, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !348, file: !298, line: 286, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !352, line: 18, baseType: !90)
!352 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !329, file: !309, line: 416, baseType: !354, size: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !78, line: 168, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 166, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !355, file: !78, line: 167, baseType: !117, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !329, file: !309, line: 428, baseType: !354, size: 32, offset: 608)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !329, file: !309, line: 437, baseType: !354, size: 32, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !329, file: !309, line: 447, baseType: !354, size: 32, offset: 672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !329, file: !309, line: 450, baseType: !362, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !363, line: 13, baseType: !364)
!363 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !78, line: 175, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 173, size: 64, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !365, file: !78, line: 174, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !82, line: 22, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !84, line: 30, baseType: !301)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !329, file: !309, line: 452, baseType: !117, size: 32, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !329, file: !309, line: 454, baseType: !179, offset: 800)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !329, file: !309, line: 457, baseType: !373, size: 256, offset: 832)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !374, line: 35, size: 256, elements: !375)
!374 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!375 = !{!376, !377, !378, !380}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !373, file: !374, line: 36, baseType: !362, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !373, file: !374, line: 42, baseType: !362, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !373, file: !374, line: 46, baseType: !379, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !180, line: 29, baseType: !187)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !373, file: !374, line: 47, baseType: !166, size: 128, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !329, file: !309, line: 459, baseType: !166, size: 128, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !329, file: !309, line: 466, baseType: !90, size: 64, offset: 1216)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !329, file: !309, line: 467, baseType: !90, size: 64, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !329, file: !309, line: 469, baseType: !90, size: 64, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !329, file: !309, line: 470, baseType: !90, size: 64, offset: 1408)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !329, file: !309, line: 471, baseType: !364, size: 64, offset: 1472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !329, file: !309, line: 472, baseType: !90, size: 64, offset: 1536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !329, file: !309, line: 473, baseType: !90, size: 64, offset: 1600)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !329, file: !309, line: 474, baseType: !90, size: 64, offset: 1664)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !329, file: !309, line: 475, baseType: !90, size: 64, offset: 1728)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !329, file: !309, line: 477, baseType: !179, offset: 1792)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !329, file: !309, line: 478, baseType: !90, size: 64, offset: 1792)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !329, file: !309, line: 478, baseType: !90, size: 64, offset: 1856)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !329, file: !309, line: 478, baseType: !90, size: 64, offset: 1920)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !329, file: !309, line: 478, baseType: !90, size: 64, offset: 1984)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !329, file: !309, line: 479, baseType: !90, size: 64, offset: 2048)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !329, file: !309, line: 479, baseType: !90, size: 64, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !329, file: !309, line: 479, baseType: !90, size: 64, offset: 2176)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !329, file: !309, line: 480, baseType: !90, size: 64, offset: 2240)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !329, file: !309, line: 480, baseType: !90, size: 64, offset: 2304)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !329, file: !309, line: 480, baseType: !90, size: 64, offset: 2368)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !329, file: !309, line: 480, baseType: !90, size: 64, offset: 2432)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !329, file: !309, line: 482, baseType: !404, size: 2816, offset: 2496)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 2816, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 44)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !329, file: !309, line: 488, baseType: !408, size: 256, offset: 5312)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !409, line: 60, size: 256, elements: !410)
!409 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !408, file: !409, line: 61, baseType: !412, size: 256)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 256, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 4)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !329, file: !309, line: 490, baseType: !416, size: 64, offset: 5568)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !309, line: 490, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !329, file: !309, line: 493, baseType: !419, size: 896, offset: 5632)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !420, line: 53, baseType: !421)
!420 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 13, size: 896, elements: !422)
!422 = !{!423, !424, !425, !426, !429, !430, !437, !438, !458, !459, !462}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !421, file: !420, line: 18, baseType: !81, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !421, file: !420, line: 28, baseType: !364, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !421, file: !420, line: 31, baseType: !373, size: 256, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !421, file: !420, line: 32, baseType: !427, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !420, line: 32, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !421, file: !420, line: 37, baseType: !261, size: 16, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !421, file: !420, line: 40, baseType: !431, size: 192, offset: 512)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !432, line: 53, size: 192, elements: !433)
!432 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !431, file: !432, line: 54, baseType: !362, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !431, file: !432, line: 55, baseType: !179, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !431, file: !432, line: 59, baseType: !166, size: 128, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !421, file: !420, line: 41, baseType: !86, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !421, file: !420, line: 42, baseType: !439, size: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !442, line: 13, size: 896, elements: !443)
!442 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !442, line: 14, baseType: !86, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !441, file: !442, line: 15, baseType: !90, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !441, file: !442, line: 17, baseType: !90, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !441, file: !442, line: 17, baseType: !90, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !441, file: !442, line: 19, baseType: !89, size: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !441, file: !442, line: 21, baseType: !89, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !441, file: !442, line: 22, baseType: !89, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !441, file: !442, line: 23, baseType: !89, size: 64, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !441, file: !442, line: 24, baseType: !89, size: 64, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !441, file: !442, line: 25, baseType: !89, size: 64, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !441, file: !442, line: 26, baseType: !89, size: 64, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !441, file: !442, line: 27, baseType: !89, size: 64, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !441, file: !442, line: 28, baseType: !89, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !441, file: !442, line: 29, baseType: !89, size: 64, offset: 832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !421, file: !420, line: 44, baseType: !354, size: 32, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !421, file: !420, line: 50, baseType: !460, size: 16, offset: 864)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !82, line: 19, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !84, line: 24, baseType: !261)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !421, file: !420, line: 51, baseType: !463, size: 16, offset: 880)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !82, line: 18, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !84, line: 23, baseType: !465)
!465 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !329, file: !309, line: 495, baseType: !90, size: 64, offset: 6528)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !329, file: !309, line: 497, baseType: !468, size: 64, offset: 6592)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !309, line: 381, size: 384, elements: !470)
!470 = !{!471, !472, !1367}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !469, file: !309, line: 382, baseType: !354, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !469, file: !309, line: 383, baseType: !473, size: 128, offset: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !309, line: 376, size: 128, elements: !474)
!474 = !{!475, !1365}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !473, file: !309, line: 377, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !478, line: 640, size: 48640, elements: !479)
!478 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!479 = !{!480, !488, !489, !490, !496, !497, !498, !499, !500, !501, !502, !503, !507, !525, !536, !629, !630, !631, !642, !643, !645, !646, !647, !648, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !727, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !783, !785, !786, !787, !799, !801, !802, !803, !804, !805, !811, !812, !813, !814, !815, !816, !817, !829, !834, !838, !839, !840, !843, !845, !848, !851, !854, !857, !860, !863, !866, !872, !873, !874, !880, !881, !882, !883, !884, !893, !894, !895, !896, !897, !902, !903, !904, !907, !908, !911, !914, !917, !920, !923, !926, !927, !1007, !1010, !1013, !1014, !1017, !1018, !1019, !1025, !1026, !1027, !1040, !1041, !1042, !1052, !1057, !1060, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !477, file: !478, line: 646, baseType: !481, size: 128)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !482, line: 56, size: 128, elements: !483)
!482 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !481, file: !482, line: 57, baseType: !90, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !481, file: !482, line: 58, baseType: !486, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !82, line: 21, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !84, line: 27, baseType: !7)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !477, file: !478, line: 649, baseType: !88, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !477, file: !478, line: 657, baseType: !86, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !477, file: !478, line: 658, baseType: !491, size: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !492, line: 113, baseType: !493)
!492 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !492, line: 111, size: 32, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !493, file: !492, line: 112, baseType: !354, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !477, file: !478, line: 660, baseType: !7, size: 32, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !477, file: !478, line: 661, baseType: !7, size: 32, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !477, file: !478, line: 684, baseType: !117, size: 32, offset: 352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !477, file: !478, line: 686, baseType: !117, size: 32, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !477, file: !478, line: 687, baseType: !117, size: 32, offset: 416)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !477, file: !478, line: 688, baseType: !117, size: 32, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !477, file: !478, line: 689, baseType: !7, size: 32, offset: 480)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !477, file: !478, line: 691, baseType: !504, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !478, line: 691, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !477, file: !478, line: 692, baseType: !508, size: 832, offset: 576)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !478, line: 451, size: 832, elements: !509)
!509 = !{!510, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !508, file: !478, line: 453, baseType: !511, size: 128)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !478, line: 325, size: 128, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !511, file: !478, line: 326, baseType: !90, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !511, file: !478, line: 327, baseType: !486, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !508, file: !478, line: 454, baseType: !316, size: 192, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !508, file: !478, line: 455, baseType: !166, size: 128, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !508, file: !478, line: 456, baseType: !7, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !508, file: !478, line: 458, baseType: !81, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !508, file: !478, line: 459, baseType: !81, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !508, file: !478, line: 460, baseType: !81, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !508, file: !478, line: 461, baseType: !81, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !508, file: !478, line: 463, baseType: !81, size: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !508, file: !478, line: 465, baseType: !524, offset: 832)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !478, line: 415, elements: !193)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !477, file: !478, line: 693, baseType: !526, size: 384, offset: 1408)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !478, line: 489, size: 384, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !526, file: !478, line: 490, baseType: !166, size: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !526, file: !478, line: 491, baseType: !90, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !526, file: !478, line: 492, baseType: !90, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !526, file: !478, line: 493, baseType: !7, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !526, file: !478, line: 494, baseType: !261, size: 16, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !526, file: !478, line: 495, baseType: !261, size: 16, offset: 304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !526, file: !478, line: 497, baseType: !535, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !477, file: !478, line: 697, baseType: !537, size: 1792, offset: 1792)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !478, line: 507, size: 1792, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !626, !627}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !537, file: !478, line: 508, baseType: !316, size: 192, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !537, file: !478, line: 515, baseType: !81, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !537, file: !478, line: 516, baseType: !81, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !537, file: !478, line: 517, baseType: !81, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !537, file: !478, line: 518, baseType: !81, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !537, file: !478, line: 519, baseType: !81, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !537, file: !478, line: 526, baseType: !368, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !537, file: !478, line: 527, baseType: !81, size: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !537, file: !478, line: 528, baseType: !7, size: 32, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !537, file: !478, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !537, file: !478, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !537, file: !478, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !537, file: !478, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !537, file: !478, line: 563, baseType: !553, size: 512, offset: 704)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !554)
!554 = !{!555, !563, !564, !569, !621, !623, !624, !625}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !553, file: !6, line: 119, baseType: !556, size: 256)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !557, line: 9, size: 256, elements: !558)
!557 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !556, file: !557, line: 10, baseType: !316, size: 192, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !556, file: !557, line: 11, baseType: !561, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !562, line: 29, baseType: !368)
!562 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !553, file: !6, line: 120, baseType: !561, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !553, file: !6, line: 121, baseType: !565, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!5, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !553, file: !6, line: 122, baseType: !570, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !572)
!572 = !{!573, !593, !594, !597, !607, !608, !616, !620}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !571, file: !6, line: 160, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !575, file: !6, line: 215, baseType: !379)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !575, file: !6, line: 216, baseType: !7, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !575, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !575, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !575, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !575, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !575, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !575, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !575, file: !6, line: 233, baseType: !561, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !575, file: !6, line: 234, baseType: !568, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !575, file: !6, line: 235, baseType: !561, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !575, file: !6, line: 236, baseType: !568, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !575, file: !6, line: 237, baseType: !590, size: 4096, offset: 512)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 4096, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !571, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !571, file: !6, line: 162, baseType: !595, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !78, line: 27, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !253, line: 96, baseType: !117)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !571, file: !6, line: 163, baseType: !598, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !599, line: 276, baseType: !600)
!599 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !599, line: 276, size: 32, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !600, file: !599, line: 276, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !599, line: 70, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !599, line: 65, size: 32, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !604, file: !599, line: 66, baseType: !7, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !571, file: !6, line: 164, baseType: !568, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !571, file: !6, line: 165, baseType: !609, size: 128, offset: 256)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !557, line: 14, size: 128, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !609, file: !557, line: 15, baseType: !612, size: 128)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !317, line: 125, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !612, file: !317, line: 126, baseType: !333, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !612, file: !317, line: 127, baseType: !321, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !571, file: !6, line: 166, baseType: !617, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!561}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !571, file: !6, line: 167, baseType: !561, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !553, file: !6, line: 123, baseType: !622, size: 8, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !82, line: 17, baseType: !99)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !553, file: !6, line: 124, baseType: !622, size: 8, offset: 456)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !553, file: !6, line: 125, baseType: !622, size: 8, offset: 464)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !553, file: !6, line: 126, baseType: !622, size: 8, offset: 472)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !537, file: !478, line: 572, baseType: !553, size: 512, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !537, file: !478, line: 580, baseType: !628, size: 64, offset: 1728)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !477, file: !478, line: 721, baseType: !7, size: 32, offset: 3584)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !477, file: !478, line: 722, baseType: !117, size: 32, offset: 3616)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !477, file: !478, line: 723, baseType: !632, size: 64, offset: 3648)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !635, line: 17, baseType: !636)
!635 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !635, line: 17, size: 64, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !636, file: !635, line: 17, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 1)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !477, file: !478, line: 724, baseType: !634, size: 64, offset: 3712)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !477, file: !478, line: 749, baseType: !644, offset: 3776)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !478, line: 290, elements: !193)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !477, file: !478, line: 751, baseType: !166, size: 128, offset: 3776)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !477, file: !478, line: 757, baseType: !325, size: 64, offset: 3904)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !477, file: !478, line: 758, baseType: !325, size: 64, offset: 3968)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !477, file: !478, line: 761, baseType: !649, size: 320, offset: 4032)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !409, line: 34, size: 320, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !649, file: !409, line: 35, baseType: !81, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !649, file: !409, line: 36, baseType: !653, size: 256, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 256, elements: !413)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !477, file: !478, line: 766, baseType: !117, size: 32, offset: 4352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !477, file: !478, line: 767, baseType: !117, size: 32, offset: 4384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !477, file: !478, line: 768, baseType: !117, size: 32, offset: 4416)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !477, file: !478, line: 770, baseType: !117, size: 32, offset: 4448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !477, file: !478, line: 772, baseType: !90, size: 64, offset: 4480)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !477, file: !478, line: 775, baseType: !7, size: 32, offset: 4544)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !477, file: !478, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !477, file: !478, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !477, file: !478, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !477, file: !478, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !477, file: !478, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !477, file: !478, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !477, file: !478, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !477, file: !478, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !477, file: !478, line: 831, baseType: !90, size: 64, offset: 4672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !477, file: !478, line: 833, baseType: !670, size: 384, offset: 4736)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !671)
!671 = !{!672, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !670, file: !12, line: 26, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!89, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !12, line: 27, baseType: !678, size: 320, offset: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !12, line: 27, size: 320, elements: !679)
!679 = !{!680, !690, !717}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !678, file: !12, line: 36, baseType: !681, size: 320)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !12, line: 29, size: 320, elements: !682)
!682 = !{!683, !685, !686, !687, !688, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !681, file: !12, line: 30, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !681, file: !12, line: 31, baseType: !486, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !681, file: !12, line: 32, baseType: !486, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !681, file: !12, line: 33, baseType: !486, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !681, file: !12, line: 34, baseType: !81, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !681, file: !12, line: 35, baseType: !684, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !678, file: !12, line: 46, baseType: !691, size: 192)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !12, line: 38, size: 192, elements: !692)
!692 = !{!693, !694, !695, !716}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !691, file: !12, line: 39, baseType: !595, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, scope: !691, file: !12, line: 41, baseType: !696, size: 64, offset: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !12, line: 41, size: 64, elements: !697)
!697 = !{!698, !706}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !696, file: !12, line: 42, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !701, line: 7, size: 128, elements: !702)
!701 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !700, file: !701, line: 8, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !253, line: 93, baseType: !301)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !700, file: !701, line: 9, baseType: !301, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !696, file: !12, line: 43, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !709, line: 7, size: 64, elements: !710)
!709 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!710 = !{!711, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !708, file: !709, line: 8, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !709, line: 5, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !82, line: 20, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !84, line: 26, baseType: !117)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !708, file: !709, line: 9, baseType: !713, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !691, file: !12, line: 45, baseType: !81, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !678, file: !12, line: 54, baseType: !718, size: 256)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !12, line: 48, size: 256, elements: !719)
!719 = !{!720, !723, !724, !725, !726}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !718, file: !12, line: 49, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !718, file: !12, line: 50, baseType: !117, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !718, file: !12, line: 51, baseType: !117, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !718, file: !12, line: 52, baseType: !90, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !718, file: !12, line: 53, baseType: !90, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !477, file: !478, line: 835, baseType: !728, size: 32, offset: 5120)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !78, line: 22, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !253, line: 28, baseType: !117)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !477, file: !478, line: 836, baseType: !728, size: 32, offset: 5152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !477, file: !478, line: 840, baseType: !90, size: 64, offset: 5184)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !477, file: !478, line: 849, baseType: !476, size: 64, offset: 5248)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !477, file: !478, line: 852, baseType: !476, size: 64, offset: 5312)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !477, file: !478, line: 857, baseType: !166, size: 128, offset: 5376)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !477, file: !478, line: 858, baseType: !166, size: 128, offset: 5504)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !477, file: !478, line: 859, baseType: !476, size: 64, offset: 5632)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !477, file: !478, line: 867, baseType: !166, size: 128, offset: 5696)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !477, file: !478, line: 868, baseType: !166, size: 128, offset: 5824)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !477, file: !478, line: 871, baseType: !740, size: 64, offset: 5952)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !742, line: 59, size: 768, elements: !743)
!742 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!743 = !{!744, !745, !746, !747, !758, !759, !766, !775}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !741, file: !742, line: 61, baseType: !491, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !741, file: !742, line: 62, baseType: !7, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !741, file: !742, line: 63, baseType: !179, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !741, file: !742, line: 65, baseType: !748, size: 256, offset: 64)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 256, elements: !413)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !78, line: 182, size: 64, elements: !750)
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !749, file: !78, line: 183, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !78, line: 186, size: 128, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !78, line: 187, baseType: !752, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !753, file: !78, line: 187, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !741, file: !742, line: 66, baseType: !749, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !741, file: !742, line: 68, baseType: !760, size: 128, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !761, line: 40, baseType: !762)
!761 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !761, line: 36, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !762, file: !761, line: 37, baseType: !179)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !762, file: !761, line: 38, baseType: !166, size: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !741, file: !742, line: 69, baseType: !767, size: 128, align: 64, offset: 512)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !78, line: 216, size: 128, align: 64, elements: !768)
!768 = !{!769, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !78, line: 217, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !767, file: !78, line: 218, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !770}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !741, file: !742, line: 70, baseType: !776, size: 128, offset: 640)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 128, elements: !640)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !742, line: 54, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !777, file: !742, line: 55, baseType: !117, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !777, file: !742, line: 56, baseType: !781, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !742, line: 56, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !477, file: !478, line: 872, baseType: !784, size: 512, offset: 6016)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 512, elements: !413)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !477, file: !478, line: 873, baseType: !166, size: 128, offset: 6528)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !477, file: !478, line: 874, baseType: !166, size: 128, offset: 6656)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !477, file: !478, line: 876, baseType: !788, size: 64, offset: 6784)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !790, line: 26, size: 192, elements: !791)
!790 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !789, file: !790, line: 27, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !789, file: !790, line: 28, baseType: !794, size: 128, offset: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !795, line: 43, size: 128, elements: !796)
!795 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !794, file: !795, line: 44, baseType: !379)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !794, file: !795, line: 45, baseType: !166, size: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !477, file: !478, line: 879, baseType: !800, size: 64, offset: 6848)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !477, file: !478, line: 882, baseType: !800, size: 64, offset: 6912)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !477, file: !478, line: 884, baseType: !81, size: 64, offset: 6976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !477, file: !478, line: 885, baseType: !81, size: 64, offset: 7040)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !477, file: !478, line: 890, baseType: !81, size: 64, offset: 7104)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !477, file: !478, line: 891, baseType: !806, size: 128, offset: 7168)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !478, line: 242, size: 128, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !806, file: !478, line: 244, baseType: !81, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !806, file: !478, line: 245, baseType: !81, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !806, file: !478, line: 246, baseType: !379, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !477, file: !478, line: 900, baseType: !90, size: 64, offset: 7296)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !477, file: !478, line: 901, baseType: !90, size: 64, offset: 7360)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !477, file: !478, line: 904, baseType: !81, size: 64, offset: 7424)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !477, file: !478, line: 907, baseType: !81, size: 64, offset: 7488)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !477, file: !478, line: 910, baseType: !90, size: 64, offset: 7552)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !477, file: !478, line: 911, baseType: !90, size: 64, offset: 7616)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !477, file: !478, line: 914, baseType: !818, size: 640, offset: 7680)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !819, line: 123, size: 640, elements: !820)
!819 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!820 = !{!821, !827, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !818, file: !819, line: 124, baseType: !822, size: 576)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 576, elements: !221)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !819, line: 108, size: 192, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !823, file: !819, line: 109, baseType: !81, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !823, file: !819, line: 110, baseType: !609, size: 128, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !818, file: !819, line: 125, baseType: !7, size: 32, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !818, file: !819, line: 126, baseType: !7, size: 32, offset: 608)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !477, file: !478, line: 917, baseType: !830, size: 192, offset: 8320)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !819, line: 134, size: 192, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !830, file: !819, line: 135, baseType: !767, size: 128, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !830, file: !819, line: 136, baseType: !7, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !477, file: !478, line: 923, baseType: !835, size: 64, offset: 8512)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !478, line: 923, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !477, file: !478, line: 926, baseType: !835, size: 64, offset: 8576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !477, file: !478, line: 929, baseType: !835, size: 64, offset: 8640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !477, file: !478, line: 933, baseType: !841, size: 64, offset: 8704)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !478, line: 933, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !477, file: !478, line: 943, baseType: !844, size: 128, offset: 8768)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !101)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !477, file: !478, line: 945, baseType: !846, size: 64, offset: 8896)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !478, line: 49, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !477, file: !478, line: 956, baseType: !849, size: 64, offset: 8960)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !478, line: 45, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !477, file: !478, line: 959, baseType: !852, size: 64, offset: 9024)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !478, line: 959, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !477, file: !478, line: 962, baseType: !855, size: 64, offset: 9088)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !478, line: 66, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !477, file: !478, line: 966, baseType: !858, size: 64, offset: 9152)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !478, line: 50, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !477, file: !478, line: 969, baseType: !861, size: 64, offset: 9216)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !819, line: 223, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !477, file: !478, line: 970, baseType: !864, size: 64, offset: 9280)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !478, line: 62, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !477, file: !478, line: 971, baseType: !867, size: 64, offset: 9344)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !868, line: 25, baseType: !869)
!868 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !868, line: 23, size: 64, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !869, file: !868, line: 24, baseType: !639, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !477, file: !478, line: 972, baseType: !867, size: 64, offset: 9408)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !477, file: !478, line: 974, baseType: !867, size: 64, offset: 9472)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !477, file: !478, line: 975, baseType: !875, size: 192, offset: 9536)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !876, line: 30, size: 192, elements: !877)
!876 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !875, file: !876, line: 31, baseType: !166, size: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !875, file: !876, line: 32, baseType: !867, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !477, file: !478, line: 976, baseType: !90, size: 64, offset: 9728)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !477, file: !478, line: 977, baseType: !266, size: 64, offset: 9792)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !477, file: !478, line: 978, baseType: !7, size: 32, offset: 9856)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !477, file: !478, line: 980, baseType: !770, size: 64, offset: 9920)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !477, file: !478, line: 989, baseType: !885, size: 128, offset: 9984)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !886, line: 35, size: 128, elements: !887)
!886 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !885, file: !886, line: 36, baseType: !117, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !885, file: !886, line: 37, baseType: !354, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !885, file: !886, line: 38, baseType: !891, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !886, line: 23, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !477, file: !478, line: 992, baseType: !81, size: 64, offset: 10112)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !477, file: !478, line: 993, baseType: !81, size: 64, offset: 10176)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !477, file: !478, line: 996, baseType: !179, offset: 10240)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !477, file: !478, line: 999, baseType: !379, offset: 10240)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !477, file: !478, line: 1001, baseType: !898, size: 64, offset: 10240)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !478, line: 636, size: 64, elements: !899)
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !478, line: 637, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !477, file: !478, line: 1005, baseType: !612, size: 128, offset: 10304)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !477, file: !478, line: 1007, baseType: !476, size: 64, offset: 10432)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !477, file: !478, line: 1009, baseType: !905, size: 64, offset: 10496)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !478, line: 1009, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !477, file: !478, line: 1043, baseType: !86, size: 64, offset: 10560)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !477, file: !478, line: 1046, baseType: !909, size: 64, offset: 10624)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !478, line: 41, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !477, file: !478, line: 1050, baseType: !912, size: 64, offset: 10688)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !478, line: 42, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !477, file: !478, line: 1054, baseType: !915, size: 64, offset: 10752)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !478, line: 55, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !477, file: !478, line: 1056, baseType: !918, size: 64, offset: 10816)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !478, line: 40, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !477, file: !478, line: 1058, baseType: !921, size: 64, offset: 10880)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !478, line: 47, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !477, file: !478, line: 1061, baseType: !924, size: 64, offset: 10944)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !478, line: 43, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !477, file: !478, line: 1064, baseType: !90, size: 64, offset: 11008)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !477, file: !478, line: 1065, baseType: !928, size: 64, offset: 11072)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !876, line: 14, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !876, line: 12, size: 384, elements: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, scope: !930, file: !876, line: 13, baseType: !933, size: 384)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !930, file: !876, line: 13, size: 384, elements: !934)
!934 = !{!935, !936, !937, !938}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !933, file: !876, line: 13, baseType: !117, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !933, file: !876, line: 13, baseType: !117, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !933, file: !876, line: 13, baseType: !117, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !933, file: !876, line: 13, baseType: !939, size: 256, offset: 128)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !940, line: 32, size: 256, elements: !941)
!940 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!941 = !{!942, !948, !961, !967, !976, !996, !1001}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !939, file: !940, line: 37, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !939, file: !940, line: 34, size: 64, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !943, file: !940, line: 35, baseType: !729, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !943, file: !940, line: 36, baseType: !947, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !253, line: 49, baseType: !7)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !939, file: !940, line: 45, baseType: !949, size: 192)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !939, file: !940, line: 40, size: 192, elements: !950)
!950 = !{!951, !953, !954, !960}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !949, file: !940, line: 41, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !253, line: 95, baseType: !117)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !949, file: !940, line: 42, baseType: !117, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !949, file: !940, line: 43, baseType: !955, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !940, line: 11, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !940, line: 8, size: 64, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !956, file: !940, line: 9, baseType: !117, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !956, file: !940, line: 10, baseType: !86, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !949, file: !940, line: 44, baseType: !117, size: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !939, file: !940, line: 52, baseType: !962, size: 128)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !939, file: !940, line: 48, size: 128, elements: !963)
!963 = !{!964, !965, !966}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !962, file: !940, line: 49, baseType: !729, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !962, file: !940, line: 50, baseType: !947, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !962, file: !940, line: 51, baseType: !955, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !939, file: !940, line: 61, baseType: !968, size: 256)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !939, file: !940, line: 55, size: 256, elements: !969)
!969 = !{!970, !971, !972, !973, !975}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !968, file: !940, line: 56, baseType: !729, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !968, file: !940, line: 57, baseType: !947, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !968, file: !940, line: 58, baseType: !117, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !968, file: !940, line: 59, baseType: !974, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !253, line: 94, baseType: !254)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !968, file: !940, line: 60, baseType: !974, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !939, file: !940, line: 95, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !939, file: !940, line: 64, size: 256, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !977, file: !940, line: 65, baseType: !86, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, scope: !977, file: !940, line: 77, baseType: !981, size: 192, offset: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !977, file: !940, line: 77, size: 192, elements: !982)
!982 = !{!983, !984, !991}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !981, file: !940, line: 82, baseType: !465, size: 16)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !981, file: !940, line: 88, baseType: !985, size: 192)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !981, file: !940, line: 84, size: 192, elements: !986)
!986 = !{!987, !989, !990}
