; ModuleID = '../bcout/drivers/i2c/i2c-core-acpi.llvm.bc'
source_filename = "drivers/i2c/i2c-core-acpi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.bus_type = type { i8*, i8*, %struct.device*, %struct.attribute_group**, %struct.attribute_group**, %struct.attribute_group**, i32 (%struct.device*, %struct.device_driver*)*, i32 (%struct.device*, %struct.kobj_uevent_env*)*, i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*, i32)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, %struct.dev_pm_ops*, %struct.iommu_ops*, %struct.subsys_private*, %struct.lock_class_key, i8 }
%struct.device = type { %struct.kobject, %struct.device*, %struct.device_private*, i8*, %struct.device_type*, %struct.bus_type*, %struct.device_driver*, i8*, i8*, %struct.mutex, %struct.dev_links_info, %struct.dev_pm_info, %struct.dev_pm_domain*, %struct.irq_domain*, %struct.list_head, %struct.dma_map_ops*, i64*, i64, i64, %struct.bus_dma_region*, %struct.device_dma_parameters*, %struct.list_head, %struct.dev_archdata, %struct.device_node*, %struct.fwnode_handle*, i32, i32, %struct.spinlock, %struct.list_head, %struct.class*, %struct.attribute_group**, void (%struct.device*)*, %struct.iommu_group*, %struct.dev_iommu*, i8 }

!19 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !23, line: 26, baseType: !7, size: 32, elements: !24)
!23 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !29, line: 44, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !35, line: 343, baseType: !7, size: 32, elements: !36)
!35 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !42, line: 524, baseType: !7, size: 32, elements: !43)
!42 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !42, line: 502, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !56, line: 76, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!58 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!64 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!65 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!66 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!68 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_prop_type", file: !70, line: 19, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "./include/linux/property.h", directory: "/home/lizy2001/genbc/linux")
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "DEV_PROP_U8", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "DEV_PROP_U16", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "DEV_PROP_U32", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "DEV_PROP_U64", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "DEV_PROP_STRING", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "DEV_PROP_REF", value: 5, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !79, line: 305, baseType: !7, size: 32, elements: !80)
!79 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!80 = !{!81, !82, !83, !84}
!81 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!85 = !{!86, !87, !94, !2435, !316, !1508, !2436, !2437, !2438, !2440, !247, !2441, !92}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !89, line: 351, size: 10880, elements: !90)
!89 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!90 = !{!91, !93, !96, !2162, !2163, !2164, !2165, !2166, !2167, !2176, !2193, !2267, !2296, !2320, !2341, !2347, !2356, !2388, !2402, !2424, !2428, !2429, !2430, !2431, !2432, !2433, !2434}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !88, file: !89, line: 352, baseType: !92, size: 32)
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !88, file: !89, line: 353, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !95, line: 424, baseType: !86)
!95 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !88, file: !89, line: 354, baseType: !97, size: 192, offset: 128)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !98, line: 17, size: 192, elements: !99)
!98 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!99 = !{!100, !102, !2161}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !97, file: !98, line: 18, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !97, file: !98, line: 19, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !98, line: 110, size: 1152, elements: !106)
!106 = !{!107, !111, !115, !124, !2103, !2107, !2111, !2116, !2120, !2121, !2125, !2129, !2133, !2144, !2145, !2146, !2147, !2157}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !105, file: !98, line: 111, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!101, !101}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !105, file: !98, line: 112, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !101}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !105, file: !98, line: 113, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !122}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !120, line: 30, baseType: !121)
!120 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !105, file: !98, line: 114, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !122, !130}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !35, line: 461, size: 5568, elements: !133)
!133 = !{!134, !1636, !1638, !1641, !1642, !1693, !1790, !1791, !1792, !1793, !1794, !1803, !1908, !1921, !2028, !2029, !2033, !2035, !2036, !2037, !2041, !2047, !2048, !2051, !2052, !2053, !2056, !2057, !2058, !2059, !2091, !2092, !2093, !2096, !2099, !2100, !2101, !2102}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !132, file: !35, line: 462, baseType: !135, size: 512)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !136, line: 64, size: 512, elements: !137)
!136 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!137 = !{!138, !142, !148, !150, !210, !1472, !1626, !1631, !1632, !1633, !1634, !1635}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !136, line: 65, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !135, file: !136, line: 66, baseType: !143, size: 128, offset: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !120, line: 178, size: 128, elements: !144)
!144 = !{!145, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !120, line: 179, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !120, line: 179, baseType: !146, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !136, line: 67, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !135, file: !136, line: 68, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !136, line: 192, size: 704, elements: !153)
!153 = !{!154, !155, !171, !172}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !152, file: !136, line: 193, baseType: !143, size: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !152, file: !136, line: 194, baseType: !156, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !157, line: 83, baseType: !158)
!157 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !157, line: 71, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !157, line: 72, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !158, file: !157, line: 72, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !161, file: !157, line: 73, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !157, line: 20, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !164, file: !157, line: 21, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !168, line: 25, baseType: !169)
!168 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 25, elements: !170)
!170 = !{}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !152, file: !136, line: 195, baseType: !135, size: 512, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !152, file: !136, line: 196, baseType: !173, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !136, line: 156, size: 192, elements: !176)
!176 = !{!177, !182, !187}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !136, line: 157, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!92, !151, !149}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !136, line: 158, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!139, !151, !149}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !175, file: !136, line: 159, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!92, !151, !149, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !136, line: 148, size: 20736, elements: !194)
!194 = !{!195, !200, !204, !205, !209}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !193, file: !136, line: 149, baseType: !196, size: 192)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 192, elements: !198)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!198 = !{!199}
!199 = !DISubrange(count: 3)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !193, file: !136, line: 150, baseType: !201, size: 4096, offset: 192)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 4096, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !193, file: !136, line: 151, baseType: !92, size: 32, offset: 4288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !193, file: !136, line: 152, baseType: !206, size: 16384, offset: 4320)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 16384, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 2048)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !193, file: !136, line: 153, baseType: !92, size: 32, offset: 20704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !135, file: !136, line: 69, baseType: !211, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !136, line: 138, size: 448, elements: !213)
!213 = !{!214, !218, !248, !250, !1419, !1450, !1454}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !212, file: !136, line: 139, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !149}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !212, file: !136, line: 140, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !222, line: 230, size: 128, elements: !223)
!222 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!223 = !{!224, !240}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !221, file: !222, line: 231, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !149, !233, !197}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !120, line: 60, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !230, line: 73, baseType: !231)
!230 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !230, line: 15, baseType: !232)
!232 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !222, line: 30, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !222, line: 31, baseType: !139, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !234, file: !222, line: 32, baseType: !238, size: 16, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !120, line: 19, baseType: !239)
!239 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !221, file: !222, line: 232, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!228, !149, !233, !139, !244}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 55, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !230, line: 72, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !230, line: 16, baseType: !247)
!247 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !212, file: !136, line: 141, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !212, file: !136, line: 142, baseType: !251, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !222, line: 84, size: 320, elements: !255)
!255 = !{!256, !257, !261, !1416, !1417}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !222, line: 85, baseType: !139, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !254, file: !222, line: 86, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!238, !149, !233, !92}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !254, file: !222, line: 88, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!238, !149, !265, !92}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !222, line: 168, size: 448, elements: !267)
!267 = !{!268, !269, !270, !271, !281, !282}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !266, file: !222, line: 169, baseType: !234, size: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !266, file: !222, line: 170, baseType: !244, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !266, file: !222, line: 171, baseType: !86, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !266, file: !222, line: 172, baseType: !272, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!228, !275, !149, !265, !197, !278, !244}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !277, line: 526, flags: DIFlagFwdDecl)
!277 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !120, line: 46, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !230, line: 88, baseType: !280)
!280 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !266, file: !222, line: 174, baseType: !272, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !266, file: !222, line: 176, baseType: !283, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!92, !275, !149, !265, !286}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !288, line: 305, size: 1472, elements: !289)
!288 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!289 = !{!290, !291, !292, !293, !294, !302, !303, !1390, !1396, !1397, !1402, !1403, !1406, !1410, !1411, !1412, !1413, !1414}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !287, file: !288, line: 308, baseType: !247, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !287, file: !288, line: 309, baseType: !247, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !287, file: !288, line: 313, baseType: !286, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !287, file: !288, line: 313, baseType: !286, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !287, file: !288, line: 315, baseType: !295, size: 192, align: 64, offset: 256)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !296, line: 24, size: 192, align: 64, elements: !297)
!296 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !299, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !295, file: !296, line: 25, baseType: !247, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !295, file: !296, line: 26, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !295, file: !296, line: 27, baseType: !300, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !287, file: !288, line: 323, baseType: !247, size: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !287, file: !288, line: 327, baseType: !304, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !288, line: 388, size: 7296, elements: !306)
!306 = !{!307, !1386}
!307 = !DIDerivedType(tag: DW_TAG_member, scope: !305, file: !288, line: 389, baseType: !308, size: 7296)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !288, line: 389, size: 7296, elements: !309)
!309 = !{!310, !311, !315, !321, !325, !326, !327, !328, !329, !337, !342, !343, !344, !345, !354, !355, !356, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !391, !399, !402, !450, !451, !1357, !1358, !1361, !1364, !1365, !1368, !1369, !1370, !1373, !1385}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !308, file: !288, line: 390, baseType: !286, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !308, file: !288, line: 391, baseType: !312, size: 64, offset: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !296, line: 31, size: 64, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !312, file: !296, line: 32, baseType: !300, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !308, file: !288, line: 392, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !317, line: 23, baseType: !318)
!317 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !319, line: 31, baseType: !320)
!319 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!320 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !308, file: !288, line: 394, baseType: !322, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!247, !275, !247, !247, !247, !247}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !308, file: !288, line: 398, baseType: !247, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !308, file: !288, line: 399, baseType: !247, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !308, file: !288, line: 405, baseType: !247, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !308, file: !288, line: 406, baseType: !247, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !308, file: !288, line: 407, baseType: !330, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !277, line: 286, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 286, size: 64, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !332, file: !277, line: 286, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !336, line: 18, baseType: !247)
!336 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !308, file: !288, line: 416, baseType: !338, size: 32, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !120, line: 168, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 166, size: 32, elements: !340)
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !339, file: !120, line: 167, baseType: !92, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !308, file: !288, line: 428, baseType: !338, size: 32, offset: 608)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !308, file: !288, line: 437, baseType: !338, size: 32, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !308, file: !288, line: 447, baseType: !338, size: 32, offset: 672)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !308, file: !288, line: 450, baseType: !346, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !347, line: 13, baseType: !348)
!347 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !120, line: 175, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 173, size: 64, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !349, file: !120, line: 174, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !317, line: 22, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !319, line: 30, baseType: !280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !308, file: !288, line: 452, baseType: !92, size: 32, offset: 768)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !308, file: !288, line: 454, baseType: !156, offset: 800)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !308, file: !288, line: 457, baseType: !357, size: 256, offset: 832)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !358, line: 35, size: 256, elements: !359)
!358 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!359 = !{!360, !361, !362, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !357, file: !358, line: 36, baseType: !346, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !357, file: !358, line: 42, baseType: !346, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !357, file: !358, line: 46, baseType: !363, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !157, line: 29, baseType: !164)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !357, file: !358, line: 47, baseType: !143, size: 128, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !308, file: !288, line: 459, baseType: !143, size: 128, offset: 1088)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !308, file: !288, line: 466, baseType: !247, size: 64, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !308, file: !288, line: 467, baseType: !247, size: 64, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !308, file: !288, line: 469, baseType: !247, size: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !308, file: !288, line: 470, baseType: !247, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !308, file: !288, line: 471, baseType: !348, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !308, file: !288, line: 472, baseType: !247, size: 64, offset: 1536)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !308, file: !288, line: 473, baseType: !247, size: 64, offset: 1600)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !308, file: !288, line: 474, baseType: !247, size: 64, offset: 1664)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !308, file: !288, line: 475, baseType: !247, size: 64, offset: 1728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !308, file: !288, line: 477, baseType: !156, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !308, file: !288, line: 478, baseType: !247, size: 64, offset: 1792)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !308, file: !288, line: 478, baseType: !247, size: 64, offset: 1856)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !308, file: !288, line: 478, baseType: !247, size: 64, offset: 1920)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !308, file: !288, line: 478, baseType: !247, size: 64, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !308, file: !288, line: 479, baseType: !247, size: 64, offset: 2048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !308, file: !288, line: 479, baseType: !247, size: 64, offset: 2112)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !308, file: !288, line: 479, baseType: !247, size: 64, offset: 2176)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !308, file: !288, line: 480, baseType: !247, size: 64, offset: 2240)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !308, file: !288, line: 480, baseType: !247, size: 64, offset: 2304)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !308, file: !288, line: 480, baseType: !247, size: 64, offset: 2368)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !308, file: !288, line: 480, baseType: !247, size: 64, offset: 2432)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !308, file: !288, line: 482, baseType: !388, size: 2816, offset: 2496)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 2816, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 44)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !308, file: !288, line: 488, baseType: !392, size: 256, offset: 5312)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !393, line: 60, size: 256, elements: !394)
!393 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !392, file: !393, line: 61, baseType: !396, size: 256)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 256, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !308, file: !288, line: 490, baseType: !400, size: 64, offset: 5568)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !288, line: 490, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !308, file: !288, line: 493, baseType: !403, size: 896, offset: 5632)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !404, line: 53, baseType: !405)
!404 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 896, elements: !406)
!406 = !{!407, !408, !409, !410, !413, !414, !421, !422, !442, !443, !446}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !405, file: !404, line: 18, baseType: !316, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !405, file: !404, line: 28, baseType: !348, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !405, file: !404, line: 31, baseType: !357, size: 256, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !405, file: !404, line: 32, baseType: !411, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !404, line: 32, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !405, file: !404, line: 37, baseType: !239, size: 16, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !405, file: !404, line: 40, baseType: !415, size: 192, offset: 512)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !416, line: 53, size: 192, elements: !417)
!416 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !415, file: !416, line: 54, baseType: !346, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !415, file: !416, line: 55, baseType: !156, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !415, file: !416, line: 59, baseType: !143, size: 128, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !405, file: !404, line: 41, baseType: !86, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !405, file: !404, line: 42, baseType: !423, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !426, line: 13, size: 896, elements: !427)
!426 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !425, file: !426, line: 14, baseType: !86, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !426, line: 15, baseType: !247, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !425, file: !426, line: 17, baseType: !247, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !425, file: !426, line: 17, baseType: !247, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !425, file: !426, line: 19, baseType: !232, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !425, file: !426, line: 21, baseType: !232, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !425, file: !426, line: 22, baseType: !232, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !425, file: !426, line: 23, baseType: !232, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !425, file: !426, line: 24, baseType: !232, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !425, file: !426, line: 25, baseType: !232, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !425, file: !426, line: 26, baseType: !232, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !425, file: !426, line: 27, baseType: !232, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !425, file: !426, line: 28, baseType: !232, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !425, file: !426, line: 29, baseType: !232, size: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !405, file: !404, line: 44, baseType: !338, size: 32, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !405, file: !404, line: 50, baseType: !444, size: 16, offset: 864)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !317, line: 19, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !319, line: 24, baseType: !239)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !405, file: !404, line: 51, baseType: !447, size: 16, offset: 880)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !317, line: 18, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !319, line: 23, baseType: !449)
!449 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !288, line: 495, baseType: !247, size: 64, offset: 6528)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !308, file: !288, line: 497, baseType: !452, size: 64, offset: 6592)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !288, line: 381, size: 384, elements: !454)
!454 = !{!455, !456, !1356}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !453, file: !288, line: 382, baseType: !338, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !453, file: !288, line: 383, baseType: !457, size: 128, offset: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !288, line: 376, size: 128, elements: !458)
!458 = !{!459, !1354}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !457, file: !288, line: 377, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !462, line: 640, size: 48640, elements: !463)
!462 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!463 = !{!464, !472, !474, !475, !481, !482, !483, !484, !485, !486, !487, !488, !492, !510, !521, !616, !617, !618, !629, !630, !632, !633, !634, !635, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !714, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !770, !772, !773, !774, !786, !788, !789, !790, !791, !792, !798, !799, !800, !801, !802, !803, !804, !816, !821, !825, !826, !827, !830, !834, !837, !840, !843, !846, !849, !852, !855, !861, !862, !863, !869, !870, !871, !872, !873, !882, !883, !884, !885, !886, !891, !892, !893, !896, !897, !900, !903, !906, !909, !912, !915, !916, !996, !999, !1002, !1003, !1006, !1007, !1008, !1014, !1015, !1016, !1029, !1030, !1031, !1041, !1046, !1049, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !461, file: !462, line: 646, baseType: !465, size: 128)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !466, line: 56, size: 128, elements: !467)
!466 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !466, line: 57, baseType: !247, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !465, file: !466, line: 58, baseType: !470, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !317, line: 21, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !319, line: 27, baseType: !7)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !462, line: 649, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !232)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !461, file: !462, line: 657, baseType: !86, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !461, file: !462, line: 658, baseType: !476, size: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !477, line: 113, baseType: !478)
!477 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !477, line: 111, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !478, file: !477, line: 112, baseType: !338, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !462, line: 660, baseType: !7, size: 32, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !461, file: !462, line: 661, baseType: !7, size: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !461, file: !462, line: 684, baseType: !92, size: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !461, file: !462, line: 686, baseType: !92, size: 32, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !461, file: !462, line: 687, baseType: !92, size: 32, offset: 416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !461, file: !462, line: 688, baseType: !92, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !461, file: !462, line: 689, baseType: !7, size: 32, offset: 480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !461, file: !462, line: 691, baseType: !489, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !462, line: 691, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !461, file: !462, line: 692, baseType: !493, size: 832, offset: 576)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !462, line: 451, size: 832, elements: !494)
!494 = !{!495, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !493, file: !462, line: 453, baseType: !496, size: 128)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !462, line: 325, size: 128, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !496, file: !462, line: 326, baseType: !247, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !496, file: !462, line: 327, baseType: !470, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !493, file: !462, line: 454, baseType: !295, size: 192, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !493, file: !462, line: 455, baseType: !143, size: 128, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !493, file: !462, line: 456, baseType: !7, size: 32, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !493, file: !462, line: 458, baseType: !316, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !493, file: !462, line: 459, baseType: !316, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !493, file: !462, line: 460, baseType: !316, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !493, file: !462, line: 461, baseType: !316, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !493, file: !462, line: 463, baseType: !316, size: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !493, file: !462, line: 465, baseType: !509, offset: 832)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !462, line: 415, elements: !170)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !461, file: !462, line: 693, baseType: !511, size: 384, offset: 1408)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !462, line: 489, size: 384, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !511, file: !462, line: 490, baseType: !143, size: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !511, file: !462, line: 491, baseType: !247, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !511, file: !462, line: 492, baseType: !247, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !511, file: !462, line: 493, baseType: !7, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !511, file: !462, line: 494, baseType: !239, size: 16, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !511, file: !462, line: 495, baseType: !239, size: 16, offset: 304)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !511, file: !462, line: 497, baseType: !520, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !461, file: !462, line: 697, baseType: !522, size: 1792, offset: 1792)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !462, line: 507, size: 1792, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !613, !614}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !522, file: !462, line: 508, baseType: !295, size: 192, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !522, file: !462, line: 515, baseType: !316, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !522, file: !462, line: 516, baseType: !316, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !522, file: !462, line: 517, baseType: !316, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !522, file: !462, line: 518, baseType: !316, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !522, file: !462, line: 519, baseType: !316, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !522, file: !462, line: 526, baseType: !352, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !522, file: !462, line: 527, baseType: !316, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !522, file: !462, line: 528, baseType: !7, size: 32, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !522, file: !462, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !522, file: !462, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !522, file: !462, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !522, file: !462, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !522, file: !462, line: 563, baseType: !538, size: 512, offset: 704)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !12, line: 118, size: 512, elements: !539)
!539 = !{!540, !548, !549, !554, !606, !610, !611, !612}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !538, file: !12, line: 119, baseType: !541, size: 256)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !542, line: 9, size: 256, elements: !543)
!542 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !541, file: !542, line: 10, baseType: !295, size: 192, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !541, file: !542, line: 11, baseType: !546, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !547, line: 29, baseType: !352)
!547 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !538, file: !12, line: 120, baseType: !546, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !538, file: !12, line: 121, baseType: !550, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!11, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !538, file: !12, line: 122, baseType: !555, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !12, line: 159, size: 512, align: 512, elements: !557)
!557 = !{!558, !578, !579, !582, !592, !593, !601, !605}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !556, file: !12, line: 160, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !12, line: 214, size: 4608, align: 512, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !560, file: !12, line: 215, baseType: !363)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !560, file: !12, line: 216, baseType: !7, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !560, file: !12, line: 217, baseType: !7, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !560, file: !12, line: 218, baseType: !7, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !560, file: !12, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !560, file: !12, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !560, file: !12, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !560, file: !12, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !560, file: !12, line: 233, baseType: !546, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !560, file: !12, line: 234, baseType: !553, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !560, file: !12, line: 235, baseType: !546, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !560, file: !12, line: 236, baseType: !553, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !560, file: !12, line: 237, baseType: !575, size: 4096, offset: 512)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 4096, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 8)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !556, file: !12, line: 161, baseType: !7, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !556, file: !12, line: 162, baseType: !580, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !120, line: 27, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !230, line: 96, baseType: !92)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !556, file: !12, line: 163, baseType: !583, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !584, line: 276, baseType: !585)
!584 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !584, line: 276, size: 32, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !585, file: !584, line: 276, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !584, line: 70, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !584, line: 65, size: 32, elements: !590)
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !589, file: !584, line: 66, baseType: !7, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !556, file: !12, line: 164, baseType: !553, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !556, file: !12, line: 165, baseType: !594, size: 128, offset: 256)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !542, line: 14, size: 128, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !594, file: !542, line: 15, baseType: !597, size: 128)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !296, line: 125, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !597, file: !296, line: 126, baseType: !312, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !597, file: !296, line: 127, baseType: !300, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !556, file: !12, line: 166, baseType: !602, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!546}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !556, file: !12, line: 167, baseType: !546, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !538, file: !12, line: 123, baseType: !607, size: 8, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !317, line: 17, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !319, line: 21, baseType: !609)
!609 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !538, file: !12, line: 124, baseType: !607, size: 8, offset: 456)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !538, file: !12, line: 125, baseType: !607, size: 8, offset: 464)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !538, file: !12, line: 126, baseType: !607, size: 8, offset: 472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !522, file: !462, line: 572, baseType: !538, size: 512, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !522, file: !462, line: 580, baseType: !615, size: 64, offset: 1728)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !461, file: !462, line: 721, baseType: !7, size: 32, offset: 3584)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !461, file: !462, line: 722, baseType: !92, size: 32, offset: 3616)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !461, file: !462, line: 723, baseType: !619, size: 64, offset: 3648)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !622, line: 17, baseType: !623)
!622 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !622, line: 17, size: 64, elements: !624)
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !623, file: !622, line: 17, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 64, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 1)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !461, file: !462, line: 724, baseType: !621, size: 64, offset: 3712)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !461, file: !462, line: 749, baseType: !631, offset: 3776)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !462, line: 290, elements: !170)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !461, file: !462, line: 751, baseType: !143, size: 128, offset: 3776)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !461, file: !462, line: 757, baseType: !304, size: 64, offset: 3904)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !461, file: !462, line: 758, baseType: !304, size: 64, offset: 3968)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !461, file: !462, line: 761, baseType: !636, size: 320, offset: 4032)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !393, line: 34, size: 320, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !636, file: !393, line: 35, baseType: !316, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !636, file: !393, line: 36, baseType: !640, size: 256, offset: 64)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !397)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !461, file: !462, line: 766, baseType: !92, size: 32, offset: 4352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !461, file: !462, line: 767, baseType: !92, size: 32, offset: 4384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !461, file: !462, line: 768, baseType: !92, size: 32, offset: 4416)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !461, file: !462, line: 770, baseType: !92, size: 32, offset: 4448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !461, file: !462, line: 772, baseType: !247, size: 64, offset: 4480)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !461, file: !462, line: 775, baseType: !7, size: 32, offset: 4544)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !461, file: !462, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !461, file: !462, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !461, file: !462, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !461, file: !462, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !461, file: !462, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !461, file: !462, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !461, file: !462, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !461, file: !462, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !461, file: !462, line: 831, baseType: !247, size: 64, offset: 4672)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !461, file: !462, line: 833, baseType: !657, size: 384, offset: 4736)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !17, line: 25, size: 384, elements: !658)
!658 = !{!659, !664}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !657, file: !17, line: 26, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!232, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !17, line: 27, baseType: !665, size: 320, offset: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !657, file: !17, line: 27, size: 320, elements: !666)
!666 = !{!667, !677, !704}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !665, file: !17, line: 36, baseType: !668, size: 320)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !17, line: 29, size: 320, elements: !669)
!669 = !{!670, !672, !673, !674, !675, !676}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !668, file: !17, line: 30, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !668, file: !17, line: 31, baseType: !470, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !668, file: !17, line: 32, baseType: !470, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !668, file: !17, line: 33, baseType: !470, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !668, file: !17, line: 34, baseType: !316, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !668, file: !17, line: 35, baseType: !671, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !665, file: !17, line: 46, baseType: !678, size: 192)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !17, line: 38, size: 192, elements: !679)
!679 = !{!680, !681, !682, !703}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !678, file: !17, line: 39, baseType: !580, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !17, line: 40, baseType: !16, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !678, file: !17, line: 41, baseType: !683, size: 64, offset: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !17, line: 41, size: 64, elements: !684)
!684 = !{!685, !693}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !683, file: !17, line: 42, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !688, line: 7, size: 128, elements: !689)
!688 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!689 = !{!690, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !687, file: !688, line: 8, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !230, line: 93, baseType: !280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !687, file: !688, line: 9, baseType: !280, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !683, file: !17, line: 43, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !696, line: 7, size: 64, elements: !697)
!696 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!697 = !{!698, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !695, file: !696, line: 8, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !696, line: 5, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !317, line: 20, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !319, line: 26, baseType: !92)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !695, file: !696, line: 9, baseType: !700, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !678, file: !17, line: 45, baseType: !316, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !665, file: !17, line: 54, baseType: !705, size: 256)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !17, line: 48, size: 256, elements: !706)
!706 = !{!707, !710, !711, !712, !713}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !705, file: !17, line: 49, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !17, line: 14, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !705, file: !17, line: 50, baseType: !92, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !705, file: !17, line: 51, baseType: !92, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !705, file: !17, line: 52, baseType: !247, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !705, file: !17, line: 53, baseType: !247, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !461, file: !462, line: 835, baseType: !715, size: 32, offset: 5120)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !120, line: 22, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !230, line: 28, baseType: !92)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !461, file: !462, line: 836, baseType: !715, size: 32, offset: 5152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !461, file: !462, line: 840, baseType: !247, size: 64, offset: 5184)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !461, file: !462, line: 849, baseType: !460, size: 64, offset: 5248)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !461, file: !462, line: 852, baseType: !460, size: 64, offset: 5312)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !461, file: !462, line: 857, baseType: !143, size: 128, offset: 5376)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !461, file: !462, line: 858, baseType: !143, size: 128, offset: 5504)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !461, file: !462, line: 859, baseType: !460, size: 64, offset: 5632)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !461, file: !462, line: 867, baseType: !143, size: 128, offset: 5696)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !461, file: !462, line: 868, baseType: !143, size: 128, offset: 5824)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !461, file: !462, line: 871, baseType: !727, size: 64, offset: 5952)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !729, line: 59, size: 768, elements: !730)
!729 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!730 = !{!731, !732, !733, !734, !745, !746, !753, !762}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !728, file: !729, line: 61, baseType: !476, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !728, file: !729, line: 62, baseType: !7, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !728, file: !729, line: 63, baseType: !156, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !728, file: !729, line: 65, baseType: !735, size: 256, offset: 64)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 256, elements: !397)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !120, line: 182, size: 64, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !736, file: !120, line: 183, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !120, line: 186, size: 128, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !740, file: !120, line: 187, baseType: !739, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !740, file: !120, line: 187, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !728, file: !729, line: 66, baseType: !736, size: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !728, file: !729, line: 68, baseType: !747, size: 128, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !748, line: 40, baseType: !749)
!748 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !748, line: 36, size: 128, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !749, file: !748, line: 37, baseType: !156)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !749, file: !748, line: 38, baseType: !143, size: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !728, file: !729, line: 69, baseType: !754, size: 128, align: 64, offset: 512)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !120, line: 216, size: 128, align: 64, elements: !755)
!755 = !{!756, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !120, line: 217, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !754, file: !120, line: 218, baseType: !759, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !757}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !728, file: !729, line: 70, baseType: !763, size: 128, offset: 640)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 128, elements: !627)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !729, line: 54, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !764, file: !729, line: 55, baseType: !92, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !764, file: !729, line: 56, baseType: !768, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !729, line: 56, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !461, file: !462, line: 872, baseType: !771, size: 512, offset: 6016)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 512, elements: !397)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !461, file: !462, line: 873, baseType: !143, size: 128, offset: 6528)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !461, file: !462, line: 874, baseType: !143, size: 128, offset: 6656)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !461, file: !462, line: 876, baseType: !775, size: 64, offset: 6784)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !777, line: 26, size: 192, elements: !778)
!777 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !776, file: !777, line: 27, baseType: !7, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !776, file: !777, line: 28, baseType: !781, size: 128, offset: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !782, line: 43, size: 128, elements: !783)
!782 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !781, file: !782, line: 44, baseType: !363)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !781, file: !782, line: 45, baseType: !143, size: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !461, file: !462, line: 879, baseType: !787, size: 64, offset: 6848)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !461, file: !462, line: 882, baseType: !787, size: 64, offset: 6912)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !461, file: !462, line: 884, baseType: !316, size: 64, offset: 6976)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !461, file: !462, line: 885, baseType: !316, size: 64, offset: 7040)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !461, file: !462, line: 890, baseType: !316, size: 64, offset: 7104)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !461, file: !462, line: 891, baseType: !793, size: 128, offset: 7168)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !462, line: 242, size: 128, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !793, file: !462, line: 244, baseType: !316, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !793, file: !462, line: 245, baseType: !316, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !793, file: !462, line: 246, baseType: !363, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !461, file: !462, line: 900, baseType: !247, size: 64, offset: 7296)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !461, file: !462, line: 901, baseType: !247, size: 64, offset: 7360)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !461, file: !462, line: 904, baseType: !316, size: 64, offset: 7424)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !461, file: !462, line: 907, baseType: !316, size: 64, offset: 7488)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !461, file: !462, line: 910, baseType: !247, size: 64, offset: 7552)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !461, file: !462, line: 911, baseType: !247, size: 64, offset: 7616)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !461, file: !462, line: 914, baseType: !805, size: 640, offset: 7680)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !806, line: 123, size: 640, elements: !807)
!806 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !814, !815}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !805, file: !806, line: 124, baseType: !809, size: 576)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 576, elements: !198)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !806, line: 108, size: 192, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !810, file: !806, line: 109, baseType: !316, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !810, file: !806, line: 110, baseType: !594, size: 128, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !805, file: !806, line: 125, baseType: !7, size: 32, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !805, file: !806, line: 126, baseType: !7, size: 32, offset: 608)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !461, file: !462, line: 917, baseType: !817, size: 192, offset: 8320)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !806, line: 134, size: 192, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !817, file: !806, line: 135, baseType: !754, size: 128, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !817, file: !806, line: 136, baseType: !7, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !461, file: !462, line: 923, baseType: !822, size: 64, offset: 8512)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !462, line: 923, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !461, file: !462, line: 926, baseType: !822, size: 64, offset: 8576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !461, file: !462, line: 929, baseType: !822, size: 64, offset: 8640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !461, file: !462, line: 933, baseType: !828, size: 64, offset: 8704)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !462, line: 933, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !461, file: !462, line: 943, baseType: !831, size: 128, offset: 8768)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 16)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !461, file: !462, line: 945, baseType: !835, size: 64, offset: 8896)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !462, line: 49, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !461, file: !462, line: 956, baseType: !838, size: 64, offset: 8960)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !462, line: 45, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !461, file: !462, line: 959, baseType: !841, size: 64, offset: 9024)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !462, line: 959, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !461, file: !462, line: 962, baseType: !844, size: 64, offset: 9088)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !462, line: 66, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !461, file: !462, line: 966, baseType: !847, size: 64, offset: 9152)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !462, line: 50, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !461, file: !462, line: 969, baseType: !850, size: 64, offset: 9216)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !806, line: 223, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !461, file: !462, line: 970, baseType: !853, size: 64, offset: 9280)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !462, line: 62, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !461, file: !462, line: 971, baseType: !856, size: 64, offset: 9344)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !857, line: 25, baseType: !858)
!857 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 23, size: 64, elements: !859)
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !858, file: !857, line: 24, baseType: !626, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !461, file: !462, line: 972, baseType: !856, size: 64, offset: 9408)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !461, file: !462, line: 974, baseType: !856, size: 64, offset: 9472)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !461, file: !462, line: 975, baseType: !864, size: 192, offset: 9536)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !865, line: 30, size: 192, elements: !866)
!865 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !864, file: !865, line: 31, baseType: !143, size: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !864, file: !865, line: 32, baseType: !856, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !461, file: !462, line: 976, baseType: !247, size: 64, offset: 9728)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !461, file: !462, line: 977, baseType: !244, size: 64, offset: 9792)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !461, file: !462, line: 978, baseType: !7, size: 32, offset: 9856)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !461, file: !462, line: 980, baseType: !757, size: 64, offset: 9920)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !461, file: !462, line: 989, baseType: !874, size: 128, offset: 9984)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !875, line: 35, size: 128, elements: !876)
!875 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !874, file: !875, line: 36, baseType: !92, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !874, file: !875, line: 37, baseType: !338, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !874, file: !875, line: 38, baseType: !880, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !875, line: 23, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !461, file: !462, line: 992, baseType: !316, size: 64, offset: 10112)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !461, file: !462, line: 993, baseType: !316, size: 64, offset: 10176)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !461, file: !462, line: 996, baseType: !156, offset: 10240)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !461, file: !462, line: 999, baseType: !363, offset: 10240)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !461, file: !462, line: 1001, baseType: !887, size: 64, offset: 10240)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !462, line: 636, size: 64, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !462, line: 637, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !461, file: !462, line: 1005, baseType: !597, size: 128, offset: 10304)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !461, file: !462, line: 1007, baseType: !460, size: 64, offset: 10432)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !461, file: !462, line: 1009, baseType: !894, size: 64, offset: 10496)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !462, line: 1009, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !461, file: !462, line: 1043, baseType: !86, size: 64, offset: 10560)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !461, file: !462, line: 1046, baseType: !898, size: 64, offset: 10624)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !462, line: 41, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !461, file: !462, line: 1050, baseType: !901, size: 64, offset: 10688)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !462, line: 42, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !461, file: !462, line: 1054, baseType: !904, size: 64, offset: 10752)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !462, line: 55, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !461, file: !462, line: 1056, baseType: !907, size: 64, offset: 10816)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !462, line: 40, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !461, file: !462, line: 1058, baseType: !910, size: 64, offset: 10880)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !462, line: 47, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !461, file: !462, line: 1061, baseType: !913, size: 64, offset: 10944)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !462, line: 43, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !461, file: !462, line: 1064, baseType: !247, size: 64, offset: 11008)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !461, file: !462, line: 1065, baseType: !917, size: 64, offset: 11072)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !865, line: 14, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !865, line: 12, size: 384, elements: !920)
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, scope: !919, file: !865, line: 13, baseType: !922, size: 384)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !919, file: !865, line: 13, size: 384, elements: !923)
!923 = !{!924, !925, !926, !927}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !922, file: !865, line: 13, baseType: !92, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !922, file: !865, line: 13, baseType: !92, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !922, file: !865, line: 13, baseType: !92, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !922, file: !865, line: 13, baseType: !928, size: 256, offset: 128)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !929, line: 32, size: 256, elements: !930)
!929 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!930 = !{!931, !937, !950, !956, !965, !985, !990}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !928, file: !929, line: 37, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !928, file: !929, line: 34, size: 64, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !932, file: !929, line: 35, baseType: !716, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !932, file: !929, line: 36, baseType: !936, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !230, line: 49, baseType: !7)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !928, file: !929, line: 45, baseType: !938, size: 192)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !928, file: !929, line: 40, size: 192, elements: !939)
!939 = !{!940, !942, !943, !949}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !938, file: !929, line: 41, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !230, line: 95, baseType: !92)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !938, file: !929, line: 42, baseType: !92, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !938, file: !929, line: 43, baseType: !944, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !929, line: 11, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !929, line: 8, size: 64, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !945, file: !929, line: 9, baseType: !92, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !945, file: !929, line: 10, baseType: !86, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !938, file: !929, line: 44, baseType: !92, size: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !928, file: !929, line: 52, baseType: !951, size: 128)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !928, file: !929, line: 48, size: 128, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !951, file: !929, line: 49, baseType: !716, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !951, file: !929, line: 50, baseType: !936, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !951, file: !929, line: 51, baseType: !944, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !928, file: !929, line: 61, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !928, file: !929, line: 55, size: 256, elements: !958)
!958 = !{!959, !960, !961, !962, !964}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !957, file: !929, line: 56, baseType: !716, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !957, file: !929, line: 57, baseType: !936, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !957, file: !929, line: 58, baseType: !92, size: 32, offset: 64)
