; ModuleID = '../bcout/drivers/input/serio/serio.llvm.bc'
source_filename = "drivers/input/serio/serio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall4.init\22, \22a\22\09"
module asm "__initcall_serio_init4:\09\09\09"
module asm ".long\09serio_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.bus_type = type { i8*, i8*, %struct.device*, %struct.attribute_group**, %struct.attribute_group**, %struct.attribute_group**, i32 (%struct.device*, %struct.device_driver*)*, i32 (%struct.device*, %struct.kobj_uevent_env*)*, i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*, i32)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, %struct.dev_pm_ops*, %struct.iommu_ops*, %struct.subsys_private*, %struct.lock_class_key, i8 }

!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !51, line: 44, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "serio_event_type", file: !3, line: 132, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIEnumerator(name: "SERIO_RESCAN_PORT", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "SERIO_RECONNECT_PORT", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "SERIO_RECONNECT_SUBTREE", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "SERIO_REGISTER_PORT", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "SERIO_ATTACH_DRIVER", value: 4, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 10, baseType: !7, size: 32, elements: !65)
!64 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!65 = !{!66, !67}
!66 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !69, line: 305, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 30, baseType: !77, size: 64, elements: !78)
!76 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!79 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!80 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!81 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!82 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!83 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!84 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!85 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!86 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!87 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!88 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!89 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!90 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!91 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!92 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!93 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!94 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!95 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!96 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!97 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!98 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!99 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!100 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!101 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!102 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!103 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!104 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!105 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!106 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!107 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!108 = !{!109, !110, !2040, !1556, !2047, !1923, !309, !181, !2049}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "serio", file: !112, line: 20, size: 8384, elements: !113)
!112 = !DIFile(filename: "./include/linux/serio.h", directory: "/home/lizy2001/genbc/linux")
!113 = !{!114, !115, !120, !121, !125, !129, !140, !156, !161, !165, !169, !170, !171, !172, !178, !179, !180, !2035, !2036, !2037, !2038}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "port_data", scope: !111, file: !112, line: 21, baseType: !109, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !112, line: 23, baseType: !116, size: 256, offset: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 256, elements: !118)
!117 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!118 = !{!119}
!119 = !DISubrange(count: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !111, file: !112, line: 24, baseType: !116, size: 256, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "firmware_id", scope: !111, file: !112, line: 25, baseType: !122, size: 1024, offset: 576)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1024, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "manual_bind", scope: !111, file: !112, line: 27, baseType: !126, size: 8, offset: 1600)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !127, line: 30, baseType: !128)
!127 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!128 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !111, file: !112, line: 29, baseType: !130, size: 32, offset: 1608)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "serio_device_id", file: !131, line: 236, size: 32, elements: !132)
!131 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!132 = !{!133, !137, !138, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !131, line: 237, baseType: !134, size: 8)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !135, line: 21, baseType: !136)
!135 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !130, file: !131, line: 238, baseType: !134, size: 8, offset: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !131, line: 239, baseType: !134, size: 8, offset: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !130, file: !131, line: 240, baseType: !134, size: 8, offset: 24)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !111, file: !112, line: 32, baseType: !141, offset: 1640)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !142, line: 83, baseType: !143)
!142 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !142, line: 71, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !142, line: 72, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !142, line: 72, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !146, file: !142, line: 73, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !142, line: 20, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !149, file: !142, line: 21, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !153, line: 25, baseType: !154)
!153 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 25, elements: !155)
!155 = !{}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !111, file: !112, line: 34, baseType: !157, size: 64, offset: 1664)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !110, !136}
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !111, file: !112, line: 35, baseType: !162, size: 64, offset: 1728)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!160, !110}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !111, file: !112, line: 36, baseType: !166, size: 64, offset: 1792)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !110}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !111, file: !112, line: 37, baseType: !162, size: 64, offset: 1856)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !111, file: !112, line: 38, baseType: !166, size: 64, offset: 1920)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !111, file: !112, line: 40, baseType: !110, size: 64, offset: 1984)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !111, file: !112, line: 42, baseType: !173, size: 128, offset: 2048)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !127, line: 178, size: 128, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !127, line: 179, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !127, line: 179, baseType: !176, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !111, file: !112, line: 43, baseType: !173, size: 128, offset: 2176)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !111, file: !112, line: 45, baseType: !7, size: 32, offset: 2304)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "drv", scope: !111, file: !112, line: 51, baseType: !181, size: 64, offset: 2368)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "serio_driver", file: !112, line: 67, size: 1792, elements: !183)
!183 = !{!184, !187, !190, !191, !192, !197, !201, !202, !203, !204, !205}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !182, file: !112, line: 68, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "id_table", scope: !182, file: !112, line: 70, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "manual_bind", scope: !182, file: !112, line: 71, baseType: !126, size: 8, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "write_wakeup", scope: !182, file: !112, line: 73, baseType: !166, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt", scope: !182, file: !112, line: 74, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !110, !136, !7}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "irqreturn_t", file: !6, line: 17, baseType: !5)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !182, file: !112, line: 75, baseType: !198, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!160, !110, !181}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect", scope: !182, file: !112, line: 76, baseType: !162, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fast_reconnect", scope: !182, file: !112, line: 77, baseType: !162, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !182, file: !112, line: 78, baseType: !166, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !182, file: !112, line: 79, baseType: !166, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !182, file: !112, line: 81, baseType: !206, size: 1152, offset: 640)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_driver", file: !51, line: 95, size: 1152, elements: !207)
!207 = !{!208, !209, !1996, !1997, !1998, !1999, !2000, !2009, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !51, line: 96, baseType: !185, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !206, file: !51, line: 97, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bus_type", file: !212, line: 82, size: 1408, elements: !213)
!212 = !DIFile(filename: "./include/linux/device/bus.h", directory: "/home/lizy2001/genbc/linux")
!213 = !{!214, !215, !216, !1965, !1966, !1967, !1968, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1983, !1984, !1985, !1986, !1987, !1991, !1992, !1995}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !212, line: 83, baseType: !185, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dev_name", scope: !211, file: !212, line: 84, baseType: !185, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dev_root", scope: !211, file: !212, line: 85, baseType: !217, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !219)
!219 = !{!220, !1684, !1685, !1688, !1689, !1740, !1741, !1743, !1744, !1745, !1746, !1755, !1864, !1877, !1880, !1881, !1885, !1887, !1888, !1889, !1893, !1899, !1900, !1903, !1907, !1910, !1913, !1914, !1915, !1916, !1953, !1954, !1955, !1958, !1961, !1962, !1963, !1964}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !218, file: !30, line: 462, baseType: !221, size: 512)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !222, line: 64, size: 512, elements: !223)
!222 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!223 = !{!224, !225, !226, !228, !273, !1520, !1674, !1679, !1680, !1681, !1682, !1683}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !222, line: 65, baseType: !185, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !221, file: !222, line: 66, baseType: !173, size: 128, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !221, file: !222, line: 67, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !221, file: !222, line: 68, baseType: !229, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !222, line: 192, size: 704, elements: !231)
!231 = !{!232, !233, !234, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !230, file: !222, line: 193, baseType: !173, size: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !230, file: !222, line: 194, baseType: !141, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !230, file: !222, line: 195, baseType: !221, size: 512, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !230, file: !222, line: 196, baseType: !236, size: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !222, line: 156, size: 192, elements: !239)
!239 = !{!240, !245, !250}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !238, file: !222, line: 157, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!160, !229, !227}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !222, line: 158, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!185, !229, !227}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !238, file: !222, line: 159, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!160, !229, !227, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !222, line: 148, size: 20736, elements: !257)
!257 = !{!258, !263, !267, !268, !272}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !256, file: !222, line: 149, baseType: !259, size: 192)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 192, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!261 = !{!262}
!262 = !DISubrange(count: 3)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !256, file: !222, line: 150, baseType: !264, size: 4096, offset: 192)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 4096, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !256, file: !222, line: 151, baseType: !160, size: 32, offset: 4288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !256, file: !222, line: 152, baseType: !269, size: 16384, offset: 4320)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 16384, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 2048)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !256, file: !222, line: 153, baseType: !160, size: 32, offset: 20704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !221, file: !222, line: 69, baseType: !274, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !222, line: 138, size: 448, elements: !276)
!276 = !{!277, !281, !310, !312, !1466, !1499, !1503}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !275, file: !222, line: 139, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !227}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !275, file: !222, line: 140, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !285, line: 230, size: 128, elements: !286)
!285 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!286 = !{!287, !302}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !284, file: !285, line: 231, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!291, !227, !295, !260}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !127, line: 60, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !293, line: 73, baseType: !294)
!293 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !293, line: 15, baseType: !77)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !285, line: 30, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !285, line: 31, baseType: !185, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !296, file: !285, line: 32, baseType: !300, size: 16, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !127, line: 19, baseType: !301)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !284, file: !285, line: 232, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!291, !227, !295, !185, !306}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 55, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !293, line: 72, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !293, line: 16, baseType: !309)
!309 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !275, file: !222, line: 141, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !275, file: !222, line: 142, baseType: !313, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !285, line: 84, size: 320, elements: !317)
!317 = !{!318, !319, !323, !1463, !1464}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !285, line: 85, baseType: !185, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !316, file: !285, line: 86, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!300, !227, !295, !160}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !316, file: !285, line: 88, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!300, !227, !327, !160}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !285, line: 168, size: 448, elements: !329)
!329 = !{!330, !331, !332, !333, !343, !344}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !328, file: !285, line: 169, baseType: !296, size: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !328, file: !285, line: 170, baseType: !306, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !328, file: !285, line: 171, baseType: !109, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !328, file: !285, line: 172, baseType: !334, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!291, !337, !227, !327, !260, !340, !306}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !339, line: 526, flags: DIFlagFwdDecl)
!339 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !127, line: 46, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !293, line: 88, baseType: !342)
!342 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !328, file: !285, line: 174, baseType: !334, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !328, file: !285, line: 176, baseType: !345, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!160, !337, !227, !327, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !350, line: 305, size: 1472, elements: !351)
!350 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!351 = !{!352, !353, !354, !355, !356, !364, !365, !1437, !1443, !1444, !1449, !1450, !1453, !1457, !1458, !1459, !1460, !1461}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !349, file: !350, line: 308, baseType: !309, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !349, file: !350, line: 309, baseType: !309, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !349, file: !350, line: 313, baseType: !348, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !349, file: !350, line: 313, baseType: !348, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !349, file: !350, line: 315, baseType: !357, size: 192, align: 64, offset: 256)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !358, line: 24, size: 192, align: 64, elements: !359)
!358 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!359 = !{!360, !361, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !357, file: !358, line: 25, baseType: !309, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !357, file: !358, line: 26, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !357, file: !358, line: 27, baseType: !362, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !349, file: !350, line: 323, baseType: !309, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !349, file: !350, line: 327, baseType: !366, size: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !350, line: 388, size: 7296, elements: !368)
!368 = !{!369, !1433}
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !367, file: !350, line: 389, baseType: !370, size: 7296)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !350, line: 389, size: 7296, elements: !371)
!371 = !{!372, !373, !377, !382, !386, !387, !388, !389, !390, !398, !403, !404, !405, !406, !415, !416, !417, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !452, !460, !463, !511, !512, !1404, !1405, !1408, !1412, !1413, !1416, !1417, !1418, !1421, !1432}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !370, file: !350, line: 390, baseType: !348, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !370, file: !350, line: 391, baseType: !374, size: 64, offset: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !358, line: 31, size: 64, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !374, file: !358, line: 32, baseType: !362, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !370, file: !350, line: 392, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !379, line: 23, baseType: !380)
!379 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !135, line: 31, baseType: !381)
!381 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !370, file: !350, line: 394, baseType: !383, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!309, !337, !309, !309, !309, !309}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !370, file: !350, line: 398, baseType: !309, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !370, file: !350, line: 399, baseType: !309, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !370, file: !350, line: 405, baseType: !309, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !370, file: !350, line: 406, baseType: !309, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !370, file: !350, line: 407, baseType: !391, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !339, line: 286, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 286, size: 64, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !393, file: !339, line: 286, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !397, line: 18, baseType: !309)
!397 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !370, file: !350, line: 416, baseType: !399, size: 32, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !127, line: 168, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 166, size: 32, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !400, file: !127, line: 167, baseType: !160, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !370, file: !350, line: 428, baseType: !399, size: 32, offset: 608)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !370, file: !350, line: 437, baseType: !399, size: 32, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !370, file: !350, line: 447, baseType: !399, size: 32, offset: 672)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !370, file: !350, line: 450, baseType: !407, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !408, line: 13, baseType: !409)
!408 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !127, line: 175, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 173, size: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !410, file: !127, line: 174, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !379, line: 22, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !135, line: 30, baseType: !342)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !370, file: !350, line: 452, baseType: !160, size: 32, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !370, file: !350, line: 454, baseType: !141, offset: 800)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !370, file: !350, line: 457, baseType: !418, size: 256, offset: 832)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !419, line: 35, size: 256, elements: !420)
!419 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!420 = !{!421, !422, !423, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !418, file: !419, line: 36, baseType: !407, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !418, file: !419, line: 42, baseType: !407, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !418, file: !419, line: 46, baseType: !424, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !142, line: 29, baseType: !149)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !418, file: !419, line: 47, baseType: !173, size: 128, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !370, file: !350, line: 459, baseType: !173, size: 128, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !370, file: !350, line: 466, baseType: !309, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !370, file: !350, line: 467, baseType: !309, size: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !370, file: !350, line: 469, baseType: !309, size: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !370, file: !350, line: 470, baseType: !309, size: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !370, file: !350, line: 471, baseType: !409, size: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !370, file: !350, line: 472, baseType: !309, size: 64, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !370, file: !350, line: 473, baseType: !309, size: 64, offset: 1600)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !370, file: !350, line: 474, baseType: !309, size: 64, offset: 1664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !370, file: !350, line: 475, baseType: !309, size: 64, offset: 1728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !370, file: !350, line: 477, baseType: !141, offset: 1792)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !370, file: !350, line: 478, baseType: !309, size: 64, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !370, file: !350, line: 478, baseType: !309, size: 64, offset: 1856)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !370, file: !350, line: 478, baseType: !309, size: 64, offset: 1920)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !370, file: !350, line: 478, baseType: !309, size: 64, offset: 1984)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !370, file: !350, line: 479, baseType: !309, size: 64, offset: 2048)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !370, file: !350, line: 479, baseType: !309, size: 64, offset: 2112)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !370, file: !350, line: 479, baseType: !309, size: 64, offset: 2176)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !370, file: !350, line: 480, baseType: !309, size: 64, offset: 2240)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !370, file: !350, line: 480, baseType: !309, size: 64, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !370, file: !350, line: 480, baseType: !309, size: 64, offset: 2368)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !370, file: !350, line: 480, baseType: !309, size: 64, offset: 2432)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !370, file: !350, line: 482, baseType: !449, size: 2816, offset: 2496)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 2816, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 44)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !370, file: !350, line: 488, baseType: !453, size: 256, offset: 5312)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !454, line: 60, size: 256, elements: !455)
!454 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !453, file: !454, line: 61, baseType: !457, size: 256)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 256, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 4)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !370, file: !350, line: 490, baseType: !461, size: 64, offset: 5568)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !350, line: 490, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !370, file: !350, line: 493, baseType: !464, size: 896, offset: 5632)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !465, line: 53, baseType: !466)
!465 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 13, size: 896, elements: !467)
!467 = !{!468, !469, !470, !471, !474, !475, !482, !483, !503, !504, !507}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !466, file: !465, line: 18, baseType: !378, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !466, file: !465, line: 28, baseType: !409, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !466, file: !465, line: 31, baseType: !418, size: 256, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !466, file: !465, line: 32, baseType: !472, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !465, line: 32, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !466, file: !465, line: 37, baseType: !301, size: 16, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !466, file: !465, line: 40, baseType: !476, size: 192, offset: 512)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !477, line: 53, size: 192, elements: !478)
!477 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !476, file: !477, line: 54, baseType: !407, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !476, file: !477, line: 55, baseType: !141, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !476, file: !477, line: 59, baseType: !173, size: 128, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !466, file: !465, line: 41, baseType: !109, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !466, file: !465, line: 42, baseType: !484, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !487, line: 13, size: 896, elements: !488)
!487 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !486, file: !487, line: 14, baseType: !109, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !487, line: 15, baseType: !309, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !486, file: !487, line: 17, baseType: !309, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !486, file: !487, line: 17, baseType: !309, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !486, file: !487, line: 19, baseType: !77, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !486, file: !487, line: 21, baseType: !77, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !486, file: !487, line: 22, baseType: !77, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !486, file: !487, line: 23, baseType: !77, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !486, file: !487, line: 24, baseType: !77, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !486, file: !487, line: 25, baseType: !77, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !486, file: !487, line: 26, baseType: !77, size: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !486, file: !487, line: 27, baseType: !77, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !486, file: !487, line: 28, baseType: !77, size: 64, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !486, file: !487, line: 29, baseType: !77, size: 64, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !466, file: !465, line: 44, baseType: !399, size: 32, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !466, file: !465, line: 50, baseType: !505, size: 16, offset: 864)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !379, line: 19, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !135, line: 24, baseType: !301)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !466, file: !465, line: 51, baseType: !508, size: 16, offset: 880)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !379, line: 18, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !135, line: 23, baseType: !510)
!510 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !370, file: !350, line: 495, baseType: !309, size: 64, offset: 6528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !370, file: !350, line: 497, baseType: !513, size: 64, offset: 6592)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !350, line: 381, size: 384, elements: !515)
!515 = !{!516, !517, !1403}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !514, file: !350, line: 382, baseType: !399, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !514, file: !350, line: 383, baseType: !518, size: 128, offset: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !350, line: 376, size: 128, elements: !519)
!519 = !{!520, !1401}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !518, file: !350, line: 377, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !523, line: 640, size: 48640, elements: !524)
!523 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!524 = !{!525, !533, !535, !536, !542, !543, !544, !545, !546, !547, !548, !549, !553, !571, !582, !675, !676, !677, !688, !689, !691, !692, !693, !694, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !773, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !829, !831, !832, !833, !845, !847, !848, !849, !850, !851, !857, !858, !859, !860, !861, !862, !863, !875, !880, !885, !886, !887, !890, !894, !897, !900, !903, !906, !910, !913, !916, !922, !923, !924, !930, !931, !932, !933, !934, !943, !944, !945, !946, !947, !952, !953, !954, !957, !958, !961, !964, !967, !970, !973, !976, !977, !1057, !1060, !1063, !1064, !1067, !1068, !1069, !1075, !1076, !1077, !1090, !1091, !1092, !1102, !1107, !1110, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !522, file: !523, line: 646, baseType: !526, size: 128)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !527, line: 56, size: 128, elements: !528)
!527 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !526, file: !527, line: 57, baseType: !309, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !526, file: !527, line: 58, baseType: !531, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !379, line: 21, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !135, line: 27, baseType: !7)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !522, file: !523, line: 649, baseType: !534, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !522, file: !523, line: 657, baseType: !109, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !522, file: !523, line: 658, baseType: !537, size: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !538, line: 113, baseType: !539)
!538 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !538, line: 111, size: 32, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !539, file: !538, line: 112, baseType: !399, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !522, file: !523, line: 660, baseType: !7, size: 32, offset: 288)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !522, file: !523, line: 661, baseType: !7, size: 32, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !522, file: !523, line: 684, baseType: !160, size: 32, offset: 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !522, file: !523, line: 686, baseType: !160, size: 32, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !522, file: !523, line: 687, baseType: !160, size: 32, offset: 416)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !522, file: !523, line: 688, baseType: !160, size: 32, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !522, file: !523, line: 689, baseType: !7, size: 32, offset: 480)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !522, file: !523, line: 691, baseType: !550, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !523, line: 691, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !522, file: !523, line: 692, baseType: !554, size: 832, offset: 576)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !523, line: 451, size: 832, elements: !555)
!555 = !{!556, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !554, file: !523, line: 453, baseType: !557, size: 128)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !523, line: 325, size: 128, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !557, file: !523, line: 326, baseType: !309, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !557, file: !523, line: 327, baseType: !531, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !554, file: !523, line: 454, baseType: !357, size: 192, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !554, file: !523, line: 455, baseType: !173, size: 128, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !554, file: !523, line: 456, baseType: !7, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !554, file: !523, line: 458, baseType: !378, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !554, file: !523, line: 459, baseType: !378, size: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !554, file: !523, line: 460, baseType: !378, size: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !554, file: !523, line: 461, baseType: !378, size: 64, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !554, file: !523, line: 463, baseType: !378, size: 64, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !554, file: !523, line: 465, baseType: !570, offset: 832)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !523, line: 415, elements: !155)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !522, file: !523, line: 693, baseType: !572, size: 384, offset: 1408)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !523, line: 489, size: 384, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !572, file: !523, line: 490, baseType: !173, size: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !572, file: !523, line: 491, baseType: !309, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !572, file: !523, line: 492, baseType: !309, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !572, file: !523, line: 493, baseType: !7, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !572, file: !523, line: 494, baseType: !301, size: 16, offset: 288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !572, file: !523, line: 495, baseType: !301, size: 16, offset: 304)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !572, file: !523, line: 497, baseType: !581, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !522, file: !523, line: 697, baseType: !583, size: 1792, offset: 1792)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !523, line: 507, size: 1792, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !672, !673}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !583, file: !523, line: 508, baseType: !357, size: 192, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !583, file: !523, line: 515, baseType: !378, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !583, file: !523, line: 516, baseType: !378, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !583, file: !523, line: 517, baseType: !378, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !583, file: !523, line: 518, baseType: !378, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !583, file: !523, line: 519, baseType: !378, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !583, file: !523, line: 526, baseType: !413, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !583, file: !523, line: 527, baseType: !378, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !523, line: 528, baseType: !7, size: 32, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !583, file: !523, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !583, file: !523, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !583, file: !523, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !583, file: !523, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !583, file: !523, line: 563, baseType: !599, size: 512, offset: 704)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !13, line: 118, size: 512, elements: !600)
!600 = !{!601, !609, !610, !615, !667, !669, !670, !671}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !599, file: !13, line: 119, baseType: !602, size: 256)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !603, line: 9, size: 256, elements: !604)
!603 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !602, file: !603, line: 10, baseType: !357, size: 192, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !602, file: !603, line: 11, baseType: !607, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !608, line: 29, baseType: !413)
!608 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !599, file: !13, line: 120, baseType: !607, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !599, file: !13, line: 121, baseType: !611, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!12, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !599, file: !13, line: 122, baseType: !616, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !13, line: 159, size: 512, align: 512, elements: !618)
!618 = !{!619, !639, !640, !643, !653, !654, !662, !666}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !617, file: !13, line: 160, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !13, line: 214, size: 4608, align: 512, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !621, file: !13, line: 215, baseType: !424)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !621, file: !13, line: 216, baseType: !7, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !621, file: !13, line: 217, baseType: !7, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !621, file: !13, line: 218, baseType: !7, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !621, file: !13, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !621, file: !13, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !621, file: !13, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !621, file: !13, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !621, file: !13, line: 233, baseType: !607, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !621, file: !13, line: 234, baseType: !614, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !621, file: !13, line: 235, baseType: !607, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !621, file: !13, line: 236, baseType: !614, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !621, file: !13, line: 237, baseType: !636, size: 4096, offset: 512)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 4096, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 8)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !617, file: !13, line: 161, baseType: !7, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !617, file: !13, line: 162, baseType: !641, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !127, line: 27, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !293, line: 96, baseType: !160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !617, file: !13, line: 163, baseType: !644, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !645, line: 276, baseType: !646)
!645 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !645, line: 276, size: 32, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !646, file: !645, line: 276, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !645, line: 70, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !645, line: 65, size: 32, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !650, file: !645, line: 66, baseType: !7, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !617, file: !13, line: 164, baseType: !614, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !617, file: !13, line: 165, baseType: !655, size: 128, offset: 256)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !603, line: 14, size: 128, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !655, file: !603, line: 15, baseType: !658, size: 128)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !358, line: 125, size: 128, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !658, file: !358, line: 126, baseType: !374, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !658, file: !358, line: 127, baseType: !362, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !617, file: !13, line: 166, baseType: !663, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!607}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !617, file: !13, line: 167, baseType: !607, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !599, file: !13, line: 123, baseType: !668, size: 8, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !379, line: 17, baseType: !134)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !599, file: !13, line: 124, baseType: !668, size: 8, offset: 456)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !599, file: !13, line: 125, baseType: !668, size: 8, offset: 464)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !599, file: !13, line: 126, baseType: !668, size: 8, offset: 472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !583, file: !523, line: 572, baseType: !599, size: 512, offset: 1216)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !583, file: !523, line: 580, baseType: !674, size: 64, offset: 1728)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !522, file: !523, line: 721, baseType: !7, size: 32, offset: 3584)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !522, file: !523, line: 722, baseType: !160, size: 32, offset: 3616)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !522, file: !523, line: 723, baseType: !678, size: 64, offset: 3648)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !681, line: 17, baseType: !682)
!681 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !681, line: 17, size: 64, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !682, file: !681, line: 17, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 64, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 1)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !522, file: !523, line: 724, baseType: !680, size: 64, offset: 3712)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !522, file: !523, line: 749, baseType: !690, offset: 3776)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !523, line: 290, elements: !155)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !522, file: !523, line: 751, baseType: !173, size: 128, offset: 3776)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !522, file: !523, line: 757, baseType: !366, size: 64, offset: 3904)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !522, file: !523, line: 758, baseType: !366, size: 64, offset: 3968)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !522, file: !523, line: 761, baseType: !695, size: 320, offset: 4032)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !454, line: 34, size: 320, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !695, file: !454, line: 35, baseType: !378, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !695, file: !454, line: 36, baseType: !699, size: 256, offset: 64)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 256, elements: !458)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !522, file: !523, line: 766, baseType: !160, size: 32, offset: 4352)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !522, file: !523, line: 767, baseType: !160, size: 32, offset: 4384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !522, file: !523, line: 768, baseType: !160, size: 32, offset: 4416)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !522, file: !523, line: 770, baseType: !160, size: 32, offset: 4448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !522, file: !523, line: 772, baseType: !309, size: 64, offset: 4480)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !522, file: !523, line: 775, baseType: !7, size: 32, offset: 4544)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !522, file: !523, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !522, file: !523, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !522, file: !523, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !522, file: !523, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !522, file: !523, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !522, file: !523, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !522, file: !523, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !522, file: !523, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !522, file: !523, line: 831, baseType: !309, size: 64, offset: 4672)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !522, file: !523, line: 833, baseType: !716, size: 384, offset: 4736)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !18, line: 25, size: 384, elements: !717)
!717 = !{!718, !723}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !716, file: !18, line: 26, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!77, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, scope: !716, file: !18, line: 27, baseType: !724, size: 320, offset: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !716, file: !18, line: 27, size: 320, elements: !725)
!725 = !{!726, !736, !763}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !724, file: !18, line: 36, baseType: !727, size: 320)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !18, line: 29, size: 320, elements: !728)
!728 = !{!729, !731, !732, !733, !734, !735}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !727, file: !18, line: 30, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !727, file: !18, line: 31, baseType: !531, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !727, file: !18, line: 32, baseType: !531, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !727, file: !18, line: 33, baseType: !531, size: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !727, file: !18, line: 34, baseType: !378, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !727, file: !18, line: 35, baseType: !730, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !724, file: !18, line: 46, baseType: !737, size: 192)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !18, line: 38, size: 192, elements: !738)
!738 = !{!739, !740, !741, !762}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !737, file: !18, line: 39, baseType: !641, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !18, line: 40, baseType: !17, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, scope: !737, file: !18, line: 41, baseType: !742, size: 64, offset: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !737, file: !18, line: 41, size: 64, elements: !743)
!743 = !{!744, !752}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !742, file: !18, line: 42, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !747, line: 7, size: 128, elements: !748)
!747 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!748 = !{!749, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !746, file: !747, line: 8, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !293, line: 93, baseType: !342)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !746, file: !747, line: 9, baseType: !342, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !742, file: !18, line: 43, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !755, line: 7, size: 64, elements: !756)
!755 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!756 = !{!757, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !754, file: !755, line: 8, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !755, line: 5, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !379, line: 20, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !135, line: 26, baseType: !160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !754, file: !755, line: 9, baseType: !759, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !737, file: !18, line: 45, baseType: !378, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !724, file: !18, line: 54, baseType: !764, size: 256)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !18, line: 48, size: 256, elements: !765)
!765 = !{!766, !769, !770, !771, !772}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !764, file: !18, line: 49, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !18, line: 14, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !764, file: !18, line: 50, baseType: !160, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !764, file: !18, line: 51, baseType: !160, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !764, file: !18, line: 52, baseType: !309, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !764, file: !18, line: 53, baseType: !309, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !522, file: !523, line: 835, baseType: !774, size: 32, offset: 5120)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !127, line: 22, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !293, line: 28, baseType: !160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !522, file: !523, line: 836, baseType: !774, size: 32, offset: 5152)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !522, file: !523, line: 840, baseType: !309, size: 64, offset: 5184)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !522, file: !523, line: 849, baseType: !521, size: 64, offset: 5248)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !522, file: !523, line: 852, baseType: !521, size: 64, offset: 5312)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !522, file: !523, line: 857, baseType: !173, size: 128, offset: 5376)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !522, file: !523, line: 858, baseType: !173, size: 128, offset: 5504)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !522, file: !523, line: 859, baseType: !521, size: 64, offset: 5632)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !522, file: !523, line: 867, baseType: !173, size: 128, offset: 5696)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !522, file: !523, line: 868, baseType: !173, size: 128, offset: 5824)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !522, file: !523, line: 871, baseType: !786, size: 64, offset: 5952)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !788, line: 59, size: 768, elements: !789)
!788 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!789 = !{!790, !791, !792, !793, !804, !805, !812, !821}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !787, file: !788, line: 61, baseType: !537, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !787, file: !788, line: 62, baseType: !7, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !787, file: !788, line: 63, baseType: !141, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !787, file: !788, line: 65, baseType: !794, size: 256, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 256, elements: !458)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !127, line: 182, size: 64, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !795, file: !127, line: 183, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !127, line: 186, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !799, file: !127, line: 187, baseType: !798, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !799, file: !127, line: 187, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !787, file: !788, line: 66, baseType: !795, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !787, file: !788, line: 68, baseType: !806, size: 128, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !807, line: 40, baseType: !808)
!807 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !807, line: 36, size: 128, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !808, file: !807, line: 37, baseType: !141)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !808, file: !807, line: 38, baseType: !173, size: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !787, file: !788, line: 69, baseType: !813, size: 128, align: 64, offset: 512)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !127, line: 216, size: 128, align: 64, elements: !814)
!814 = !{!815, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !813, file: !127, line: 217, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !813, file: !127, line: 218, baseType: !818, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !816}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !787, file: !788, line: 70, baseType: !822, size: 128, offset: 640)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 128, elements: !686)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !788, line: 54, size: 128, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !823, file: !788, line: 55, baseType: !160, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !823, file: !788, line: 56, baseType: !827, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !788, line: 56, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !522, file: !523, line: 872, baseType: !830, size: 512, offset: 6016)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 512, elements: !458)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !522, file: !523, line: 873, baseType: !173, size: 128, offset: 6528)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !522, file: !523, line: 874, baseType: !173, size: 128, offset: 6656)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !522, file: !523, line: 876, baseType: !834, size: 64, offset: 6784)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !836, line: 26, size: 192, elements: !837)
!836 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !835, file: !836, line: 27, baseType: !7, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !835, file: !836, line: 28, baseType: !840, size: 128, offset: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !841, line: 43, size: 128, elements: !842)
!841 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !840, file: !841, line: 44, baseType: !424)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !840, file: !841, line: 45, baseType: !173, size: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !522, file: !523, line: 879, baseType: !846, size: 64, offset: 6848)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !522, file: !523, line: 882, baseType: !846, size: 64, offset: 6912)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !522, file: !523, line: 884, baseType: !378, size: 64, offset: 6976)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !522, file: !523, line: 885, baseType: !378, size: 64, offset: 7040)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !522, file: !523, line: 890, baseType: !378, size: 64, offset: 7104)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !522, file: !523, line: 891, baseType: !852, size: 128, offset: 7168)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !523, line: 242, size: 128, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !852, file: !523, line: 244, baseType: !378, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !852, file: !523, line: 245, baseType: !378, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !852, file: !523, line: 246, baseType: !424, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !522, file: !523, line: 900, baseType: !309, size: 64, offset: 7296)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !522, file: !523, line: 901, baseType: !309, size: 64, offset: 7360)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !522, file: !523, line: 904, baseType: !378, size: 64, offset: 7424)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !522, file: !523, line: 907, baseType: !378, size: 64, offset: 7488)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !522, file: !523, line: 910, baseType: !309, size: 64, offset: 7552)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !522, file: !523, line: 911, baseType: !309, size: 64, offset: 7616)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !522, file: !523, line: 914, baseType: !864, size: 640, offset: 7680)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !865, line: 123, size: 640, elements: !866)
!865 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!866 = !{!867, !873, !874}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !864, file: !865, line: 124, baseType: !868, size: 576)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 576, elements: !261)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !865, line: 108, size: 192, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !869, file: !865, line: 109, baseType: !378, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !869, file: !865, line: 110, baseType: !655, size: 128, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !864, file: !865, line: 125, baseType: !7, size: 32, offset: 576)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !864, file: !865, line: 126, baseType: !7, size: 32, offset: 608)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !522, file: !523, line: 917, baseType: !876, size: 192, offset: 8320)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !865, line: 134, size: 192, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !876, file: !865, line: 135, baseType: !813, size: 128, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !876, file: !865, line: 136, baseType: !7, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !522, file: !523, line: 923, baseType: !881, size: 64, offset: 8512)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !884, line: 11, flags: DIFlagFwdDecl)
!884 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !522, file: !523, line: 926, baseType: !881, size: 64, offset: 8576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !522, file: !523, line: 929, baseType: !881, size: 64, offset: 8640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !522, file: !523, line: 933, baseType: !888, size: 64, offset: 8704)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !523, line: 933, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !522, file: !523, line: 943, baseType: !891, size: 128, offset: 8768)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 16)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !522, file: !523, line: 945, baseType: !895, size: 64, offset: 8896)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !523, line: 49, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !522, file: !523, line: 956, baseType: !898, size: 64, offset: 8960)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !523, line: 45, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !522, file: !523, line: 959, baseType: !901, size: 64, offset: 9024)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !523, line: 959, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !522, file: !523, line: 962, baseType: !904, size: 64, offset: 9088)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !523, line: 66, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !522, file: !523, line: 966, baseType: !907, size: 64, offset: 9152)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !909, line: 35, flags: DIFlagFwdDecl)
!909 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!910 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !522, file: !523, line: 969, baseType: !911, size: 64, offset: 9216)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !865, line: 223, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !522, file: !523, line: 970, baseType: !914, size: 64, offset: 9280)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !523, line: 62, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !522, file: !523, line: 971, baseType: !917, size: 64, offset: 9344)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !918, line: 25, baseType: !919)
!918 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 23, size: 64, elements: !920)
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !919, file: !918, line: 24, baseType: !685, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !522, file: !523, line: 972, baseType: !917, size: 64, offset: 9408)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !522, file: !523, line: 974, baseType: !917, size: 64, offset: 9472)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !522, file: !523, line: 975, baseType: !925, size: 192, offset: 9536)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !926, line: 30, size: 192, elements: !927)
!926 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !925, file: !926, line: 31, baseType: !173, size: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !925, file: !926, line: 32, baseType: !917, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !522, file: !523, line: 976, baseType: !309, size: 64, offset: 9728)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !522, file: !523, line: 977, baseType: !306, size: 64, offset: 9792)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !522, file: !523, line: 978, baseType: !7, size: 32, offset: 9856)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !522, file: !523, line: 980, baseType: !816, size: 64, offset: 9920)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !522, file: !523, line: 989, baseType: !935, size: 128, offset: 9984)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !936, line: 35, size: 128, elements: !937)
!936 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !935, file: !936, line: 36, baseType: !160, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !935, file: !936, line: 37, baseType: !399, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !935, file: !936, line: 38, baseType: !941, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !936, line: 23, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !522, file: !523, line: 992, baseType: !378, size: 64, offset: 10112)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !522, file: !523, line: 993, baseType: !378, size: 64, offset: 10176)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !522, file: !523, line: 996, baseType: !141, offset: 10240)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !522, file: !523, line: 999, baseType: !424, offset: 10240)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !522, file: !523, line: 1001, baseType: !948, size: 64, offset: 10240)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !523, line: 636, size: 64, elements: !949)
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !523, line: 637, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !522, file: !523, line: 1005, baseType: !658, size: 128, offset: 10304)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !522, file: !523, line: 1007, baseType: !521, size: 64, offset: 10432)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !522, file: !523, line: 1009, baseType: !955, size: 64, offset: 10496)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !523, line: 1009, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !522, file: !523, line: 1043, baseType: !109, size: 64, offset: 10560)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !522, file: !523, line: 1046, baseType: !959, size: 64, offset: 10624)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !523, line: 41, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !522, file: !523, line: 1050, baseType: !962, size: 64, offset: 10688)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !523, line: 42, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !522, file: !523, line: 1054, baseType: !965, size: 64, offset: 10752)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !523, line: 55, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !522, file: !523, line: 1056, baseType: !968, size: 64, offset: 10816)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !523, line: 40, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !522, file: !523, line: 1058, baseType: !971, size: 64, offset: 10880)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !523, line: 47, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !522, file: !523, line: 1061, baseType: !974, size: 64, offset: 10944)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !523, line: 43, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !522, file: !523, line: 1064, baseType: !309, size: 64, offset: 11008)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !522, file: !523, line: 1065, baseType: !978, size: 64, offset: 11072)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !926, line: 14, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !926, line: 12, size: 384, elements: !981)
