; ModuleID = '../bcout/drivers/video/fbdev/core/fbcon.llvm.bc'
source_filename = "drivers/video/fbdev/core/fbcon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.obs_kernel_param = type { i8*, i32 (i8*)*, i32 }
%struct.vc = type { %struct.vc_data*, %struct.work_struct }
%struct.vc_data = type { %struct.tty_port, %struct.vc_state, %struct.vc_state, i16, i32, i32, i32, i32, i64, i64, i64, i32, i32, %struct.consw*, i16*, i32, i8, i8, i8, i8, i8, i8, i32, i16, i16, i64, i16, %struct.console_font, i16, i32, i32, [16 x i32], %struct.vt_mode, %struct.pid*, i32, %struct.wait_queue_head, i16, i8, i32, [4 x i64], [48 x i8], i16*, i32, i32, i32, i16, %struct.vc_data**, %struct.uni_pagedir*, %struct.uni_pagedir**, %struct.uni_screen* }
%struct.tty_port = type { %struct.tty_bufhead, %struct.tty_struct*, %struct.tty_struct*, %struct.tty_port_operations*, %struct.tty_port_client_operations*, %struct.spinlock, i32, i32, %struct.wait_queue_head, %struct.wait_queue_head, i64, i64, i8, %struct.mutex, %struct.mutex, i8*, i32, i32, i32, %struct.kref, i8* }
%struct.tty_bufhead = type { %struct.tty_buffer*, %struct.work_struct, %struct.mutex, %struct.atomic_t, %struct.tty_buffer, %struct.llist_head, %struct.atomic_t, i32, %struct.tty_buffer* }
%struct.tty_buffer = type { %union.anon.31, i32, i32, i32, i32, i32, [0 x i64] }
%union.anon.31 = type { %struct.tty_buffer* }
%struct.llist_head = type { %struct.llist_node* }

!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !132, line: 10, baseType: !7, size: 32, elements: !133)
!132 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!133 = !{!134, !135}
!134 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!135 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 30, baseType: !138, size: 64, elements: !139)
!137 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!138 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!140 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!141 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!142 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!143 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!144 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!145 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!146 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!147 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!148 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!149 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!150 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!151 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!152 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!153 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!154 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!155 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!156 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!157 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!158 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!159 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!160 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!161 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!162 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!163 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!164 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!165 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!166 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!167 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!168 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 110, baseType: !170, size: 32, elements: !171)
!170 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!171 = !{!172, !173, !174}
!172 = !DIEnumerator(name: "FBCON_LOGO_CANSHOW", value: -1)
!173 = !DIEnumerator(name: "FBCON_LOGO_DRAW", value: -2)
!174 = !DIEnumerator(name: "FBCON_LOGO_DONTSHOW", value: -3)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !176, line: 305, baseType: !7, size: 32, elements: !177)
!176 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!177 = !{!178, !179, !180, !181}
!178 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!179 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!180 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!181 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 303, baseType: !7, size: 32, elements: !184)
!183 = !DIFile(filename: "./include/uapi/linux/fb.h", directory: "/home/lizy2001/genbc/linux")
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIEnumerator(name: "FB_BLANK_UNBLANK", value: 0, isUnsigned: true)
!186 = !DIEnumerator(name: "FB_BLANK_NORMAL", value: 1, isUnsigned: true)
!187 = !DIEnumerator(name: "FB_BLANK_VSYNC_SUSPEND", value: 2, isUnsigned: true)
!188 = !DIEnumerator(name: "FB_BLANK_HSYNC_SUSPEND", value: 3, isUnsigned: true)
!189 = !DIEnumerator(name: "FB_BLANK_POWERDOWN", value: 4, isUnsigned: true)
!190 = !{!191, !192, !193, !170, !138, !199, !299, !4816, !4818, !5096, !1010, !4957, !557, !656, !397}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !195, line: 19, baseType: !196)
!195 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !197, line: 24, baseType: !198)
!197 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_info", file: !201, line: 437, size: 8128, elements: !202)
!201 = !DIFile(filename: "./include/linux/fb.h", directory: "/home/lizy2001/genbc/linux")
!202 = !{!203, !209, !210, !211, !212, !248, !249, !290, !316, !382, !393, !412, !413, !423, !424, !425, !4561, !4562, !4564, !4571, !4586, !4714, !4715, !4716, !4717, !4793, !4798, !4799, !4800, !4801, !4802, !4803, !4815}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !200, file: !201, line: 438, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !205, line: 168, baseType: !206)
!205 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 166, size: 32, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !206, file: !205, line: 167, baseType: !170, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !201, line: 439, baseType: !170, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !200, file: !201, line: 440, baseType: !170, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fbcon_rotate_hint", scope: !200, file: !201, line: 445, baseType: !170, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !200, file: !201, line: 446, baseType: !213, size: 192, offset: 128)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !214, line: 53, size: 192, elements: !215)
!214 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!215 = !{!216, !226, !242}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !213, file: !214, line: 54, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !218, line: 13, baseType: !219)
!218 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !205, line: 175, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 173, size: 64, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !220, file: !205, line: 174, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !195, line: 22, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !197, line: 30, baseType: !225)
!225 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !213, file: !214, line: 55, baseType: !227, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !228, line: 83, baseType: !229)
!228 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !228, line: 71, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !228, line: 72, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !228, line: 72, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !232, file: !228, line: 73, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !228, line: 20, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !235, file: !228, line: 21, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !239, line: 25, baseType: !240)
!239 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 25, elements: !241)
!241 = !{}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !213, file: !214, line: 59, baseType: !243, size: 128, offset: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !205, line: 178, size: 128, elements: !244)
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !205, line: 179, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !205, line: 179, baseType: !246, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mm_lock", scope: !200, file: !201, line: 447, baseType: !213, size: 192, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !200, file: !201, line: 448, baseType: !250, size: 1280, offset: 512)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_var_screeninfo", file: !183, line: 242, size: 1280, elements: !251)
!251 = !{!252, !254, !255, !256, !257, !258, !259, !260, !261, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !250, file: !183, line: 243, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !197, line: 27, baseType: !7)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !250, file: !183, line: 244, baseType: !253, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "xres_virtual", scope: !250, file: !183, line: 245, baseType: !253, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "yres_virtual", scope: !250, file: !183, line: 246, baseType: !253, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "xoffset", scope: !250, file: !183, line: 247, baseType: !253, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "yoffset", scope: !250, file: !183, line: 248, baseType: !253, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !250, file: !183, line: 250, baseType: !253, size: 32, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "grayscale", scope: !250, file: !183, line: 251, baseType: !253, size: 32, offset: 224)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !250, file: !183, line: 253, baseType: !262, size: 96, offset: 256)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_bitfield", file: !183, line: 188, size: 96, elements: !263)
!263 = !{!264, !265, !266}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !262, file: !183, line: 189, baseType: !253, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !262, file: !183, line: 190, baseType: !253, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "msb_right", scope: !262, file: !183, line: 191, baseType: !253, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !250, file: !183, line: 254, baseType: !262, size: 96, offset: 352)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !250, file: !183, line: 255, baseType: !262, size: 96, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !250, file: !183, line: 256, baseType: !262, size: 96, offset: 544)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nonstd", scope: !250, file: !183, line: 258, baseType: !253, size: 32, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !250, file: !183, line: 260, baseType: !253, size: 32, offset: 672)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !250, file: !183, line: 262, baseType: !253, size: 32, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !250, file: !183, line: 263, baseType: !253, size: 32, offset: 736)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "accel_flags", scope: !250, file: !183, line: 265, baseType: !253, size: 32, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !250, file: !183, line: 268, baseType: !253, size: 32, offset: 800)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "left_margin", scope: !250, file: !183, line: 269, baseType: !253, size: 32, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "right_margin", scope: !250, file: !183, line: 270, baseType: !253, size: 32, offset: 864)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "upper_margin", scope: !250, file: !183, line: 271, baseType: !253, size: 32, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lower_margin", scope: !250, file: !183, line: 272, baseType: !253, size: 32, offset: 928)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_len", scope: !250, file: !183, line: 273, baseType: !253, size: 32, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_len", scope: !250, file: !183, line: 274, baseType: !253, size: 32, offset: 992)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !250, file: !183, line: 275, baseType: !253, size: 32, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !250, file: !183, line: 276, baseType: !253, size: 32, offset: 1056)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !250, file: !183, line: 277, baseType: !253, size: 32, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !250, file: !183, line: 278, baseType: !253, size: 32, offset: 1120)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !250, file: !183, line: 279, baseType: !287, size: 128, offset: 1152)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 4)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fix", scope: !200, file: !201, line: 449, baseType: !291, size: 640, offset: 1792)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_fix_screeninfo", file: !183, line: 157, size: 640, elements: !292)
!292 = !{!293, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !291, file: !183, line: 158, baseType: !294, size: 128)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 128, elements: !296)
!295 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!296 = !{!297}
!297 = !DISubrange(count: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "smem_start", scope: !291, file: !183, line: 159, baseType: !299, size: 64, offset: 128)
!299 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "smem_len", scope: !291, file: !183, line: 161, baseType: !253, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !183, line: 162, baseType: !253, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type_aux", scope: !291, file: !183, line: 163, baseType: !253, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !291, file: !183, line: 164, baseType: !253, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "xpanstep", scope: !291, file: !183, line: 165, baseType: !196, size: 16, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ypanstep", scope: !291, file: !183, line: 166, baseType: !196, size: 16, offset: 336)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ywrapstep", scope: !291, file: !183, line: 167, baseType: !196, size: 16, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !291, file: !183, line: 168, baseType: !253, size: 32, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mmio_start", scope: !291, file: !183, line: 169, baseType: !299, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mmio_len", scope: !291, file: !183, line: 171, baseType: !253, size: 32, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "accel", scope: !291, file: !183, line: 172, baseType: !253, size: 32, offset: 544)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !291, file: !183, line: 174, baseType: !196, size: 16, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !291, file: !183, line: 175, baseType: !313, size: 32, offset: 592)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 32, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 2)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "monspecs", scope: !200, file: !201, line: 450, baseType: !317, size: 1152, offset: 2432)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_monspecs", file: !201, line: 63, size: 1152, elements: !318)
!318 = !{!319, !330, !351, !355, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "chroma", scope: !317, file: !201, line: 64, baseType: !320, size: 256)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_chroma", file: !201, line: 52, size: 256, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "redx", scope: !320, file: !201, line: 53, baseType: !253, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "greenx", scope: !320, file: !201, line: 54, baseType: !253, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "bluex", scope: !320, file: !201, line: 55, baseType: !253, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "whitex", scope: !320, file: !201, line: 56, baseType: !253, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "redy", scope: !320, file: !201, line: 57, baseType: !253, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "greeny", scope: !320, file: !201, line: 58, baseType: !253, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bluey", scope: !320, file: !201, line: 59, baseType: !253, size: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "whitey", scope: !320, file: !201, line: 60, baseType: !253, size: 32, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "modedb", scope: !317, file: !201, line: 65, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_videomode", file: !201, line: 766, size: 512, elements: !333)
!333 = !{!334, !337, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !201, line: 767, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !332, file: !201, line: 768, baseType: !338, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !195, line: 21, baseType: !253)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !332, file: !201, line: 769, baseType: !338, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !332, file: !201, line: 770, baseType: !338, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !332, file: !201, line: 771, baseType: !338, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "left_margin", scope: !332, file: !201, line: 772, baseType: !338, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "right_margin", scope: !332, file: !201, line: 773, baseType: !338, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "upper_margin", scope: !332, file: !201, line: 774, baseType: !338, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "lower_margin", scope: !332, file: !201, line: 775, baseType: !338, size: 32, offset: 288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_len", scope: !332, file: !201, line: 776, baseType: !338, size: 32, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_len", scope: !332, file: !201, line: 777, baseType: !338, size: 32, offset: 352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !332, file: !201, line: 778, baseType: !338, size: 32, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !332, file: !201, line: 779, baseType: !338, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !201, line: 780, baseType: !338, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "manufacturer", scope: !317, file: !201, line: 66, baseType: !352, size: 32, offset: 320)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 32, elements: !288)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !197, line: 21, baseType: !354)
!354 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !317, file: !201, line: 67, baseType: !356, size: 112, offset: 352)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 112, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 14)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "serial_no", scope: !317, file: !201, line: 68, baseType: !356, size: 112, offset: 464)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !317, file: !201, line: 69, baseType: !356, size: 112, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "modedb_len", scope: !317, file: !201, line: 70, baseType: !253, size: 32, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !317, file: !201, line: 71, baseType: !253, size: 32, offset: 736)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !317, file: !201, line: 72, baseType: !253, size: 32, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !317, file: !201, line: 73, baseType: !253, size: 32, offset: 800)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "week", scope: !317, file: !201, line: 74, baseType: !253, size: 32, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hfmin", scope: !317, file: !201, line: 75, baseType: !253, size: 32, offset: 864)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hfmax", scope: !317, file: !201, line: 76, baseType: !253, size: 32, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dclkmin", scope: !317, file: !201, line: 77, baseType: !253, size: 32, offset: 928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dclkmax", scope: !317, file: !201, line: 78, baseType: !253, size: 32, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !317, file: !201, line: 79, baseType: !196, size: 16, offset: 992)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dpms", scope: !317, file: !201, line: 80, baseType: !196, size: 16, offset: 1008)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !317, file: !201, line: 81, baseType: !196, size: 16, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vfmin", scope: !317, file: !201, line: 82, baseType: !196, size: 16, offset: 1040)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vfmax", scope: !317, file: !201, line: 83, baseType: !196, size: 16, offset: 1056)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !317, file: !201, line: 84, baseType: !196, size: 16, offset: 1072)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gtf", scope: !317, file: !201, line: 85, baseType: !196, size: 1, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !317, file: !201, line: 86, baseType: !196, size: 16, offset: 1104)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !317, file: !201, line: 87, baseType: !353, size: 8, offset: 1120)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !317, file: !201, line: 88, baseType: !353, size: 8, offset: 1128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max_x", scope: !317, file: !201, line: 89, baseType: !353, size: 8, offset: 1136)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "max_y", scope: !317, file: !201, line: 90, baseType: !353, size: 8, offset: 1144)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !200, file: !201, line: 451, baseType: !383, size: 256, offset: 3584)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !137, line: 102, size: 256, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !137, line: 103, baseType: !217, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !383, file: !137, line: 104, baseType: !243, size: 128, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !383, file: !137, line: 105, baseType: !388, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !137, line: 21, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap", scope: !200, file: !201, line: 452, baseType: !394, size: 448, offset: 3840)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_pixmap", file: !201, line: 185, size: 448, elements: !395)
!395 = !{!396, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !394, file: !201, line: 186, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !195, line: 17, baseType: !353)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !201, line: 187, baseType: !338, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !394, file: !201, line: 188, baseType: !338, size: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buf_align", scope: !394, file: !201, line: 189, baseType: !338, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scan_align", scope: !394, file: !201, line: 190, baseType: !338, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "access_align", scope: !394, file: !201, line: 191, baseType: !338, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !394, file: !201, line: 192, baseType: !338, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blit_x", scope: !394, file: !201, line: 193, baseType: !338, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "blit_y", scope: !394, file: !201, line: 194, baseType: !338, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "writeio", scope: !394, file: !201, line: 198, baseType: !408, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !199, !192, !192, !7}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "readio", scope: !394, file: !201, line: 199, baseType: !408, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sprite", scope: !200, file: !201, line: 453, baseType: !394, size: 448, offset: 4288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !200, file: !201, line: 454, baseType: !414, size: 320, offset: 4736)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_cmap", file: !183, line: 282, size: 320, elements: !415)
!415 = !{!416, !417, !418, !420, !421, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !414, file: !183, line: 283, baseType: !253, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !414, file: !183, line: 284, baseType: !253, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !414, file: !183, line: 285, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !414, file: !183, line: 286, baseType: !419, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !414, file: !183, line: 287, baseType: !419, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !414, file: !183, line: 288, baseType: !419, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "modelist", scope: !200, file: !201, line: 455, baseType: !243, size: 128, offset: 5056)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !200, file: !201, line: 456, baseType: !331, size: 64, offset: 5184)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bl_dev", scope: !200, file: !201, line: 462, baseType: !426, size: 64, offset: 5248)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backlight_device", file: !6, line: 280, size: 6912, elements: !428)
!428 = !{!429, !439, !440, !441, !456, !468, !469, !4558, !4560}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !427, file: !6, line: 284, baseType: !430, size: 224)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backlight_properties", file: !6, line: 182, size: 224, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !430, file: !6, line: 194, baseType: !170, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_brightness", scope: !430, file: !6, line: 203, baseType: !170, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !430, file: !6, line: 219, baseType: !170, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fb_blank", scope: !430, file: !6, line: 238, baseType: !170, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !6, line: 249, baseType: !5, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !6, line: 264, baseType: !7, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !430, file: !6, line: 272, baseType: !13, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "update_lock", scope: !427, file: !6, line: 294, baseType: !213, size: 192, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ops_lock", scope: !427, file: !6, line: 303, baseType: !213, size: 192, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !427, file: !6, line: 312, baseType: !442, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backlight_ops", file: !6, line: 120, size: 256, elements: !445)
!445 = !{!446, !447, !451, !452}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !444, file: !6, line: 128, baseType: !7, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "update_status", scope: !444, file: !6, line: 146, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!170, !426}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "get_brightness", scope: !444, file: !6, line: 160, baseType: !448, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "check_fb", scope: !444, file: !6, line: 174, baseType: !453, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!170, !426, !199}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fb_notif", scope: !427, file: !6, line: 317, baseType: !457, size: 192, offset: 704)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !458, line: 54, size: 192, elements: !459)
!458 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!459 = !{!460, !466, !467}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !457, file: !458, line: 55, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !458, line: 51, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!170, !465, !299, !192}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !458, line: 56, baseType: !465, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !457, file: !458, line: 57, baseType: !170, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !427, file: !6, line: 322, baseType: !243, size: 128, offset: 896)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !427, file: !6, line: 327, baseType: !470, size: 5568, offset: 1024)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !85, line: 461, size: 5568, elements: !471)
!471 = !{!472, !4012, !4013, !4016, !4017, !4068, !4159, !4160, !4161, !4162, !4163, !4172, !4277, !4290, !4485, !4486, !4490, !4492, !4493, !4494, !4498, !4504, !4505, !4508, !4509, !4510, !4511, !4512, !4513, !4514, !4546, !4547, !4548, !4551, !4554, !4555, !4556, !4557}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !470, file: !85, line: 462, baseType: !473, size: 512)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !474, line: 64, size: 512, elements: !475)
!474 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!475 = !{!476, !477, !478, !480, !525, !3885, !4006, !4007, !4008, !4009, !4010, !4011}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !474, line: 65, baseType: !335, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !473, file: !474, line: 66, baseType: !243, size: 128, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !473, file: !474, line: 67, baseType: !479, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !473, file: !474, line: 68, baseType: !481, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !474, line: 192, size: 704, elements: !483)
!483 = !{!484, !485, !486, !487}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !482, file: !474, line: 193, baseType: !243, size: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !482, file: !474, line: 194, baseType: !227, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !482, file: !474, line: 195, baseType: !473, size: 512, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !482, file: !474, line: 196, baseType: !488, size: 64, offset: 640)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !474, line: 156, size: 192, elements: !491)
!491 = !{!492, !497, !502}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !490, file: !474, line: 157, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!170, !481, !479}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !474, line: 158, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!335, !481, !479}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !490, file: !474, line: 159, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!170, !481, !479, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !474, line: 148, size: 20736, elements: !509)
!509 = !{!510, !515, !519, !520, !524}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !508, file: !474, line: 149, baseType: !511, size: 192)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 192, elements: !513)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!513 = !{!514}
!514 = !DISubrange(count: 3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !508, file: !474, line: 150, baseType: !516, size: 4096, offset: 192)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 4096, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !508, file: !474, line: 151, baseType: !170, size: 32, offset: 4288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !508, file: !474, line: 152, baseType: !521, size: 16384, offset: 4320)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 16384, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 2048)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !508, file: !474, line: 153, baseType: !170, size: 32, offset: 20704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !473, file: !474, line: 69, baseType: !526, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !474, line: 138, size: 448, elements: !528)
!528 = !{!529, !533, !560, !562, !3847, !3875, !3879}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !527, file: !474, line: 139, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !479}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !527, file: !474, line: 140, baseType: !534, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !537, line: 230, size: 128, elements: !538)
!537 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!538 = !{!539, !553}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !536, file: !537, line: 231, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !479, !547, !512}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !205, line: 60, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !545, line: 73, baseType: !546)
!545 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !545, line: 15, baseType: !138)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !537, line: 30, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !537, line: 31, baseType: !335, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !548, file: !537, line: 32, baseType: !552, size: 16, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !205, line: 19, baseType: !198)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !536, file: !537, line: 232, baseType: !554, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!543, !479, !547, !335, !557}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !205, line: 55, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !545, line: 72, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !545, line: 16, baseType: !299)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !527, file: !474, line: 141, baseType: !561, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !527, file: !474, line: 142, baseType: !563, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !537, line: 84, size: 320, elements: !567)
!567 = !{!568, !569, !573, !3844, !3845}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !566, file: !537, line: 85, baseType: !335, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !566, file: !537, line: 86, baseType: !570, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!552, !479, !547, !170}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !566, file: !537, line: 88, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!552, !479, !577, !170}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !537, line: 168, size: 448, elements: !579)
!579 = !{!580, !581, !582, !583, !3839, !3840}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !578, file: !537, line: 169, baseType: !548, size: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !578, file: !537, line: 170, baseType: !557, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !578, file: !537, line: 171, baseType: !192, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !578, file: !537, line: 172, baseType: !584, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!543, !587, !479, !577, !512, !761, !557}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !56, line: 916, size: 1856, align: 32, elements: !589)
!589 = !{!590, !608, !3804, !3805, !3806, !3807, !3808, !3809, !3810, !3811, !3812, !3813, !3822, !3823, !3832, !3833, !3834, !3835, !3836, !3837, !3838}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !588, file: !56, line: 920, baseType: !591, size: 128)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !588, file: !56, line: 917, size: 128, elements: !592)
!592 = !{!593, !599}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !591, file: !56, line: 918, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !595, line: 58, size: 64, elements: !596)
!595 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !594, file: !595, line: 59, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !591, file: !56, line: 919, baseType: !600, size: 128, align: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !205, line: 216, size: 128, align: 64, elements: !601)
!601 = !{!602, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !600, file: !205, line: 217, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !600, file: !205, line: 218, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !603}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !588, file: !56, line: 921, baseType: !609, size: 128, offset: 128)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !610, line: 8, size: 128, elements: !611)
!610 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!611 = !{!612, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !609, file: !610, line: 9, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !615, line: 18, flags: DIFlagFwdDecl)
!615 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !609, file: !610, line: 10, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !615, line: 89, size: 1536, elements: !619)
!619 = !{!620, !621, !631, !639, !640, !658, !3772, !3774, !3786, !3787, !3788, !3789, !3790, !3796, !3797, !3798}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !618, file: !615, line: 91, baseType: !7, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !618, file: !615, line: 92, baseType: !622, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !623, line: 277, baseType: !624)
!623 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !623, line: 277, size: 32, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !624, file: !623, line: 277, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !623, line: 70, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !623, line: 65, size: 32, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !628, file: !623, line: 66, baseType: !7, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !618, file: !615, line: 93, baseType: !632, size: 128, offset: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !633, line: 38, size: 128, elements: !634)
!633 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!634 = !{!635, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !632, file: !633, line: 39, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !632, file: !633, line: 39, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !618, file: !615, line: 94, baseType: !617, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !618, file: !615, line: 95, baseType: !641, size: 128, offset: 256)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !615, line: 47, size: 128, elements: !642)
!642 = !{!643, !655}
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !615, line: 48, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !615, line: 48, size: 64, elements: !645)
!645 = !{!646, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !615, line: 49, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !615, line: 49, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !647, file: !615, line: 50, baseType: !338, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !647, file: !615, line: 50, baseType: !338, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !644, file: !615, line: 52, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !195, line: 23, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !197, line: 31, baseType: !654)
!654 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !641, file: !615, line: 54, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !618, file: !615, line: 96, baseType: !659, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !56, line: 610, size: 4224, elements: !661)
!661 = !{!662, !663, !664, !672, !679, !680, !826, !3707, !3708, !3709, !3715, !3716, !3717, !3718, !3719, !3720, !3721, !3722, !3723, !3724, !3725, !3726, !3727, !3728, !3729, !3730, !3731, !3732, !3733, !3734, !3739, !3740, !3741, !3742, !3743, !3744, !3745, !3750, !3758, !3759, !3760, !3768, !3769, !3770, !3771}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !660, file: !56, line: 611, baseType: !552, size: 16)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !660, file: !56, line: 612, baseType: !198, size: 16, offset: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !660, file: !56, line: 613, baseType: !665, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !666, line: 23, baseType: !667)
!666 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !666, line: 21, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !667, file: !666, line: 22, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !205, line: 32, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !545, line: 49, baseType: !7)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !660, file: !56, line: 614, baseType: !673, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !666, line: 28, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !666, line: 26, size: 32, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !674, file: !666, line: 27, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !205, line: 33, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !545, line: 50, baseType: !7)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !660, file: !56, line: 615, baseType: !7, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !660, file: !56, line: 622, baseType: !681, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !56, line: 1864, size: 1536, align: 512, elements: !684)
!684 = !{!685, !689, !702, !706, !712, !716, !722, !726, !730, !734, !738, !739, !745, !749, !773, !802, !806, !812, !817, !821, !822}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !683, file: !56, line: 1865, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!617, !659, !617, !7}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !683, file: !56, line: 1866, baseType: !690, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!335, !617, !659, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !695, line: 10, size: 128, elements: !696)
!695 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!696 = !{!697, !701}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !694, file: !695, line: 11, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !192}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !694, file: !695, line: 12, baseType: !192, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !683, file: !56, line: 1867, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!170, !659, !170}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !683, file: !56, line: 1868, baseType: !707, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !659, !170}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !56, line: 581, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !683, file: !56, line: 1870, baseType: !713, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!170, !617, !512, !170}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !683, file: !56, line: 1872, baseType: !717, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!170, !659, !617, !552, !720}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !205, line: 30, baseType: !721)
!721 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !683, file: !56, line: 1873, baseType: !723, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!170, !617, !659, !617}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !683, file: !56, line: 1874, baseType: !727, size: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!170, !659, !617}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !683, file: !56, line: 1875, baseType: !731, size: 64, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!170, !659, !617, !335}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !683, file: !56, line: 1876, baseType: !735, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!170, !659, !617, !552}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !683, file: !56, line: 1877, baseType: !727, size: 64, offset: 640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !683, file: !56, line: 1878, baseType: !740, size: 64, offset: 704)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!170, !659, !617, !552, !743}
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !205, line: 16, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !205, line: 13, baseType: !338)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !683, file: !56, line: 1879, baseType: !746, size: 64, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!170, !659, !617, !659, !617, !7}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !683, file: !56, line: 1881, baseType: !750, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!170, !617, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !56, line: 219, size: 640, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !763, !770, !771, !772}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !754, file: !56, line: 220, baseType: !7, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !754, file: !56, line: 221, baseType: !552, size: 16, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !754, file: !56, line: 222, baseType: !665, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !754, file: !56, line: 223, baseType: !673, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !754, file: !56, line: 224, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !205, line: 46, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !545, line: 88, baseType: !225)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !754, file: !56, line: 225, baseType: !764, size: 128, offset: 192)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !765, line: 13, size: 128, elements: !766)
!765 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!766 = !{!767, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !764, file: !765, line: 14, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !765, line: 8, baseType: !224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !764, file: !765, line: 15, baseType: !138, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !754, file: !56, line: 226, baseType: !764, size: 128, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !754, file: !56, line: 227, baseType: !764, size: 128, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !754, file: !56, line: 234, baseType: !587, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !683, file: !56, line: 1882, baseType: !774, size: 64, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!170, !777, !779, !338, !7}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !781, line: 22, size: 1152, elements: !782)
!781 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!782 = !{!783, !784, !785, !786, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !780, file: !781, line: 23, baseType: !338, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !780, file: !781, line: 24, baseType: !552, size: 16, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !780, file: !781, line: 25, baseType: !7, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !780, file: !781, line: 26, baseType: !787, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !205, line: 104, baseType: !338)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !780, file: !781, line: 27, baseType: !652, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !780, file: !781, line: 28, baseType: !652, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !780, file: !781, line: 37, baseType: !652, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !780, file: !781, line: 38, baseType: !743, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !780, file: !781, line: 39, baseType: !743, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !780, file: !781, line: 40, baseType: !665, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !780, file: !781, line: 41, baseType: !673, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !781, line: 42, baseType: !761, size: 64, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !780, file: !781, line: 43, baseType: !764, size: 128, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !780, file: !781, line: 44, baseType: !764, size: 128, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !780, file: !781, line: 45, baseType: !764, size: 128, offset: 768)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !780, file: !781, line: 46, baseType: !764, size: 128, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !780, file: !781, line: 47, baseType: !652, size: 64, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !780, file: !781, line: 48, baseType: !652, size: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !683, file: !56, line: 1883, baseType: !803, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!543, !617, !512, !557}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !683, file: !56, line: 1884, baseType: !807, size: 64, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!170, !659, !810, !652, !652}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !56, line: 50, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !683, file: !56, line: 1886, baseType: !813, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!170, !659, !816, !170}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !683, file: !56, line: 1887, baseType: !818, size: 64, offset: 1152)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!170, !659, !617, !587, !7, !552}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !683, file: !56, line: 1890, baseType: !735, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !683, file: !56, line: 1891, baseType: !823, size: 64, offset: 1280)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!170, !659, !710, !170}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !660, file: !56, line: 623, baseType: !827, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !56, line: 1416, size: 9472, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !885, !3314, !3396, !3479, !3483, !3484, !3485, !3486, !3487, !3488, !3489, !3490, !3495, !3499, !3500, !3503, !3504, !3507, !3508, !3509, !3550, !3577, !3578, !3579, !3580, !3581, !3582, !3585, !3587, !3594, !3595, !3597, !3598, !3599, !3658, !3659, !3674, !3675, !3676, !3677, !3678, !3681, !3682, !3683, !3698, !3699, !3700, !3701, !3702, !3703, !3704, !3705, !3706}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !828, file: !56, line: 1417, baseType: !243, size: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !828, file: !56, line: 1418, baseType: !743, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !828, file: !56, line: 1419, baseType: !354, size: 8, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !828, file: !56, line: 1420, baseType: !299, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !828, file: !56, line: 1421, baseType: !761, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !828, file: !56, line: 1422, baseType: !836, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !56, line: 2228, size: 576, elements: !838)
!838 = !{!839, !840, !841, !848, !852, !856, !860, !864, !865, !875, !878, !879, !880, !882, !883, !884}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !56, line: 2229, baseType: !335, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !837, file: !56, line: 2230, baseType: !170, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !837, file: !56, line: 2238, baseType: !842, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!170, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !847, line: 28, flags: DIFlagFwdDecl)
!847 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!848 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !837, file: !56, line: 2239, baseType: !849, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !56, line: 70, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !837, file: !56, line: 2240, baseType: !853, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!617, !836, !170, !335, !192}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !837, file: !56, line: 2242, baseType: !857, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !827}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !837, file: !56, line: 2243, baseType: !861, size: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !863, line: 76, flags: DIFlagFwdDecl)
!863 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!864 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !56, line: 2244, baseType: !836, size: 64, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !837, file: !56, line: 2245, baseType: !866, size: 64, offset: 512)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !205, line: 182, size: 64, elements: !867)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !866, file: !205, line: 183, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !205, line: 186, size: 128, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !205, line: 187, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !870, file: !205, line: 187, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !837, file: !56, line: 2247, baseType: !876, offset: 576)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !877, line: 187, elements: !241)
!877 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!878 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !837, file: !56, line: 2248, baseType: !876, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !837, file: !56, line: 2249, baseType: !876, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !837, file: !56, line: 2250, baseType: !881, offset: 576)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, elements: !513)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !837, file: !56, line: 2252, baseType: !876, offset: 576)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !837, file: !56, line: 2253, baseType: !876, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !837, file: !56, line: 2254, baseType: !876, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !828, file: !56, line: 1423, baseType: !886, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !56, line: 1935, size: 1472, elements: !889)
!889 = !{!890, !894, !898, !899, !903, !909, !913, !914, !915, !919, !923, !924, !925, !926, !932, !936, !937, !980, !981, !982, !983, !3298, !3313}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !888, file: !56, line: 1936, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!659, !827}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !888, file: !56, line: 1937, baseType: !895, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !659}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !888, file: !56, line: 1938, baseType: !895, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !888, file: !56, line: 1940, baseType: !900, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !659, !170}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !888, file: !56, line: 1941, baseType: !904, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!170, !659, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !56, line: 289, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !888, file: !56, line: 1942, baseType: !910, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!170, !659}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !888, file: !56, line: 1943, baseType: !895, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !888, file: !56, line: 1944, baseType: !857, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !888, file: !56, line: 1945, baseType: !916, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!170, !827, !170}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !888, file: !56, line: 1946, baseType: !920, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!170, !827}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !888, file: !56, line: 1947, baseType: !920, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !888, file: !56, line: 1948, baseType: !920, size: 64, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !888, file: !56, line: 1949, baseType: !920, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !888, file: !56, line: 1950, baseType: !927, size: 64, offset: 832)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!170, !617, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !56, line: 57, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !888, file: !56, line: 1951, baseType: !933, size: 64, offset: 896)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!170, !827, !191, !512}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !888, file: !56, line: 1952, baseType: !857, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !888, file: !56, line: 1954, baseType: !938, size: 64, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!170, !941, !617}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !943, line: 16, size: 896, elements: !944)
!943 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/home/lizy2001/genbc/linux")
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !975, !976, !979}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !942, file: !943, line: 17, baseType: !512, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !942, file: !943, line: 18, baseType: !557, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !942, file: !943, line: 19, baseType: !557, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !942, file: !943, line: 20, baseType: !557, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !942, file: !943, line: 21, baseType: !557, size: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !942, file: !943, line: 22, baseType: !761, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !942, file: !943, line: 23, baseType: !761, size: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !942, file: !943, line: 24, baseType: !213, size: 192, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !942, file: !943, line: 25, baseType: !954, size: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !943, line: 31, size: 256, elements: !957)
!957 = !{!958, !963, !967, !971}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !956, file: !943, line: 32, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!192, !941, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !956, file: !943, line: 33, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !941, !192}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !943, line: 34, baseType: !968, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!192, !941, !192, !962}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !956, file: !943, line: 35, baseType: !972, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!170, !941, !192}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !942, file: !943, line: 26, baseType: !170, size: 32, offset: 704)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !942, file: !943, line: 27, baseType: !977, size: 64, offset: 768)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !942, file: !943, line: 28, baseType: !192, size: 64, offset: 832)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !888, file: !56, line: 1955, baseType: !938, size: 64, offset: 1088)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !888, file: !56, line: 1956, baseType: !938, size: 64, offset: 1152)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !888, file: !56, line: 1957, baseType: !938, size: 64, offset: 1216)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !888, file: !56, line: 1963, baseType: !984, size: 64, offset: 1280)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!170, !827, !987, !1010}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !989, line: 68, size: 512, align: 128, elements: !990)
!989 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!990 = !{!991, !992, !3290, !3297}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !989, line: 69, baseType: !299, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, scope: !988, file: !989, line: 77, baseType: !993, size: 320, offset: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !989, line: 77, size: 320, elements: !994)
!994 = !{!995, !1170, !1175, !1203, !1211, !1217, !3221, !3289}
!995 = !DIDerivedType(tag: DW_TAG_member, scope: !993, file: !989, line: 78, baseType: !996, size: 320)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !993, file: !989, line: 78, size: 320, elements: !997)
!997 = !{!998, !999, !1168, !1169}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !996, file: !989, line: 84, baseType: !243, size: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !996, file: !989, line: 86, baseType: !1000, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !56, line: 451, size: 1216, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1012, !1013, !1014, !1029, !1038, !1039, !1040, !1041, !1161, !1162, !1165, !1166, !1167}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1001, file: !56, line: 452, baseType: !659, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1001, file: !56, line: 453, baseType: !1005, size: 128, offset: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1006, line: 292, size: 128, elements: !1007)
!1006 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1007 = !{!1008, !1009, !1011}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1005, file: !1006, line: 293, baseType: !227)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1005, file: !1006, line: 295, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !205, line: 148, baseType: !7)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1005, file: !1006, line: 296, baseType: !192, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1001, file: !56, line: 454, baseType: !1010, size: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1001, file: !56, line: 455, baseType: !204, size: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1001, file: !56, line: 460, baseType: !1015, size: 128, offset: 256)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1016, line: 125, size: 128, elements: !1017)
!1016 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1017 = !{!1018, !1028}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1015, file: !1016, line: 126, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1016, line: 31, size: 64, elements: !1020)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1019, file: !1016, line: 32, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1016, line: 24, size: 192, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1023, file: !1016, line: 25, baseType: !299, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1023, file: !1016, line: 26, baseType: !1022, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1023, file: !1016, line: 27, baseType: !1022, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1015, file: !1016, line: 127, baseType: !1022, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1001, file: !56, line: 461, baseType: !1030, size: 256, offset: 384)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1031, line: 35, size: 256, elements: !1032)
!1031 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1032 = !{!1033, !1034, !1035, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1030, file: !1031, line: 36, baseType: !217, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1030, file: !1031, line: 42, baseType: !217, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1030, file: !1031, line: 46, baseType: !1036, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !228, line: 29, baseType: !235)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1030, file: !1031, line: 47, baseType: !243, size: 128, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1001, file: !56, line: 462, baseType: !299, size: 64, offset: 640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1001, file: !56, line: 463, baseType: !299, size: 64, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1001, file: !56, line: 464, baseType: !299, size: 64, offset: 768)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1001, file: !56, line: 465, baseType: !1042, size: 64, offset: 832)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !56, line: 367, size: 1408, elements: !1045)
!1045 = !{!1046, !1050, !1054, !1058, !1062, !1066, !1072, !1078, !1082, !1087, !1091, !1095, !1099, !1125, !1129, !1135, !1136, !1137, !1141, !1146, !1150, !1157}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1044, file: !56, line: 368, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!170, !987, !907}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1044, file: !56, line: 369, baseType: !1051, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!170, !587, !987}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1044, file: !56, line: 372, baseType: !1055, size: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!170, !1000, !907}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1044, file: !56, line: 375, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!170, !987}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !1044, file: !56, line: 381, baseType: !1063, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!170, !587, !1000, !246, !7}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !1044, file: !56, line: 383, baseType: !1067, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !56, line: 290, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !1044, file: !56, line: 385, baseType: !1073, size: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!170, !587, !1000, !761, !7, !7, !1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !1044, file: !56, line: 388, baseType: !1079, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!170, !587, !1000, !761, !7, !7, !987, !192}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !1044, file: !56, line: 393, baseType: !1083, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!1086, !1000, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !205, line: 125, baseType: !652)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !1044, file: !56, line: 394, baseType: !1088, size: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !987, !7, !7}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !1044, file: !56, line: 395, baseType: !1092, size: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!170, !987, !1010}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !1044, file: !56, line: 396, baseType: !1096, size: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !987}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !1044, file: !56, line: 397, baseType: !1100, size: 64, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!543, !1103, !1123}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !56, line: 320, size: 384, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1112, !1113, !1114, !1115, !1116}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !1104, file: !56, line: 321, baseType: !587, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !1104, file: !56, line: 326, baseType: !761, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !1104, file: !56, line: 327, baseType: !1109, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !1103, !138, !138}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1104, file: !56, line: 328, baseType: !192, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !1104, file: !56, line: 329, baseType: !170, size: 32, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !1104, file: !56, line: 330, baseType: !194, size: 16, offset: 288)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !1104, file: !56, line: 331, baseType: !194, size: 16, offset: 304)
!1116 = !DIDerivedType(tag: DW_TAG_member, scope: !1104, file: !56, line: 332, baseType: !1117, size: 64, offset: 320)
!1117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1104, file: !56, line: 332, size: 64, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !1117, file: !56, line: 333, baseType: !7, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !1117, file: !56, line: 334, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !56, line: 334, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !56, line: 64, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !1044, file: !56, line: 402, baseType: !1126, size: 64, offset: 832)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!170, !1000, !987, !987, !18}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !1044, file: !56, line: 404, baseType: !1130, size: 64, offset: 896)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!720, !987, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !1134, line: 305, baseType: !7)
!1134 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !1044, file: !56, line: 405, baseType: !1096, size: 64, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !1044, file: !56, line: 406, baseType: !1059, size: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !1044, file: !56, line: 407, baseType: !1138, size: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!170, !987, !299, !299}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "is_dirty_writeback", scope: !1044, file: !56, line: 409, baseType: !1142, size: 64, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !987, !1145, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "error_remove_page", scope: !1044, file: !56, line: 410, baseType: !1147, size: 64, offset: 1216)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!170, !1000, !987}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "swap_activate", scope: !1044, file: !56, line: 413, baseType: !1151, size: 64, offset: 1280)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!170, !1154, !587, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "swap_info_struct", file: !56, line: 61, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "swap_deactivate", scope: !1044, file: !56, line: 415, baseType: !1158, size: 64, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !587}
