; ModuleID = '../bcout/drivers/video/fbdev/core/fbcvt.llvm.bc'
source_filename = "drivers/video/fbdev/core/fbcvt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.fb_videomode = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.fb_cvt_data = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [35 x i8] c"\016fbcvt: Invalid input parameters\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"\016fbcvt: Refresh rate not CVT standard\0A\00", align 1
@.str.2 = private unnamed_addr constant [57 x i8] c"\016fbcvt: 60Hz refresh rate advised for reduced blanking\0A\00", align 1
@fb_cvt_vbi_tab = internal constant [8 x i8] c"\04\05\06\07\07\08\09\0A", align 1, !dbg !0
@.str.3 = private unnamed_addr constant [40 x i8] c"\016fbcvt: Aspect ratio not CVT standard\0A\00", align 1
@.str.4 = private unnamed_addr constant [29 x i8] c"fbcvt: %dx%d@%d: CVT Name - \00", align 1
@.str.5 = private unnamed_addr constant [47 x i8] c"Not a CVT standard - %d.%03d Mega Pixel Image\0A\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c".%03dM\00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c"3\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "fb_cvt_vbi_tab", scope: !2, file: !3, line: 61, type: !18, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/video/fbdev/core/fbcvt.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !15, line: 148, baseType: !7)
!15 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !{!0}
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !21)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !{!22}
!22 = !DISubrange(count: 8)
!23 = !{i32 7, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 2}
!26 = !{i32 1, !"Code Model", i32 2}
!27 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!28 = distinct !DISubprogram(name: "fb_find_mode_cvt", scope: !3, file: !3, line: 305, type: !29, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !57)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !31, !31}
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_videomode", file: !34, line: 766, size: 512, elements: !35)
!34 = !DIFile(filename: "./include/linux/fb.h", directory: "/home/lizy2001/genbc/linux")
!35 = !{!36, !40, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !34, line: 767, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !33, file: !34, line: 768, baseType: !41, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !42, line: 21, baseType: !43)
!42 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !44, line: 27, baseType: !7)
!44 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !33, file: !34, line: 769, baseType: !41, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !33, file: !34, line: 770, baseType: !41, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !33, file: !34, line: 771, baseType: !41, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "left_margin", scope: !33, file: !34, line: 772, baseType: !41, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "right_margin", scope: !33, file: !34, line: 773, baseType: !41, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "upper_margin", scope: !33, file: !34, line: 774, baseType: !41, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lower_margin", scope: !33, file: !34, line: 775, baseType: !41, size: 32, offset: 288)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_len", scope: !33, file: !34, line: 776, baseType: !41, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_len", scope: !33, file: !34, line: 777, baseType: !41, size: 32, offset: 352)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !33, file: !34, line: 778, baseType: !41, size: 32, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !33, file: !34, line: 779, baseType: !41, size: 32, offset: 416)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !33, file: !34, line: 780, baseType: !41, size: 32, offset: 448)
!57 = !{}
!58 = !DILocalVariable(name: "mode", arg: 1, scope: !28, file: !3, line: 305, type: !32)
!59 = !DILocation(line: 305, column: 43, scope: !28)
!60 = !DILocalVariable(name: "margins", arg: 2, scope: !28, file: !3, line: 305, type: !31)
!61 = !DILocation(line: 305, column: 53, scope: !28)
!62 = !DILocalVariable(name: "rb", arg: 3, scope: !28, file: !3, line: 305, type: !31)
!63 = !DILocation(line: 305, column: 66, scope: !28)
!64 = !DILocalVariable(name: "cvt", scope: !28, file: !3, line: 307, type: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_cvt_data", file: !3, line: 35, size: 736, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !65, file: !3, line: 36, baseType: !41, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !65, file: !3, line: 37, baseType: !41, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !65, file: !3, line: 38, baseType: !41, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "f_refresh", scope: !65, file: !3, line: 39, baseType: !41, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !65, file: !3, line: 40, baseType: !41, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "hperiod", scope: !65, file: !3, line: 41, baseType: !41, size: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "hblank", scope: !65, file: !3, line: 42, baseType: !41, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hfreq", scope: !65, file: !3, line: 43, baseType: !41, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "htotal", scope: !65, file: !3, line: 44, baseType: !41, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vtotal", scope: !65, file: !3, line: 45, baseType: !41, size: 32, offset: 288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vsync", scope: !65, file: !3, line: 46, baseType: !41, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hsync", scope: !65, file: !3, line: 47, baseType: !41, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "h_front_porch", scope: !65, file: !3, line: 48, baseType: !41, size: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "h_back_porch", scope: !65, file: !3, line: 49, baseType: !41, size: 32, offset: 416)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "v_front_porch", scope: !65, file: !3, line: 50, baseType: !41, size: 32, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "v_back_porch", scope: !65, file: !3, line: 51, baseType: !41, size: 32, offset: 480)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "h_margin", scope: !65, file: !3, line: 52, baseType: !41, size: 32, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "v_margin", scope: !65, file: !3, line: 53, baseType: !41, size: 32, offset: 544)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !65, file: !3, line: 54, baseType: !41, size: 32, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio", scope: !65, file: !3, line: 55, baseType: !41, size: 32, offset: 608)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "active_pixels", scope: !65, file: !3, line: 56, baseType: !41, size: 32, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !3, line: 57, baseType: !41, size: 32, offset: 672)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !65, file: !3, line: 58, baseType: !41, size: 32, offset: 704)
!90 = !DILocation(line: 307, column: 21, scope: !28)
!91 = !DILocation(line: 309, column: 2, scope: !28)
!92 = !DILocation(line: 311, column: 6, scope: !93)
!93 = distinct !DILexicalBlock(scope: !28, file: !3, line: 311, column: 6)
!94 = !DILocation(line: 311, column: 6, scope: !28)
!95 = !DILocation(line: 312, column: 10, scope: !93)
!96 = !DILocation(line: 312, column: 16, scope: !93)
!97 = !DILocation(line: 312, column: 6, scope: !93)
!98 = !DILocation(line: 314, column: 6, scope: !99)
!99 = distinct !DILexicalBlock(scope: !28, file: !3, line: 314, column: 6)
!100 = !DILocation(line: 314, column: 6, scope: !28)
!101 = !DILocation(line: 315, column: 10, scope: !99)
!102 = !DILocation(line: 315, column: 16, scope: !99)
!103 = !DILocation(line: 315, column: 6, scope: !99)
!104 = !DILocation(line: 317, column: 6, scope: !105)
!105 = distinct !DILexicalBlock(scope: !28, file: !3, line: 317, column: 6)
!106 = !DILocation(line: 317, column: 12, scope: !105)
!107 = !DILocation(line: 317, column: 18, scope: !105)
!108 = !DILocation(line: 317, column: 6, scope: !28)
!109 = !DILocation(line: 318, column: 10, scope: !105)
!110 = !DILocation(line: 318, column: 16, scope: !105)
!111 = !DILocation(line: 318, column: 6, scope: !105)
!112 = !DILocation(line: 320, column: 13, scope: !28)
!113 = !DILocation(line: 320, column: 19, scope: !28)
!114 = !DILocation(line: 320, column: 6, scope: !28)
!115 = !DILocation(line: 320, column: 11, scope: !28)
!116 = !DILocation(line: 321, column: 13, scope: !28)
!117 = !DILocation(line: 321, column: 19, scope: !28)
!118 = !DILocation(line: 321, column: 6, scope: !28)
!119 = !DILocation(line: 321, column: 11, scope: !28)
!120 = !DILocation(line: 322, column: 16, scope: !28)
!121 = !DILocation(line: 322, column: 22, scope: !28)
!122 = !DILocation(line: 322, column: 6, scope: !28)
!123 = !DILocation(line: 322, column: 14, scope: !28)
!124 = !DILocation(line: 323, column: 22, scope: !28)
!125 = !DILocation(line: 323, column: 6, scope: !28)
!126 = !DILocation(line: 323, column: 16, scope: !28)
!127 = !DILocation(line: 324, column: 6, scope: !28)
!128 = !DILocation(line: 324, column: 16, scope: !28)
!129 = !DILocation(line: 326, column: 11, scope: !130)
!130 = distinct !DILexicalBlock(scope: !28, file: !3, line: 326, column: 6)
!131 = !DILocation(line: 326, column: 7, scope: !130)
!132 = !DILocation(line: 326, column: 16, scope: !130)
!133 = !DILocation(line: 326, column: 24, scope: !130)
!134 = !DILocation(line: 326, column: 20, scope: !130)
!135 = !DILocation(line: 326, column: 29, scope: !130)
!136 = !DILocation(line: 326, column: 37, scope: !130)
!137 = !DILocation(line: 326, column: 33, scope: !130)
!138 = !DILocation(line: 326, column: 6, scope: !28)
!139 = !DILocation(line: 327, column: 3, scope: !140)
!140 = distinct !DILexicalBlock(scope: !130, file: !3, line: 326, column: 46)
!141 = !DILocation(line: 328, column: 3, scope: !140)
!142 = !DILocation(line: 331, column: 12, scope: !143)
!143 = distinct !DILexicalBlock(scope: !28, file: !3, line: 331, column: 6)
!144 = !DILocation(line: 331, column: 20, scope: !143)
!145 = !DILocation(line: 331, column: 26, scope: !143)
!146 = !DILocation(line: 331, column: 33, scope: !143)
!147 = !DILocation(line: 331, column: 41, scope: !143)
!148 = !DILocation(line: 331, column: 47, scope: !143)
!149 = !DILocation(line: 331, column: 54, scope: !143)
!150 = !DILocation(line: 331, column: 62, scope: !143)
!151 = !DILocation(line: 331, column: 68, scope: !143)
!152 = !DILocation(line: 332, column: 12, scope: !143)
!153 = !DILocation(line: 332, column: 20, scope: !143)
!154 = !DILocation(line: 331, column: 6, scope: !28)
!155 = !DILocation(line: 333, column: 3, scope: !156)
!156 = distinct !DILexicalBlock(scope: !143, file: !3, line: 332, column: 28)
!157 = !DILocation(line: 335, column: 7, scope: !156)
!158 = !DILocation(line: 335, column: 14, scope: !156)
