; ModuleID = '../bcout/drivers/video/fbdev/core/svgalib.llvm.bc'
source_filename = "drivers/video/fbdev/core/svgalib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!92 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !92, line: 502, baseType: !7, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !106, line: 76, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!108 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!113 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!114 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!115 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!116 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!118 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!119 = !{!120, !126, !130, !132, !133, !135}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !122, line: 17, baseType: !123)
!122 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !124, line: 21, baseType: !125)
!124 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !122, line: 19, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !124, line: 24, baseType: !129)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !122, line: 21, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !124, line: 27, baseType: !7)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !129)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!137 = !{!0, !138, !145, !150}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description245", scope: !2, file: !3, line: 671, type: !140, isLocal: true, isDefinition: true, align: 8)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 592, elements: !143)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!143 = !{!144}
!144 = !DISubrange(count: 74)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file246", scope: !2, file: !3, line: 672, type: !147, isLocal: true, isDefinition: true, align: 8)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 368, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 46)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license247", scope: !2, file: !3, line: 672, type: !152, isLocal: true, isDefinition: true, align: 8)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 160, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 20)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 440, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 55)
!158 = !{i32 7, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{i32 1, !"wchar_size", i32 2}
!161 = !{i32 1, !"Code Model", i32 2}
!162 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!163 = distinct !DISubprogram(name: "svga_wcrt_multi", scope: !3, file: !3, line: 23, type: !164, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !132, !166, !130}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vga_regset", file: !169, line: 13, size: 24, elements: !170)
!169 = !DIFile(filename: "./include/linux/svga.h", directory: "/home/lizy2001/genbc/linux")
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "regnum", scope: !168, file: !169, line: 14, baseType: !121, size: 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lowbit", scope: !168, file: !169, line: 15, baseType: !121, size: 8, offset: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "highbit", scope: !168, file: !169, line: 16, baseType: !121, size: 8, offset: 16)
!174 = !{}
!175 = !DILocalVariable(name: "regbase", arg: 1, scope: !163, file: !3, line: 23, type: !132)
!176 = !DILocation(line: 23, column: 36, scope: !163)
!177 = !DILocalVariable(name: "regset", arg: 2, scope: !163, file: !3, line: 23, type: !166)
!178 = !DILocation(line: 23, column: 70, scope: !163)
!179 = !DILocalVariable(name: "value", arg: 3, scope: !163, file: !3, line: 23, type: !130)
!180 = !DILocation(line: 23, column: 82, scope: !163)
!181 = !DILocalVariable(name: "regval", scope: !163, file: !3, line: 25, type: !121)
!182 = !DILocation(line: 25, column: 5, scope: !163)
!183 = !DILocalVariable(name: "bitval", scope: !163, file: !3, line: 25, type: !121)
!184 = !DILocation(line: 25, column: 13, scope: !163)
!185 = !DILocalVariable(name: "bitnum", scope: !163, file: !3, line: 25, type: !121)
!186 = !DILocation(line: 25, column: 21, scope: !163)
!187 = !DILocation(line: 27, column: 2, scope: !163)
!188 = !DILocation(line: 27, column: 9, scope: !163)
!189 = !DILocation(line: 27, column: 17, scope: !163)
!190 = !DILocation(line: 27, column: 24, scope: !163)
!191 = !DILocation(line: 28, column: 21, scope: !192)
!192 = distinct !DILexicalBlock(scope: !163, file: !3, line: 27, column: 47)
!193 = !DILocation(line: 28, column: 30, scope: !192)
!194 = !DILocation(line: 28, column: 38, scope: !192)
!195 = !DILocation(line: 28, column: 12, scope: !192)
!196 = !DILocation(line: 28, column: 10, scope: !192)
!197 = !DILocation(line: 29, column: 12, scope: !192)
!198 = !DILocation(line: 29, column: 20, scope: !192)
!199 = !DILocation(line: 29, column: 10, scope: !192)
!200 = !DILocation(line: 30, column: 3, scope: !192)
!201 = !DILocation(line: 30, column: 10, scope: !192)
!202 = !DILocation(line: 30, column: 20, scope: !192)
!203 = !DILocation(line: 30, column: 28, scope: !192)
!204 = !DILocation(line: 30, column: 17, scope: !192)
!205 = !DILocation(line: 31, column: 18, scope: !206)
!206 = distinct !DILexicalBlock(scope: !192, file: !3, line: 30, column: 37)
!207 = !DILocation(line: 31, column: 15, scope: !206)
!208 = !DILocation(line: 31, column: 13, scope: !206)
!209 = !DILocation(line: 31, column: 11, scope: !206)
!210 = !DILocation(line: 32, column: 13, scope: !206)
!211 = !DILocation(line: 32, column: 23, scope: !206)
!212 = !DILocation(line: 32, column: 22, scope: !206)
!213 = !DILocation(line: 32, column: 20, scope: !206)
!214 = !DILocation(line: 32, column: 11, scope: !206)
!215 = !DILocation(line: 33, column: 8, scope: !216)
!216 = distinct !DILexicalBlock(scope: !206, file: !3, line: 33, column: 8)
!217 = !DILocation(line: 33, column: 14, scope: !216)
!218 = !DILocation(line: 33, column: 8, scope: !206)
!219 = !DILocation(line: 33, column: 28, scope: !216)
!220 = !DILocation(line: 33, column: 37, scope: !216)
!221 = !DILocation(line: 33, column: 35, scope: !216)
!222 = !DILocation(line: 33, column: 26, scope: !216)
!223 = !DILocation(line: 33, column: 19, scope: !216)
!224 = !DILocation(line: 34, column: 11, scope: !206)
!225 = !DILocation(line: 35, column: 12, scope: !206)
!226 = !DILocation(line: 35, column: 18, scope: !206)
!227 = !DILocation(line: 35, column: 10, scope: !206)
!228 = distinct !{!228, !200, !229}
!229 = !DILocation(line: 36, column: 3, scope: !192)
!230 = !DILocation(line: 37, column: 12, scope: !192)
!231 = !DILocation(line: 37, column: 21, scope: !192)
!232 = !DILocation(line: 37, column: 29, scope: !192)
!233 = !DILocation(line: 37, column: 37, scope: !192)
!234 = !DILocation(line: 37, column: 3, scope: !192)
!235 = !DILocation(line: 38, column: 10, scope: !192)
!236 = distinct !{!236, !187, !237}
!237 = !DILocation(line: 39, column: 2, scope: !163)
!238 = !DILocation(line: 40, column: 1, scope: !163)
!239 = distinct !DISubprogram(name: "vga_rcrt", scope: !240, file: !240, line: 265, type: !241, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!240 = !DIFile(filename: "./include/video/vga.h", directory: "/home/lizy2001/genbc/linux")
!241 = !DISubroutineType(types: !242)
!242 = !{!125, !132, !125}
!243 = !DILocalVariable(name: "regbase", arg: 1, scope: !239, file: !240, line: 265, type: !132)
!244 = !DILocation(line: 265, column: 53, scope: !239)
!245 = !DILocalVariable(name: "reg", arg: 2, scope: !239, file: !240, line: 265, type: !125)
!246 = !DILocation(line: 265, column: 76, scope: !239)
!247 = !DILocation(line: 267, column: 16, scope: !239)
!248 = !DILocation(line: 267, column: 37, scope: !239)
!249 = !DILocation(line: 267, column: 9, scope: !239)
!250 = !DILocation(line: 268, column: 23, scope: !239)
!251 = !DILocation(line: 268, column: 16, scope: !239)
!252 = !DILocation(line: 268, column: 9, scope: !239)
!253 = distinct !DISubprogram(name: "vga_wcrt", scope: !240, file: !240, line: 271, type: !254, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !132, !125, !125}
!256 = !DILocalVariable(name: "regbase", arg: 1, scope: !253, file: !240, line: 271, type: !132)
!257 = !DILocation(line: 271, column: 44, scope: !253)
!258 = !DILocalVariable(name: "reg", arg: 2, scope: !253, file: !240, line: 271, type: !125)
!259 = !DILocation(line: 271, column: 67, scope: !253)
!260 = !DILocalVariable(name: "val", arg: 3, scope: !253, file: !240, line: 271, type: !125)
!261 = !DILocation(line: 271, column: 86, scope: !253)
!262 = !DILocation(line: 274, column: 14, scope: !253)
!263 = !DILocation(line: 274, column: 35, scope: !253)
!264 = !DILocation(line: 274, column: 40, scope: !253)
!265 = !DILocation(line: 274, column: 2, scope: !253)
!266 = !DILocation(line: 279, column: 1, scope: !253)
!267 = distinct !DISubprogram(name: "svga_wseq_multi", scope: !3, file: !3, line: 43, type: !164, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!268 = !DILocalVariable(name: "regbase", arg: 1, scope: !267, file: !3, line: 43, type: !132)
!269 = !DILocation(line: 43, column: 36, scope: !267)
!270 = !DILocalVariable(name: "regset", arg: 2, scope: !267, file: !3, line: 43, type: !166)
!271 = !DILocation(line: 43, column: 70, scope: !267)
!272 = !DILocalVariable(name: "value", arg: 3, scope: !267, file: !3, line: 43, type: !130)
!273 = !DILocation(line: 43, column: 82, scope: !267)
!274 = !DILocalVariable(name: "regval", scope: !267, file: !3, line: 45, type: !121)
!275 = !DILocation(line: 45, column: 5, scope: !267)
!276 = !DILocalVariable(name: "bitval", scope: !267, file: !3, line: 45, type: !121)
!277 = !DILocation(line: 45, column: 13, scope: !267)
!278 = !DILocalVariable(name: "bitnum", scope: !267, file: !3, line: 45, type: !121)
!279 = !DILocation(line: 45, column: 21, scope: !267)
!280 = !DILocation(line: 47, column: 2, scope: !267)
!281 = !DILocation(line: 47, column: 9, scope: !267)
!282 = !DILocation(line: 47, column: 17, scope: !267)
!283 = !DILocation(line: 47, column: 24, scope: !267)
!284 = !DILocation(line: 48, column: 21, scope: !285)
!285 = distinct !DILexicalBlock(scope: !267, file: !3, line: 47, column: 47)
!286 = !DILocation(line: 48, column: 30, scope: !285)
!287 = !DILocation(line: 48, column: 38, scope: !285)
!288 = !DILocation(line: 48, column: 12, scope: !285)
!289 = !DILocation(line: 48, column: 10, scope: !285)
!290 = !DILocation(line: 49, column: 12, scope: !285)
!291 = !DILocation(line: 49, column: 20, scope: !285)
!292 = !DILocation(line: 49, column: 10, scope: !285)
!293 = !DILocation(line: 50, column: 3, scope: !285)
!294 = !DILocation(line: 50, column: 10, scope: !285)
!295 = !DILocation(line: 50, column: 20, scope: !285)
!296 = !DILocation(line: 50, column: 28, scope: !285)
!297 = !DILocation(line: 50, column: 17, scope: !285)
!298 = !DILocation(line: 51, column: 18, scope: !299)
!299 = distinct !DILexicalBlock(scope: !285, file: !3, line: 50, column: 37)
!300 = !DILocation(line: 51, column: 15, scope: !299)
!301 = !DILocation(line: 51, column: 13, scope: !299)
!302 = !DILocation(line: 51, column: 11, scope: !299)
!303 = !DILocation(line: 52, column: 13, scope: !299)
!304 = !DILocation(line: 52, column: 23, scope: !299)
!305 = !DILocation(line: 52, column: 22, scope: !299)
!306 = !DILocation(line: 52, column: 20, scope: !299)
!307 = !DILocation(line: 52, column: 11, scope: !299)
!308 = !DILocation(line: 53, column: 8, scope: !309)
!309 = distinct !DILexicalBlock(scope: !299, file: !3, line: 53, column: 8)
!310 = !DILocation(line: 53, column: 14, scope: !309)
!311 = !DILocation(line: 53, column: 8, scope: !299)
!312 = !DILocation(line: 53, column: 28, scope: !309)
!313 = !DILocation(line: 53, column: 37, scope: !309)
!314 = !DILocation(line: 53, column: 35, scope: !309)
!315 = !DILocation(line: 53, column: 26, scope: !309)
!316 = !DILocation(line: 53, column: 19, scope: !309)
!317 = !DILocation(line: 54, column: 11, scope: !299)
!318 = !DILocation(line: 55, column: 12, scope: !299)
!319 = !DILocation(line: 55, column: 18, scope: !299)
!320 = !DILocation(line: 55, column: 10, scope: !299)
!321 = distinct !{!321, !293, !322}
!322 = !DILocation(line: 56, column: 3, scope: !285)
!323 = !DILocation(line: 57, column: 12, scope: !285)
!324 = !DILocation(line: 57, column: 21, scope: !285)
!325 = !DILocation(line: 57, column: 29, scope: !285)
!326 = !DILocation(line: 57, column: 37, scope: !285)
!327 = !DILocation(line: 57, column: 3, scope: !285)
!328 = !DILocation(line: 58, column: 10, scope: !285)
!329 = distinct !{!329, !280, !330}
!330 = !DILocation(line: 59, column: 2, scope: !267)
!331 = !DILocation(line: 60, column: 1, scope: !267)
!332 = distinct !DISubprogram(name: "vga_rseq", scope: !240, file: !240, line: 318, type: !241, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!333 = !DILocalVariable(name: "regbase", arg: 1, scope: !332, file: !240, line: 318, type: !132)
!334 = !DILocation(line: 318, column: 53, scope: !332)
!335 = !DILocalVariable(name: "reg", arg: 2, scope: !332, file: !240, line: 318, type: !125)
!336 = !DILocation(line: 318, column: 76, scope: !332)
!337 = !DILocation(line: 320, column: 16, scope: !332)
!338 = !DILocation(line: 320, column: 36, scope: !332)
!339 = !DILocation(line: 320, column: 9, scope: !332)
!340 = !DILocation(line: 321, column: 23, scope: !332)
!341 = !DILocation(line: 321, column: 16, scope: !332)
!342 = !DILocation(line: 321, column: 9, scope: !332)
!343 = distinct !DISubprogram(name: "vga_wseq", scope: !240, file: !240, line: 324, type: !254, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!344 = !DILocalVariable(name: "regbase", arg: 1, scope: !343, file: !240, line: 324, type: !132)
!345 = !DILocation(line: 324, column: 44, scope: !343)
!346 = !DILocalVariable(name: "reg", arg: 2, scope: !343, file: !240, line: 324, type: !125)
!347 = !DILocation(line: 324, column: 67, scope: !343)
!348 = !DILocalVariable(name: "val", arg: 3, scope: !343, file: !240, line: 324, type: !125)
!349 = !DILocation(line: 324, column: 86, scope: !343)
!350 = !DILocation(line: 327, column: 14, scope: !343)
!351 = !DILocation(line: 327, column: 34, scope: !343)
!352 = !DILocation(line: 327, column: 39, scope: !343)
!353 = !DILocation(line: 327, column: 2, scope: !343)
!354 = !DILocation(line: 332, column: 1, scope: !343)
!355 = distinct !DISubprogram(name: "svga_set_default_gfx_regs", scope: !3, file: !3, line: 78, type: !356, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !132}
!358 = !DILocalVariable(name: "regbase", arg: 1, scope: !355, file: !3, line: 78, type: !132)
!359 = !DILocation(line: 78, column: 46, scope: !355)
!360 = !DILocation(line: 81, column: 11, scope: !355)
!361 = !DILocation(line: 81, column: 2, scope: !355)
!362 = !DILocation(line: 82, column: 11, scope: !355)
!363 = !DILocation(line: 82, column: 2, scope: !355)
!364 = !DILocation(line: 83, column: 11, scope: !355)
!365 = !DILocation(line: 83, column: 2, scope: !355)
!366 = !DILocation(line: 84, column: 11, scope: !355)
!367 = !DILocation(line: 84, column: 2, scope: !355)
!368 = !DILocation(line: 85, column: 11, scope: !355)
!369 = !DILocation(line: 85, column: 2, scope: !355)
!370 = !DILocation(line: 86, column: 11, scope: !355)
!371 = !DILocation(line: 86, column: 2, scope: !355)
!372 = !DILocation(line: 89, column: 11, scope: !355)
!373 = !DILocation(line: 89, column: 2, scope: !355)
!374 = !DILocation(line: 91, column: 11, scope: !355)
!375 = !DILocation(line: 91, column: 2, scope: !355)
!376 = !DILocation(line: 92, column: 11, scope: !355)
!377 = !DILocation(line: 92, column: 2, scope: !355)
!378 = !DILocation(line: 93, column: 1, scope: !355)
!379 = distinct !DISubprogram(name: "vga_wgfx", scope: !240, file: !240, line: 376, type: !254, scopeLine: 377, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!380 = !DILocalVariable(name: "regbase", arg: 1, scope: !379, file: !240, line: 376, type: !132)
!381 = !DILocation(line: 376, column: 44, scope: !379)
!382 = !DILocalVariable(name: "reg", arg: 2, scope: !379, file: !240, line: 376, type: !125)
!383 = !DILocation(line: 376, column: 67, scope: !379)
!384 = !DILocalVariable(name: "val", arg: 3, scope: !379, file: !240, line: 376, type: !125)
!385 = !DILocation(line: 376, column: 86, scope: !379)
!386 = !DILocation(line: 379, column: 14, scope: !379)
!387 = !DILocation(line: 379, column: 34, scope: !379)
!388 = !DILocation(line: 379, column: 39, scope: !379)
!389 = !DILocation(line: 379, column: 2, scope: !379)
!390 = !DILocation(line: 384, column: 1, scope: !379)
!391 = distinct !DISubprogram(name: "svga_set_default_atc_regs", scope: !3, file: !3, line: 96, type: !356, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!392 = !DILocalVariable(name: "regbase", arg: 1, scope: !391, file: !3, line: 96, type: !132)
!393 = !DILocation(line: 96, column: 46, scope: !391)
!394 = !DILocalVariable(name: "count", scope: !391, file: !3, line: 98, type: !121)
!395 = !DILocation(line: 98, column: 5, scope: !391)
!396 = !DILocation(line: 100, column: 8, scope: !391)
!397 = !DILocation(line: 100, column: 2, scope: !391)
!398 = !DILocation(line: 101, column: 8, scope: !391)
!399 = !DILocation(line: 101, column: 2, scope: !391)
!400 = !DILocation(line: 104, column: 13, scope: !401)
!401 = distinct !DILexicalBlock(scope: !391, file: !3, line: 104, column: 2)
!402 = !DILocation(line: 104, column: 7, scope: !401)
!403 = !DILocation(line: 104, column: 18, scope: !404)
!404 = distinct !DILexicalBlock(scope: !401, file: !3, line: 104, column: 2)
!405 = !DILocation(line: 104, column: 24, scope: !404)
!406 = !DILocation(line: 104, column: 2, scope: !401)
!407 = !DILocation(line: 105, column: 14, scope: !404)
!408 = !DILocation(line: 105, column: 23, scope: !404)
!409 = !DILocation(line: 105, column: 30, scope: !404)
!410 = !DILocation(line: 105, column: 3, scope: !404)
!411 = !DILocation(line: 104, column: 38, scope: !404)
!412 = !DILocation(line: 104, column: 2, scope: !404)
!413 = distinct !{!413, !406, !414}
!414 = !DILocation(line: 105, column: 35, scope: !401)
!415 = !DILocation(line: 107, column: 13, scope: !391)
!416 = !DILocation(line: 107, column: 2, scope: !391)
!417 = !DILocation(line: 109, column: 13, scope: !391)
!418 = !DILocation(line: 109, column: 2, scope: !391)
!419 = !DILocation(line: 110, column: 13, scope: !391)
!420 = !DILocation(line: 110, column: 2, scope: !391)
!421 = !DILocation(line: 111, column: 13, scope: !391)
!422 = !DILocation(line: 111, column: 2, scope: !391)
!423 = !DILocation(line: 112, column: 13, scope: !391)
!424 = !DILocation(line: 112, column: 2, scope: !391)
!425 = !DILocation(line: 114, column: 8, scope: !391)
!426 = !DILocation(line: 114, column: 2, scope: !391)
!427 = !DILocation(line: 115, column: 8, scope: !391)
!428 = !DILocation(line: 115, column: 2, scope: !391)
!429 = !DILocation(line: 116, column: 1, scope: !391)
!430 = distinct !DISubprogram(name: "vga_r", scope: !240, file: !240, line: 234, type: !431, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!431 = !DISubroutineType(types: !432)
!432 = !{!125, !132, !129}
!433 = !DILocalVariable(name: "regbase", arg: 1, scope: !430, file: !240, line: 234, type: !132)
!434 = !DILocation(line: 234, column: 50, scope: !430)
!435 = !DILocalVariable(name: "port", arg: 2, scope: !430, file: !240, line: 234, type: !129)
!436 = !DILocation(line: 234, column: 74, scope: !430)
!437 = !DILocation(line: 236, column: 6, scope: !438)
!438 = distinct !DILexicalBlock(scope: !430, file: !240, line: 236, column: 6)
!439 = !DILocation(line: 236, column: 6, scope: !430)
!440 = !DILocation(line: 237, column: 20, scope: !438)
!441 = !DILocation(line: 237, column: 29, scope: !438)
!442 = !DILocation(line: 237, column: 10, scope: !438)
!443 = !DILocation(line: 237, column: 3, scope: !438)
!444 = !DILocation(line: 239, column: 20, scope: !438)
!445 = !DILocation(line: 239, column: 10, scope: !438)
!446 = !DILocation(line: 239, column: 3, scope: !438)
!447 = !DILocation(line: 240, column: 1, scope: !430)
!448 = distinct !DISubprogram(name: "vga_w", scope: !240, file: !240, line: 242, type: !449, scopeLine: 243, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !132, !129, !125}
!451 = !DILocalVariable(name: "regbase", arg: 1, scope: !448, file: !240, line: 242, type: !132)
!452 = !DILocation(line: 242, column: 41, scope: !448)
!453 = !DILocalVariable(name: "port", arg: 2, scope: !448, file: !240, line: 242, type: !129)
!454 = !DILocation(line: 242, column: 65, scope: !448)
!455 = !DILocalVariable(name: "val", arg: 3, scope: !448, file: !240, line: 242, type: !125)
!456 = !DILocation(line: 242, column: 85, scope: !448)
!457 = !DILocation(line: 244, column: 6, scope: !458)
!458 = distinct !DILexicalBlock(scope: !448, file: !240, line: 244, column: 6)
!459 = !DILocation(line: 244, column: 6, scope: !448)
!460 = !DILocation(line: 245, column: 13, scope: !458)
!461 = !DILocation(line: 245, column: 22, scope: !458)
!462 = !DILocation(line: 245, column: 28, scope: !458)
!463 = !DILocation(line: 245, column: 3, scope: !458)
!464 = !DILocation(line: 247, column: 13, scope: !458)
!465 = !DILocation(line: 247, column: 19, scope: !458)
!466 = !DILocation(line: 247, column: 3, scope: !458)
!467 = !DILocation(line: 248, column: 1, scope: !448)
!468 = distinct !DISubprogram(name: "svga_wattr", scope: !169, file: !169, line: 71, type: !469, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !132, !121, !121}
!471 = !DILocalVariable(name: "regbase", arg: 1, scope: !468, file: !169, line: 71, type: !132)
!472 = !DILocation(line: 71, column: 45, scope: !468)
!473 = !DILocalVariable(name: "index", arg: 2, scope: !468, file: !169, line: 71, type: !121)
!474 = !DILocation(line: 71, column: 57, scope: !468)
!475 = !DILocalVariable(name: "data", arg: 3, scope: !468, file: !169, line: 71, type: !121)
!476 = !DILocation(line: 71, column: 67, scope: !468)
!477 = !DILocation(line: 73, column: 8, scope: !468)
!478 = !DILocation(line: 73, column: 2, scope: !468)
!479 = !DILocation(line: 74, column: 8, scope: !468)
!480 = !DILocation(line: 74, column: 29, scope: !468)
!481 = !DILocation(line: 74, column: 2, scope: !468)
!482 = !DILocation(line: 75, column: 8, scope: !468)
!483 = !DILocation(line: 75, column: 28, scope: !468)
!484 = !DILocation(line: 75, column: 2, scope: !468)
!485 = !DILocation(line: 76, column: 1, scope: !468)
!486 = distinct !DISubprogram(name: "svga_set_default_seq_regs", scope: !3, file: !3, line: 119, type: !356, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!487 = !DILocalVariable(name: "regbase", arg: 1, scope: !486, file: !3, line: 119, type: !132)
!488 = !DILocation(line: 119, column: 46, scope: !486)
!489 = !DILocation(line: 122, column: 11, scope: !486)
!490 = !DILocation(line: 122, column: 2, scope: !486)
!491 = !DILocation(line: 123, column: 11, scope: !486)
!492 = !DILocation(line: 123, column: 2, scope: !486)
!493 = !DILocation(line: 124, column: 11, scope: !486)
!494 = !DILocation(line: 124, column: 2, scope: !486)
!495 = !DILocation(line: 126, column: 11, scope: !486)
!496 = !DILocation(line: 126, column: 2, scope: !486)
!497 = !DILocation(line: 127, column: 1, scope: !486)
!498 = distinct !DISubprogram(name: "svga_set_default_crt_regs", scope: !3, file: !3, line: 130, type: !356, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!499 = !DILocalVariable(name: "regbase", arg: 1, scope: !498, file: !3, line: 130, type: !132)
!500 = !DILocation(line: 130, column: 46, scope: !498)
!501 = !DILocation(line: 133, column: 17, scope: !498)
!502 = !DILocation(line: 133, column: 2, scope: !498)
!503 = !DILocation(line: 134, column: 11, scope: !498)
!504 = !DILocation(line: 134, column: 2, scope: !498)
!505 = !DILocation(line: 135, column: 17, scope: !498)
!506 = !DILocation(line: 135, column: 2, scope: !498)
!507 = !DILocation(line: 136, column: 11, scope: !498)
!508 = !DILocation(line: 136, column: 2, scope: !498)
!509 = !DILocation(line: 137, column: 11, scope: !498)
!510 = !DILocation(line: 137, column: 2, scope: !498)
!511 = !DILocation(line: 138, column: 1, scope: !498)
!512 = distinct !DISubprogram(name: "svga_wcrt_mask", scope: !169, file: !169, line: 87, type: !513, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !174)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !132, !121, !121, !121}
!515 = !DILocalVariable(name: "regbase", arg: 1, scope: !512, file: !169, line: 87, type: !132)
!516 = !DILocation(line: 87, column: 49, scope: !512)
!517 = !DILocalVariable(name: "index", arg: 2, scope: !512, file: !169, line: 87, type: !121)
!518 = !DILocation(line: 87, column: 61, scope: !512)
!519 = !DILocalVariable(name: "data", arg: 3, scope: !512, file: !169, line: 87, type: !121)
!520 = !DILocation(line: 87, column: 71, scope: !512)
!521 = !DILocalVariable(name: "mask", arg: 4, scope: !512, file: !169, line: 87, type: !121)
!522 = !DILocation(line: 87, column: 80, scope: !512)
!523 = !DILocation(line: 89, column: 11, scope: !512)
!524 = !DILocation(line: 89, column: 20, scope: !512)
!525 = !DILocation(line: 89, column: 28, scope: !512)
!526 = !DILocation(line: 89, column: 35, scope: !512)
!527 = !DILocation(line: 89, column: 33, scope: !512)
!528 = !DILocation(line: 89, column: 53, scope: !512)
!529 = !DILocation(line: 89, column: 62, scope: !512)
!530 = !DILocation(line: 89, column: 44, scope: !512)
!531 = !DILocation(line: 89, column: 72, scope: !512)
!532 = !DILocation(line: 89, column: 71, scope: !512)
!533 = !DILocation(line: 89, column: 69, scope: !512)
!534 = !DILocation(line: 89, column: 41, scope: !512)
!535 = !DILocation(line: 89, column: 27, scope: !512)
!536 = !DILocation(line: 89, column: 2, scope: !512)
!537 = !DILocation(line: 90, column: 1, scope: !512)
!538 = distinct !DISubprogram(name: "svga_set_textmode_vga_regs", scope: !3, file: !3, line: 140, type: !356, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!539 = !DILocalVariable(name: "regbase", arg: 1, scope: !538, file: !3, line: 140, type: !132)
!540 = !DILocation(line: 140, column: 47, scope: !538)
!541 = !DILocation(line: 143, column: 11, scope: !538)
!542 = !DILocation(line: 143, column: 2, scope: !538)
!543 = !DILocation(line: 144, column: 11, scope: !538)
!544 = !DILocation(line: 144, column: 2, scope: !538)
!545 = !DILocation(line: 146, column: 11, scope: !538)
!546 = !DILocation(line: 146, column: 2, scope: !538)
!547 = !DILocation(line: 147, column: 11, scope: !538)
!548 = !DILocation(line: 147, column: 2, scope: !538)
!549 = !DILocation(line: 148, column: 17, scope: !538)
!550 = !DILocation(line: 148, column: 2, scope: !538)
!551 = !DILocation(line: 150, column: 11, scope: !538)
!552 = !DILocation(line: 150, column: 2, scope: !538)
!553 = !DILocation(line: 151, column: 11, scope: !538)
!554 = !DILocation(line: 151, column: 2, scope: !538)
!555 = !DILocation(line: 152, column: 11, scope: !538)
!556 = !DILocation(line: 152, column: 2, scope: !538)
!557 = !DILocation(line: 153, column: 11, scope: !538)
!558 = !DILocation(line: 153, column: 2, scope: !538)
!559 = !DILocation(line: 155, column: 11, scope: !538)
!560 = !DILocation(line: 155, column: 2, scope: !538)
!561 = !DILocation(line: 156, column: 11, scope: !538)
!562 = !DILocation(line: 156, column: 2, scope: !538)
!563 = !DILocation(line: 157, column: 11, scope: !538)
!564 = !DILocation(line: 157, column: 2, scope: !538)
!565 = !DILocation(line: 159, column: 8, scope: !538)
!566 = !DILocation(line: 159, column: 2, scope: !538)
!567 = !DILocation(line: 160, column: 8, scope: !538)
!568 = !DILocation(line: 160, column: 2, scope: !538)
!569 = !DILocation(line: 162, column: 13, scope: !538)
!570 = !DILocation(line: 162, column: 2, scope: !538)
!571 = !DILocation(line: 163, column: 13, scope: !538)
!572 = !DILocation(line: 163, column: 2, scope: !538)
!573 = !DILocation(line: 165, column: 8, scope: !538)
!574 = !DILocation(line: 165, column: 2, scope: !538)
!575 = !DILocation(line: 166, column: 8, scope: !538)
!576 = !DILocation(line: 166, column: 2, scope: !538)
!577 = !DILocation(line: 167, column: 1, scope: !538)
!578 = distinct !DISubprogram(name: "svga_settile", scope: !3, file: !3, line: 193, type: !579, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !174)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581, !4780}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_info", file: !583, line: 437, size: 8128, elements: !584)
!583 = !DIFile(filename: "./include/linux/fb.h", directory: "/home/lizy2001/genbc/linux")
!584 = !{!585, !592, !593, !594, !595, !630, !631, !672, !697, !759, !771, !788, !789, !799, !800, !801, !4537, !4538, !4540, !4547, !4562, !4690, !4691, !4692, !4693, !4757, !4762, !4763, !4764, !4765, !4766, !4767, !4779}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !582, file: !583, line: 438, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !587, line: 168, baseType: !588)
!587 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 166, size: 32, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !588, file: !587, line: 167, baseType: !591, size: 32)
!591 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !582, file: !583, line: 439, baseType: !591, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !582, file: !583, line: 440, baseType: !591, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fbcon_rotate_hint", scope: !582, file: !583, line: 445, baseType: !591, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !582, file: !583, line: 446, baseType: !596, size: 192, offset: 128)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !597, line: 53, size: 192, elements: !598)
!597 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!598 = !{!599, !609, !624}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !596, file: !597, line: 54, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !601, line: 13, baseType: !602)
!601 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !587, line: 175, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 173, size: 64, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !603, file: !587, line: 174, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !122, line: 22, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !124, line: 30, baseType: !608)
!608 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !596, file: !597, line: 55, baseType: !610, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !611, line: 83, baseType: !612)
!611 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !611, line: 71, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !611, line: 72, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !611, line: 72, elements: !616)
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !615, file: !611, line: 73, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !611, line: 20, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !618, file: !611, line: 21, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !622, line: 25, baseType: !623)
!622 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 25, elements: !174)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !596, file: !597, line: 59, baseType: !625, size: 128, offset: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !587, line: 178, size: 128, elements: !626)
!626 = !{!627, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !587, line: 179, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !625, file: !587, line: 179, baseType: !628, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mm_lock", scope: !582, file: !583, line: 447, baseType: !596, size: 192, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !582, file: !583, line: 448, baseType: !632, size: 1280, offset: 512)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_var_screeninfo", file: !633, line: 242, size: 1280, elements: !634)
!633 = !DIFile(filename: "./include/uapi/linux/fb.h", directory: "/home/lizy2001/genbc/linux")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !632, file: !633, line: 243, baseType: !131, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !632, file: !633, line: 244, baseType: !131, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "xres_virtual", scope: !632, file: !633, line: 245, baseType: !131, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "yres_virtual", scope: !632, file: !633, line: 246, baseType: !131, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "xoffset", scope: !632, file: !633, line: 247, baseType: !131, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "yoffset", scope: !632, file: !633, line: 248, baseType: !131, size: 32, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !632, file: !633, line: 250, baseType: !131, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "grayscale", scope: !632, file: !633, line: 251, baseType: !131, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !632, file: !633, line: 253, baseType: !644, size: 96, offset: 256)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_bitfield", file: !633, line: 188, size: 96, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !644, file: !633, line: 189, baseType: !131, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !644, file: !633, line: 190, baseType: !131, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "msb_right", scope: !644, file: !633, line: 191, baseType: !131, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !632, file: !633, line: 254, baseType: !644, size: 96, offset: 352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !632, file: !633, line: 255, baseType: !644, size: 96, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !632, file: !633, line: 256, baseType: !644, size: 96, offset: 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nonstd", scope: !632, file: !633, line: 258, baseType: !131, size: 32, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !632, file: !633, line: 260, baseType: !131, size: 32, offset: 672)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !632, file: !633, line: 262, baseType: !131, size: 32, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !632, file: !633, line: 263, baseType: !131, size: 32, offset: 736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "accel_flags", scope: !632, file: !633, line: 265, baseType: !131, size: 32, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !632, file: !633, line: 268, baseType: !131, size: 32, offset: 800)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "left_margin", scope: !632, file: !633, line: 269, baseType: !131, size: 32, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "right_margin", scope: !632, file: !633, line: 270, baseType: !131, size: 32, offset: 864)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "upper_margin", scope: !632, file: !633, line: 271, baseType: !131, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lower_margin", scope: !632, file: !633, line: 272, baseType: !131, size: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_len", scope: !632, file: !633, line: 273, baseType: !131, size: 32, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_len", scope: !632, file: !633, line: 274, baseType: !131, size: 32, offset: 992)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !632, file: !633, line: 275, baseType: !131, size: 32, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !632, file: !633, line: 276, baseType: !131, size: 32, offset: 1056)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rotate", scope: !632, file: !633, line: 277, baseType: !131, size: 32, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !632, file: !633, line: 278, baseType: !131, size: 32, offset: 1120)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !632, file: !633, line: 279, baseType: !669, size: 128, offset: 1152)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 4)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fix", scope: !582, file: !583, line: 449, baseType: !673, size: 640, offset: 1792)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_fix_screeninfo", file: !633, line: 157, size: 640, elements: !674)
!674 = !{!675, !679, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !673, file: !633, line: 158, baseType: !676, size: 128)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 16)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "smem_start", scope: !673, file: !633, line: 159, baseType: !680, size: 64, offset: 128)
!680 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "smem_len", scope: !673, file: !633, line: 161, baseType: !131, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !673, file: !633, line: 162, baseType: !131, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "type_aux", scope: !673, file: !633, line: 163, baseType: !131, size: 32, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !673, file: !633, line: 164, baseType: !131, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "xpanstep", scope: !673, file: !633, line: 165, baseType: !128, size: 16, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ypanstep", scope: !673, file: !633, line: 166, baseType: !128, size: 16, offset: 336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ywrapstep", scope: !673, file: !633, line: 167, baseType: !128, size: 16, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !673, file: !633, line: 168, baseType: !131, size: 32, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mmio_start", scope: !673, file: !633, line: 169, baseType: !680, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mmio_len", scope: !673, file: !633, line: 171, baseType: !131, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "accel", scope: !673, file: !633, line: 172, baseType: !131, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !673, file: !633, line: 174, baseType: !128, size: 16, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !673, file: !633, line: 175, baseType: !694, size: 32, offset: 592)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 32, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 2)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "monspecs", scope: !582, file: !583, line: 450, baseType: !698, size: 1152, offset: 2432)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_monspecs", file: !583, line: 63, size: 1152, elements: !699)
!699 = !{!700, !711, !730, !732, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "chroma", scope: !698, file: !583, line: 64, baseType: !701, size: 256)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_chroma", file: !583, line: 52, size: 256, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "redx", scope: !701, file: !583, line: 53, baseType: !131, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "greenx", scope: !701, file: !583, line: 54, baseType: !131, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bluex", scope: !701, file: !583, line: 55, baseType: !131, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "whitex", scope: !701, file: !583, line: 56, baseType: !131, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "redy", scope: !701, file: !583, line: 57, baseType: !131, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "greeny", scope: !701, file: !583, line: 58, baseType: !131, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bluey", scope: !701, file: !583, line: 59, baseType: !131, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "whitey", scope: !701, file: !583, line: 60, baseType: !131, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "modedb", scope: !698, file: !583, line: 65, baseType: !712, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_videomode", file: !583, line: 766, size: 512, elements: !714)
!714 = !{!715, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !583, line: 767, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !713, file: !583, line: 768, baseType: !130, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !713, file: !583, line: 769, baseType: !130, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !713, file: !583, line: 770, baseType: !130, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pixclock", scope: !713, file: !583, line: 771, baseType: !130, size: 32, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "left_margin", scope: !713, file: !583, line: 772, baseType: !130, size: 32, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "right_margin", scope: !713, file: !583, line: 773, baseType: !130, size: 32, offset: 224)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "upper_margin", scope: !713, file: !583, line: 774, baseType: !130, size: 32, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lower_margin", scope: !713, file: !583, line: 775, baseType: !130, size: 32, offset: 288)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "hsync_len", scope: !713, file: !583, line: 776, baseType: !130, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "vsync_len", scope: !713, file: !583, line: 777, baseType: !130, size: 32, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !713, file: !583, line: 778, baseType: !130, size: 32, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !713, file: !583, line: 779, baseType: !130, size: 32, offset: 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !713, file: !583, line: 780, baseType: !130, size: 32, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "manufacturer", scope: !698, file: !583, line: 66, baseType: !731, size: 32, offset: 320)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 32, elements: !670)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !698, file: !583, line: 67, baseType: !733, size: 112, offset: 352)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 112, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 14)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "serial_no", scope: !698, file: !583, line: 68, baseType: !733, size: 112, offset: 464)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !698, file: !583, line: 69, baseType: !733, size: 112, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "modedb_len", scope: !698, file: !583, line: 70, baseType: !131, size: 32, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !698, file: !583, line: 71, baseType: !131, size: 32, offset: 736)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !698, file: !583, line: 72, baseType: !131, size: 32, offset: 768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !698, file: !583, line: 73, baseType: !131, size: 32, offset: 800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "week", scope: !698, file: !583, line: 74, baseType: !131, size: 32, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hfmin", scope: !698, file: !583, line: 75, baseType: !131, size: 32, offset: 864)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "hfmax", scope: !698, file: !583, line: 76, baseType: !131, size: 32, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dclkmin", scope: !698, file: !583, line: 77, baseType: !131, size: 32, offset: 928)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "dclkmax", scope: !698, file: !583, line: 78, baseType: !131, size: 32, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !698, file: !583, line: 79, baseType: !128, size: 16, offset: 992)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dpms", scope: !698, file: !583, line: 80, baseType: !128, size: 16, offset: 1008)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !698, file: !583, line: 81, baseType: !128, size: 16, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vfmin", scope: !698, file: !583, line: 82, baseType: !128, size: 16, offset: 1040)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vfmax", scope: !698, file: !583, line: 83, baseType: !128, size: 16, offset: 1056)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !698, file: !583, line: 84, baseType: !128, size: 16, offset: 1072)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gtf", scope: !698, file: !583, line: 85, baseType: !128, size: 1, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !698, file: !583, line: 86, baseType: !128, size: 16, offset: 1104)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !698, file: !583, line: 87, baseType: !123, size: 8, offset: 1120)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !698, file: !583, line: 88, baseType: !123, size: 8, offset: 1128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "max_x", scope: !698, file: !583, line: 89, baseType: !123, size: 8, offset: 1136)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "max_y", scope: !698, file: !583, line: 90, baseType: !123, size: 8, offset: 1144)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !582, file: !583, line: 451, baseType: !760, size: 256, offset: 3584)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !761, line: 102, size: 256, elements: !762)
!761 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !761, line: 103, baseType: !600, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !760, file: !761, line: 104, baseType: !625, size: 128, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !760, file: !761, line: 105, baseType: !766, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !761, line: 21, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap", scope: !582, file: !583, line: 452, baseType: !772, size: 448, offset: 3840)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_pixmap", file: !583, line: 185, size: 448, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !787}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !772, file: !583, line: 186, baseType: !120, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !772, file: !583, line: 187, baseType: !130, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !772, file: !583, line: 188, baseType: !130, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "buf_align", scope: !772, file: !583, line: 189, baseType: !130, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "scan_align", scope: !772, file: !583, line: 190, baseType: !130, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "access_align", scope: !772, file: !583, line: 191, baseType: !130, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !772, file: !583, line: 192, baseType: !130, size: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "blit_x", scope: !772, file: !583, line: 193, baseType: !130, size: 32, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "blit_y", scope: !772, file: !583, line: 194, baseType: !130, size: 32, offset: 288)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "writeio", scope: !772, file: !583, line: 198, baseType: !784, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !581, !132, !132, !7}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "readio", scope: !772, file: !583, line: 199, baseType: !784, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sprite", scope: !582, file: !583, line: 453, baseType: !772, size: 448, offset: 4288)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !582, file: !583, line: 454, baseType: !790, size: 320, offset: 4736)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fb_cmap", file: !633, line: 282, size: 320, elements: !791)
!791 = !{!792, !793, !794, !796, !797, !798}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !790, file: !633, line: 283, baseType: !131, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !790, file: !633, line: 284, baseType: !131, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !790, file: !633, line: 285, baseType: !795, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !790, file: !633, line: 286, baseType: !795, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !790, file: !633, line: 287, baseType: !795, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !790, file: !633, line: 288, baseType: !795, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "modelist", scope: !582, file: !583, line: 455, baseType: !625, size: 128, offset: 5056)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !582, file: !583, line: 456, baseType: !712, size: 64, offset: 5184)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bl_dev", scope: !582, file: !583, line: 462, baseType: !802, size: 64, offset: 5248)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backlight_device", file: !6, line: 280, size: 6912, elements: !804)
!804 = !{!805, !815, !816, !817, !832, !844, !845, !4534, !4536}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !803, file: !6, line: 284, baseType: !806, size: 224)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backlight_properties", file: !6, line: 182, size: 224, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !806, file: !6, line: 194, baseType: !591, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "max_brightness", scope: !806, file: !6, line: 203, baseType: !591, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !806, file: !6, line: 219, baseType: !591, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fb_blank", scope: !806, file: !6, line: 238, baseType: !591, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !806, file: !6, line: 249, baseType: !5, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !806, file: !6, line: 264, baseType: !7, size: 32, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !806, file: !6, line: 272, baseType: !13, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "update_lock", scope: !803, file: !6, line: 294, baseType: !596, size: 192, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ops_lock", scope: !803, file: !6, line: 303, baseType: !596, size: 192, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !803, file: !6, line: 312, baseType: !818, size: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backlight_ops", file: !6, line: 120, size: 256, elements: !821)
!821 = !{!822, !823, !827, !828}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !820, file: !6, line: 128, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "update_status", scope: !820, file: !6, line: 146, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!591, !802}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "get_brightness", scope: !820, file: !6, line: 160, baseType: !824, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "check_fb", scope: !820, file: !6, line: 174, baseType: !829, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!591, !802, !581}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fb_notif", scope: !803, file: !6, line: 317, baseType: !833, size: 192, offset: 704)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !834, line: 54, size: 192, elements: !835)
!834 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!835 = !{!836, !842, !843}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !833, file: !834, line: 55, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !834, line: 51, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!591, !841, !680, !132}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !833, file: !834, line: 56, baseType: !841, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !833, file: !834, line: 57, baseType: !591, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !803, file: !6, line: 322, baseType: !625, size: 128, offset: 896)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !803, file: !6, line: 327, baseType: !846, size: 5568, offset: 1024)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !85, line: 461, size: 5568, elements: !847)
!847 = !{!848, !3987, !3989, !3992, !3993, !4044, !4135, !4136, !4137, !4138, !4139, !4148, !4253, !4266, !4461, !4462, !4466, !4468, !4469, !4470, !4474, !4480, !4481, !4484, !4485, !4486, !4487, !4488, !4489, !4490, !4522, !4523, !4524, !4527, !4530, !4531, !4532, !4533}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !846, file: !85, line: 462, baseType: !849, size: 512)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !850, line: 64, size: 512, elements: !851)
!850 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!851 = !{!852, !853, !854, !856, !901, !3848, !3981, !3982, !3983, !3984, !3985, !3986}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !849, file: !850, line: 65, baseType: !716, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !849, file: !850, line: 66, baseType: !625, size: 128, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !849, file: !850, line: 67, baseType: !855, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !849, file: !850, line: 68, baseType: !857, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !850, line: 192, size: 704, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !858, file: !850, line: 193, baseType: !625, size: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !858, file: !850, line: 194, baseType: !610, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !858, file: !850, line: 195, baseType: !849, size: 512, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !858, file: !850, line: 196, baseType: !864, size: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !850, line: 156, size: 192, elements: !867)
!867 = !{!868, !873, !878}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !866, file: !850, line: 157, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!591, !857, !855}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !850, line: 158, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!716, !857, !855}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !866, file: !850, line: 159, baseType: !879, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!591, !857, !855, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !850, line: 148, size: 20736, elements: !885)
!885 = !{!886, !891, !895, !896, !900}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !884, file: !850, line: 149, baseType: !887, size: 192)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 192, elements: !889)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!889 = !{!890}
!890 = !DISubrange(count: 3)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !884, file: !850, line: 150, baseType: !892, size: 4096, offset: 192)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 4096, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !884, file: !850, line: 151, baseType: !591, size: 32, offset: 4288)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !884, file: !850, line: 152, baseType: !897, size: 16384, offset: 4320)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 16384, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 2048)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !884, file: !850, line: 153, baseType: !591, size: 32, offset: 20704)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !849, file: !850, line: 69, baseType: !902, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !850, line: 138, size: 448, elements: !904)
!904 = !{!905, !909, !937, !939, !3810, !3838, !3842}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !903, file: !850, line: 139, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !855}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !903, file: !850, line: 140, baseType: !910, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !913, line: 230, size: 128, elements: !914)
!913 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!914 = !{!915, !930}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !912, file: !913, line: 231, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!919, !855, !924, !888}
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !587, line: 60, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !921, line: 73, baseType: !922)
!921 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !921, line: 15, baseType: !923)
!923 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !913, line: 30, size: 128, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !913, line: 31, baseType: !716, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !925, file: !913, line: 32, baseType: !929, size: 16, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !587, line: 19, baseType: !129)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !912, file: !913, line: 232, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!919, !855, !924, !716, !934}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !587, line: 55, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !921, line: 72, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !921, line: 16, baseType: !680)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !903, file: !850, line: 141, baseType: !938, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !903, file: !850, line: 142, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !913, line: 84, size: 320, elements: !944)
!944 = !{!945, !946, !950, !3807, !3808}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !913, line: 85, baseType: !716, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !943, file: !913, line: 86, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!929, !855, !924, !591}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !943, file: !913, line: 88, baseType: !951, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!929, !855, !954, !591}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !913, line: 168, size: 448, elements: !956)
!956 = !{!957, !958, !959, !960, !3802, !3803}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !955, file: !913, line: 169, baseType: !925, size: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !955, file: !913, line: 170, baseType: !934, size: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !955, file: !913, line: 171, baseType: !132, size: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !955, file: !913, line: 172, baseType: !961, size: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!919, !964, !855, !954, !888, !1136, !934}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !56, line: 916, size: 1856, align: 32, elements: !966)
!966 = !{!967, !985, !3767, !3768, !3769, !3770, !3771, !3772, !3773, !3774, !3775, !3776, !3785, !3786, !3795, !3796, !3797, !3798, !3799, !3800, !3801}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !965, file: !56, line: 920, baseType: !968, size: 128)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !965, file: !56, line: 917, size: 128, elements: !969)
!969 = !{!970, !976}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !968, file: !56, line: 918, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !972, line: 58, size: 64, elements: !973)
!972 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!973 = !{!974}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !971, file: !972, line: 59, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !968, file: !56, line: 919, baseType: !977, size: 128, align: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !587, line: 216, size: 128, align: 64, elements: !978)
!978 = !{!979, !981}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !587, line: 217, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !977, file: !587, line: 218, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !980}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !965, file: !56, line: 921, baseType: !986, size: 128, offset: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !987, line: 8, size: 128, elements: !988)
!987 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!988 = !{!989, !993}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !986, file: !987, line: 9, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !992, line: 18, flags: DIFlagFwdDecl)
!992 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !986, file: !987, line: 10, baseType: !994, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !992, line: 89, size: 1536, elements: !996)
!996 = !{!997, !998, !1008, !1016, !1017, !1035, !3735, !3737, !3749, !3750, !3751, !3752, !3753, !3759, !3760, !3761}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !995, file: !992, line: 91, baseType: !7, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !995, file: !992, line: 92, baseType: !999, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !1000, line: 277, baseType: !1001)
!1000 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !1000, line: 277, size: 32, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !1001, file: !1000, line: 277, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !1000, line: 70, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !1000, line: 65, size: 32, elements: !1006)
!1006 = !{!1007}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1005, file: !1000, line: 66, baseType: !7, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !995, file: !992, line: 93, baseType: !1009, size: 128, offset: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !1010, line: 38, size: 128, elements: !1011)
!1010 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!1011 = !{!1012, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !1010, line: 39, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1009, file: !1010, line: 39, baseType: !1015, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !995, file: !992, line: 94, baseType: !994, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !995, file: !992, line: 95, baseType: !1018, size: 128, offset: 256)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !992, line: 47, size: 128, elements: !1019)
!1019 = !{!1020, !1032}
!1020 = !DIDerivedType(tag: DW_TAG_member, scope: !1018, file: !992, line: 48, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1018, file: !992, line: 48, size: 64, elements: !1022)
!1022 = !{!1023, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, scope: !1021, file: !992, line: 49, baseType: !1024, size: 64)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1021, file: !992, line: 49, size: 64, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1024, file: !992, line: 50, baseType: !130, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1024, file: !992, line: 50, baseType: !130, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !1021, file: !992, line: 52, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !122, line: 23, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !124, line: 31, baseType: !1031)
!1031 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !992, line: 54, baseType: !1033, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !995, file: !992, line: 96, baseType: !1036, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !56, line: 610, size: 4224, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1049, !1056, !1057, !1201, !3446, !3447, !3448, !3454, !3455, !3456, !3457, !3458, !3459, !3460, !3461, !3462, !3463, !3464, !3465, !3466, !3467, !3468, !3469, !3470, !3471, !3472, !3473, !3478, !3479, !3480, !3481, !3482, !3483, !3484, !3711, !3719, !3720, !3721, !3731, !3732, !3733, !3734}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !1037, file: !56, line: 611, baseType: !929, size: 16)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !1037, file: !56, line: 612, baseType: !129, size: 16, offset: 16)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !1037, file: !56, line: 613, baseType: !1042, size: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !1043, line: 23, baseType: !1044)
!1043 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1043, line: 21, size: 32, elements: !1045)
!1045 = !{!1046}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1044, file: !1043, line: 22, baseType: !1047, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !587, line: 32, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !921, line: 49, baseType: !7)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !1037, file: !56, line: 614, baseType: !1050, size: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !1043, line: 28, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1043, line: 26, size: 32, elements: !1052)
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1051, file: !1043, line: 27, baseType: !1054, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !587, line: 33, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !921, line: 50, baseType: !7)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !1037, file: !56, line: 615, baseType: !7, size: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !1037, file: !56, line: 622, baseType: !1058, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !56, line: 1864, size: 1536, align: 512, elements: !1061)
!1061 = !{!1062, !1066, !1077, !1081, !1087, !1091, !1097, !1101, !1105, !1109, !1113, !1114, !1120, !1124, !1148, !1177, !1181, !1187, !1192, !1196, !1197}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !1060, file: !56, line: 1865, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!994, !1036, !994, !7}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !1060, file: !56, line: 1866, baseType: !1067, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!716, !994, !1036, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !1072, line: 10, size: 128, elements: !1073)
!1072 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!1073 = !{!1074, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1071, file: !1072, line: 11, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1071, file: !1072, line: 12, baseType: !132, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !1060, file: !56, line: 1867, baseType: !1078, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!591, !1036, !591}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !1060, file: !56, line: 1868, baseType: !1082, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1085, !1036, !591}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !56, line: 581, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !1060, file: !56, line: 1870, baseType: !1088, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!591, !994, !888, !591}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !1060, file: !56, line: 1872, baseType: !1092, size: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!591, !1036, !994, !929, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !587, line: 30, baseType: !1096)
!1096 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1060, file: !56, line: 1873, baseType: !1098, size: 64, offset: 384)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!591, !994, !1036, !994}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !1060, file: !56, line: 1874, baseType: !1102, size: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!591, !1036, !994}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !1060, file: !56, line: 1875, baseType: !1106, size: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!591, !1036, !994, !716}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !1060, file: !56, line: 1876, baseType: !1110, size: 64, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!591, !1036, !994, !929}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !1060, file: !56, line: 1877, baseType: !1102, size: 64, offset: 640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !1060, file: !56, line: 1878, baseType: !1115, size: 64, offset: 704)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!591, !1036, !994, !929, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !587, line: 16, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !587, line: 13, baseType: !130)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !1060, file: !56, line: 1879, baseType: !1121, size: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!591, !1036, !994, !1036, !994, !7}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !1060, file: !56, line: 1881, baseType: !1125, size: 64, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!591, !994, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !56, line: 219, size: 640, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1138, !1145, !1146, !1147}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !1129, file: !56, line: 220, baseType: !7, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !1129, file: !56, line: 221, baseType: !929, size: 16, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !1129, file: !56, line: 222, baseType: !1042, size: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !1129, file: !56, line: 223, baseType: !1050, size: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !1129, file: !56, line: 224, baseType: !1136, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !587, line: 46, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !921, line: 88, baseType: !608)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !1129, file: !56, line: 225, baseType: !1139, size: 128, offset: 192)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !1140, line: 13, size: 128, elements: !1141)
!1140 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!1141 = !{!1142, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1139, file: !1140, line: 14, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !1140, line: 8, baseType: !607)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1139, file: !1140, line: 15, baseType: !923, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !1129, file: !56, line: 226, baseType: !1139, size: 128, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !1129, file: !56, line: 227, baseType: !1139, size: 128, offset: 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !1129, file: !56, line: 234, baseType: !964, size: 64, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !1060, file: !56, line: 1882, baseType: !1149, size: 64, offset: 896)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!591, !1152, !1154, !130, !7}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !1156, line: 22, size: 1152, elements: !1157)
!1156 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!1157 = !{!1158, !1159, !1160, !1161, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !1155, file: !1156, line: 23, baseType: !130, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1155, file: !1156, line: 24, baseType: !929, size: 16, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !1155, file: !1156, line: 25, baseType: !7, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !1155, file: !1156, line: 26, baseType: !1162, size: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !587, line: 104, baseType: !130)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1155, file: !1156, line: 27, baseType: !1029, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !1155, file: !1156, line: 28, baseType: !1029, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !1155, file: !1156, line: 37, baseType: !1029, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1155, file: !1156, line: 38, baseType: !1118, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !1155, file: !1156, line: 39, baseType: !1118, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1155, file: !1156, line: 40, baseType: !1042, size: 32, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1155, file: !1156, line: 41, baseType: !1050, size: 32, offset: 416)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1155, file: !1156, line: 42, baseType: !1136, size: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !1155, file: !1156, line: 43, baseType: !1139, size: 128, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1155, file: !1156, line: 44, baseType: !1139, size: 128, offset: 640)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1155, file: !1156, line: 45, baseType: !1139, size: 128, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !1155, file: !1156, line: 46, baseType: !1139, size: 128, offset: 896)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1155, file: !1156, line: 47, baseType: !1029, size: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !1155, file: !1156, line: 48, baseType: !1029, size: 64, offset: 1088)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !1060, file: !56, line: 1883, baseType: !1178, size: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!919, !994, !888, !934}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !1060, file: !56, line: 1884, baseType: !1182, size: 64, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!591, !1036, !1185, !1029, !1029}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !56, line: 50, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !1060, file: !56, line: 1886, baseType: !1188, size: 64, offset: 1088)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!591, !1036, !1191, !591}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !1060, file: !56, line: 1887, baseType: !1193, size: 64, offset: 1152)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!591, !1036, !994, !964, !7, !929}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1060, file: !56, line: 1890, baseType: !1110, size: 64, offset: 1216)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !1060, file: !56, line: 1891, baseType: !1198, size: 64, offset: 1280)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!591, !1036, !1085, !591}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !1037, file: !56, line: 623, baseType: !1202, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !56, line: 1416, size: 9472, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1260, !3053, !3135, !3218, !3222, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3234, !3238, !3239, !3242, !3243, !3246, !3247, !3248, !3289, !3316, !3317, !3318, !3319, !3320, !3321, !3324, !3326, !3333, !3334, !3336, !3337, !3338, !3397, !3398, !3413, !3414, !3415, !3416, !3417, !3420, !3421, !3422, !3437, !3438, !3439, !3440, !3441, !3442, !3443, !3444, !3445}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !1203, file: !56, line: 1417, baseType: !625, size: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !1203, file: !56, line: 1418, baseType: !1118, size: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !1203, file: !56, line: 1419, baseType: !125, size: 8, offset: 160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !1203, file: !56, line: 1420, baseType: !680, size: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !1203, file: !56, line: 1421, baseType: !1136, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !1203, file: !56, line: 1422, baseType: !1211, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !56, line: 2228, size: 576, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1223, !1227, !1231, !1235, !1239, !1240, !1250, !1253, !1254, !1255, !1257, !1258, !1259}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1212, file: !56, line: 2229, baseType: !716, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !1212, file: !56, line: 2230, baseType: !591, size: 32, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !1212, file: !56, line: 2238, baseType: !1217, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!591, !1220}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !1222, line: 28, flags: DIFlagFwdDecl)
!1222 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !1212, file: !56, line: 2239, baseType: !1224, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !56, line: 70, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !1212, file: !56, line: 2240, baseType: !1228, size: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!994, !1211, !591, !716, !132}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !1212, file: !56, line: 2242, baseType: !1232, size: 64, offset: 320)
