; ModuleID = '../bcout/drivers/xen/events/events_2l.llvm.bc'
source_filename = "drivers/xen/events/events_2l.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.shared_info = type { [32 x %struct.vcpu_info], [64 x i64], [64 x i64], %struct.pvclock_wall_clock, %struct.arch_shared_info }
%struct.vcpu_info = type { i8, i8, i64, %struct.arch_vcpu_info, %struct.pvclock_vcpu_time_info }
%struct.arch_vcpu_info = type { i64, i64 }
%struct.pvclock_vcpu_time_info = type { i32, i32, i64, i64, i32, i8, i8, [2 x i8] }
%struct.pvclock_wall_clock = type { i32, i32, i32 }
%struct.arch_shared_info = type { i64, i64, i64, i64, i64, i64 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.cpumask = type { [1 x i64] }
%struct.evtchn_ops = type { i32 ()*, i32 ()*, i32 (i32)*, void (i32, i32, i32)*, void (i32)*, void (i32)*, i1 (i32)*, i1 (i32)*, void (i32)*, void (i32)*, void (i32, %struct.evtchn_loop_ctrl*)*, void ()*, i32 (i32)*, i32 (i32)* }
%struct.evtchn_loop_ctrl = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cpu_evtchn_mask", scope: !2, file: !3, line: 43, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !120, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/xen/events/events_2l.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irqreturn", file: !6, line: 11, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/irqreturn.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "IRQ_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "IRQ_HANDLED", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "IRQ_WAKE_THREAD", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 10, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xen_domain_type", file: !18, line: 5, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/xen/xen.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "XEN_NATIVE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "XEN_PV_DOMAIN", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "XEN_HVM_DOMAIN", value: 2, isUnsigned: true)
!23 = !{!24, !31, !32, !76, !77, !86, !28, !87, !88, !113, !116, !33, !119, !7, !26, !58}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 4096, elements: !29)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "xen_ulong_t", file: !27, line: 81, baseType: !28)
!27 = !DIFile(filename: "./arch/x86/include/asm/xen/interface.h", directory: "/home/lizy2001/genbc/linux")
!28 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!29 = !{!30}
!30 = !DISubrange(count: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vcpu_info", file: !35, line: 522, size: 512, elements: !36)
!35 = !DIFile(filename: "./include/xen/interface/xen.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !45, !46, !47, !53}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "evtchn_upcall_pending", scope: !34, file: !35, line: 548, baseType: !38, size: 8)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !39, line: 102, baseType: !40)
!39 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !41, line: 17, baseType: !42)
!41 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !43, line: 21, baseType: !44)
!43 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "evtchn_upcall_mask", scope: !34, file: !35, line: 549, baseType: !38, size: 8, offset: 8)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "evtchn_pending_sel", scope: !34, file: !35, line: 550, baseType: !26, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !34, file: !35, line: 551, baseType: !48, size: 128, offset: 128)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arch_vcpu_info", file: !49, line: 136, size: 128, elements: !50)
!49 = !DIFile(filename: "./arch/x86/include/asm/xen/interface_64.h", directory: "/home/lizy2001/genbc/linux")
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cr2", scope: !48, file: !49, line: 137, baseType: !28, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !48, file: !49, line: 138, baseType: !28, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !34, file: !35, line: 552, baseType: !54, size: 256, offset: 256)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pvclock_vcpu_time_info", file: !55, line: 26, size: 256, elements: !56)
!55 = !DIFile(filename: "./arch/x86/include/asm/pvclock-abi.h", directory: "/home/lizy2001/genbc/linux")
!56 = !{!57, !60, !61, !65, !66, !67, !71, !72}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !54, file: !55, line: 27, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !41, line: 21, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !43, line: 27, baseType: !7)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pad0", scope: !54, file: !55, line: 28, baseType: !58, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_timestamp", scope: !54, file: !55, line: 29, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !41, line: 23, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !43, line: 31, baseType: !64)
!64 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "system_time", scope: !54, file: !55, line: 30, baseType: !62, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_to_system_mul", scope: !54, file: !55, line: 31, baseType: !58, size: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_shift", scope: !54, file: !55, line: 32, baseType: !68, size: 8, offset: 224)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !41, line: 16, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !43, line: 20, baseType: !70)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !55, line: 33, baseType: !40, size: 8, offset: 232)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !54, file: !55, line: 34, baseType: !73, size: 16, offset: 240)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 16, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 2)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !80, line: 17, size: 64, elements: !81)
!80 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !79, file: !80, line: 17, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_regs", file: !90, line: 56, size: 1344, elements: !91)
!90 = !DIFile(filename: "./arch/x86/include/asm/ptrace.h", directory: "/home/lizy2001/genbc/linux")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r15", scope: !89, file: !90, line: 61, baseType: !28, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "r14", scope: !89, file: !90, line: 62, baseType: !28, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "r13", scope: !89, file: !90, line: 63, baseType: !28, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !89, file: !90, line: 64, baseType: !28, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !89, file: !90, line: 65, baseType: !28, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !89, file: !90, line: 66, baseType: !28, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "r11", scope: !89, file: !90, line: 68, baseType: !28, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "r10", scope: !89, file: !90, line: 69, baseType: !28, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "r9", scope: !89, file: !90, line: 70, baseType: !28, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "r8", scope: !89, file: !90, line: 71, baseType: !28, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !89, file: !90, line: 72, baseType: !28, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !89, file: !90, line: 73, baseType: !28, size: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !89, file: !90, line: 74, baseType: !28, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !89, file: !90, line: 75, baseType: !28, size: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !89, file: !90, line: 76, baseType: !28, size: 64, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "orig_ax", scope: !89, file: !90, line: 81, baseType: !28, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !89, file: !90, line: 83, baseType: !28, size: 64, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !89, file: !90, line: 84, baseType: !28, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !90, line: 85, baseType: !28, size: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !89, file: !90, line: 86, baseType: !28, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !89, file: !90, line: 87, baseType: !28, size: 64, offset: 1280)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!118 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!120 = !{!121, !0, !142, !193, !195}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "debug_lock", scope: !123, file: !3, line: 272, type: !128, isLocal: true, isDefinition: true)
!123 = distinct !DISubprogram(name: "xen_debug_interrupt", scope: !3, file: !3, line: 265, type: !124, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !127)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !76, !31}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "irqreturn_t", file: !6, line: 17, baseType: !5)
!127 = !{}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !129, line: 83, baseType: !130)
!129 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !129, line: 71, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !129, line: 72, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !129, line: 72, elements: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !133, file: !129, line: 73, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !129, line: 20, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !136, file: !129, line: 21, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !140, line: 25, baseType: !141)
!140 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 25, elements: !127)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "evtchn_ops_2l", scope: !2, file: !3, line: 358, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_ops", file: !146, line: 12, size: 896, elements: !147)
!146 = !DIFile(filename: "drivers/xen/events/events_internal.h", directory: "/home/lizy2001/genbc/linux")
!147 = !{!148, !152, !153, !160, !164, !168, !169, !175, !176, !177, !178, !184, !188, !192}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "max_channels", scope: !145, file: !146, line: 13, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!7}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nr_channels", scope: !145, file: !146, line: 14, baseType: !149, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !145, file: !146, line: 16, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!76, !157}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "evtchn_port_t", file: !158, line: 15, baseType: !159)
!158 = !DIFile(filename: "./include/xen/interface/event_channel.h", directory: "/home/lizy2001/genbc/linux")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !39, line: 104, baseType: !58)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bind_to_cpu", scope: !145, file: !146, line: 17, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !157, !7, !7}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "clear_pending", scope: !145, file: !146, line: 20, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !157}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "set_pending", scope: !145, file: !146, line: 21, baseType: !165, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "is_pending", scope: !145, file: !146, line: 22, baseType: !170, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !157}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !39, line: 30, baseType: !174)
!174 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "test_and_set_mask", scope: !145, file: !146, line: 23, baseType: !170, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !145, file: !146, line: 24, baseType: !165, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "unmask", scope: !145, file: !146, line: 25, baseType: !165, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "handle_events", scope: !145, file: !146, line: 27, baseType: !179, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !7, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_loop_ctrl", file: !146, line: 10, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !145, file: !146, line: 28, baseType: !185, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_init", scope: !145, file: !146, line: 30, baseType: !189, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!76, !7}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_deinit", scope: !145, file: !146, line: 31, baseType: !189, size: 64, offset: 832)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "current_word_idx", scope: !2, file: !3, line: 140, type: !7, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "current_bit_idx", scope: !2, file: !3, line: 141, type: !7, isLocal: true, isDefinition: true)
!197 = !{!"rsp"}
!198 = !{i32 7, !"Dwarf Version", i32 4}
!199 = !{i32 2, !"Debug Info Version", i32 3}
!200 = !{i32 1, !"wchar_size", i32 2}
!201 = !{i32 1, !"Code Model", i32 2}
!202 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!203 = !DILocalVariable(name: "lock", arg: 1, scope: !204, file: !205, line: 407, type: !208)
!204 = distinct !DISubprogram(name: "spin_unlock_irqrestore", scope: !205, file: !205, line: 407, type: !206, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !127)
!205 = !DIFile(filename: "./include/linux/spinlock.h", directory: "/home/lizy2001/genbc/linux")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208, !28}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!209 = !DILocation(line: 407, column: 64, scope: !204, inlinedAt: !210)
!210 = distinct !DILocation(line: 344, column: 2, scope: !123)
!211 = !DILocalVariable(name: "flags", arg: 2, scope: !204, file: !205, line: 407, type: !28)
!212 = !DILocation(line: 407, column: 84, scope: !204, inlinedAt: !210)
!213 = !DILocalVariable(name: "lock", arg: 1, scope: !214, file: !205, line: 327, type: !208)
!214 = distinct !DISubprogram(name: "spinlock_check", scope: !205, file: !205, line: 327, type: !215, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !127)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !208}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !129, line: 29, baseType: !136)
!219 = !DILocation(line: 327, column: 67, scope: !214, inlinedAt: !220)
!220 = distinct !DILocation(line: 275, column: 2, scope: !221)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 275, column: 2)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 275, column: 2)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 275, column: 2)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 275, column: 2)
!225 = distinct !DILexicalBlock(scope: !123, file: !3, line: 275, column: 2)
!226 = !DILocalVariable(name: "irq", arg: 1, scope: !123, file: !3, line: 265, type: !76)
!227 = !DILocation(line: 265, column: 37, scope: !123)
!228 = !DILocalVariable(name: "dev_id", arg: 2, scope: !123, file: !3, line: 265, type: !31)
!229 = !DILocation(line: 265, column: 48, scope: !123)
!230 = !DILocalVariable(name: "sh", scope: !123, file: !3, line: 267, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "shared_info", file: !35, line: 559, size: 25088, elements: !233)
!233 = !{!234, !238, !239, !240, !246}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vcpu_info", scope: !232, file: !35, line: 560, baseType: !235, size: 16384)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 16384, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "evtchn_pending", scope: !232, file: !35, line: 593, baseType: !25, size: 4096, offset: 16384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "evtchn_mask", scope: !232, file: !35, line: 594, baseType: !25, size: 4096, offset: 20480)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "wc", scope: !232, file: !35, line: 600, baseType: !241, size: 96, offset: 24576)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pvclock_wall_clock", file: !55, line: 37, size: 96, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !241, file: !55, line: 38, baseType: !58, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !241, file: !55, line: 39, baseType: !58, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nsec", scope: !241, file: !55, line: 40, baseType: !58, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !232, file: !35, line: 602, baseType: !247, size: 384, offset: 24704)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arch_shared_info", file: !27, line: 149, size: 384, elements: !248)
!248 = !{!249, !250, !252, !253, !254, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "max_pfn", scope: !247, file: !27, line: 154, baseType: !28, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pfn_to_mfn_frame_list_list", scope: !247, file: !27, line: 162, baseType: !251, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "xen_pfn_t", file: !27, line: 79, baseType: !28)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nmi_reason", scope: !247, file: !27, line: 163, baseType: !28, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "p2m_cr3", scope: !247, file: !27, line: 182, baseType: !28, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "p2m_vaddr", scope: !247, file: !27, line: 183, baseType: !28, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p2m_generation", scope: !247, file: !27, line: 184, baseType: !28, size: 64, offset: 320)
!256 = !DILocation(line: 267, column: 22, scope: !123)
!257 = !DILocation(line: 267, column: 27, scope: !123)
!258 = !DILocalVariable(name: "cpu", scope: !123, file: !3, line: 268, type: !76)
!259 = !DILocation(line: 268, column: 6, scope: !123)
!260 = !DILocalVariable(name: "cpu_evtchn", scope: !123, file: !3, line: 269, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!262 = !DILocation(line: 269, column: 15, scope: !123)
!263 = !DILocation(line: 269, column: 28, scope: !264)
!264 = distinct !DILexicalBlock(scope: !123, file: !3, line: 269, column: 28)
!265 = !DILocation(line: 269, column: 28, scope: !266)
!266 = distinct !DILexicalBlock(scope: !264, file: !3, line: 269, column: 28)
!267 = !DILocalVariable(name: "__vpp_verify", scope: !268, file: !3, line: 269, type: !269)
!268 = distinct !DILexicalBlock(scope: !266, file: !3, line: 269, column: 28)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!271 = !DILocation(line: 269, column: 28, scope: !268)
!272 = !DILocation(line: 269, column: 28, scope: !123)
!273 = !DILocalVariable(name: "i", scope: !123, file: !3, line: 270, type: !76)
!274 = !DILocation(line: 270, column: 6, scope: !123)
!275 = !DILocalVariable(name: "flags", scope: !123, file: !3, line: 271, type: !28)
!276 = !DILocation(line: 271, column: 16, scope: !123)
!277 = !DILocalVariable(name: "v", scope: !123, file: !3, line: 273, type: !33)
!278 = !DILocation(line: 273, column: 20, scope: !123)
!279 = !DILocation(line: 275, column: 2, scope: !123)
!280 = !DILocation(line: 275, column: 2, scope: !225)
!281 = !DILocalVariable(name: "__dummy", scope: !282, file: !3, line: 275, type: !28)
!282 = distinct !DILexicalBlock(scope: !224, file: !3, line: 275, column: 2)
!283 = !DILocation(line: 275, column: 2, scope: !282)
!284 = !DILocalVariable(name: "__dummy2", scope: !282, file: !3, line: 275, type: !28)
!285 = !DILocation(line: 275, column: 2, scope: !224)
!286 = !DILocation(line: 275, column: 2, scope: !223)
!287 = !DILocation(line: 275, column: 2, scope: !288)
!288 = distinct !DILexicalBlock(scope: !223, file: !3, line: 275, column: 2)
!289 = !DILocalVariable(name: "__dummy", scope: !290, file: !3, line: 275, type: !28)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 275, column: 2)
!291 = distinct !DILexicalBlock(scope: !288, file: !3, line: 275, column: 2)
!292 = !DILocation(line: 275, column: 2, scope: !290)
!293 = !DILocalVariable(name: "__dummy2", scope: !290, file: !3, line: 275, type: !28)
!294 = !DILocation(line: 275, column: 2, scope: !291)
!295 = !DILocation(line: 275, column: 2, scope: !222)
!296 = !{i32 -2141672960}
!297 = !DILocation(line: 329, column: 10, scope: !214, inlinedAt: !220)
!298 = !DILocation(line: 329, column: 16, scope: !214, inlinedAt: !220)
!299 = !DILocation(line: 275, column: 2, scope: !221)
!300 = !DILocation(line: 277, column: 26, scope: !123)
!301 = !DILocation(line: 277, column: 2, scope: !123)
!302 = !DILocation(line: 279, column: 2, scope: !303)
!303 = distinct !DILexicalBlock(scope: !123, file: !3, line: 279, column: 2)
!304 = !DILocation(line: 279, column: 2, scope: !305)
!305 = distinct !DILexicalBlock(scope: !303, file: !3, line: 279, column: 2)
!306 = !DILocalVariable(name: "pending", scope: !307, file: !3, line: 280, type: !76)
!307 = distinct !DILexicalBlock(scope: !305, file: !3, line: 279, column: 25)
!308 = !DILocation(line: 280, column: 7, scope: !307)
!309 = !DILocation(line: 281, column: 7, scope: !310)
!310 = distinct !DILexicalBlock(scope: !307, file: !3, line: 281, column: 7)
!311 = !DILocation(line: 281, column: 7, scope: !312)
!312 = distinct !DILexicalBlock(scope: !310, file: !3, line: 281, column: 7)
!313 = !DILocalVariable(name: "__vpp_verify", scope: !314, file: !3, line: 281, type: !269)
