; ModuleID = '../bcout/drivers/xen/events/events_fifo.llvm.bc'
source_filename = "drivers/xen/events/events_fifo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.evtchn_ops = type { i32 ()*, i32 ()*, i32 (i32)*, void (i32, i32, i32)*, void (i32)*, void (i32)*, i1 (i32)*, i1 (i32)*, void (i32)*, void (i32)*, void (i32, %struct.evtchn_loop_ctrl*)*, void ()*, i32 (i32)*, i32 (i32)* }
%struct.evtchn_loop_ctrl = type opaque
%struct.evtchn_fifo_control_block = type { i32, i32, [16 x i32] }
%struct.evtchn_fifo_queue = type { [16 x i32] }
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "evtchn_ops_fifo", scope: !2, file: !3, line: 418, type: !71, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !58, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/xen/events/events_fifo.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !{!12, !13, !15, !32, !33, !38, !39, !40, !41, !44, !46, !49}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !14, line: 148, baseType: !7)
!14 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_fifo_control_block", file: !18, line: 273, size: 576, elements: !19)
!18 = !DIFile(filename: "./include/xen/interface/event_channel.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !26, !27}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !17, file: !18, line: 274, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !14, line: 104, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !25, line: 27, baseType: !7)
!25 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_rsvd", scope: !17, file: !18, line: 275, baseType: !21, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !17, file: !18, line: 276, baseType: !28, size: 512, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_word_t", file: !18, line: 261, baseType: !21)
!30 = !{!31}
!31 = !DISubrange(count: 16)
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_fifo_queue", file: !3, line: 60, size: 512, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !34, file: !3, line: 61, baseType: !37, size: 512)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !30)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !22)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !52, line: 17, size: 64, elements: !53)
!52 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !51, file: !52, line: 17, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !{!59, !61, !0, !63, !65}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "cpu_queue", scope: !2, file: !3, line: 65, type: !34, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "cpu_control_block", scope: !2, file: !3, line: 64, type: !16, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "event_array_pages", scope: !2, file: !3, line: 67, type: !7, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "event_array", scope: !2, file: !3, line: 66, type: !67, isLocal: true, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8192, elements: !69)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!69 = !{!70}
!70 = !DISubrange(count: 128)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_ops", file: !73, line: 12, size: 896, elements: !74)
!73 = !DIFile(filename: "drivers/xen/events/events_internal.h", directory: "/home/lizy2001/genbc/linux")
!74 = !{!75, !79, !80, !85, !89, !93, !94, !100, !101, !102, !103, !109, !113, !117}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "max_channels", scope: !72, file: !73, line: 13, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!7}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nr_channels", scope: !72, file: !73, line: 14, baseType: !76, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !72, file: !73, line: 16, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!39, !84}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "evtchn_port_t", file: !18, line: 15, baseType: !21)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bind_to_cpu", scope: !72, file: !73, line: 17, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !84, !7, !7}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "clear_pending", scope: !72, file: !73, line: 20, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !84}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "set_pending", scope: !72, file: !73, line: 21, baseType: !90, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "is_pending", scope: !72, file: !73, line: 22, baseType: !95, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !84}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !14, line: 30, baseType: !99)
!99 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "test_and_set_mask", scope: !72, file: !73, line: 23, baseType: !95, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !72, file: !73, line: 24, baseType: !90, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "unmask", scope: !72, file: !73, line: 25, baseType: !90, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "handle_events", scope: !72, file: !73, line: 27, baseType: !104, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !7, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_loop_ctrl", file: !73, line: 10, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !72, file: !73, line: 28, baseType: !110, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_init", scope: !72, file: !73, line: 30, baseType: !114, size: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!39, !7}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_deinit", scope: !72, file: !73, line: 31, baseType: !114, size: 64, offset: 832)
!118 = !{!"rsp"}
!119 = !{i32 7, !"Dwarf Version", i32 4}
!120 = !{i32 2, !"Debug Info Version", i32 3}
!121 = !{i32 1, !"wchar_size", i32 2}
!122 = !{i32 1, !"Code Model", i32 2}
!123 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!124 = distinct !DISubprogram(name: "xen_evtchn_fifo_init", scope: !3, file: !3, line: 435, type: !125, scopeLine: 436, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!39}
!127 = !{}
!128 = !DILocalVariable(name: "cpu", scope: !124, file: !3, line: 437, type: !39)
!129 = !DILocation(line: 437, column: 6, scope: !124)
!130 = !DILocalVariable(name: "ret", scope: !124, file: !3, line: 438, type: !39)
!131 = !DILocation(line: 438, column: 6, scope: !124)
!132 = !DILocation(line: 440, column: 40, scope: !124)
!133 = !DILocation(line: 440, column: 8, scope: !124)
!134 = !DILocation(line: 440, column: 6, scope: !124)
!135 = !DILocation(line: 441, column: 6, scope: !136)
!136 = distinct !DILexicalBlock(scope: !124, file: !3, line: 441, column: 6)
!137 = !DILocation(line: 441, column: 10, scope: !136)
!138 = !DILocation(line: 441, column: 6, scope: !124)
!139 = !DILocation(line: 442, column: 10, scope: !136)
!140 = !DILocation(line: 442, column: 3, scope: !136)
!141 = !DILocation(line: 444, column: 2, scope: !124)
!142 = !DILocation(line: 446, column: 13, scope: !124)
!143 = !DILocation(line: 448, column: 9, scope: !124)
!144 = !DILocation(line: 448, column: 2, scope: !124)
!145 = !DILocation(line: 449, column: 1, scope: !124)
!146 = distinct !DISubprogram(name: "evtchn_fifo_alloc_control_block", scope: !3, file: !3, line: 383, type: !115, scopeLine: 384, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !127)
!147 = !DILocalVariable(name: "cpu", arg: 1, scope: !146, file: !3, line: 383, type: !7)
!148 = !DILocation(line: 383, column: 53, scope: !146)
!149 = !DILocalVariable(name: "control_block", scope: !146, file: !3, line: 385, type: !12)
!150 = !DILocation(line: 385, column: 8, scope: !146)
!151 = !DILocalVariable(name: "ret", scope: !146, file: !3, line: 386, type: !39)
!152 = !DILocation(line: 386, column: 6, scope: !146)
!153 = !DILocation(line: 388, column: 26, scope: !146)
!154 = !DILocation(line: 388, column: 18, scope: !146)
!155 = !DILocation(line: 388, column: 16, scope: !146)
!156 = !DILocation(line: 389, column: 6, scope: !157)
!157 = distinct !DILexicalBlock(scope: !146, file: !3, line: 389, column: 6)
!158 = !DILocation(line: 389, column: 20, scope: !157)
!159 = !DILocation(line: 389, column: 6, scope: !146)
!160 = !DILocation(line: 390, column: 3, scope: !157)
!161 = !DILocation(line: 392, column: 27, scope: !146)
!162 = !DILocation(line: 392, column: 32, scope: !146)
!163 = !DILocation(line: 392, column: 8, scope: !146)
!164 = !DILocation(line: 392, column: 6, scope: !146)
!165 = !DILocation(line: 393, column: 6, scope: !166)
!166 = distinct !DILexicalBlock(scope: !146, file: !3, line: 393, column: 6)
!167 = !DILocation(line: 393, column: 10, scope: !166)
!168 = !DILocation(line: 393, column: 6, scope: !146)
!169 = !DILocation(line: 394, column: 3, scope: !166)
!170 = !DILocation(line: 396, column: 36, scope: !146)
!171 = !DILocation(line: 396, column: 2, scope: !172)
!172 = distinct !DILexicalBlock(scope: !146, file: !3, line: 396, column: 2)
!173 = !DILocation(line: 396, column: 2, scope: !174)
!174 = distinct !DILexicalBlock(scope: !172, file: !3, line: 396, column: 2)
!175 = !DILocalVariable(name: "__vpp_verify", scope: !176, file: !3, line: 396, type: !177)
!176 = distinct !DILexicalBlock(scope: !174, file: !3, line: 396, column: 2)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!179 = !DILocation(line: 396, column: 2, scope: !176)
!180 = !DILocation(line: 396, column: 34, scope: !146)
!181 = !DILocation(line: 398, column: 2, scope: !146)
!182 = !DILabel(scope: !146, name: "error", file: !3, line: 400)
!183 = !DILocation(line: 400, column: 3, scope: !146)
!184 = !DILocation(line: 401, column: 2, scope: !146)
!185 = !DILocation(line: 402, column: 9, scope: !146)
!186 = !DILocation(line: 402, column: 2, scope: !146)
!187 = !DILocation(line: 403, column: 1, scope: !146)
!188 = distinct !DISubprogram(name: "init_control_block", scope: !3, file: !3, line: 102, type: !189, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !127)
!189 = !DISubroutineType(types: !190)
!190 = !{!39, !39, !16}
!191 = !DILocalVariable(name: "cpu", arg: 1, scope: !188, file: !3, line: 102, type: !39)
!192 = !DILocation(line: 102, column: 35, scope: !188)
!193 = !DILocalVariable(name: "control_block", arg: 2, scope: !188, file: !3, line: 103, type: !16)
!194 = !DILocation(line: 103, column: 65, scope: !188)
!195 = !DILocalVariable(name: "q", scope: !188, file: !3, line: 105, type: !33)
!196 = !DILocation(line: 105, column: 28, scope: !188)
!197 = !DILocation(line: 105, column: 33, scope: !198)
!198 = distinct !DILexicalBlock(scope: !188, file: !3, line: 105, column: 33)
!199 = !DILocation(line: 105, column: 33, scope: !200)
!200 = distinct !DILexicalBlock(scope: !198, file: !3, line: 105, column: 33)
!201 = !DILocalVariable(name: "__vpp_verify", scope: !202, file: !3, line: 105, type: !177)
!202 = distinct !DILexicalBlock(scope: !200, file: !3, line: 105, column: 33)
!203 = !DILocation(line: 105, column: 33, scope: !202)
!204 = !DILocalVariable(name: "init_control", scope: !188, file: !3, line: 106, type: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evtchn_init_control", file: !18, line: 198, size: 192, elements: !206)
!206 = !{!207, !212, !213, !214, !219}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "control_gfn", scope: !205, file: !18, line: 200, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !14, line: 107, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !23, line: 23, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !25, line: 31, baseType: !211)
!211 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !205, file: !18, line: 201, baseType: !21, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vcpu", scope: !205, file: !18, line: 202, baseType: !21, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "link_bits", scope: !205, file: !18, line: 204, baseType: !215, size: 8, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !14, line: 102, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !23, line: 17, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !25, line: 21, baseType: !218)
!218 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !205, file: !18, line: 205, baseType: !220, size: 56, offset: 136)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 56, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 7)
!223 = !DILocation(line: 106, column: 29, scope: !188)
!224 = !DILocalVariable(name: "i", scope: !188, file: !3, line: 107, type: !7)
!225 = !DILocation(line: 107, column: 15, scope: !188)
!226 = !DILocation(line: 110, column: 13, scope: !188)
!227 = !DILocation(line: 110, column: 2, scope: !188)
!228 = !DILocation(line: 111, column: 9, scope: !229)
!229 = distinct !DILexicalBlock(scope: !188, file: !3, line: 111, column: 2)
!230 = !DILocation(line: 111, column: 7, scope: !229)
!231 = !DILocation(line: 111, column: 14, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !3, line: 111, column: 2)
!233 = !DILocation(line: 111, column: 16, scope: !232)
!234 = !DILocation(line: 111, column: 2, scope: !229)
!235 = !DILocation(line: 112, column: 3, scope: !232)
!236 = !DILocation(line: 112, column: 6, scope: !232)
!237 = !DILocation(line: 112, column: 11, scope: !232)
!238 = !DILocation(line: 112, column: 14, scope: !232)
!239 = !DILocation(line: 111, column: 43, scope: !232)
!240 = !DILocation(line: 111, column: 2, scope: !232)
!241 = distinct !{!241, !234, !242}
!242 = !DILocation(line: 112, column: 16, scope: !229)
!243 = !DILocation(line: 114, column: 29, scope: !188)
!244 = !DILocation(line: 114, column: 15, scope: !188)
!245 = !DILocation(line: 114, column: 27, scope: !188)
!246 = !DILocation(line: 115, column: 15, scope: !188)
!247 = !DILocation(line: 115, column: 27, scope: !188)
!248 = !DILocation(line: 116, column: 41, scope: !188)
!249 = !DILocation(line: 116, column: 29, scope: !188)
!250 = !DILocation(line: 116, column: 15, scope: !188)
!251 = !DILocation(line: 116, column: 27, scope: !188)
!252 = !DILocation(line: 118, column: 60, scope: !188)
!253 = !DILocation(line: 118, column: 9, scope: !188)
!254 = !DILocation(line: 118, column: 2, scope: !188)
!255 = distinct !DISubprogram(name: "clear_page", scope: !256, file: !256, line: 47, type: !257, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !127)
!256 = !DIFile(filename: "./arch/x86/include/asm/page_64.h", directory: "/home/lizy2001/genbc/linux")
!257 = !DISubroutineType(types: !258)
!258 = !{null, !12}
!259 = !DILocalVariable(name: "page", arg: 1, scope: !255, file: !256, line: 47, type: !12)
!260 = !DILocation(line: 47, column: 37, scope: !255)
!261 = !DILocation(line: 49, column: 2, scope: !255)
!262 = !{i32 -2146306797, i32 -2146306764, i32 -2146306758, i32 -2146306742, i32 -2146306723, i32 -2146306692, i32 -2146305733, i32 -2146307196, i32 -2146305727, i32 -2146305679, i32 -2146305615, i32 -2146305553, i32 -2146305496, i32 -2146305440, i32 -2146305206, i32 -2146305158, i32 -2146305094, i32 -2146305032, i32 -2146304975, i32 -2146304919, i32 -2146307080, i32 -2146307055, i32 -2146304685, i32 -2146304556, i32 -2146304624, i32 -2146304542, i32 -2146304528, i32 -2146304399, i32 -2146304467, i32 -2146304385, i32 -2146306903}
!263 = !DILocation(line: 55, column: 1, scope: !255)
!264 = distinct !DISubprogram(name: "pfn_to_gfn", scope: !265, file: !265, line: 251, type: !266, scopeLine: 252, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !127)
!265 = !DIFile(filename: "./arch/x86/include/asm/xen/page.h", directory: "/home/lizy2001/genbc/linux")
!266 = !DISubroutineType(types: !267)
!267 = !{!32, !32}
!268 = !DILocalVariable(name: "pfn", arg: 1, scope: !264, file: !265, line: 251, type: !32)
!269 = !DILocation(line: 251, column: 54, scope: !264)
!270 = !DILocation(line: 253, column: 6, scope: !271)
!271 = distinct !DILexicalBlock(scope: !264, file: !265, line: 253, column: 6)
!272 = !DILocation(line: 253, column: 6, scope: !264)
!273 = !DILocation(line: 254, column: 10, scope: !271)
