; ModuleID = '../bcout/drivers/mmc/core/sdio.llvm.bc'
source_filename = "drivers/mmc/core/sdio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.mmc_host = type { %struct.device*, %struct.device, i32, %struct.mmc_host_ops*, %struct.mmc_pwrseq*, i32, i32, i32, i32, i32, i32, i32, %struct.notifier_block, %struct.wakeup_source*, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, i32, i32, i32, i32, %struct.spinlock, %struct.mmc_ios, i16, i32, i32, i32, i32, i32, %struct.timer_list, i8, %struct.mmc_card*, %struct.wait_queue_head, %struct.mmc_ctx*, i32, %struct.mmc_ctx, %struct.delayed_work, i32, %struct.mmc_slot, %struct.mmc_bus_ops*, i32, i32, %struct.task_struct*, %struct.delayed_work, i8, %struct.atomic_t, i32, %struct.led_trigger*, %struct.mmc_supply, %struct.dentry*, %struct.mmc_request*, i32, i32, i32, i32, %struct.mmc_cqe_ops*, i8*, i32, i8, i8, i8, [41 x i8], [0 x i64] }

!56 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!57 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!59 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!60 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!61 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!62 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!63 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!64 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!65 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!66 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!67 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!68 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!69 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!70 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!71 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!72 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!73 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!74 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!75 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!76 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!77 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!78 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!79 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!80 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!81 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!82 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!83 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!84 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!85 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!86 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!87 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!88 = !{!89, !93, !94, !100, !101, !227, !57, !296, !219, !406}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !97, line: 21, baseType: !98)
!97 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !99, line: 27, baseType: !7)
!99 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mmc_card", file: !103, line: 244, size: 12672, elements: !104)
!103 = !DIFile(filename: "./include/linux/mmc/card.h", directory: "/home/lizy2001/genbc/linux")
!104 = !{!105, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2253, !2255, !2267, !2287, !2368, !2377, !2383, !2391, !2392, !2393, !2404, !2411, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2470, !2471, !2472}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !102, file: !103, line: 245, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mmc_host", file: !108, line: 275, size: 10752, elements: !109)
!108 = !DIFile(filename: "./include/linux/mmc/host.h", directory: "/home/lizy2001/genbc/linux")
!109 = !{!110, !1953, !1954, !1955, !2082, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2148, !2149, !2150, !2159, !2160, !2166, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2193, !2200, !2203, !2204, !2205, !2206, !2207, !2208, !2229, !2230, !2231, !2232, !2233, !2234}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !107, file: !108, line: 276, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !113)
!113 = !{!114, !1586, !1587, !1590, !1591, !1642, !1739, !1740, !1741, !1742, !1743, !1752, !1857, !1870, !1873, !1874, !1878, !1880, !1881, !1882, !1886, !1892, !1893, !1896, !1900, !1903, !1906, !1907, !1908, !1909, !1941, !1942, !1943, !1946, !1949, !1950, !1951, !1952}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !112, file: !30, line: 462, baseType: !115, size: 512)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !116, line: 64, size: 512, elements: !117)
!116 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!117 = !{!118, !122, !129, !131, !191, !1422, !1576, !1581, !1582, !1583, !1584, !1585}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !116, line: 65, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !115, file: !116, line: 66, baseType: !123, size: 128, offset: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !124, line: 178, size: 128, elements: !125)
!124 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !124, line: 179, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !124, line: 179, baseType: !127, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !115, file: !116, line: 67, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !115, file: !116, line: 68, baseType: !132, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !116, line: 192, size: 704, elements: !134)
!134 = !{!135, !136, !152, !153}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !133, file: !116, line: 193, baseType: !123, size: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !133, file: !116, line: 194, baseType: !137, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !138, line: 83, baseType: !139)
!138 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !138, line: 71, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !139, file: !138, line: 72, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !139, file: !138, line: 72, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !142, file: !138, line: 73, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !138, line: 20, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !145, file: !138, line: 21, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !149, line: 25, baseType: !150)
!149 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 25, elements: !151)
!151 = !{}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !133, file: !116, line: 195, baseType: !115, size: 512, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !133, file: !116, line: 196, baseType: !154, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !116, line: 156, size: 192, elements: !157)
!157 = !{!158, !163, !168}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !156, file: !116, line: 157, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!92, !132, !130}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !116, line: 158, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!119, !132, !130}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !156, file: !116, line: 159, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!92, !132, !130, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !116, line: 148, size: 20736, elements: !175)
!175 = !{!176, !181, !185, !186, !190}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !174, file: !116, line: 149, baseType: !177, size: 192)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 192, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !174, file: !116, line: 150, baseType: !182, size: 4096, offset: 192)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 4096, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !174, file: !116, line: 151, baseType: !92, size: 32, offset: 4288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !174, file: !116, line: 152, baseType: !187, size: 16384, offset: 4320)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 16384, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !174, file: !116, line: 153, baseType: !92, size: 32, offset: 20704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !115, file: !116, line: 69, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !116, line: 138, size: 448, elements: !194)
!194 = !{!195, !199, !228, !230, !1368, !1401, !1405}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !193, file: !116, line: 139, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !130}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !193, file: !116, line: 140, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !203, line: 230, size: 128, elements: !204)
!203 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!204 = !{!205, !220}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !202, file: !203, line: 231, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !130, !213, !178}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !124, line: 60, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !211, line: 73, baseType: !212)
!211 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !211, line: 15, baseType: !57)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !203, line: 30, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !203, line: 31, baseType: !119, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !214, file: !203, line: 32, baseType: !218, size: 16, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !124, line: 19, baseType: !219)
!219 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !202, file: !203, line: 232, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!209, !130, !213, !119, !224}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !124, line: 55, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !211, line: 72, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !211, line: 16, baseType: !227)
!227 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !193, file: !116, line: 141, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !193, file: !116, line: 142, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !203, line: 84, size: 320, elements: !235)
!235 = !{!236, !237, !241, !1365, !1366}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !203, line: 85, baseType: !119, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !234, file: !203, line: 86, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!218, !130, !213, !92}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !234, file: !203, line: 88, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!218, !130, !245, !92}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !203, line: 168, size: 448, elements: !247)
!247 = !{!248, !249, !250, !251, !261, !262}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !246, file: !203, line: 169, baseType: !214, size: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !203, line: 170, baseType: !224, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !246, file: !203, line: 171, baseType: !100, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !246, file: !203, line: 172, baseType: !252, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!209, !255, !130, !245, !178, !258, !224}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !257, line: 526, flags: DIFlagFwdDecl)
!257 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !124, line: 46, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !211, line: 88, baseType: !260)
!260 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !246, file: !203, line: 174, baseType: !252, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !246, file: !203, line: 176, baseType: !263, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!92, !255, !130, !245, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !268, line: 305, size: 1472, elements: !269)
!268 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!269 = !{!270, !271, !272, !273, !274, !282, !283, !1339, !1345, !1346, !1351, !1352, !1355, !1359, !1360, !1361, !1362, !1363}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !267, file: !268, line: 308, baseType: !227, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !267, file: !268, line: 309, baseType: !227, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !267, file: !268, line: 313, baseType: !266, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !267, file: !268, line: 313, baseType: !266, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !267, file: !268, line: 315, baseType: !275, size: 192, align: 64, offset: 256)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !276, line: 24, size: 192, align: 64, elements: !277)
!276 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!277 = !{!278, !279, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !275, file: !276, line: 25, baseType: !227, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !275, file: !276, line: 26, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !275, file: !276, line: 27, baseType: !280, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !267, file: !268, line: 323, baseType: !227, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !267, file: !268, line: 327, baseType: !284, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !268, line: 388, size: 7296, elements: !286)
!286 = !{!287, !1335}
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !285, file: !268, line: 389, baseType: !288, size: 7296)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !268, line: 389, size: 7296, elements: !289)
!289 = !{!290, !291, !295, !299, !303, !304, !305, !306, !307, !315, !320, !321, !322, !323, !332, !333, !334, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !377, !380, !412, !413, !1306, !1307, !1310, !1314, !1315, !1318, !1319, !1320, !1323, !1334}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !288, file: !268, line: 390, baseType: !266, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !288, file: !268, line: 391, baseType: !292, size: 64, offset: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !276, line: 31, size: 64, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !292, file: !276, line: 32, baseType: !280, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !288, file: !268, line: 392, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !97, line: 23, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !99, line: 31, baseType: !298)
!298 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !288, file: !268, line: 394, baseType: !300, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!227, !255, !227, !227, !227, !227}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !288, file: !268, line: 398, baseType: !227, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !288, file: !268, line: 399, baseType: !227, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !288, file: !268, line: 405, baseType: !227, size: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !288, file: !268, line: 406, baseType: !227, size: 64, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !288, file: !268, line: 407, baseType: !308, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !257, line: 286, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 286, size: 64, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !310, file: !257, line: 286, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !314, line: 18, baseType: !227)
!314 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !288, file: !268, line: 416, baseType: !316, size: 32, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !124, line: 168, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 166, size: 32, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !317, file: !124, line: 167, baseType: !92, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !288, file: !268, line: 428, baseType: !316, size: 32, offset: 608)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !288, file: !268, line: 437, baseType: !316, size: 32, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !288, file: !268, line: 447, baseType: !316, size: 32, offset: 672)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !288, file: !268, line: 450, baseType: !324, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !325, line: 13, baseType: !326)
!325 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !124, line: 175, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 173, size: 64, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !327, file: !124, line: 174, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !97, line: 22, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !99, line: 30, baseType: !260)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !288, file: !268, line: 452, baseType: !92, size: 32, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !288, file: !268, line: 454, baseType: !137, offset: 800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !288, file: !268, line: 457, baseType: !335, size: 256, offset: 832)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !336, line: 35, size: 256, elements: !337)
!336 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!337 = !{!338, !339, !340, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !335, file: !336, line: 36, baseType: !324, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !335, file: !336, line: 42, baseType: !324, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !335, file: !336, line: 46, baseType: !341, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !138, line: 29, baseType: !145)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !335, file: !336, line: 47, baseType: !123, size: 128, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !288, file: !268, line: 459, baseType: !123, size: 128, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !288, file: !268, line: 466, baseType: !227, size: 64, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !288, file: !268, line: 467, baseType: !227, size: 64, offset: 1280)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !288, file: !268, line: 469, baseType: !227, size: 64, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !288, file: !268, line: 470, baseType: !227, size: 64, offset: 1408)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !288, file: !268, line: 471, baseType: !326, size: 64, offset: 1472)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !288, file: !268, line: 472, baseType: !227, size: 64, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !288, file: !268, line: 473, baseType: !227, size: 64, offset: 1600)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !288, file: !268, line: 474, baseType: !227, size: 64, offset: 1664)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !288, file: !268, line: 475, baseType: !227, size: 64, offset: 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !288, file: !268, line: 477, baseType: !137, offset: 1792)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !288, file: !268, line: 478, baseType: !227, size: 64, offset: 1792)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !288, file: !268, line: 478, baseType: !227, size: 64, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !288, file: !268, line: 478, baseType: !227, size: 64, offset: 1920)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !288, file: !268, line: 478, baseType: !227, size: 64, offset: 1984)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !288, file: !268, line: 479, baseType: !227, size: 64, offset: 2048)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !288, file: !268, line: 479, baseType: !227, size: 64, offset: 2112)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !288, file: !268, line: 479, baseType: !227, size: 64, offset: 2176)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !288, file: !268, line: 480, baseType: !227, size: 64, offset: 2240)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !288, file: !268, line: 480, baseType: !227, size: 64, offset: 2304)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !288, file: !268, line: 480, baseType: !227, size: 64, offset: 2368)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !288, file: !268, line: 480, baseType: !227, size: 64, offset: 2432)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !288, file: !268, line: 482, baseType: !366, size: 2816, offset: 2496)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 2816, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 44)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !288, file: !268, line: 488, baseType: !370, size: 256, offset: 5312)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !371, line: 60, size: 256, elements: !372)
!371 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !370, file: !371, line: 61, baseType: !374, size: 256)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 256, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 4)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !288, file: !268, line: 490, baseType: !378, size: 64, offset: 5568)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !268, line: 490, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !288, file: !268, line: 493, baseType: !381, size: 896, offset: 5632)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !382, line: 53, baseType: !383)
!382 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 13, size: 896, elements: !384)
!384 = !{!385, !386, !387, !388, !391, !392, !399, !400, !404, !405, !408}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !383, file: !382, line: 18, baseType: !296, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !383, file: !382, line: 28, baseType: !326, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !383, file: !382, line: 31, baseType: !335, size: 256, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !383, file: !382, line: 32, baseType: !389, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !382, line: 32, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !383, file: !382, line: 37, baseType: !219, size: 16, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !383, file: !382, line: 40, baseType: !393, size: 192, offset: 512)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !394, line: 53, size: 192, elements: !395)
!394 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!395 = !{!396, !397, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !393, file: !394, line: 54, baseType: !324, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !393, file: !394, line: 55, baseType: !137, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !393, file: !394, line: 59, baseType: !123, size: 128, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !383, file: !382, line: 41, baseType: !100, size: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !383, file: !382, line: 42, baseType: !401, size: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !382, line: 42, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !383, file: !382, line: 44, baseType: !316, size: 32, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !383, file: !382, line: 50, baseType: !406, size: 16, offset: 864)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !97, line: 19, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !99, line: 24, baseType: !219)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !383, file: !382, line: 51, baseType: !409, size: 16, offset: 880)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !97, line: 18, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !99, line: 23, baseType: !411)
!411 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !268, line: 495, baseType: !227, size: 64, offset: 6528)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !288, file: !268, line: 497, baseType: !414, size: 64, offset: 6592)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !268, line: 381, size: 384, elements: !416)
!416 = !{!417, !418, !1305}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !415, file: !268, line: 382, baseType: !316, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !415, file: !268, line: 383, baseType: !419, size: 128, offset: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !268, line: 376, size: 128, elements: !420)
!420 = !{!421, !1303}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !419, file: !268, line: 377, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !424, line: 640, size: 48640, elements: !425)
!424 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!425 = !{!426, !432, !434, !435, !441, !442, !443, !444, !445, !446, !447, !448, !452, !470, !481, !576, !577, !578, !589, !590, !592, !593, !594, !595, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !674, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !730, !732, !733, !734, !746, !747, !748, !749, !750, !751, !757, !758, !759, !760, !761, !762, !763, !775, !780, !784, !785, !786, !789, !793, !796, !799, !802, !805, !808, !811, !814, !820, !821, !822, !828, !829, !830, !831, !832, !841, !842, !843, !844, !845, !850, !851, !852, !855, !856, !859, !862, !865, !868, !871, !874, !875, !955, !958, !961, !962, !965, !966, !967, !973, !974, !975, !988, !989, !990, !1002, !1007, !1010, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !423, file: !424, line: 646, baseType: !427, size: 128)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !428, line: 56, size: 128, elements: !429)
!428 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !427, file: !428, line: 57, baseType: !227, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !427, file: !428, line: 58, baseType: !96, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !423, file: !424, line: 649, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !57)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !423, file: !424, line: 657, baseType: !100, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !423, file: !424, line: 658, baseType: !436, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !437, line: 113, baseType: !438)
!437 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !437, line: 111, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !438, file: !437, line: 112, baseType: !316, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !423, file: !424, line: 660, baseType: !7, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !423, file: !424, line: 661, baseType: !7, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !423, file: !424, line: 684, baseType: !92, size: 32, offset: 352)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !423, file: !424, line: 686, baseType: !92, size: 32, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !423, file: !424, line: 687, baseType: !92, size: 32, offset: 416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !423, file: !424, line: 688, baseType: !92, size: 32, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !423, file: !424, line: 689, baseType: !7, size: 32, offset: 480)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !423, file: !424, line: 691, baseType: !449, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !424, line: 691, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !423, file: !424, line: 692, baseType: !453, size: 832, offset: 576)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !424, line: 451, size: 832, elements: !454)
!454 = !{!455, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !453, file: !424, line: 453, baseType: !456, size: 128)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !424, line: 325, size: 128, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !456, file: !424, line: 326, baseType: !227, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !456, file: !424, line: 327, baseType: !96, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !453, file: !424, line: 454, baseType: !275, size: 192, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !453, file: !424, line: 455, baseType: !123, size: 128, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !453, file: !424, line: 456, baseType: !7, size: 32, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !453, file: !424, line: 458, baseType: !296, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !453, file: !424, line: 459, baseType: !296, size: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !453, file: !424, line: 460, baseType: !296, size: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !453, file: !424, line: 461, baseType: !296, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !453, file: !424, line: 463, baseType: !296, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !453, file: !424, line: 465, baseType: !469, offset: 832)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !424, line: 415, elements: !151)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !423, file: !424, line: 693, baseType: !471, size: 384, offset: 1408)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !424, line: 489, size: 384, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !471, file: !424, line: 490, baseType: !123, size: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !471, file: !424, line: 491, baseType: !227, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !471, file: !424, line: 492, baseType: !227, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !471, file: !424, line: 493, baseType: !7, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !471, file: !424, line: 494, baseType: !219, size: 16, offset: 288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !471, file: !424, line: 495, baseType: !219, size: 16, offset: 304)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !471, file: !424, line: 497, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !423, file: !424, line: 697, baseType: !482, size: 1792, offset: 1792)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !424, line: 507, size: 1792, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !573, !574}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !482, file: !424, line: 508, baseType: !275, size: 192, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !482, file: !424, line: 515, baseType: !296, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !482, file: !424, line: 516, baseType: !296, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !482, file: !424, line: 517, baseType: !296, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !482, file: !424, line: 518, baseType: !296, size: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !482, file: !424, line: 519, baseType: !296, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !482, file: !424, line: 526, baseType: !330, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !482, file: !424, line: 527, baseType: !296, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !482, file: !424, line: 528, baseType: !7, size: 32, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !482, file: !424, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !482, file: !424, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !482, file: !424, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !482, file: !424, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !482, file: !424, line: 563, baseType: !498, size: 512, offset: 704)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !499)
!499 = !{!500, !508, !509, !514, !566, !570, !571, !572}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !6, line: 119, baseType: !501, size: 256)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !502, line: 9, size: 256, elements: !503)
!502 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !501, file: !502, line: 10, baseType: !275, size: 192, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !501, file: !502, line: 11, baseType: !506, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !507, line: 29, baseType: !330)
!507 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !498, file: !6, line: 120, baseType: !506, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !498, file: !6, line: 121, baseType: !510, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!5, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !498, file: !6, line: 122, baseType: !515, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !517)
!517 = !{!518, !538, !539, !542, !552, !553, !561, !565}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !516, file: !6, line: 160, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !520, file: !6, line: 215, baseType: !341)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !520, file: !6, line: 216, baseType: !7, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !520, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !520, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !520, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !520, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !520, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !520, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !520, file: !6, line: 233, baseType: !506, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !520, file: !6, line: 234, baseType: !513, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !520, file: !6, line: 235, baseType: !506, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !520, file: !6, line: 236, baseType: !513, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !520, file: !6, line: 237, baseType: !535, size: 4096, offset: 512)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 4096, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 8)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !516, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !516, file: !6, line: 162, baseType: !540, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !124, line: 27, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !211, line: 96, baseType: !92)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !516, file: !6, line: 163, baseType: !543, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !544, line: 276, baseType: !545)
!544 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !544, line: 276, size: 32, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !545, file: !544, line: 276, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !544, line: 70, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !544, line: 65, size: 32, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !549, file: !544, line: 66, baseType: !7, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !516, file: !6, line: 164, baseType: !513, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !516, file: !6, line: 165, baseType: !554, size: 128, offset: 256)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !502, line: 14, size: 128, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !554, file: !502, line: 15, baseType: !557, size: 128)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !276, line: 125, size: 128, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !557, file: !276, line: 126, baseType: !292, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !557, file: !276, line: 127, baseType: !280, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !516, file: !6, line: 166, baseType: !562, size: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!506}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !516, file: !6, line: 167, baseType: !506, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !498, file: !6, line: 123, baseType: !567, size: 8, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !97, line: 17, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !99, line: 21, baseType: !569)
!569 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !498, file: !6, line: 124, baseType: !567, size: 8, offset: 456)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !498, file: !6, line: 125, baseType: !567, size: 8, offset: 464)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !498, file: !6, line: 126, baseType: !567, size: 8, offset: 472)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !482, file: !424, line: 572, baseType: !498, size: 512, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !482, file: !424, line: 580, baseType: !575, size: 64, offset: 1728)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !423, file: !424, line: 721, baseType: !7, size: 32, offset: 3584)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !423, file: !424, line: 722, baseType: !92, size: 32, offset: 3616)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !423, file: !424, line: 723, baseType: !579, size: 64, offset: 3648)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !582, line: 17, baseType: !583)
!582 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !582, line: 17, size: 64, elements: !584)
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !583, file: !582, line: 17, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 64, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 1)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !423, file: !424, line: 724, baseType: !581, size: 64, offset: 3712)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !423, file: !424, line: 749, baseType: !591, offset: 3776)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !424, line: 290, elements: !151)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !423, file: !424, line: 751, baseType: !123, size: 128, offset: 3776)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !423, file: !424, line: 757, baseType: !284, size: 64, offset: 3904)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !423, file: !424, line: 758, baseType: !284, size: 64, offset: 3968)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !423, file: !424, line: 761, baseType: !596, size: 320, offset: 4032)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !371, line: 34, size: 320, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !596, file: !371, line: 35, baseType: !296, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !596, file: !371, line: 36, baseType: !600, size: 256, offset: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 256, elements: !375)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !423, file: !424, line: 766, baseType: !92, size: 32, offset: 4352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !423, file: !424, line: 767, baseType: !92, size: 32, offset: 4384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !423, file: !424, line: 768, baseType: !92, size: 32, offset: 4416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !423, file: !424, line: 770, baseType: !92, size: 32, offset: 4448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !423, file: !424, line: 772, baseType: !227, size: 64, offset: 4480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !423, file: !424, line: 775, baseType: !7, size: 32, offset: 4544)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !423, file: !424, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !423, file: !424, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !423, file: !424, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !423, file: !424, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !423, file: !424, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !423, file: !424, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !423, file: !424, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !423, file: !424, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !423, file: !424, line: 831, baseType: !227, size: 64, offset: 4672)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !423, file: !424, line: 833, baseType: !617, size: 384, offset: 4736)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !618)
!618 = !{!619, !624}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !617, file: !12, line: 26, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!57, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !617, file: !12, line: 27, baseType: !625, size: 320, offset: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !12, line: 27, size: 320, elements: !626)
!626 = !{!627, !637, !664}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !625, file: !12, line: 36, baseType: !628, size: 320)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !12, line: 29, size: 320, elements: !629)
!629 = !{!630, !632, !633, !634, !635, !636}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !628, file: !12, line: 30, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !628, file: !12, line: 31, baseType: !96, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !12, line: 32, baseType: !96, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !628, file: !12, line: 33, baseType: !96, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !628, file: !12, line: 34, baseType: !296, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !628, file: !12, line: 35, baseType: !631, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !625, file: !12, line: 46, baseType: !638, size: 192)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !12, line: 38, size: 192, elements: !639)
!639 = !{!640, !641, !642, !663}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !638, file: !12, line: 39, baseType: !540, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, scope: !638, file: !12, line: 41, baseType: !643, size: 64, offset: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !638, file: !12, line: 41, size: 64, elements: !644)
!644 = !{!645, !653}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !643, file: !12, line: 42, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !648, line: 7, size: 128, elements: !649)
!648 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!649 = !{!650, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !647, file: !648, line: 8, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !211, line: 93, baseType: !260)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !647, file: !648, line: 9, baseType: !260, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !643, file: !12, line: 43, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !656, line: 7, size: 64, elements: !657)
!656 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!657 = !{!658, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !655, file: !656, line: 8, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !656, line: 5, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !97, line: 20, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !99, line: 26, baseType: !92)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !655, file: !656, line: 9, baseType: !660, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !638, file: !12, line: 45, baseType: !296, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !625, file: !12, line: 54, baseType: !665, size: 256)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !12, line: 48, size: 256, elements: !666)
!666 = !{!667, !670, !671, !672, !673}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !665, file: !12, line: 49, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !665, file: !12, line: 50, baseType: !92, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !665, file: !12, line: 51, baseType: !92, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !665, file: !12, line: 52, baseType: !227, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !665, file: !12, line: 53, baseType: !227, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !423, file: !424, line: 835, baseType: !675, size: 32, offset: 5120)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !124, line: 22, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !211, line: 28, baseType: !92)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !423, file: !424, line: 836, baseType: !675, size: 32, offset: 5152)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !423, file: !424, line: 840, baseType: !227, size: 64, offset: 5184)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !423, file: !424, line: 849, baseType: !422, size: 64, offset: 5248)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !423, file: !424, line: 852, baseType: !422, size: 64, offset: 5312)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !423, file: !424, line: 857, baseType: !123, size: 128, offset: 5376)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !423, file: !424, line: 858, baseType: !123, size: 128, offset: 5504)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !423, file: !424, line: 859, baseType: !422, size: 64, offset: 5632)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !423, file: !424, line: 867, baseType: !123, size: 128, offset: 5696)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !423, file: !424, line: 868, baseType: !123, size: 128, offset: 5824)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !423, file: !424, line: 871, baseType: !687, size: 64, offset: 5952)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !689, line: 59, size: 768, elements: !690)
!689 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!690 = !{!691, !692, !693, !694, !705, !706, !713, !722}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !688, file: !689, line: 61, baseType: !436, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !688, file: !689, line: 62, baseType: !7, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !688, file: !689, line: 63, baseType: !137, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !688, file: !689, line: 65, baseType: !695, size: 256, offset: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 256, elements: !375)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !124, line: 182, size: 64, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !696, file: !124, line: 183, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !124, line: 186, size: 128, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !124, line: 187, baseType: !699, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !700, file: !124, line: 187, baseType: !704, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !688, file: !689, line: 66, baseType: !696, size: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !688, file: !689, line: 68, baseType: !707, size: 128, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !708, line: 40, baseType: !709)
!708 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !708, line: 36, size: 128, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !708, line: 37, baseType: !137)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !709, file: !708, line: 38, baseType: !123, size: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !688, file: !689, line: 69, baseType: !714, size: 128, align: 64, offset: 512)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !124, line: 216, size: 128, align: 64, elements: !715)
!715 = !{!716, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !124, line: 217, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !714, file: !124, line: 218, baseType: !719, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !717}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !688, file: !689, line: 70, baseType: !723, size: 128, offset: 640)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 128, elements: !587)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !689, line: 54, size: 128, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !724, file: !689, line: 55, baseType: !92, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !724, file: !689, line: 56, baseType: !728, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !689, line: 56, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !423, file: !424, line: 872, baseType: !731, size: 512, offset: 6016)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 512, elements: !375)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !423, file: !424, line: 873, baseType: !123, size: 128, offset: 6528)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !423, file: !424, line: 874, baseType: !123, size: 128, offset: 6656)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !423, file: !424, line: 876, baseType: !735, size: 64, offset: 6784)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !737, line: 26, size: 192, elements: !738)
!737 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !736, file: !737, line: 27, baseType: !7, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !736, file: !737, line: 28, baseType: !741, size: 128, offset: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !742, line: 43, size: 128, elements: !743)
!742 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !741, file: !742, line: 44, baseType: !341)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !741, file: !742, line: 45, baseType: !123, size: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !423, file: !424, line: 879, baseType: !93, size: 64, offset: 6848)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !423, file: !424, line: 882, baseType: !93, size: 64, offset: 6912)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !423, file: !424, line: 884, baseType: !296, size: 64, offset: 6976)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !423, file: !424, line: 885, baseType: !296, size: 64, offset: 7040)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !423, file: !424, line: 890, baseType: !296, size: 64, offset: 7104)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !423, file: !424, line: 891, baseType: !752, size: 128, offset: 7168)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !424, line: 242, size: 128, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !752, file: !424, line: 244, baseType: !296, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !752, file: !424, line: 245, baseType: !296, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !752, file: !424, line: 246, baseType: !341, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !423, file: !424, line: 900, baseType: !227, size: 64, offset: 7296)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !423, file: !424, line: 901, baseType: !227, size: 64, offset: 7360)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !423, file: !424, line: 904, baseType: !296, size: 64, offset: 7424)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !423, file: !424, line: 907, baseType: !296, size: 64, offset: 7488)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !423, file: !424, line: 910, baseType: !227, size: 64, offset: 7552)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !423, file: !424, line: 911, baseType: !227, size: 64, offset: 7616)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !423, file: !424, line: 914, baseType: !764, size: 640, offset: 7680)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !765, line: 123, size: 640, elements: !766)
!765 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!766 = !{!767, !773, !774}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !764, file: !765, line: 124, baseType: !768, size: 576)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 576, elements: !179)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !765, line: 108, size: 192, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !769, file: !765, line: 109, baseType: !296, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !769, file: !765, line: 110, baseType: !554, size: 128, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !764, file: !765, line: 125, baseType: !7, size: 32, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !764, file: !765, line: 126, baseType: !7, size: 32, offset: 608)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !423, file: !424, line: 917, baseType: !776, size: 192, offset: 8320)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !765, line: 134, size: 192, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !776, file: !765, line: 135, baseType: !714, size: 128, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !776, file: !765, line: 136, baseType: !7, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !423, file: !424, line: 923, baseType: !781, size: 64, offset: 8512)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !424, line: 923, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !423, file: !424, line: 926, baseType: !781, size: 64, offset: 8576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !423, file: !424, line: 929, baseType: !781, size: 64, offset: 8640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !423, file: !424, line: 933, baseType: !787, size: 64, offset: 8704)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !424, line: 933, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !423, file: !424, line: 943, baseType: !790, size: 128, offset: 8768)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !423, file: !424, line: 945, baseType: !794, size: 64, offset: 8896)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !424, line: 49, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !423, file: !424, line: 956, baseType: !797, size: 64, offset: 8960)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !424, line: 45, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !423, file: !424, line: 959, baseType: !800, size: 64, offset: 9024)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !424, line: 959, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !423, file: !424, line: 962, baseType: !803, size: 64, offset: 9088)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !424, line: 66, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !423, file: !424, line: 966, baseType: !806, size: 64, offset: 9152)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !424, line: 50, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !423, file: !424, line: 969, baseType: !809, size: 64, offset: 9216)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !765, line: 223, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !423, file: !424, line: 970, baseType: !812, size: 64, offset: 9280)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !424, line: 62, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !423, file: !424, line: 971, baseType: !815, size: 64, offset: 9344)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !816, line: 25, baseType: !817)
!816 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !816, line: 23, size: 64, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !817, file: !816, line: 24, baseType: !586, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !423, file: !424, line: 972, baseType: !815, size: 64, offset: 9408)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !423, file: !424, line: 974, baseType: !815, size: 64, offset: 9472)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !423, file: !424, line: 975, baseType: !823, size: 192, offset: 9536)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !824, line: 30, size: 192, elements: !825)
!824 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !823, file: !824, line: 31, baseType: !123, size: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !823, file: !824, line: 32, baseType: !815, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !423, file: !424, line: 976, baseType: !227, size: 64, offset: 9728)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !423, file: !424, line: 977, baseType: !224, size: 64, offset: 9792)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !423, file: !424, line: 978, baseType: !7, size: 32, offset: 9856)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !423, file: !424, line: 980, baseType: !717, size: 64, offset: 9920)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !423, file: !424, line: 989, baseType: !833, size: 128, offset: 9984)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !834, line: 35, size: 128, elements: !835)
!834 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !833, file: !834, line: 36, baseType: !92, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !833, file: !834, line: 37, baseType: !316, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !833, file: !834, line: 38, baseType: !839, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !834, line: 23, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !423, file: !424, line: 992, baseType: !296, size: 64, offset: 10112)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !423, file: !424, line: 993, baseType: !296, size: 64, offset: 10176)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !423, file: !424, line: 996, baseType: !137, offset: 10240)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !423, file: !424, line: 999, baseType: !341, offset: 10240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !423, file: !424, line: 1001, baseType: !846, size: 64, offset: 10240)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !424, line: 636, size: 64, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !424, line: 637, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !423, file: !424, line: 1005, baseType: !557, size: 128, offset: 10304)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !423, file: !424, line: 1007, baseType: !422, size: 64, offset: 10432)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !423, file: !424, line: 1009, baseType: !853, size: 64, offset: 10496)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !424, line: 1009, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !423, file: !424, line: 1043, baseType: !100, size: 64, offset: 10560)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !423, file: !424, line: 1046, baseType: !857, size: 64, offset: 10624)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !424, line: 41, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !423, file: !424, line: 1050, baseType: !860, size: 64, offset: 10688)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !424, line: 42, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !423, file: !424, line: 1054, baseType: !863, size: 64, offset: 10752)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !424, line: 55, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !423, file: !424, line: 1056, baseType: !866, size: 64, offset: 10816)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !424, line: 40, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !423, file: !424, line: 1058, baseType: !869, size: 64, offset: 10880)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !424, line: 47, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !423, file: !424, line: 1061, baseType: !872, size: 64, offset: 10944)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !424, line: 43, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !423, file: !424, line: 1064, baseType: !227, size: 64, offset: 11008)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !423, file: !424, line: 1065, baseType: !876, size: 64, offset: 11072)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !824, line: 14, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !824, line: 12, size: 384, elements: !879)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, scope: !878, file: !824, line: 13, baseType: !881, size: 384)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !824, line: 13, size: 384, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !881, file: !824, line: 13, baseType: !92, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !881, file: !824, line: 13, baseType: !92, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !881, file: !824, line: 13, baseType: !92, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !881, file: !824, line: 13, baseType: !887, size: 256, offset: 128)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !888, line: 32, size: 256, elements: !889)
!888 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!889 = !{!890, !896, !909, !915, !924, !944, !949}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !887, file: !888, line: 37, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 34, size: 64, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !891, file: !888, line: 35, baseType: !676, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !891, file: !888, line: 36, baseType: !895, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !211, line: 49, baseType: !7)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !887, file: !888, line: 45, baseType: !897, size: 192)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 40, size: 192, elements: !898)
!898 = !{!899, !901, !902, !908}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !897, file: !888, line: 41, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !211, line: 95, baseType: !92)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !897, file: !888, line: 42, baseType: !92, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !897, file: !888, line: 43, baseType: !903, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !888, line: 11, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !888, line: 8, size: 64, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !904, file: !888, line: 9, baseType: !92, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !904, file: !888, line: 10, baseType: !100, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !897, file: !888, line: 44, baseType: !92, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !887, file: !888, line: 52, baseType: !910, size: 128)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 48, size: 128, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !910, file: !888, line: 49, baseType: !676, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !910, file: !888, line: 50, baseType: !895, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !910, file: !888, line: 51, baseType: !903, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !887, file: !888, line: 61, baseType: !916, size: 256)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 55, size: 256, elements: !917)
!917 = !{!918, !919, !920, !921, !923}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !916, file: !888, line: 56, baseType: !676, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !916, file: !888, line: 57, baseType: !895, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !916, file: !888, line: 58, baseType: !92, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !916, file: !888, line: 59, baseType: !922, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !211, line: 94, baseType: !212)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !916, file: !888, line: 60, baseType: !922, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !887, file: !888, line: 95, baseType: !925, size: 256)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 64, size: 256, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !925, file: !888, line: 65, baseType: !100, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, scope: !925, file: !888, line: 77, baseType: !929, size: 192, offset: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !925, file: !888, line: 77, size: 192, elements: !930)
!930 = !{!931, !932, !939}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !929, file: !888, line: 82, baseType: !411, size: 16)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !929, file: !888, line: 88, baseType: !933, size: 192)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !929, file: !888, line: 84, size: 192, elements: !934)
!934 = !{!935, !937, !938}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !933, file: !888, line: 85, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !536)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !933, file: !888, line: 86, baseType: !100, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !933, file: !888, line: 87, baseType: !100, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !929, file: !888, line: 93, baseType: !940, size: 96)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !929, file: !888, line: 90, size: 96, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !940, file: !888, line: 91, baseType: !936, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !940, file: !888, line: 92, baseType: !98, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !887, file: !888, line: 101, baseType: !945, size: 128)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 98, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !945, file: !888, line: 99, baseType: !57, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !945, file: !888, line: 100, baseType: !92, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !887, file: !888, line: 108, baseType: !950, size: 128)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !888, line: 104, size: 128, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !950, file: !888, line: 105, baseType: !100, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !950, file: !888, line: 106, baseType: !92, size: 32, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !950, file: !888, line: 107, baseType: !7, size: 32, offset: 96)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ioac", scope: !423, file: !424, line: 1067, baseType: !956, offset: 11136)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_io_accounting", file: !957, line: 12, elements: !151)
!957 = !DIFile(filename: "./include/linux/task_io_accounting.h", directory: "/home/lizy2001/genbc/linux")
!958 = !DIDerivedType(tag: DW_TAG_member, name: "robust_list", scope: !423, file: !424, line: 1099, baseType: !959, size: 64, offset: 11136)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "robust_list_head", file: !424, line: 56, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_list", scope: !423, file: !424, line: 1103, baseType: !123, size: 128, offset: 11200)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_cache", scope: !423, file: !424, line: 1104, baseType: !963, size: 64, offset: 11328)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "futex_pi_state", file: !424, line: 46, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "futex_exit_mutex", scope: !423, file: !424, line: 1105, baseType: !393, size: 192, offset: 11392)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "futex_state", scope: !423, file: !424, line: 1106, baseType: !7, size: 32, offset: 11584)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_ctxp", scope: !423, file: !424, line: 1109, baseType: !968, size: 128, offset: 11648)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 128, elements: !971)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_context", file: !424, line: 51, flags: DIFlagFwdDecl)
!971 = !{!972}
!972 = !DISubrange(count: 2)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_mutex", scope: !423, file: !424, line: 1110, baseType: !393, size: 192, offset: 11776)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_list", scope: !423, file: !424, line: 1111, baseType: !123, size: 128, offset: 11968)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rseq", scope: !423, file: !424, line: 1173, baseType: !976, size: 64, offset: 12096)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rseq", file: !978, line: 62, size: 256, align: 256, elements: !979)
!978 = !DIFile(filename: "./include/uapi/linux/rseq.h", directory: "/home/lizy2001/genbc/linux")
!979 = !{!980, !981, !982, !987}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id_start", scope: !977, file: !978, line: 75, baseType: !98, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id", scope: !977, file: !978, line: 90, baseType: !98, size: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rseq_cs", scope: !977, file: !978, line: 124, baseType: !983, size: 64, offset: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !977, file: !978, line: 109, size: 64, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ptr64", scope: !983, file: !978, line: 110, baseType: !297, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !983, file: !978, line: 112, baseType: !297, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !978, line: 144, baseType: !98, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "rseq_sig", scope: !423, file: !424, line: 1174, baseType: !96, size: 32, offset: 12160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "rseq_event_mask", scope: !423, file: !424, line: 1179, baseType: !227, size: 64, offset: 12224)
