; ModuleID = '../bcout/drivers/mmc/core/sdio_cis.llvm.bc'
source_filename = "drivers/mmc/core/sdio_cis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.cis_tpl = type { i8, i8, i32 (%struct.mmc_card*, %struct.sdio_func*, i8*, i32)* }
%struct.mmc_card = type { %struct.mmc_host*, %struct.device, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i8, [4 x i32], [4 x i32], [2 x i32], [16 x i32], %struct.mmc_cid, %struct.mmc_csd, %struct.mmc_ext_csd, %struct.sd_scr, %struct.sd_ssr, %struct.sd_switch_caps, i32, %struct.atomic_t, %struct.sdio_cccr, %struct.sdio_cis, [7 x %struct.sdio_func*], %struct.sdio_func*, i8, i8, i32, i8**, %struct.sdio_func_tuple*, i32, i32, i32, %struct.dentry*, [7 x %struct.mmc_part], i32, i32, %struct.workqueue_struct* }

!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !51, line: 305, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!57 = !{!58, !60, !61, !62, !64}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !59, line: 148, baseType: !7)
!59 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!67 = !{!68, !0, !2443, !2458, !2461}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "_rs", scope: !70, file: !3, line: 330, type: !2433, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "sdio_read_cis", scope: !3, file: !3, line: 241, type: !71, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !119)
!71 = !DISubroutineType(types: !72)
!72 = !{!60, !73, !2374}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mmc_card", file: !75, line: 244, size: 12672, elements: !76)
!75 = !DIFile(filename: "./include/linux/mmc/card.h", directory: "/home/lizy2001/genbc/linux")
!76 = !{!77, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2214, !2216, !2228, !2248, !2329, !2338, !2344, !2352, !2353, !2354, !2365, !2372, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2430, !2431, !2432}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !74, file: !75, line: 245, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mmc_host", file: !80, line: 275, size: 10752, elements: !81)
!80 = !DIFile(filename: "./include/linux/mmc/host.h", directory: "/home/lizy2001/genbc/linux")
!81 = !{!82, !1927, !1928, !1929, !2056, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2122, !2123, !2124, !2133, !2134, !2140, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2154, !2161, !2164, !2165, !2166, !2167, !2168, !2169, !2190, !2191, !2192, !2193, !2194, !2195}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !80, line: 276, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !85)
!85 = !{!86, !1560, !1561, !1564, !1565, !1616, !1713, !1714, !1715, !1716, !1717, !1726, !1831, !1844, !1847, !1848, !1852, !1854, !1855, !1856, !1860, !1866, !1867, !1870, !1874, !1877, !1880, !1881, !1882, !1883, !1915, !1916, !1917, !1920, !1923, !1924, !1925, !1926}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !84, file: !30, line: 462, baseType: !87, size: 512)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !88, line: 64, size: 512, elements: !89)
!88 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!89 = !{!90, !91, !97, !99, !158, !1397, !1550, !1555, !1556, !1557, !1558, !1559}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !88, line: 65, baseType: !65, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !87, file: !88, line: 66, baseType: !92, size: 128, offset: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !59, line: 178, size: 128, elements: !93)
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !59, line: 179, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !92, file: !59, line: 179, baseType: !95, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !88, line: 67, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !87, file: !88, line: 68, baseType: !100, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !88, line: 192, size: 704, elements: !102)
!102 = !{!103, !104, !120, !121}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !101, file: !88, line: 193, baseType: !92, size: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !101, file: !88, line: 194, baseType: !105, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !106, line: 83, baseType: !107)
!106 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !106, line: 71, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, scope: !107, file: !106, line: 72, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !107, file: !106, line: 72, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !110, file: !106, line: 73, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !106, line: 20, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !113, file: !106, line: 21, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !117, line: 25, baseType: !118)
!117 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 25, elements: !119)
!119 = !{}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !101, file: !88, line: 195, baseType: !87, size: 512, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !101, file: !88, line: 196, baseType: !122, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !88, line: 156, size: 192, elements: !125)
!125 = !{!126, !131, !136}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !124, file: !88, line: 157, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!60, !100, !98}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !88, line: 158, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!65, !100, !98}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !124, file: !88, line: 159, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!60, !100, !98, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !88, line: 148, size: 20736, elements: !143)
!143 = !{!144, !148, !152, !153, !157}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !142, file: !88, line: 149, baseType: !145, size: 192)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 192, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 3)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !142, file: !88, line: 150, baseType: !149, size: 4096, offset: 192)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 4096, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !142, file: !88, line: 151, baseType: !60, size: 32, offset: 4288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !142, file: !88, line: 152, baseType: !154, size: 16384, offset: 4320)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 16384, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 2048)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !142, file: !88, line: 153, baseType: !60, size: 32, offset: 20704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !87, file: !88, line: 69, baseType: !159, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !88, line: 138, size: 448, elements: !161)
!161 = !{!162, !166, !196, !198, !1342, !1375, !1379}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !160, file: !88, line: 139, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !98}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !160, file: !88, line: 140, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !170, line: 230, size: 128, elements: !171)
!170 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!171 = !{!172, !188}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !169, file: !170, line: 231, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !98, !181, !62}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !59, line: 60, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !178, line: 73, baseType: !179)
!178 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !178, line: 15, baseType: !180)
!180 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !170, line: 30, size: 128, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !170, line: 31, baseType: !65, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !182, file: !170, line: 32, baseType: !186, size: 16, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !59, line: 19, baseType: !187)
!187 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !169, file: !170, line: 232, baseType: !189, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!176, !98, !181, !65, !192}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 55, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !178, line: 72, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !178, line: 16, baseType: !195)
!195 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !160, file: !88, line: 141, baseType: !197, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !160, file: !88, line: 142, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !170, line: 84, size: 320, elements: !203)
!203 = !{!204, !205, !209, !1339, !1340}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !170, line: 85, baseType: !65, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !202, file: !170, line: 86, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!186, !98, !181, !60}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !202, file: !170, line: 88, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!186, !98, !213, !60}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !170, line: 168, size: 448, elements: !215)
!215 = !{!216, !217, !218, !219, !229, !230}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !214, file: !170, line: 169, baseType: !182, size: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !214, file: !170, line: 170, baseType: !192, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !214, file: !170, line: 171, baseType: !61, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !214, file: !170, line: 172, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!176, !223, !98, !213, !62, !226, !192}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !225, line: 526, flags: DIFlagFwdDecl)
!225 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !59, line: 46, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !178, line: 88, baseType: !228)
!228 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !214, file: !170, line: 174, baseType: !220, size: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !214, file: !170, line: 176, baseType: !231, size: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!60, !223, !98, !213, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !236, line: 305, size: 1472, elements: !237)
!236 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!237 = !{!238, !239, !240, !241, !242, !250, !251, !1313, !1319, !1320, !1325, !1326, !1329, !1333, !1334, !1335, !1336, !1337}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !235, file: !236, line: 308, baseType: !195, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !235, file: !236, line: 309, baseType: !195, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !235, file: !236, line: 313, baseType: !234, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !235, file: !236, line: 313, baseType: !234, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !235, file: !236, line: 315, baseType: !243, size: 192, align: 64, offset: 256)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !244, line: 24, size: 192, align: 64, elements: !245)
!244 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!245 = !{!246, !247, !249}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !243, file: !244, line: 25, baseType: !195, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !243, file: !244, line: 26, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !243, file: !244, line: 27, baseType: !248, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !235, file: !236, line: 323, baseType: !195, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !235, file: !236, line: 327, baseType: !252, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !236, line: 388, size: 7296, elements: !254)
!254 = !{!255, !1309}
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !236, line: 389, baseType: !256, size: 7296)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !253, file: !236, line: 389, size: 7296, elements: !257)
!257 = !{!258, !259, !263, !269, !273, !274, !275, !276, !277, !285, !290, !291, !292, !293, !302, !303, !304, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !339, !347, !350, !382, !383, !1280, !1281, !1284, !1287, !1288, !1291, !1292, !1293, !1296, !1308}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !256, file: !236, line: 390, baseType: !234, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !256, file: !236, line: 391, baseType: !260, size: 64, offset: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !244, line: 31, size: 64, elements: !261)
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !260, file: !244, line: 32, baseType: !248, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !256, file: !236, line: 392, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !265, line: 23, baseType: !266)
!265 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !267, line: 31, baseType: !268)
!267 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!268 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !256, file: !236, line: 394, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!195, !223, !195, !195, !195, !195}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !256, file: !236, line: 398, baseType: !195, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !256, file: !236, line: 399, baseType: !195, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !256, file: !236, line: 405, baseType: !195, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !256, file: !236, line: 406, baseType: !195, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !256, file: !236, line: 407, baseType: !278, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !225, line: 286, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 286, size: 64, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !280, file: !225, line: 286, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !284, line: 18, baseType: !195)
!284 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!285 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !256, file: !236, line: 416, baseType: !286, size: 32, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !59, line: 168, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 166, size: 32, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !287, file: !59, line: 167, baseType: !60, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !256, file: !236, line: 428, baseType: !286, size: 32, offset: 608)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !256, file: !236, line: 437, baseType: !286, size: 32, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !256, file: !236, line: 447, baseType: !286, size: 32, offset: 672)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !256, file: !236, line: 450, baseType: !294, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !295, line: 13, baseType: !296)
!295 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !59, line: 175, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 173, size: 64, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !297, file: !59, line: 174, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !265, line: 22, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !267, line: 30, baseType: !228)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !256, file: !236, line: 452, baseType: !60, size: 32, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !256, file: !236, line: 454, baseType: !105, offset: 800)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !256, file: !236, line: 457, baseType: !305, size: 256, offset: 832)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !306, line: 35, size: 256, elements: !307)
!306 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!307 = !{!308, !309, !310, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !305, file: !306, line: 36, baseType: !294, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !305, file: !306, line: 42, baseType: !294, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !305, file: !306, line: 46, baseType: !311, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !106, line: 29, baseType: !113)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !305, file: !306, line: 47, baseType: !92, size: 128, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !256, file: !236, line: 459, baseType: !92, size: 128, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !256, file: !236, line: 466, baseType: !195, size: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !256, file: !236, line: 467, baseType: !195, size: 64, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !256, file: !236, line: 469, baseType: !195, size: 64, offset: 1344)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !256, file: !236, line: 470, baseType: !195, size: 64, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !256, file: !236, line: 471, baseType: !296, size: 64, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !256, file: !236, line: 472, baseType: !195, size: 64, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !256, file: !236, line: 473, baseType: !195, size: 64, offset: 1600)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !256, file: !236, line: 474, baseType: !195, size: 64, offset: 1664)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !256, file: !236, line: 475, baseType: !195, size: 64, offset: 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !256, file: !236, line: 477, baseType: !105, offset: 1792)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !256, file: !236, line: 478, baseType: !195, size: 64, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !256, file: !236, line: 478, baseType: !195, size: 64, offset: 1856)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !256, file: !236, line: 478, baseType: !195, size: 64, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !256, file: !236, line: 478, baseType: !195, size: 64, offset: 1984)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !256, file: !236, line: 479, baseType: !195, size: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !256, file: !236, line: 479, baseType: !195, size: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !256, file: !236, line: 479, baseType: !195, size: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !256, file: !236, line: 480, baseType: !195, size: 64, offset: 2240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !256, file: !236, line: 480, baseType: !195, size: 64, offset: 2304)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !256, file: !236, line: 480, baseType: !195, size: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !256, file: !236, line: 480, baseType: !195, size: 64, offset: 2432)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !256, file: !236, line: 482, baseType: !336, size: 2816, offset: 2496)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 2816, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 44)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !256, file: !236, line: 488, baseType: !340, size: 256, offset: 5312)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !341, line: 60, size: 256, elements: !342)
!341 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !340, file: !341, line: 61, baseType: !344, size: 256)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 256, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 4)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !256, file: !236, line: 490, baseType: !348, size: 64, offset: 5568)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !236, line: 490, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !256, file: !236, line: 493, baseType: !351, size: 896, offset: 5632)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !352, line: 53, baseType: !353)
!352 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 13, size: 896, elements: !354)
!354 = !{!355, !356, !357, !358, !361, !362, !369, !370, !374, !375, !378}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !353, file: !352, line: 18, baseType: !264, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !353, file: !352, line: 28, baseType: !296, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !353, file: !352, line: 31, baseType: !305, size: 256, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !353, file: !352, line: 32, baseType: !359, size: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !352, line: 32, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !353, file: !352, line: 37, baseType: !187, size: 16, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !353, file: !352, line: 40, baseType: !363, size: 192, offset: 512)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !364, line: 53, size: 192, elements: !365)
!364 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !363, file: !364, line: 54, baseType: !294, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !363, file: !364, line: 55, baseType: !105, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !363, file: !364, line: 59, baseType: !92, size: 128, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !353, file: !352, line: 41, baseType: !61, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !353, file: !352, line: 42, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !352, line: 42, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !353, file: !352, line: 44, baseType: !286, size: 32, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !353, file: !352, line: 50, baseType: !376, size: 16, offset: 864)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !265, line: 19, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !267, line: 24, baseType: !187)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !353, file: !352, line: 51, baseType: !379, size: 16, offset: 880)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !265, line: 18, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !267, line: 23, baseType: !381)
!381 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !236, line: 495, baseType: !195, size: 64, offset: 6528)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !256, file: !236, line: 497, baseType: !384, size: 64, offset: 6592)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !236, line: 381, size: 384, elements: !386)
!386 = !{!387, !388, !1279}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !385, file: !236, line: 382, baseType: !286, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !385, file: !236, line: 383, baseType: !389, size: 128, offset: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !236, line: 376, size: 128, elements: !390)
!390 = !{!391, !1277}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !389, file: !236, line: 377, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !394, line: 640, size: 48640, elements: !395)
!394 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!395 = !{!396, !404, !406, !407, !413, !414, !415, !416, !417, !418, !419, !420, !424, !442, !453, !548, !549, !550, !561, !562, !564, !565, !566, !567, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !646, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !702, !704, !705, !706, !718, !720, !721, !722, !723, !724, !730, !731, !732, !733, !734, !735, !736, !748, !753, !757, !758, !759, !762, !766, !769, !772, !775, !778, !781, !784, !787, !793, !794, !795, !801, !802, !803, !804, !805, !814, !815, !816, !817, !818, !823, !824, !825, !828, !829, !832, !835, !838, !841, !844, !847, !848, !928, !931, !934, !935, !938, !939, !940, !946, !947, !948, !961, !962, !963, !975, !980, !983, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !393, file: !394, line: 646, baseType: !397, size: 128)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !398, line: 56, size: 128, elements: !399)
!398 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !398, line: 57, baseType: !195, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !397, file: !398, line: 58, baseType: !402, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !265, line: 21, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !267, line: 27, baseType: !7)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !393, file: !394, line: 649, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !180)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !393, file: !394, line: 657, baseType: !61, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !393, file: !394, line: 658, baseType: !408, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !409, line: 113, baseType: !410)
!409 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !409, line: 111, size: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !410, file: !409, line: 112, baseType: !286, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !394, line: 660, baseType: !7, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !393, file: !394, line: 661, baseType: !7, size: 32, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !393, file: !394, line: 684, baseType: !60, size: 32, offset: 352)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !393, file: !394, line: 686, baseType: !60, size: 32, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !393, file: !394, line: 687, baseType: !60, size: 32, offset: 416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !393, file: !394, line: 688, baseType: !60, size: 32, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !393, file: !394, line: 689, baseType: !7, size: 32, offset: 480)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !393, file: !394, line: 691, baseType: !421, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !394, line: 691, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !393, file: !394, line: 692, baseType: !425, size: 832, offset: 576)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !394, line: 451, size: 832, elements: !426)
!426 = !{!427, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !425, file: !394, line: 453, baseType: !428, size: 128)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !394, line: 325, size: 128, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !428, file: !394, line: 326, baseType: !195, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !428, file: !394, line: 327, baseType: !402, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !425, file: !394, line: 454, baseType: !243, size: 192, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !425, file: !394, line: 455, baseType: !92, size: 128, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !425, file: !394, line: 456, baseType: !7, size: 32, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !425, file: !394, line: 458, baseType: !264, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !425, file: !394, line: 459, baseType: !264, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !425, file: !394, line: 460, baseType: !264, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !425, file: !394, line: 461, baseType: !264, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !425, file: !394, line: 463, baseType: !264, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !425, file: !394, line: 465, baseType: !441, offset: 832)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !394, line: 415, elements: !119)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !393, file: !394, line: 693, baseType: !443, size: 384, offset: 1408)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !394, line: 489, size: 384, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !443, file: !394, line: 490, baseType: !92, size: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !443, file: !394, line: 491, baseType: !195, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !443, file: !394, line: 492, baseType: !195, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !443, file: !394, line: 493, baseType: !7, size: 32, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !443, file: !394, line: 494, baseType: !187, size: 16, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !443, file: !394, line: 495, baseType: !187, size: 16, offset: 304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !443, file: !394, line: 497, baseType: !452, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !393, file: !394, line: 697, baseType: !454, size: 1792, offset: 1792)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !394, line: 507, size: 1792, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !545, !546}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !454, file: !394, line: 508, baseType: !243, size: 192, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !454, file: !394, line: 515, baseType: !264, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !454, file: !394, line: 516, baseType: !264, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !454, file: !394, line: 517, baseType: !264, size: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !454, file: !394, line: 518, baseType: !264, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !454, file: !394, line: 519, baseType: !264, size: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !454, file: !394, line: 526, baseType: !300, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !454, file: !394, line: 527, baseType: !264, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !454, file: !394, line: 528, baseType: !7, size: 32, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !454, file: !394, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !454, file: !394, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !454, file: !394, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !454, file: !394, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !454, file: !394, line: 563, baseType: !470, size: 512, offset: 704)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !471)
!471 = !{!472, !480, !481, !486, !538, !542, !543, !544}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !470, file: !6, line: 119, baseType: !473, size: 256)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !474, line: 9, size: 256, elements: !475)
!474 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !474, line: 10, baseType: !243, size: 192, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !473, file: !474, line: 11, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !479, line: 29, baseType: !300)
!479 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !470, file: !6, line: 120, baseType: !478, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !470, file: !6, line: 121, baseType: !482, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!5, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !470, file: !6, line: 122, baseType: !487, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !489)
!489 = !{!490, !510, !511, !514, !524, !525, !533, !537}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !488, file: !6, line: 160, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !492, file: !6, line: 215, baseType: !311)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !492, file: !6, line: 216, baseType: !7, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !492, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !492, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !492, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !492, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !492, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !492, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !492, file: !6, line: 233, baseType: !478, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !492, file: !6, line: 234, baseType: !485, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !492, file: !6, line: 235, baseType: !478, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !492, file: !6, line: 236, baseType: !485, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !492, file: !6, line: 237, baseType: !507, size: 4096, offset: 512)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 4096, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !488, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !488, file: !6, line: 162, baseType: !512, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !59, line: 27, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !178, line: 96, baseType: !60)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !488, file: !6, line: 163, baseType: !515, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !516, line: 276, baseType: !517)
!516 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !516, line: 276, size: 32, elements: !518)
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !517, file: !516, line: 276, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !516, line: 70, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !516, line: 65, size: 32, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !521, file: !516, line: 66, baseType: !7, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !488, file: !6, line: 164, baseType: !485, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !488, file: !6, line: 165, baseType: !526, size: 128, offset: 256)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !474, line: 14, size: 128, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !526, file: !474, line: 15, baseType: !529, size: 128)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !244, line: 125, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !529, file: !244, line: 126, baseType: !260, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !529, file: !244, line: 127, baseType: !248, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !488, file: !6, line: 166, baseType: !534, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!478}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !488, file: !6, line: 167, baseType: !478, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !470, file: !6, line: 123, baseType: !539, size: 8, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !265, line: 17, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !267, line: 21, baseType: !541)
!541 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !470, file: !6, line: 124, baseType: !539, size: 8, offset: 456)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !470, file: !6, line: 125, baseType: !539, size: 8, offset: 464)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !470, file: !6, line: 126, baseType: !539, size: 8, offset: 472)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !454, file: !394, line: 572, baseType: !470, size: 512, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !454, file: !394, line: 580, baseType: !547, size: 64, offset: 1728)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !393, file: !394, line: 721, baseType: !7, size: 32, offset: 3584)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !393, file: !394, line: 722, baseType: !60, size: 32, offset: 3616)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !393, file: !394, line: 723, baseType: !551, size: 64, offset: 3648)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !554, line: 17, baseType: !555)
!554 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !554, line: 17, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !555, file: !554, line: 17, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !393, file: !394, line: 724, baseType: !553, size: 64, offset: 3712)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !393, file: !394, line: 749, baseType: !563, offset: 3776)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !394, line: 290, elements: !119)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !393, file: !394, line: 751, baseType: !92, size: 128, offset: 3776)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !393, file: !394, line: 757, baseType: !252, size: 64, offset: 3904)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !393, file: !394, line: 758, baseType: !252, size: 64, offset: 3968)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !393, file: !394, line: 761, baseType: !568, size: 320, offset: 4032)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !341, line: 34, size: 320, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !568, file: !341, line: 35, baseType: !264, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !568, file: !341, line: 36, baseType: !572, size: 256, offset: 64)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 256, elements: !345)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !393, file: !394, line: 766, baseType: !60, size: 32, offset: 4352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !393, file: !394, line: 767, baseType: !60, size: 32, offset: 4384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !393, file: !394, line: 768, baseType: !60, size: 32, offset: 4416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !393, file: !394, line: 770, baseType: !60, size: 32, offset: 4448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !393, file: !394, line: 772, baseType: !195, size: 64, offset: 4480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !393, file: !394, line: 775, baseType: !7, size: 32, offset: 4544)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !393, file: !394, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !393, file: !394, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !393, file: !394, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !393, file: !394, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !393, file: !394, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !393, file: !394, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !393, file: !394, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !393, file: !394, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !393, file: !394, line: 831, baseType: !195, size: 64, offset: 4672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !393, file: !394, line: 833, baseType: !589, size: 384, offset: 4736)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !590)
!590 = !{!591, !596}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !589, file: !12, line: 26, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!180, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !589, file: !12, line: 27, baseType: !597, size: 320, offset: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !589, file: !12, line: 27, size: 320, elements: !598)
!598 = !{!599, !609, !636}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !597, file: !12, line: 36, baseType: !600, size: 320)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !12, line: 29, size: 320, elements: !601)
!601 = !{!602, !604, !605, !606, !607, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !600, file: !12, line: 30, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !600, file: !12, line: 31, baseType: !402, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !600, file: !12, line: 32, baseType: !402, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !600, file: !12, line: 33, baseType: !402, size: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !600, file: !12, line: 34, baseType: !264, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !600, file: !12, line: 35, baseType: !603, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !597, file: !12, line: 46, baseType: !610, size: 192)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !12, line: 38, size: 192, elements: !611)
!611 = !{!612, !613, !614, !635}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !610, file: !12, line: 39, baseType: !512, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, scope: !610, file: !12, line: 41, baseType: !615, size: 64, offset: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !12, line: 41, size: 64, elements: !616)
!616 = !{!617, !625}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !615, file: !12, line: 42, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !620, line: 7, size: 128, elements: !621)
!620 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!621 = !{!622, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !619, file: !620, line: 8, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !178, line: 93, baseType: !228)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !619, file: !620, line: 9, baseType: !228, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !615, file: !12, line: 43, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !628, line: 7, size: 64, elements: !629)
!628 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!629 = !{!630, !634}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !627, file: !628, line: 8, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !628, line: 5, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !265, line: 20, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !267, line: 26, baseType: !60)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !627, file: !628, line: 9, baseType: !632, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !610, file: !12, line: 45, baseType: !264, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !597, file: !12, line: 54, baseType: !637, size: 256)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !12, line: 48, size: 256, elements: !638)
!638 = !{!639, !642, !643, !644, !645}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !637, file: !12, line: 49, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !637, file: !12, line: 50, baseType: !60, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !637, file: !12, line: 51, baseType: !60, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !637, file: !12, line: 52, baseType: !195, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !637, file: !12, line: 53, baseType: !195, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !393, file: !394, line: 835, baseType: !647, size: 32, offset: 5120)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !59, line: 22, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !178, line: 28, baseType: !60)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !393, file: !394, line: 836, baseType: !647, size: 32, offset: 5152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !393, file: !394, line: 840, baseType: !195, size: 64, offset: 5184)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !393, file: !394, line: 849, baseType: !392, size: 64, offset: 5248)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !393, file: !394, line: 852, baseType: !392, size: 64, offset: 5312)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !393, file: !394, line: 857, baseType: !92, size: 128, offset: 5376)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !393, file: !394, line: 858, baseType: !92, size: 128, offset: 5504)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !393, file: !394, line: 859, baseType: !392, size: 64, offset: 5632)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !393, file: !394, line: 867, baseType: !92, size: 128, offset: 5696)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !393, file: !394, line: 868, baseType: !92, size: 128, offset: 5824)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !393, file: !394, line: 871, baseType: !659, size: 64, offset: 5952)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !661, line: 59, size: 768, elements: !662)
!661 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!662 = !{!663, !664, !665, !666, !677, !678, !685, !694}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !660, file: !661, line: 61, baseType: !408, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !660, file: !661, line: 62, baseType: !7, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !660, file: !661, line: 63, baseType: !105, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !660, file: !661, line: 65, baseType: !667, size: 256, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 256, elements: !345)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !59, line: 182, size: 64, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !668, file: !59, line: 183, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !59, line: 186, size: 128, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !672, file: !59, line: 187, baseType: !671, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !672, file: !59, line: 187, baseType: !676, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !660, file: !661, line: 66, baseType: !668, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !660, file: !661, line: 68, baseType: !679, size: 128, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !680, line: 40, baseType: !681)
!680 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !680, line: 36, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !681, file: !680, line: 37, baseType: !105)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !681, file: !680, line: 38, baseType: !92, size: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !660, file: !661, line: 69, baseType: !686, size: 128, align: 64, offset: 512)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !59, line: 216, size: 128, align: 64, elements: !687)
!687 = !{!688, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !59, line: 217, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !686, file: !59, line: 218, baseType: !691, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !689}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !660, file: !661, line: 70, baseType: !695, size: 128, offset: 640)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 128, elements: !559)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !661, line: 54, size: 128, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !696, file: !661, line: 55, baseType: !60, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !696, file: !661, line: 56, baseType: !700, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !661, line: 56, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !393, file: !394, line: 872, baseType: !703, size: 512, offset: 6016)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 512, elements: !345)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !393, file: !394, line: 873, baseType: !92, size: 128, offset: 6528)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !393, file: !394, line: 874, baseType: !92, size: 128, offset: 6656)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !393, file: !394, line: 876, baseType: !707, size: 64, offset: 6784)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !709, line: 26, size: 192, elements: !710)
!709 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !708, file: !709, line: 27, baseType: !7, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !708, file: !709, line: 28, baseType: !713, size: 128, offset: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !714, line: 43, size: 128, elements: !715)
!714 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !713, file: !714, line: 44, baseType: !311)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !713, file: !714, line: 45, baseType: !92, size: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !393, file: !394, line: 879, baseType: !719, size: 64, offset: 6848)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !393, file: !394, line: 882, baseType: !719, size: 64, offset: 6912)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !393, file: !394, line: 884, baseType: !264, size: 64, offset: 6976)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !393, file: !394, line: 885, baseType: !264, size: 64, offset: 7040)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !393, file: !394, line: 890, baseType: !264, size: 64, offset: 7104)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !393, file: !394, line: 891, baseType: !725, size: 128, offset: 7168)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !394, line: 242, size: 128, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !725, file: !394, line: 244, baseType: !264, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !725, file: !394, line: 245, baseType: !264, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !725, file: !394, line: 246, baseType: !311, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !393, file: !394, line: 900, baseType: !195, size: 64, offset: 7296)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !393, file: !394, line: 901, baseType: !195, size: 64, offset: 7360)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !393, file: !394, line: 904, baseType: !264, size: 64, offset: 7424)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !393, file: !394, line: 907, baseType: !264, size: 64, offset: 7488)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !393, file: !394, line: 910, baseType: !195, size: 64, offset: 7552)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !393, file: !394, line: 911, baseType: !195, size: 64, offset: 7616)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !393, file: !394, line: 914, baseType: !737, size: 640, offset: 7680)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !738, line: 123, size: 640, elements: !739)
!738 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!739 = !{!740, !746, !747}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !737, file: !738, line: 124, baseType: !741, size: 576)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 576, elements: !146)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !738, line: 108, size: 192, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !742, file: !738, line: 109, baseType: !264, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !742, file: !738, line: 110, baseType: !526, size: 128, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !737, file: !738, line: 125, baseType: !7, size: 32, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !737, file: !738, line: 126, baseType: !7, size: 32, offset: 608)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !393, file: !394, line: 917, baseType: !749, size: 192, offset: 8320)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !738, line: 134, size: 192, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !749, file: !738, line: 135, baseType: !686, size: 128, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !749, file: !738, line: 136, baseType: !7, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !393, file: !394, line: 923, baseType: !754, size: 64, offset: 8512)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !394, line: 923, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !393, file: !394, line: 926, baseType: !754, size: 64, offset: 8576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !393, file: !394, line: 929, baseType: !754, size: 64, offset: 8640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !393, file: !394, line: 933, baseType: !760, size: 64, offset: 8704)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !394, line: 933, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !393, file: !394, line: 943, baseType: !763, size: 128, offset: 8768)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !393, file: !394, line: 945, baseType: !767, size: 64, offset: 8896)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !394, line: 49, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !393, file: !394, line: 956, baseType: !770, size: 64, offset: 8960)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !394, line: 45, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !393, file: !394, line: 959, baseType: !773, size: 64, offset: 9024)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !394, line: 959, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !393, file: !394, line: 962, baseType: !776, size: 64, offset: 9088)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !394, line: 66, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !393, file: !394, line: 966, baseType: !779, size: 64, offset: 9152)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !394, line: 50, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !393, file: !394, line: 969, baseType: !782, size: 64, offset: 9216)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !738, line: 223, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !393, file: !394, line: 970, baseType: !785, size: 64, offset: 9280)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !394, line: 62, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !393, file: !394, line: 971, baseType: !788, size: 64, offset: 9344)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !789, line: 25, baseType: !790)
!789 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !789, line: 23, size: 64, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !790, file: !789, line: 24, baseType: !558, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !393, file: !394, line: 972, baseType: !788, size: 64, offset: 9408)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !393, file: !394, line: 974, baseType: !788, size: 64, offset: 9472)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !393, file: !394, line: 975, baseType: !796, size: 192, offset: 9536)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !797, line: 30, size: 192, elements: !798)
!797 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !796, file: !797, line: 31, baseType: !92, size: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !796, file: !797, line: 32, baseType: !788, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !393, file: !394, line: 976, baseType: !195, size: 64, offset: 9728)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !393, file: !394, line: 977, baseType: !192, size: 64, offset: 9792)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !393, file: !394, line: 978, baseType: !7, size: 32, offset: 9856)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !393, file: !394, line: 980, baseType: !689, size: 64, offset: 9920)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !393, file: !394, line: 989, baseType: !806, size: 128, offset: 9984)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !807, line: 35, size: 128, elements: !808)
!807 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !806, file: !807, line: 36, baseType: !60, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !806, file: !807, line: 37, baseType: !286, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !806, file: !807, line: 38, baseType: !812, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !807, line: 23, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !393, file: !394, line: 992, baseType: !264, size: 64, offset: 10112)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !393, file: !394, line: 993, baseType: !264, size: 64, offset: 10176)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !393, file: !394, line: 996, baseType: !105, offset: 10240)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !393, file: !394, line: 999, baseType: !311, offset: 10240)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !393, file: !394, line: 1001, baseType: !819, size: 64, offset: 10240)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !394, line: 636, size: 64, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !819, file: !394, line: 637, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !393, file: !394, line: 1005, baseType: !529, size: 128, offset: 10304)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !393, file: !394, line: 1007, baseType: !392, size: 64, offset: 10432)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !393, file: !394, line: 1009, baseType: !826, size: 64, offset: 10496)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !394, line: 1009, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !393, file: !394, line: 1043, baseType: !61, size: 64, offset: 10560)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !393, file: !394, line: 1046, baseType: !830, size: 64, offset: 10624)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !394, line: 41, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !393, file: !394, line: 1050, baseType: !833, size: 64, offset: 10688)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !394, line: 42, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !393, file: !394, line: 1054, baseType: !836, size: 64, offset: 10752)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !394, line: 55, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !393, file: !394, line: 1056, baseType: !839, size: 64, offset: 10816)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !394, line: 40, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !393, file: !394, line: 1058, baseType: !842, size: 64, offset: 10880)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !394, line: 47, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !393, file: !394, line: 1061, baseType: !845, size: 64, offset: 10944)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !394, line: 43, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !393, file: !394, line: 1064, baseType: !195, size: 64, offset: 11008)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !393, file: !394, line: 1065, baseType: !849, size: 64, offset: 11072)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !797, line: 14, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !797, line: 12, size: 384, elements: !852)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, scope: !851, file: !797, line: 13, baseType: !854, size: 384)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !851, file: !797, line: 13, size: 384, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !854, file: !797, line: 13, baseType: !60, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !854, file: !797, line: 13, baseType: !60, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !854, file: !797, line: 13, baseType: !60, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !854, file: !797, line: 13, baseType: !860, size: 256, offset: 128)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !861, line: 32, size: 256, elements: !862)
!861 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!862 = !{!863, !869, !882, !888, !897, !917, !922}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !860, file: !861, line: 37, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 34, size: 64, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !864, file: !861, line: 35, baseType: !648, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !864, file: !861, line: 36, baseType: !868, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !178, line: 49, baseType: !7)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !860, file: !861, line: 45, baseType: !870, size: 192)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 40, size: 192, elements: !871)
!871 = !{!872, !874, !875, !881}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !870, file: !861, line: 41, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !178, line: 95, baseType: !60)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !870, file: !861, line: 42, baseType: !60, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !870, file: !861, line: 43, baseType: !876, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !861, line: 11, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !861, line: 8, size: 64, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !877, file: !861, line: 9, baseType: !60, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !877, file: !861, line: 10, baseType: !61, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !870, file: !861, line: 44, baseType: !60, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !860, file: !861, line: 52, baseType: !883, size: 128)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 48, size: 128, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !883, file: !861, line: 49, baseType: !648, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !883, file: !861, line: 50, baseType: !868, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !883, file: !861, line: 51, baseType: !876, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !860, file: !861, line: 61, baseType: !889, size: 256)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 55, size: 256, elements: !890)
!890 = !{!891, !892, !893, !894, !896}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !889, file: !861, line: 56, baseType: !648, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !889, file: !861, line: 57, baseType: !868, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !889, file: !861, line: 58, baseType: !60, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !889, file: !861, line: 59, baseType: !895, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !178, line: 94, baseType: !179)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !889, file: !861, line: 60, baseType: !895, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !860, file: !861, line: 95, baseType: !898, size: 256)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 64, size: 256, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !898, file: !861, line: 65, baseType: !61, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, scope: !898, file: !861, line: 77, baseType: !902, size: 192, offset: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !898, file: !861, line: 77, size: 192, elements: !903)
!903 = !{!904, !905, !912}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !902, file: !861, line: 82, baseType: !381, size: 16)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !902, file: !861, line: 88, baseType: !906, size: 192)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !902, file: !861, line: 84, size: 192, elements: !907)
!907 = !{!908, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !906, file: !861, line: 85, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !508)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !906, file: !861, line: 86, baseType: !61, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !906, file: !861, line: 87, baseType: !61, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !902, file: !861, line: 93, baseType: !913, size: 96)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !902, file: !861, line: 90, size: 96, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !913, file: !861, line: 91, baseType: !909, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !913, file: !861, line: 92, baseType: !403, size: 32, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !860, file: !861, line: 101, baseType: !918, size: 128)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 98, size: 128, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !918, file: !861, line: 99, baseType: !180, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !918, file: !861, line: 100, baseType: !60, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !860, file: !861, line: 108, baseType: !923, size: 128)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !861, line: 104, size: 128, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !923, file: !861, line: 105, baseType: !61, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !923, file: !861, line: 106, baseType: !60, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !923, file: !861, line: 107, baseType: !7, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ioac", scope: !393, file: !394, line: 1067, baseType: !929, offset: 11136)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_io_accounting", file: !930, line: 12, elements: !119)
!930 = !DIFile(filename: "./include/linux/task_io_accounting.h", directory: "/home/lizy2001/genbc/linux")
!931 = !DIDerivedType(tag: DW_TAG_member, name: "robust_list", scope: !393, file: !394, line: 1099, baseType: !932, size: 64, offset: 11136)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "robust_list_head", file: !394, line: 56, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_list", scope: !393, file: !394, line: 1103, baseType: !92, size: 128, offset: 11200)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_cache", scope: !393, file: !394, line: 1104, baseType: !936, size: 64, offset: 11328)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "futex_pi_state", file: !394, line: 46, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "futex_exit_mutex", scope: !393, file: !394, line: 1105, baseType: !363, size: 192, offset: 11392)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "futex_state", scope: !393, file: !394, line: 1106, baseType: !7, size: 32, offset: 11584)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_ctxp", scope: !393, file: !394, line: 1109, baseType: !941, size: 128, offset: 11648)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 128, elements: !944)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_context", file: !394, line: 51, flags: DIFlagFwdDecl)
!944 = !{!945}
!945 = !DISubrange(count: 2)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_mutex", scope: !393, file: !394, line: 1110, baseType: !363, size: 192, offset: 11776)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_list", scope: !393, file: !394, line: 1111, baseType: !92, size: 128, offset: 11968)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rseq", scope: !393, file: !394, line: 1173, baseType: !949, size: 64, offset: 12096)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rseq", file: !951, line: 62, size: 256, align: 256, elements: !952)
!951 = !DIFile(filename: "./include/uapi/linux/rseq.h", directory: "/home/lizy2001/genbc/linux")
!952 = !{!953, !954, !955, !960}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id_start", scope: !950, file: !951, line: 75, baseType: !403, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id", scope: !950, file: !951, line: 90, baseType: !403, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rseq_cs", scope: !950, file: !951, line: 124, baseType: !956, size: 64, offset: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !950, file: !951, line: 109, size: 64, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ptr64", scope: !956, file: !951, line: 110, baseType: !266, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !956, file: !951, line: 112, baseType: !266, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !951, line: 144, baseType: !403, size: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rseq_sig", scope: !393, file: !394, line: 1174, baseType: !402, size: 32, offset: 12160)
