; ModuleID = '../bcout/drivers/input/input-compat.llvm.bc'
source_filename = "drivers/input/input-compat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.input_event = type { i64, i64, i16, i16, i32 }
%struct.ff_effect = type { i16, i16, i16, %struct.ff_trigger, %struct.ff_replay, %union.anon }
%struct.ff_trigger = type { i16, i16 }
%struct.ff_replay = type { i16, i16 }
%union.anon = type { %struct.ff_periodic_effect }
%struct.ff_periodic_effect = type { i16, i16, i16, i16, i16, %struct.ff_envelope, i32, i16* }
%struct.ff_envelope = type { i16, i16, i16, i16 }

@.str = private unnamed_addr constant [28 x i8] c"include/linux/thread_info.h\00", align 1
@.str.1 = private unnamed_addr constant [38 x i8] c"Buffer overflow detected (%d < %lu)!\0A\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @input_event_from_user(i8* %buffer, %struct.input_event* %event) #0 !dbg !16 {
entry:
  %retval.i.i = alloca i1, align 1
  %addr.addr.i.i = alloca i8*, align 8
  call void @llvm.dbg.declare(metadata i8** %addr.addr.i.i, metadata !39, metadata !DIExpression()), !dbg !51
  %bytes.addr.i.i = alloca i64, align 8
  call void @llvm.dbg.declare(metadata i64* %bytes.addr.i.i, metadata !61, metadata !DIExpression()), !dbg !62
  %is_source.addr.i.i = alloca i8, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/input/input-compat.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 10, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!9 = !{!10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !{i32 7, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 1, !"wchar_size", i32 2}
!14 = !{i32 1, !"Code Model", i32 2}
!15 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!16 = distinct !DISubprogram(name: "input_event_from_user", scope: !1, file: !1, line: 99, type: !17, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !38)
!17 = !DISubroutineType(types: !18)
!18 = !{!10, !19, !22}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_event", file: !24, line: 28, size: 192, elements: !25)
!24 = !DIFile(filename: "./include/uapi/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !30, !31, !35, !36}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__sec", scope: !23, file: !24, line: 34, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !28, line: 16, baseType: !29)
!28 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__usec", scope: !23, file: !24, line: 39, baseType: !27, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, file: !24, line: 44, baseType: !32, size: 16, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !33, line: 24, baseType: !34)
!33 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !23, file: !24, line: 45, baseType: !32, size: 16, offset: 144)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !23, file: !24, line: 46, baseType: !37, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !33, line: 26, baseType: !10)
!38 = !{}
!39 = !DILocalVariable(name: "addr", arg: 1, scope: !40, file: !41, line: 138, type: !47)
!40 = distinct !DISubprogram(name: "check_copy_size", scope: !41, file: !41, line: 138, type: !42, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !38)
!41 = !DIFile(filename: "./include/linux/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !47, !49, !44}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !45, line: 30, baseType: !46)
!45 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!46 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 55, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !28, line: 72, baseType: !27)
!51 = !DILocation(line: 138, column: 29, scope: !40, inlinedAt: !52)
!52 = distinct !DILocation(line: 191, column: 6, scope: !53, inlinedAt: !59)
!53 = distinct !DILexicalBlock(scope: !55, file: !54, line: 191, column: 6)
!54 = !DIFile(filename: "./include/linux/uaccess.h", directory: "/home/lizy2001/genbc/linux")
!55 = distinct !DISubprogram(name: "copy_from_user", scope: !54, file: !54, line: 189, type: !56, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !38)
!56 = !DISubroutineType(types: !57)
!57 = !{!29, !58, !47, !29}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = distinct !DILocation(line: 102, column: 6, scope: !60)
!60 = distinct !DILexicalBlock(scope: !16, file: !1, line: 102, column: 6)
!61 = !DILocalVariable(name: "bytes", arg: 2, scope: !40, file: !41, line: 138, type: !49)
!62 = !DILocation(line: 138, column: 42, scope: !40, inlinedAt: !52)
!63 = !DILocalVariable(name: "is_source", arg: 3, scope: !40, file: !41, line: 138, type: !44)
!64 = !DILocation(line: 138, column: 54, scope: !40, inlinedAt: !52)
!65 = !DILocalVariable(name: "sz", scope: !40, file: !41, line: 140, type: !10)
!66 = !DILocation(line: 140, column: 6, scope: !40, inlinedAt: !52)
!67 = !DILocalVariable(name: "__ret_warn_on", scope: !68, file: !41, line: 150, type: !10)
!68 = distinct !DILexicalBlock(scope: !69, file: !41, line: 150, column: 6)
!69 = distinct !DILexicalBlock(scope: !40, file: !41, line: 150, column: 6)
!70 = !DILocation(line: 150, column: 6, scope: !68, inlinedAt: !52)
!71 = !DILocalVariable(name: "to", arg: 1, scope: !55, file: !54, line: 189, type: !58)
!72 = !DILocation(line: 189, column: 22, scope: !55, inlinedAt: !59)
!73 = !DILocalVariable(name: "from", arg: 2, scope: !55, file: !54, line: 189, type: !47)
!74 = !DILocation(line: 189, column: 45, scope: !55, inlinedAt: !59)
!75 = !DILocalVariable(name: "n", arg: 3, scope: !55, file: !54, line: 189, type: !29)
!76 = !DILocation(line: 189, column: 65, scope: !55, inlinedAt: !59)
!77 = !DILocalVariable(name: "buffer", arg: 1, scope: !16, file: !1, line: 99, type: !19)
!78 = !DILocation(line: 99, column: 46, scope: !16)
!79 = !DILocalVariable(name: "event", arg: 2, scope: !16, file: !1, line: 100, type: !22)
!80 = !DILocation(line: 100, column: 25, scope: !16)
!81 = !DILocation(line: 102, column: 21, scope: !60)
!82 = !DILocation(line: 102, column: 28, scope: !60)
!83 = !DILocation(line: 191, column: 6, scope: !53, inlinedAt: !59)
!84 = !DILocation(line: 141, column: 6, scope: !85, inlinedAt: !52)
!85 = distinct !DILexicalBlock(scope: !40, file: !41, line: 141, column: 6)
!86 = !DILocation(line: 0, scope: !85, inlinedAt: !52)
!87 = !DILocation(line: 141, column: 6, scope: !40, inlinedAt: !52)
!88 = !DILocation(line: 142, column: 29, scope: !89, inlinedAt: !52)
!89 = distinct !DILexicalBlock(scope: !90, file: !41, line: 142, column: 7)
!90 = distinct !DILexicalBlock(scope: !85, file: !41, line: 141, column: 39)
!91 = !DILocation(line: 142, column: 8, scope: !89, inlinedAt: !52)
!92 = !DILocation(line: 142, column: 7, scope: !90, inlinedAt: !52)
!93 = !DILocation(line: 143, column: 18, scope: !89, inlinedAt: !52)
!94 = !DILocation(line: 143, column: 22, scope: !89, inlinedAt: !52)
!95 = !DILocation(line: 143, column: 4, scope: !89, inlinedAt: !52)
!96 = !DILocation(line: 144, column: 12, scope: !97, inlinedAt: !52)
!97 = distinct !DILexicalBlock(scope: !89, file: !41, line: 144, column: 12)
!98 = !DILocation(line: 144, column: 12, scope: !89, inlinedAt: !52)
!99 = !DILocation(line: 145, column: 4, scope: !97, inlinedAt: !52)
!100 = !DILocation(line: 147, column: 4, scope: !97, inlinedAt: !52)
!101 = !DILocation(line: 148, column: 3, scope: !90, inlinedAt: !52)
!102 = !DILocation(line: 150, column: 6, scope: !103, inlinedAt: !52)
!103 = distinct !DILexicalBlock(scope: !68, file: !41, line: 150, column: 6)
!104 = !DILocation(line: 150, column: 6, scope: !105, inlinedAt: !52)
!105 = distinct !DILexicalBlock(scope: !106, file: !41, line: 150, column: 6)
!106 = distinct !DILexicalBlock(scope: !103, file: !41, line: 150, column: 6)
!107 = !{i32 -2145569792, i32 -2145569763, i32 -2145569717, i32 -2145569659, i32 -2145569605, i32 -2145569551, i32 -2145569496, i32 -2145569465}
!108 = !DILocation(line: 150, column: 6, scope: !109, inlinedAt: !52)
!109 = distinct !DILexicalBlock(scope: !106, file: !41, line: 150, column: 6)
!110 = !{i32 -2145569045, i32 -2145569038, i32 -2145568986, i32 -2145568955, i32 -2145568925}
!111 = !DILocation(line: 150, column: 6, scope: !106, inlinedAt: !52)
!112 = !DILocation(line: 150, column: 6, scope: !69, inlinedAt: !52)
!113 = !DILocation(line: 150, column: 6, scope: !40, inlinedAt: !52)
!114 = !DILocation(line: 151, column: 3, scope: !69, inlinedAt: !52)
!115 = !DILocation(line: 152, column: 20, scope: !40, inlinedAt: !52)
!116 = !DILocation(line: 152, column: 26, scope: !40, inlinedAt: !52)
!117 = !DILocation(line: 152, column: 33, scope: !40, inlinedAt: !52)
!118 = !DILocation(line: 152, column: 2, scope: !40, inlinedAt: !52)
!119 = !DILocation(line: 153, column: 2, scope: !40, inlinedAt: !52)
!120 = !DILocation(line: 154, column: 1, scope: !40, inlinedAt: !52)
!121 = !DILocation(line: 191, column: 6, scope: !55, inlinedAt: !59)
!122 = !DILocation(line: 192, column: 23, scope: !53, inlinedAt: !59)
!123 = !DILocation(line: 192, column: 27, scope: !53, inlinedAt: !59)
!124 = !DILocation(line: 192, column: 33, scope: !53, inlinedAt: !59)
!125 = !DILocation(line: 192, column: 7, scope: !53, inlinedAt: !59)
!126 = !DILocation(line: 192, column: 5, scope: !53, inlinedAt: !59)
!127 = !DILocation(line: 192, column: 3, scope: !53, inlinedAt: !59)
!128 = !DILocation(line: 193, column: 9, scope: !55, inlinedAt: !59)
!129 = !DILocation(line: 102, column: 6, scope: !60)
!130 = !DILocation(line: 102, column: 6, scope: !16)
!131 = !DILocation(line: 103, column: 3, scope: !60)
!132 = !DILocation(line: 105, column: 2, scope: !16)
!133 = !DILocation(line: 106, column: 1, scope: !16)
!134 = distinct !DISubprogram(name: "input_event_to_user", scope: !1, file: !1, line: 108, type: !135, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !38)
!135 = !DISubroutineType(types: !136)
!136 = !{!10, !137, !138}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!140 = !DILocation(line: 138, column: 29, scope: !40, inlinedAt: !141)
!141 = distinct !DILocation(line: 199, column: 6, scope: !142, inlinedAt: !144)
!142 = distinct !DILexicalBlock(scope: !143, file: !54, line: 199, column: 6)
!143 = distinct !DISubprogram(name: "copy_to_user", scope: !54, file: !54, line: 197, type: !56, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !38)
!144 = distinct !DILocation(line: 111, column: 6, scope: !145)
!145 = distinct !DILexicalBlock(scope: !134, file: !1, line: 111, column: 6)
!146 = !DILocation(line: 138, column: 42, scope: !40, inlinedAt: !141)
!147 = !DILocation(line: 138, column: 54, scope: !40, inlinedAt: !141)
!148 = !DILocation(line: 140, column: 6, scope: !40, inlinedAt: !141)
!149 = !DILocation(line: 150, column: 6, scope: !68, inlinedAt: !141)
!150 = !DILocalVariable(name: "to", arg: 1, scope: !143, file: !54, line: 197, type: !58)
!151 = !DILocation(line: 197, column: 27, scope: !143, inlinedAt: !144)
!152 = !DILocalVariable(name: "from", arg: 2, scope: !143, file: !54, line: 197, type: !47)
!153 = !DILocation(line: 197, column: 43, scope: !143, inlinedAt: !144)
!154 = !DILocalVariable(name: "n", arg: 3, scope: !143, file: !54, line: 197, type: !29)
!155 = !DILocation(line: 197, column: 63, scope: !143, inlinedAt: !144)
!156 = !DILocalVariable(name: "buffer", arg: 1, scope: !134, file: !1, line: 108, type: !137)
!157 = !DILocation(line: 108, column: 38, scope: !134)
!158 = !DILocalVariable(name: "event", arg: 2, scope: !134, file: !1, line: 109, type: !138)
!159 = !DILocation(line: 109, column: 30, scope: !134)
!160 = !DILocation(line: 111, column: 19, scope: !145)
!161 = !DILocation(line: 111, column: 27, scope: !145)
!162 = !DILocation(line: 199, column: 6, scope: !142, inlinedAt: !144)
!163 = !DILocation(line: 141, column: 6, scope: !85, inlinedAt: !141)
!164 = !DILocation(line: 0, scope: !85, inlinedAt: !141)
!165 = !DILocation(line: 141, column: 6, scope: !40, inlinedAt: !141)
!166 = !DILocation(line: 142, column: 29, scope: !89, inlinedAt: !141)
!167 = !DILocation(line: 142, column: 8, scope: !89, inlinedAt: !141)
!168 = !DILocation(line: 142, column: 7, scope: !90, inlinedAt: !141)
!169 = !DILocation(line: 143, column: 18, scope: !89, inlinedAt: !141)
!170 = !DILocation(line: 143, column: 22, scope: !89, inlinedAt: !141)
!171 = !DILocation(line: 143, column: 4, scope: !89, inlinedAt: !141)
!172 = !DILocation(line: 144, column: 12, scope: !97, inlinedAt: !141)
!173 = !DILocation(line: 144, column: 12, scope: !89, inlinedAt: !141)
!174 = !DILocation(line: 145, column: 4, scope: !97, inlinedAt: !141)
!175 = !DILocation(line: 147, column: 4, scope: !97, inlinedAt: !141)
!176 = !DILocation(line: 148, column: 3, scope: !90, inlinedAt: !141)
!177 = !DILocation(line: 150, column: 6, scope: !103, inlinedAt: !141)
!178 = !DILocation(line: 150, column: 6, scope: !105, inlinedAt: !141)
!179 = !DILocation(line: 150, column: 6, scope: !109, inlinedAt: !141)
!180 = !DILocation(line: 150, column: 6, scope: !106, inlinedAt: !141)
!181 = !DILocation(line: 150, column: 6, scope: !69, inlinedAt: !141)
!182 = !DILocation(line: 150, column: 6, scope: !40, inlinedAt: !141)
!183 = !DILocation(line: 151, column: 3, scope: !69, inlinedAt: !141)
!184 = !DILocation(line: 152, column: 20, scope: !40, inlinedAt: !141)
!185 = !DILocation(line: 152, column: 26, scope: !40, inlinedAt: !141)
!186 = !DILocation(line: 152, column: 33, scope: !40, inlinedAt: !141)
!187 = !DILocation(line: 152, column: 2, scope: !40, inlinedAt: !141)
!188 = !DILocation(line: 153, column: 2, scope: !40, inlinedAt: !141)
!189 = !DILocation(line: 154, column: 1, scope: !40, inlinedAt: !141)
!190 = !DILocation(line: 199, column: 6, scope: !143, inlinedAt: !144)
!191 = !DILocation(line: 200, column: 21, scope: !142, inlinedAt: !144)
!192 = !DILocation(line: 200, column: 25, scope: !142, inlinedAt: !144)
!193 = !DILocation(line: 200, column: 31, scope: !142, inlinedAt: !144)
!194 = !DILocation(line: 200, column: 7, scope: !142, inlinedAt: !144)
!195 = !DILocation(line: 200, column: 5, scope: !142, inlinedAt: !144)
!196 = !DILocation(line: 200, column: 3, scope: !142, inlinedAt: !144)
!197 = !DILocation(line: 201, column: 9, scope: !143, inlinedAt: !144)
!198 = !DILocation(line: 111, column: 6, scope: !145)
!199 = !DILocation(line: 111, column: 6, scope: !134)
!200 = !DILocation(line: 112, column: 3, scope: !145)
!201 = !DILocation(line: 114, column: 2, scope: !134)
!202 = !DILocation(line: 115, column: 1, scope: !134)
!203 = distinct !DISubprogram(name: "input_ff_effect_from_user", scope: !1, file: !1, line: 117, type: !204, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !38)
!204 = !DISubroutineType(types: !205)
!205 = !{!10, !19, !49, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_effect", file: !24, line: 450, size: 384, elements: !208)
!208 = !{!209, !210, !213, !214, !219, !224}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !24, line: 451, baseType: !32, size: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !207, file: !24, line: 452, baseType: !211, size: 16, offset: 16)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !33, line: 23, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !207, file: !24, line: 453, baseType: !32, size: 16, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !207, file: !24, line: 454, baseType: !215, size: 32, offset: 48)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_trigger", file: !24, line: 316, size: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !215, file: !24, line: 317, baseType: !32, size: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !215, file: !24, line: 318, baseType: !32, size: 16, offset: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !207, file: !24, line: 455, baseType: !220, size: 32, offset: 80)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_replay", file: !24, line: 306, size: 32, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !220, file: !24, line: 307, baseType: !32, size: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !220, file: !24, line: 308, baseType: !32, size: 16, offset: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !207, file: !24, line: 463, baseType: !225, size: 256, offset: 128)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !207, file: !24, line: 457, size: 256, elements: !226)
!226 = !{!227, !238, !244, !257, !269}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !225, file: !24, line: 458, baseType: !228, size: 80)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_constant_effect", file: !24, line: 345, size: 80, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !228, file: !24, line: 346, baseType: !211, size: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !228, file: !24, line: 347, baseType: !232, size: 64, offset: 16)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_envelope", file: !24, line: 333, size: 64, elements: !233)
!233 = !{!234, !235, !236, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "attack_length", scope: !232, file: !24, line: 334, baseType: !32, size: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "attack_level", scope: !232, file: !24, line: 335, baseType: !32, size: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fade_length", scope: !232, file: !24, line: 336, baseType: !32, size: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fade_level", scope: !232, file: !24, line: 337, baseType: !32, size: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ramp", scope: !225, file: !24, line: 459, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_ramp_effect", file: !24, line: 356, size: 96, elements: !240)
!240 = !{!241, !242, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "start_level", scope: !239, file: !24, line: 357, baseType: !211, size: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "end_level", scope: !239, file: !24, line: 358, baseType: !211, size: 16, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !239, file: !24, line: 359, baseType: !232, size: 64, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !225, file: !24, line: 460, baseType: !245, size: 256)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_periodic_effect", file: !24, line: 401, size: 256, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !255}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !245, file: !24, line: 402, baseType: !32, size: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !245, file: !24, line: 403, baseType: !32, size: 16, offset: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !245, file: !24, line: 404, baseType: !211, size: 16, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !245, file: !24, line: 405, baseType: !211, size: 16, offset: 48)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !245, file: !24, line: 406, baseType: !32, size: 16, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !245, file: !24, line: 408, baseType: !232, size: 64, offset: 80)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "custom_len", scope: !245, file: !24, line: 410, baseType: !254, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !33, line: 27, baseType: !5)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !245, file: !24, line: 411, baseType: !256, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !225, file: !24, line: 461, baseType: !258, size: 192)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 192, elements: !267)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_condition_effect", file: !24, line: 372, size: 96, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "right_saturation", scope: !259, file: !24, line: 373, baseType: !32, size: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "left_saturation", scope: !259, file: !24, line: 374, baseType: !32, size: 16, offset: 16)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "right_coeff", scope: !259, file: !24, line: 376, baseType: !211, size: 16, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "left_coeff", scope: !259, file: !24, line: 377, baseType: !211, size: 16, offset: 48)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "deadband", scope: !259, file: !24, line: 379, baseType: !32, size: 16, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !259, file: !24, line: 380, baseType: !211, size: 16, offset: 80)
!267 = !{!268}
!268 = !DISubrange(count: 2)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rumble", scope: !225, file: !24, line: 462, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_rumble_effect", file: !24, line: 422, size: 32, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "strong_magnitude", scope: !270, file: !24, line: 423, baseType: !32, size: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "weak_magnitude", scope: !270, file: !24, line: 424, baseType: !32, size: 16, offset: 16)
!274 = !DILocation(line: 138, column: 29, scope: !40, inlinedAt: !275)
!275 = distinct !DILocation(line: 191, column: 6, scope: !53, inlinedAt: !276)
!276 = distinct !DILocation(line: 123, column: 6, scope: !277)
!277 = distinct !DILexicalBlock(scope: !203, file: !1, line: 123, column: 6)
!278 = !DILocation(line: 138, column: 42, scope: !40, inlinedAt: !275)
!279 = !DILocation(line: 138, column: 54, scope: !40, inlinedAt: !275)
!280 = !DILocation(line: 140, column: 6, scope: !40, inlinedAt: !275)
!281 = !DILocation(line: 150, column: 6, scope: !68, inlinedAt: !275)
!282 = !DILocation(line: 189, column: 22, scope: !55, inlinedAt: !276)
!283 = !DILocation(line: 189, column: 45, scope: !55, inlinedAt: !276)
!284 = !DILocation(line: 189, column: 65, scope: !55, inlinedAt: !276)
!285 = !DILocalVariable(name: "buffer", arg: 1, scope: !203, file: !1, line: 117, type: !19)
!286 = !DILocation(line: 117, column: 50, scope: !203)
!287 = !DILocalVariable(name: "size", arg: 2, scope: !203, file: !1, line: 117, type: !49)
!288 = !DILocation(line: 117, column: 65, scope: !203)
!289 = !DILocalVariable(name: "effect", arg: 3, scope: !203, file: !1, line: 118, type: !206)
!290 = !DILocation(line: 118, column: 28, scope: !203)
!291 = !DILocation(line: 120, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !203, file: !1, line: 120, column: 6)
!293 = !DILocation(line: 120, column: 11, scope: !292)
!294 = !DILocation(line: 120, column: 6, scope: !203)
!295 = !DILocation(line: 121, column: 3, scope: !292)
!296 = !DILocation(line: 123, column: 21, scope: !277)
!297 = !DILocation(line: 123, column: 29, scope: !277)
!298 = !DILocation(line: 191, column: 6, scope: !53, inlinedAt: !276)
!299 = !DILocation(line: 141, column: 6, scope: !85, inlinedAt: !275)
!300 = !DILocation(line: 0, scope: !85, inlinedAt: !275)
!301 = !DILocation(line: 141, column: 6, scope: !40, inlinedAt: !275)
!302 = !DILocation(line: 142, column: 29, scope: !89, inlinedAt: !275)
!303 = !DILocation(line: 142, column: 8, scope: !89, inlinedAt: !275)
!304 = !DILocation(line: 142, column: 7, scope: !90, inlinedAt: !275)
!305 = !DILocation(line: 143, column: 18, scope: !89, inlinedAt: !275)
!306 = !DILocation(line: 143, column: 22, scope: !89, inlinedAt: !275)
!307 = !DILocation(line: 143, column: 4, scope: !89, inlinedAt: !275)
!308 = !DILocation(line: 144, column: 12, scope: !97, inlinedAt: !275)
!309 = !DILocation(line: 144, column: 12, scope: !89, inlinedAt: !275)
!310 = !DILocation(line: 145, column: 4, scope: !97, inlinedAt: !275)
!311 = !DILocation(line: 147, column: 4, scope: !97, inlinedAt: !275)
!312 = !DILocation(line: 148, column: 3, scope: !90, inlinedAt: !275)
!313 = !DILocation(line: 150, column: 6, scope: !103, inlinedAt: !275)
!314 = !DILocation(line: 150, column: 6, scope: !105, inlinedAt: !275)
!315 = !DILocation(line: 150, column: 6, scope: !109, inlinedAt: !275)
!316 = !DILocation(line: 150, column: 6, scope: !106, inlinedAt: !275)
!317 = !DILocation(line: 150, column: 6, scope: !69, inlinedAt: !275)
!318 = !DILocation(line: 150, column: 6, scope: !40, inlinedAt: !275)
!319 = !DILocation(line: 151, column: 3, scope: !69, inlinedAt: !275)
!320 = !DILocation(line: 152, column: 20, scope: !40, inlinedAt: !275)
!321 = !DILocation(line: 152, column: 26, scope: !40, inlinedAt: !275)
!322 = !DILocation(line: 152, column: 33, scope: !40, inlinedAt: !275)
!323 = !DILocation(line: 152, column: 2, scope: !40, inlinedAt: !275)
!324 = !DILocation(line: 153, column: 2, scope: !40, inlinedAt: !275)
!325 = !DILocation(line: 154, column: 1, scope: !40, inlinedAt: !275)
!326 = !DILocation(line: 191, column: 6, scope: !55, inlinedAt: !276)
!327 = !DILocation(line: 192, column: 23, scope: !53, inlinedAt: !276)
!328 = !DILocation(line: 192, column: 27, scope: !53, inlinedAt: !276)
!329 = !DILocation(line: 192, column: 33, scope: !53, inlinedAt: !276)
