; ModuleID = '../bcout/drivers/char/hw_random/stm32-rng.llvm.bc'
source_filename = "drivers/char/hw_random/stm32-rng.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_stm32_rng_driver_init6:\09\09\09"
module asm ".long\09stm32_rng_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !55, globals: !2094, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/char/hw_random/stm32-rng.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 10, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!55 = !{!56, !59, !61, !62, !63, !64, !161, !93, !2090, !2092}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !58, line: 76, flags: DIFlagFwdDecl)
!58 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !60, line: 148, baseType: !7)
!60 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!61 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_rng_private", file: !3, line: 30, size: 1152, elements: !66)
!66 = !{!67, !151, !152, !156, !160}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !65, file: !3, line: 31, baseType: !68, size: 896)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwrng", file: !69, line: 39, size: 896, elements: !70)
!69 = !DIFile(filename: "./include/linux/hw_random.h", directory: "/home/lizy2001/genbc/linux")
!70 = !{!71, !75, !81, !85, !89, !98, !108, !109, !111, !117, !131}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 40, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !68, file: !69, line: 41, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !80}
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !68, file: !69, line: 42, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !80}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data_present", scope: !68, file: !69, line: 43, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!79, !80, !79}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_read", scope: !68, file: !69, line: 44, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!79, !80, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !95, line: 21, baseType: !96)
!95 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !97, line: 27, baseType: !7)
!97 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !68, file: !69, line: 45, baseType: !99, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!79, !80, !62, !102, !106}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 55, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !104, line: 72, baseType: !105)
!104 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !104, line: 16, baseType: !61)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !60, line: 30, baseType: !107)
!107 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !68, file: !69, line: 46, baseType: !61, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !68, file: !69, line: 47, baseType: !110, size: 16, offset: 448)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !68, file: !69, line: 50, baseType: !112, size: 128, offset: 512)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !60, line: 178, size: 128, elements: !113)
!113 = !{!114, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !60, line: 179, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !60, line: 179, baseType: !115, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !68, file: !69, line: 51, baseType: !118, size: 32, offset: 640)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !119, line: 19, size: 32, elements: !120)
!119 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !118, file: !119, line: 20, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !123, line: 113, baseType: !124)
!123 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !123, line: 111, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !124, file: !123, line: 112, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !60, line: 168, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 166, size: 32, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !128, file: !60, line: 167, baseType: !79, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_done", scope: !68, file: !69, line: 52, baseType: !132, size: 192, offset: 704)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !133, line: 26, size: 192, elements: !134)
!133 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !132, file: !133, line: 27, baseType: !7, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !132, file: !133, line: 28, baseType: !137, size: 128, offset: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !138, line: 43, size: 128, elements: !139)
!138 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!139 = !{!140, !150}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !137, file: !138, line: 44, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !142, line: 29, baseType: !143)
!142 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !142, line: 20, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !143, file: !142, line: 21, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !147, line: 25, baseType: !148)
!147 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 25, elements: !149)
!149 = !{}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !137, file: !138, line: 45, baseType: !112, size: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !65, file: !3, line: 32, baseType: !62, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !65, file: !3, line: 33, baseType: !153, size: 64, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !155, line: 17, flags: DIFlagFwdDecl)
!155 = !DIFile(filename: "./include/linux/clk.h", directory: "/home/lizy2001/genbc/linux")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !65, file: !3, line: 34, baseType: !157, size: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "reset_control", file: !159, line: 11, flags: DIFlagFwdDecl)
!159 = !DIFile(filename: "./include/linux/reset.h", directory: "/home/lizy2001/genbc/linux")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ced", scope: !65, file: !3, line: 35, baseType: !106, size: 8, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !163)
!163 = !{!164, !1617, !1618, !1621, !1622, !1673, !1767, !1768, !1769, !1770, !1771, !1780, !1885, !1898, !1901, !1902, !1906, !1908, !1909, !1910, !1914, !1920, !1921, !1924, !2039, !2040, !2043, !2044, !2045, !2046, !2078, !2079, !2080, !2083, !2086, !2087, !2088, !2089}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !162, file: !30, line: 462, baseType: !165, size: 512)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !166, line: 64, size: 512, elements: !167)
!166 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!167 = !{!168, !169, !170, !172, !224, !1458, !1611, !1612, !1613, !1614, !1615, !1616}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !166, line: 65, baseType: !72, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !165, file: !166, line: 66, baseType: !112, size: 128, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !166, line: 67, baseType: !171, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !165, file: !166, line: 68, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !166, line: 192, size: 704, elements: !175)
!175 = !{!176, !177, !185, !186}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !174, file: !166, line: 193, baseType: !112, size: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !174, file: !166, line: 194, baseType: !178, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !142, line: 83, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !142, line: 71, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !142, line: 72, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !142, line: 72, elements: !183)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !182, file: !142, line: 73, baseType: !143)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !174, file: !166, line: 195, baseType: !165, size: 512, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !174, file: !166, line: 196, baseType: !187, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !166, line: 156, size: 192, elements: !190)
!190 = !{!191, !196, !201}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !189, file: !166, line: 157, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!79, !173, !171}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !166, line: 158, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!72, !173, !171}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !189, file: !166, line: 159, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!79, !173, !171, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !166, line: 148, size: 20736, elements: !208)
!208 = !{!209, !214, !218, !219, !223}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !207, file: !166, line: 149, baseType: !210, size: 192)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 192, elements: !212)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!212 = !{!213}
!213 = !DISubrange(count: 3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !207, file: !166, line: 150, baseType: !215, size: 4096, offset: 192)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 4096, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !207, file: !166, line: 151, baseType: !79, size: 32, offset: 4288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !207, file: !166, line: 152, baseType: !220, size: 16384, offset: 4320)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 16384, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 2048)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !207, file: !166, line: 153, baseType: !79, size: 32, offset: 20704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !165, file: !166, line: 69, baseType: !225, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !166, line: 138, size: 448, elements: !227)
!227 = !{!228, !232, !255, !257, !1406, !1437, !1441}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !226, file: !166, line: 139, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !171}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !226, file: !166, line: 140, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !236, line: 230, size: 128, elements: !237)
!236 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!237 = !{!238, !251}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !235, file: !236, line: 231, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !171, !245, !211}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !60, line: 60, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !104, line: 73, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !104, line: 15, baseType: !63)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !236, line: 30, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !236, line: 31, baseType: !72, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !246, file: !236, line: 32, baseType: !250, size: 16, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !60, line: 19, baseType: !110)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !235, file: !236, line: 232, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!242, !171, !245, !72, !102}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !226, file: !166, line: 141, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !226, file: !166, line: 142, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !236, line: 84, size: 320, elements: !262)
!262 = !{!263, !264, !268, !1403, !1404}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !236, line: 85, baseType: !72, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !261, file: !236, line: 86, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!250, !171, !245, !79}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !261, file: !236, line: 88, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!250, !171, !272, !79}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !236, line: 168, size: 448, elements: !274)
!274 = !{!275, !276, !277, !278, !288, !289}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !273, file: !236, line: 169, baseType: !246, size: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !273, file: !236, line: 170, baseType: !102, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !273, file: !236, line: 171, baseType: !62, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !273, file: !236, line: 172, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!242, !282, !171, !272, !211, !285, !102}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !284, line: 526, flags: DIFlagFwdDecl)
!284 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !60, line: 46, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !104, line: 88, baseType: !287)
!287 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !273, file: !236, line: 174, baseType: !279, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !273, file: !236, line: 176, baseType: !290, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!79, !282, !171, !272, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !295, line: 305, size: 1472, elements: !296)
!295 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!296 = !{!297, !298, !299, !300, !301, !309, !310, !1377, !1383, !1384, !1389, !1390, !1393, !1397, !1398, !1399, !1400, !1401}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !294, file: !295, line: 308, baseType: !61, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !294, file: !295, line: 309, baseType: !61, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !294, file: !295, line: 313, baseType: !293, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !294, file: !295, line: 313, baseType: !293, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !294, file: !295, line: 315, baseType: !302, size: 192, align: 64, offset: 256)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !303, line: 24, size: 192, align: 64, elements: !304)
!303 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!304 = !{!305, !306, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !302, file: !303, line: 25, baseType: !61, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !302, file: !303, line: 26, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !302, file: !303, line: 27, baseType: !307, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !294, file: !295, line: 323, baseType: !61, size: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !294, file: !295, line: 327, baseType: !311, size: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !295, line: 388, size: 7296, elements: !313)
!313 = !{!314, !1373}
!314 = !DIDerivedType(tag: DW_TAG_member, scope: !312, file: !295, line: 389, baseType: !315, size: 7296)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !295, line: 389, size: 7296, elements: !316)
!316 = !{!317, !318, !322, !326, !330, !331, !332, !333, !334, !342, !343, !344, !345, !346, !355, !356, !357, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !391, !399, !402, !450, !451, !1343, !1344, !1347, !1351, !1352, !1355, !1356, !1357, !1360, !1372}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !315, file: !295, line: 390, baseType: !293, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !315, file: !295, line: 391, baseType: !319, size: 64, offset: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !303, line: 31, size: 64, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !319, file: !303, line: 32, baseType: !307, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !315, file: !295, line: 392, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !95, line: 23, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !97, line: 31, baseType: !325)
!325 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !315, file: !295, line: 394, baseType: !327, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!61, !282, !61, !61, !61, !61}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !315, file: !295, line: 398, baseType: !61, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !315, file: !295, line: 399, baseType: !61, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !315, file: !295, line: 405, baseType: !61, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !315, file: !295, line: 406, baseType: !61, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !315, file: !295, line: 407, baseType: !335, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !284, line: 286, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 286, size: 64, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !337, file: !284, line: 286, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !341, line: 18, baseType: !61)
!341 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !315, file: !295, line: 416, baseType: !127, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !315, file: !295, line: 428, baseType: !127, size: 32, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !315, file: !295, line: 437, baseType: !127, size: 32, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !315, file: !295, line: 447, baseType: !127, size: 32, offset: 672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !315, file: !295, line: 450, baseType: !347, size: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !348, line: 13, baseType: !349)
!348 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !60, line: 175, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 173, size: 64, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !350, file: !60, line: 174, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !95, line: 22, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !97, line: 30, baseType: !287)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !315, file: !295, line: 452, baseType: !79, size: 32, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !315, file: !295, line: 454, baseType: !178, offset: 800)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !315, file: !295, line: 457, baseType: !358, size: 256, offset: 832)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !359, line: 35, size: 256, elements: !360)
!359 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!360 = !{!361, !362, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !358, file: !359, line: 36, baseType: !347, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !358, file: !359, line: 42, baseType: !347, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !358, file: !359, line: 46, baseType: !141, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !358, file: !359, line: 47, baseType: !112, size: 128, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !315, file: !295, line: 459, baseType: !112, size: 128, offset: 1088)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !315, file: !295, line: 466, baseType: !61, size: 64, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !315, file: !295, line: 467, baseType: !61, size: 64, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !315, file: !295, line: 469, baseType: !61, size: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !315, file: !295, line: 470, baseType: !61, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !315, file: !295, line: 471, baseType: !349, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !315, file: !295, line: 472, baseType: !61, size: 64, offset: 1536)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !315, file: !295, line: 473, baseType: !61, size: 64, offset: 1600)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !315, file: !295, line: 474, baseType: !61, size: 64, offset: 1664)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !315, file: !295, line: 475, baseType: !61, size: 64, offset: 1728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !315, file: !295, line: 477, baseType: !178, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !315, file: !295, line: 478, baseType: !61, size: 64, offset: 1792)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !315, file: !295, line: 478, baseType: !61, size: 64, offset: 1856)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !315, file: !295, line: 478, baseType: !61, size: 64, offset: 1920)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !315, file: !295, line: 478, baseType: !61, size: 64, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !315, file: !295, line: 479, baseType: !61, size: 64, offset: 2048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !315, file: !295, line: 479, baseType: !61, size: 64, offset: 2112)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !315, file: !295, line: 479, baseType: !61, size: 64, offset: 2176)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !315, file: !295, line: 480, baseType: !61, size: 64, offset: 2240)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !315, file: !295, line: 480, baseType: !61, size: 64, offset: 2304)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !315, file: !295, line: 480, baseType: !61, size: 64, offset: 2368)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !315, file: !295, line: 480, baseType: !61, size: 64, offset: 2432)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !315, file: !295, line: 482, baseType: !388, size: 2816, offset: 2496)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2816, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 44)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !315, file: !295, line: 488, baseType: !392, size: 256, offset: 5312)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !393, line: 60, size: 256, elements: !394)
!393 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !392, file: !393, line: 61, baseType: !396, size: 256)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 256, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !315, file: !295, line: 490, baseType: !400, size: 64, offset: 5568)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !295, line: 490, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !315, file: !295, line: 493, baseType: !403, size: 896, offset: 5632)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !404, line: 53, baseType: !405)
!404 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 896, elements: !406)
!406 = !{!407, !408, !409, !410, !413, !414, !421, !422, !442, !443, !446}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !405, file: !404, line: 18, baseType: !323, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !405, file: !404, line: 28, baseType: !349, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !405, file: !404, line: 31, baseType: !358, size: 256, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !405, file: !404, line: 32, baseType: !411, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !404, line: 32, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !405, file: !404, line: 37, baseType: !110, size: 16, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !405, file: !404, line: 40, baseType: !415, size: 192, offset: 512)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !416, line: 53, size: 192, elements: !417)
!416 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !415, file: !416, line: 54, baseType: !347, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !415, file: !416, line: 55, baseType: !178, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !415, file: !416, line: 59, baseType: !112, size: 128, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !405, file: !404, line: 41, baseType: !62, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !405, file: !404, line: 42, baseType: !423, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !426, line: 13, size: 896, elements: !427)
!426 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !425, file: !426, line: 14, baseType: !62, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !426, line: 15, baseType: !61, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !425, file: !426, line: 17, baseType: !61, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !425, file: !426, line: 17, baseType: !61, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !425, file: !426, line: 19, baseType: !63, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !425, file: !426, line: 21, baseType: !63, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !425, file: !426, line: 22, baseType: !63, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !425, file: !426, line: 23, baseType: !63, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !425, file: !426, line: 24, baseType: !63, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !425, file: !426, line: 25, baseType: !63, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !425, file: !426, line: 26, baseType: !63, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !425, file: !426, line: 27, baseType: !63, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !425, file: !426, line: 28, baseType: !63, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !425, file: !426, line: 29, baseType: !63, size: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !405, file: !404, line: 44, baseType: !127, size: 32, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !405, file: !404, line: 50, baseType: !444, size: 16, offset: 864)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !95, line: 19, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !97, line: 24, baseType: !110)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !405, file: !404, line: 51, baseType: !447, size: 16, offset: 880)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !95, line: 18, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !97, line: 23, baseType: !449)
!449 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !315, file: !295, line: 495, baseType: !61, size: 64, offset: 6528)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !315, file: !295, line: 497, baseType: !452, size: 64, offset: 6592)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !295, line: 381, size: 384, elements: !454)
!454 = !{!455, !456, !1342}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !453, file: !295, line: 382, baseType: !127, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !453, file: !295, line: 383, baseType: !457, size: 128, offset: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !295, line: 376, size: 128, elements: !458)
!458 = !{!459, !1340}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !457, file: !295, line: 377, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !462, line: 640, size: 48640, elements: !463)
!462 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!463 = !{!464, !470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !485, !503, !514, !609, !610, !611, !622, !623, !625, !626, !627, !628, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !706, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !762, !764, !765, !766, !768, !770, !771, !772, !773, !774, !780, !781, !782, !783, !784, !785, !786, !798, !803, !808, !809, !810, !813, !817, !820, !823, !826, !829, !833, !836, !839, !845, !846, !847, !853, !854, !855, !856, !857, !866, !867, !868, !869, !870, !875, !876, !877, !880, !881, !884, !887, !890, !893, !896, !899, !900, !980, !983, !986, !987, !990, !991, !992, !998, !999, !1000, !1013, !1014, !1015, !1025, !1030, !1033, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !461, file: !462, line: 646, baseType: !465, size: 128)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !466, line: 56, size: 128, elements: !467)
!466 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !466, line: 57, baseType: !61, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !465, file: !466, line: 58, baseType: !94, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !462, line: 649, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !461, file: !462, line: 657, baseType: !62, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !461, file: !462, line: 658, baseType: !122, size: 32, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !462, line: 660, baseType: !7, size: 32, offset: 288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !461, file: !462, line: 661, baseType: !7, size: 32, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !461, file: !462, line: 684, baseType: !79, size: 32, offset: 352)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !461, file: !462, line: 686, baseType: !79, size: 32, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !461, file: !462, line: 687, baseType: !79, size: 32, offset: 416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !461, file: !462, line: 688, baseType: !79, size: 32, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !461, file: !462, line: 689, baseType: !7, size: 32, offset: 480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !461, file: !462, line: 691, baseType: !482, size: 64, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !462, line: 691, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !461, file: !462, line: 692, baseType: !486, size: 832, offset: 576)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !462, line: 451, size: 832, elements: !487)
!487 = !{!488, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !486, file: !462, line: 453, baseType: !489, size: 128)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !462, line: 325, size: 128, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !489, file: !462, line: 326, baseType: !61, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !489, file: !462, line: 327, baseType: !94, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !486, file: !462, line: 454, baseType: !302, size: 192, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !486, file: !462, line: 455, baseType: !112, size: 128, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !486, file: !462, line: 456, baseType: !7, size: 32, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !486, file: !462, line: 458, baseType: !323, size: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !486, file: !462, line: 459, baseType: !323, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !486, file: !462, line: 460, baseType: !323, size: 64, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !486, file: !462, line: 461, baseType: !323, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !486, file: !462, line: 463, baseType: !323, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !486, file: !462, line: 465, baseType: !502, offset: 832)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !462, line: 415, elements: !149)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !461, file: !462, line: 693, baseType: !504, size: 384, offset: 1408)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !462, line: 489, size: 384, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !504, file: !462, line: 490, baseType: !112, size: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !504, file: !462, line: 491, baseType: !61, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !504, file: !462, line: 492, baseType: !61, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !504, file: !462, line: 493, baseType: !7, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !504, file: !462, line: 494, baseType: !110, size: 16, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !504, file: !462, line: 495, baseType: !110, size: 16, offset: 304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !504, file: !462, line: 497, baseType: !513, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !461, file: !462, line: 697, baseType: !515, size: 1792, offset: 1792)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !462, line: 507, size: 1792, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !606, !607}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !515, file: !462, line: 508, baseType: !302, size: 192, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !515, file: !462, line: 515, baseType: !323, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !515, file: !462, line: 516, baseType: !323, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !515, file: !462, line: 517, baseType: !323, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !515, file: !462, line: 518, baseType: !323, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !515, file: !462, line: 519, baseType: !323, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !515, file: !462, line: 526, baseType: !353, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !515, file: !462, line: 527, baseType: !323, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !515, file: !462, line: 528, baseType: !7, size: 32, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !515, file: !462, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !515, file: !462, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !515, file: !462, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !515, file: !462, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !515, file: !462, line: 563, baseType: !531, size: 512, offset: 704)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !532)
!532 = !{!533, !541, !542, !547, !599, !603, !604, !605}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !531, file: !6, line: 119, baseType: !534, size: 256)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !535, line: 9, size: 256, elements: !536)
!535 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !534, file: !535, line: 10, baseType: !302, size: 192, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !534, file: !535, line: 11, baseType: !539, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !540, line: 29, baseType: !353)
!540 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !531, file: !6, line: 120, baseType: !539, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !531, file: !6, line: 121, baseType: !543, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!5, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !531, file: !6, line: 122, baseType: !548, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !550)
!550 = !{!551, !571, !572, !575, !585, !586, !594, !598}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !549, file: !6, line: 160, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !553, file: !6, line: 215, baseType: !141)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !553, file: !6, line: 216, baseType: !7, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !553, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !553, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !553, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !553, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !553, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !553, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !553, file: !6, line: 233, baseType: !539, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !553, file: !6, line: 234, baseType: !546, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !553, file: !6, line: 235, baseType: !539, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !553, file: !6, line: 236, baseType: !546, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !553, file: !6, line: 237, baseType: !568, size: 4096, offset: 512)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 4096, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !549, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !549, file: !6, line: 162, baseType: !573, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !60, line: 27, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !104, line: 96, baseType: !79)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !549, file: !6, line: 163, baseType: !576, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !577, line: 276, baseType: !578)
!577 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !577, line: 276, size: 32, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !578, file: !577, line: 276, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !577, line: 70, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !577, line: 65, size: 32, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !582, file: !577, line: 66, baseType: !7, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !549, file: !6, line: 164, baseType: !546, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !549, file: !6, line: 165, baseType: !587, size: 128, offset: 256)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !535, line: 14, size: 128, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !587, file: !535, line: 15, baseType: !590, size: 128)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !303, line: 125, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !590, file: !303, line: 126, baseType: !319, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !590, file: !303, line: 127, baseType: !307, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !549, file: !6, line: 166, baseType: !595, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!539}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !549, file: !6, line: 167, baseType: !539, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !531, file: !6, line: 123, baseType: !600, size: 8, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !95, line: 17, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !97, line: 21, baseType: !602)
!602 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !531, file: !6, line: 124, baseType: !600, size: 8, offset: 456)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !531, file: !6, line: 125, baseType: !600, size: 8, offset: 464)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !531, file: !6, line: 126, baseType: !600, size: 8, offset: 472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !515, file: !462, line: 572, baseType: !531, size: 512, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !515, file: !462, line: 580, baseType: !608, size: 64, offset: 1728)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !461, file: !462, line: 721, baseType: !7, size: 32, offset: 3584)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !461, file: !462, line: 722, baseType: !79, size: 32, offset: 3616)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !461, file: !462, line: 723, baseType: !612, size: 64, offset: 3648)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !615, line: 17, baseType: !616)
!615 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !615, line: 17, size: 64, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !616, file: !615, line: 17, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 1)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !461, file: !462, line: 724, baseType: !614, size: 64, offset: 3712)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !461, file: !462, line: 749, baseType: !624, offset: 3776)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !462, line: 290, elements: !149)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !461, file: !462, line: 751, baseType: !112, size: 128, offset: 3776)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !461, file: !462, line: 757, baseType: !311, size: 64, offset: 3904)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !461, file: !462, line: 758, baseType: !311, size: 64, offset: 3968)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !461, file: !462, line: 761, baseType: !629, size: 320, offset: 4032)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !393, line: 34, size: 320, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !629, file: !393, line: 35, baseType: !323, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !629, file: !393, line: 36, baseType: !633, size: 256, offset: 64)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 256, elements: !397)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !461, file: !462, line: 766, baseType: !79, size: 32, offset: 4352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !461, file: !462, line: 767, baseType: !79, size: 32, offset: 4384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !461, file: !462, line: 768, baseType: !79, size: 32, offset: 4416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !461, file: !462, line: 770, baseType: !79, size: 32, offset: 4448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !461, file: !462, line: 772, baseType: !61, size: 64, offset: 4480)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !461, file: !462, line: 775, baseType: !7, size: 32, offset: 4544)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !461, file: !462, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !461, file: !462, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !461, file: !462, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !461, file: !462, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !461, file: !462, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !461, file: !462, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !461, file: !462, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !461, file: !462, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !461, file: !462, line: 831, baseType: !61, size: 64, offset: 4672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !461, file: !462, line: 833, baseType: !650, size: 384, offset: 4736)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !651)
!651 = !{!652, !657}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !650, file: !12, line: 26, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!63, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, scope: !650, file: !12, line: 27, baseType: !658, size: 320, offset: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !650, file: !12, line: 27, size: 320, elements: !659)
!659 = !{!660, !669, !696}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !658, file: !12, line: 36, baseType: !661, size: 320)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !12, line: 29, size: 320, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !661, file: !12, line: 30, baseType: !93, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !661, file: !12, line: 31, baseType: !94, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !12, line: 32, baseType: !94, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !661, file: !12, line: 33, baseType: !94, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !661, file: !12, line: 34, baseType: !323, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !661, file: !12, line: 35, baseType: !93, size: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !658, file: !12, line: 46, baseType: !670, size: 192)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !12, line: 38, size: 192, elements: !671)
!671 = !{!672, !673, !674, !695}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !670, file: !12, line: 39, baseType: !573, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !12, line: 41, baseType: !675, size: 64, offset: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !12, line: 41, size: 64, elements: !676)
!676 = !{!677, !685}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !675, file: !12, line: 42, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !680, line: 7, size: 128, elements: !681)
!680 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !679, file: !680, line: 8, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !104, line: 93, baseType: !287)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !679, file: !680, line: 9, baseType: !287, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !675, file: !12, line: 43, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !688, line: 7, size: 64, elements: !689)
!688 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!689 = !{!690, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !687, file: !688, line: 8, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !688, line: 5, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !95, line: 20, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !97, line: 26, baseType: !79)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !687, file: !688, line: 9, baseType: !692, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !670, file: !12, line: 45, baseType: !323, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !658, file: !12, line: 54, baseType: !697, size: 256)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !12, line: 48, size: 256, elements: !698)
!698 = !{!699, !702, !703, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !697, file: !12, line: 49, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !697, file: !12, line: 50, baseType: !79, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !697, file: !12, line: 51, baseType: !79, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !697, file: !12, line: 52, baseType: !61, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !697, file: !12, line: 53, baseType: !61, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !461, file: !462, line: 835, baseType: !707, size: 32, offset: 5120)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !60, line: 22, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !104, line: 28, baseType: !79)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !461, file: !462, line: 836, baseType: !707, size: 32, offset: 5152)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !461, file: !462, line: 840, baseType: !61, size: 64, offset: 5184)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !461, file: !462, line: 849, baseType: !460, size: 64, offset: 5248)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !461, file: !462, line: 852, baseType: !460, size: 64, offset: 5312)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !461, file: !462, line: 857, baseType: !112, size: 128, offset: 5376)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !461, file: !462, line: 858, baseType: !112, size: 128, offset: 5504)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !461, file: !462, line: 859, baseType: !460, size: 64, offset: 5632)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !461, file: !462, line: 867, baseType: !112, size: 128, offset: 5696)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !461, file: !462, line: 868, baseType: !112, size: 128, offset: 5824)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !461, file: !462, line: 871, baseType: !719, size: 64, offset: 5952)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !721, line: 59, size: 768, elements: !722)
!721 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!722 = !{!723, !724, !725, !726, !737, !738, !745, !754}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !720, file: !721, line: 61, baseType: !122, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !720, file: !721, line: 62, baseType: !7, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !720, file: !721, line: 63, baseType: !178, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !720, file: !721, line: 65, baseType: !727, size: 256, offset: 64)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 256, elements: !397)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !60, line: 182, size: 64, elements: !729)
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !728, file: !60, line: 183, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !60, line: 186, size: 128, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !60, line: 187, baseType: !731, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !732, file: !60, line: 187, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !720, file: !721, line: 66, baseType: !728, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !720, file: !721, line: 68, baseType: !739, size: 128, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !740, line: 40, baseType: !741)
!740 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !740, line: 36, size: 128, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !741, file: !740, line: 37, baseType: !178)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !741, file: !740, line: 38, baseType: !112, size: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !720, file: !721, line: 69, baseType: !746, size: 128, align: 64, offset: 512)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !60, line: 216, size: 128, align: 64, elements: !747)
!747 = !{!748, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !746, file: !60, line: 217, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !746, file: !60, line: 218, baseType: !751, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !749}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !720, file: !721, line: 70, baseType: !755, size: 128, offset: 640)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 128, elements: !620)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !721, line: 54, size: 128, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !756, file: !721, line: 55, baseType: !79, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !756, file: !721, line: 56, baseType: !760, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !721, line: 56, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !461, file: !462, line: 872, baseType: !763, size: 512, offset: 6016)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 512, elements: !397)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !461, file: !462, line: 873, baseType: !112, size: 128, offset: 6528)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !461, file: !462, line: 874, baseType: !112, size: 128, offset: 6656)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !461, file: !462, line: 876, baseType: !767, size: 64, offset: 6784)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !461, file: !462, line: 879, baseType: !769, size: 64, offset: 6848)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !461, file: !462, line: 882, baseType: !769, size: 64, offset: 6912)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !461, file: !462, line: 884, baseType: !323, size: 64, offset: 6976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !461, file: !462, line: 885, baseType: !323, size: 64, offset: 7040)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !461, file: !462, line: 890, baseType: !323, size: 64, offset: 7104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !461, file: !462, line: 891, baseType: !775, size: 128, offset: 7168)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !462, line: 242, size: 128, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !775, file: !462, line: 244, baseType: !323, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !775, file: !462, line: 245, baseType: !323, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !775, file: !462, line: 246, baseType: !141, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !461, file: !462, line: 900, baseType: !61, size: 64, offset: 7296)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !461, file: !462, line: 901, baseType: !61, size: 64, offset: 7360)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !461, file: !462, line: 904, baseType: !323, size: 64, offset: 7424)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !461, file: !462, line: 907, baseType: !323, size: 64, offset: 7488)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !461, file: !462, line: 910, baseType: !61, size: 64, offset: 7552)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !461, file: !462, line: 911, baseType: !61, size: 64, offset: 7616)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !461, file: !462, line: 914, baseType: !787, size: 640, offset: 7680)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !788, line: 123, size: 640, elements: !789)
!788 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!789 = !{!790, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !787, file: !788, line: 124, baseType: !791, size: 576)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 576, elements: !212)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !788, line: 108, size: 192, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !792, file: !788, line: 109, baseType: !323, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !792, file: !788, line: 110, baseType: !587, size: 128, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !787, file: !788, line: 125, baseType: !7, size: 32, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !787, file: !788, line: 126, baseType: !7, size: 32, offset: 608)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !461, file: !462, line: 917, baseType: !799, size: 192, offset: 8320)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !788, line: 134, size: 192, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !799, file: !788, line: 135, baseType: !746, size: 128, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !799, file: !788, line: 136, baseType: !7, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !461, file: !462, line: 923, baseType: !804, size: 64, offset: 8512)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !807, line: 11, flags: DIFlagFwdDecl)
!807 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!808 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !461, file: !462, line: 926, baseType: !804, size: 64, offset: 8576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !461, file: !462, line: 929, baseType: !804, size: 64, offset: 8640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !461, file: !462, line: 933, baseType: !811, size: 64, offset: 8704)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !462, line: 933, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !461, file: !462, line: 943, baseType: !814, size: 128, offset: 8768)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 16)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !461, file: !462, line: 945, baseType: !818, size: 64, offset: 8896)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !462, line: 49, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !461, file: !462, line: 956, baseType: !821, size: 64, offset: 8960)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !462, line: 45, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !461, file: !462, line: 959, baseType: !824, size: 64, offset: 9024)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !462, line: 959, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !461, file: !462, line: 962, baseType: !827, size: 64, offset: 9088)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !462, line: 66, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !461, file: !462, line: 966, baseType: !830, size: 64, offset: 9152)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !832, line: 35, flags: DIFlagFwdDecl)
!832 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!833 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !461, file: !462, line: 969, baseType: !834, size: 64, offset: 9216)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !788, line: 223, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !461, file: !462, line: 970, baseType: !837, size: 64, offset: 9280)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !462, line: 62, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !461, file: !462, line: 971, baseType: !840, size: 64, offset: 9344)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !841, line: 25, baseType: !842)
!841 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 23, size: 64, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !842, file: !841, line: 24, baseType: !619, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !461, file: !462, line: 972, baseType: !840, size: 64, offset: 9408)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !461, file: !462, line: 974, baseType: !840, size: 64, offset: 9472)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !461, file: !462, line: 975, baseType: !848, size: 192, offset: 9536)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !849, line: 30, size: 192, elements: !850)
!849 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !848, file: !849, line: 31, baseType: !112, size: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !848, file: !849, line: 32, baseType: !840, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !461, file: !462, line: 976, baseType: !61, size: 64, offset: 9728)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !461, file: !462, line: 977, baseType: !102, size: 64, offset: 9792)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !461, file: !462, line: 978, baseType: !7, size: 32, offset: 9856)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !461, file: !462, line: 980, baseType: !749, size: 64, offset: 9920)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !461, file: !462, line: 989, baseType: !858, size: 128, offset: 9984)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !859, line: 35, size: 128, elements: !860)
!859 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !858, file: !859, line: 36, baseType: !79, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !858, file: !859, line: 37, baseType: !127, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !858, file: !859, line: 38, baseType: !864, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !859, line: 23, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !461, file: !462, line: 992, baseType: !323, size: 64, offset: 10112)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !461, file: !462, line: 993, baseType: !323, size: 64, offset: 10176)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !461, file: !462, line: 996, baseType: !178, offset: 10240)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !461, file: !462, line: 999, baseType: !141, offset: 10240)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !461, file: !462, line: 1001, baseType: !871, size: 64, offset: 10240)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !462, line: 636, size: 64, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !462, line: 637, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !461, file: !462, line: 1005, baseType: !590, size: 128, offset: 10304)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !461, file: !462, line: 1007, baseType: !460, size: 64, offset: 10432)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !461, file: !462, line: 1009, baseType: !878, size: 64, offset: 10496)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !462, line: 1009, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !461, file: !462, line: 1043, baseType: !62, size: 64, offset: 10560)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !461, file: !462, line: 1046, baseType: !882, size: 64, offset: 10624)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !462, line: 41, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !461, file: !462, line: 1050, baseType: !885, size: 64, offset: 10688)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !462, line: 42, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !461, file: !462, line: 1054, baseType: !888, size: 64, offset: 10752)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !462, line: 55, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !461, file: !462, line: 1056, baseType: !891, size: 64, offset: 10816)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !462, line: 40, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !461, file: !462, line: 1058, baseType: !894, size: 64, offset: 10880)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !462, line: 47, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !461, file: !462, line: 1061, baseType: !897, size: 64, offset: 10944)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !462, line: 43, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !461, file: !462, line: 1064, baseType: !61, size: 64, offset: 11008)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !461, file: !462, line: 1065, baseType: !901, size: 64, offset: 11072)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !849, line: 14, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !849, line: 12, size: 384, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !903, file: !849, line: 13, baseType: !906, size: 384)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !903, file: !849, line: 13, size: 384, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !906, file: !849, line: 13, baseType: !79, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !906, file: !849, line: 13, baseType: !79, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !906, file: !849, line: 13, baseType: !79, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !906, file: !849, line: 13, baseType: !912, size: 256, offset: 128)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !913, line: 32, size: 256, elements: !914)
!913 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!914 = !{!915, !921, !934, !940, !949, !969, !974}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !912, file: !913, line: 37, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 34, size: 64, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !916, file: !913, line: 35, baseType: !708, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !916, file: !913, line: 36, baseType: !920, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !104, line: 49, baseType: !7)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !912, file: !913, line: 45, baseType: !922, size: 192)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 40, size: 192, elements: !923)
!923 = !{!924, !926, !927, !933}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !922, file: !913, line: 41, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !104, line: 95, baseType: !79)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !922, file: !913, line: 42, baseType: !79, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !922, file: !913, line: 43, baseType: !928, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !913, line: 11, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !913, line: 8, size: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !929, file: !913, line: 9, baseType: !79, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !929, file: !913, line: 10, baseType: !62, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !922, file: !913, line: 44, baseType: !79, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !912, file: !913, line: 52, baseType: !935, size: 128)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 48, size: 128, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !935, file: !913, line: 49, baseType: !708, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !935, file: !913, line: 50, baseType: !920, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !935, file: !913, line: 51, baseType: !928, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !912, file: !913, line: 61, baseType: !941, size: 256)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 55, size: 256, elements: !942)
!942 = !{!943, !944, !945, !946, !948}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !941, file: !913, line: 56, baseType: !708, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !941, file: !913, line: 57, baseType: !920, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !941, file: !913, line: 58, baseType: !79, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !941, file: !913, line: 59, baseType: !947, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !104, line: 94, baseType: !244)
