; ModuleID = '../bcout/drivers/char/hw_random/via-rng.llvm.bc'
source_filename = "drivers/char/hw_random/via-rng.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_mod_init6:\09\09\09"
module asm ".long\09mod_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.cpuinfo_x86 = type { i8, i8, i8, i8, i32, [3 x i32], i8, i8, i8, i8, i32, i32, %union.anon, [16 x i8], [64 x i8], i32, i32, i32, i32, i32, i32, i64, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i32, i8, i8 }
%union.anon = type { i64, [72 x i8] }
%struct.hwrng = type { i8*, i32 (%struct.hwrng*)*, {}*, i32 (%struct.hwrng*, i32)*, i32 (%struct.hwrng*, i32*)*, i32 (%struct.hwrng*, i8*, i64, i1)*, i64, i16, %struct.list_head, %struct.kref, %struct.completion }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kref = type { %struct.refcount_struct }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.atomic_t = type { i32 }
%struct.completion = type { i32, %struct.swait_queue_head }
%struct.swait_queue_head = type { %struct.raw_spinlock, %struct.list_head }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_mod_init104", scope: !2, file: !3, line: 212, type: !94, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !42, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/char/hw_random/via-rng.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 41, baseType: !7, size: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!13 = !DIEnumerator(name: "VIA_STRFILT_CNT_SHIFT", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "VIA_STRFILT_FAIL", value: 32768, isUnsigned: true)
!15 = !DIEnumerator(name: "VIA_STRFILT_ENABLE", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "VIA_RAWBITS_ENABLE", value: 8192, isUnsigned: true)
!17 = !DIEnumerator(name: "VIA_RNG_ENABLE", value: 64, isUnsigned: true)
!18 = !DIEnumerator(name: "VIA_NOISESRC1", value: 256, isUnsigned: true)
!19 = !DIEnumerator(name: "VIA_NOISESRC2", value: 512, isUnsigned: true)
!20 = !DIEnumerator(name: "VIA_XSTORE_CNT_MASK", value: 15, isUnsigned: true)
!21 = !DIEnumerator(name: "VIA_RNG_CHUNK_8", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "VIA_RNG_CHUNK_4", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "VIA_RNG_CHUNK_4_MASK", value: 4294967295, isUnsigned: true)
!24 = !DIEnumerator(name: "VIA_RNG_CHUNK_2", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "VIA_RNG_CHUNK_2_MASK", value: 65535, isUnsigned: true)
!26 = !DIEnumerator(name: "VIA_RNG_CHUNK_1", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "VIA_RNG_CHUNK_1_MASK", value: 255, isUnsigned: true)
!28 = !{!29, !30, !32, !31, !36, !39, !40}
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !33, line: 21, baseType: !34)
!33 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !35, line: 27, baseType: !7)
!35 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !33, line: 23, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !35, line: 31, baseType: !38)
!38 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !{!0, !43, !50, !56, !61, !66}
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "__exitcall_mod_exit", scope: !2, file: !3, line: 218, type: !45, isLocal: true, isDefinition: true)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !46, line: 117, baseType: !47)
!46 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description105", scope: !2, file: !3, line: 226, type: !52, isLocal: true, isDefinition: true, align: 8)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 480, elements: !54)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!54 = !{!55}
!55 = !DISubrange(count: 60)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file106", scope: !2, file: !3, line: 227, type: !58, isLocal: true, isDefinition: true, align: 8)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 352, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 44)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license107", scope: !2, file: !3, line: 227, type: !63, isLocal: true, isDefinition: true, align: 8)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 20)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "via_rng", scope: !2, file: !3, line: 187, type: !68, isLocal: true, isDefinition: true)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hwrng", file: !69, line: 39, size: 896, elements: !70)
!69 = !DIFile(filename: "./include/linux/hw_random.h", directory: "/home/lizy2001/genbc/linux")
!70 = !{!71, !73, !78, !82, !86, !90, !102, !103, !105, !111, !125}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 40, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !68, file: !69, line: 41, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!29, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !68, file: !69, line: 42, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !77}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data_present", scope: !68, file: !69, line: 43, baseType: !83, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!29, !77, !29}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_read", scope: !68, file: !69, line: 44, baseType: !87, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!29, !77, !39}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !68, file: !69, line: 45, baseType: !91, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!29, !77, !94, !95, !100}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 55, baseType: !97)
!96 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !98, line: 72, baseType: !99)
!98 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !98, line: 16, baseType: !31)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !96, line: 30, baseType: !101)
!101 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !68, file: !69, line: 46, baseType: !31, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !68, file: !69, line: 47, baseType: !104, size: 16, offset: 448)
!104 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !68, file: !69, line: 50, baseType: !106, size: 128, offset: 512)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !96, line: 178, size: 128, elements: !107)
!107 = !{!108, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !96, line: 179, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !106, file: !96, line: 179, baseType: !109, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !68, file: !69, line: 51, baseType: !112, size: 32, offset: 640)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !113, line: 19, size: 32, elements: !114)
!113 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !112, file: !113, line: 20, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !117, line: 113, baseType: !118)
!117 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !117, line: 111, size: 32, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !118, file: !117, line: 112, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !96, line: 168, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 166, size: 32, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !122, file: !96, line: 167, baseType: !29, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_done", scope: !68, file: !69, line: 52, baseType: !126, size: 192, offset: 704)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !127, line: 26, size: 192, elements: !128)
!127 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !126, file: !127, line: 27, baseType: !7, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !126, file: !127, line: 28, baseType: !131, size: 128, offset: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !132, line: 43, size: 128, elements: !133)
!132 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!133 = !{!134, !144}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !131, file: !132, line: 44, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !136, line: 29, baseType: !137)
!136 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !136, line: 20, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !137, file: !136, line: 21, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !141, line: 25, baseType: !142)
!141 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 25, elements: !143)
!143 = !{}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !131, file: !132, line: 45, baseType: !106, size: 128)
!145 = !{!"rsp"}
!146 = !{i32 7, !"Dwarf Version", i32 4}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{i32 1, !"wchar_size", i32 2}
!149 = !{i32 1, !"Code Model", i32 2}
!150 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!151 = distinct !DISubprogram(name: "mod_init", scope: !3, file: !3, line: 195, type: !152, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!152 = !DISubroutineType(types: !153)
!153 = !{!29}
!154 = !DILocalVariable(name: "err", scope: !151, file: !3, line: 197, type: !29)
!155 = !DILocation(line: 197, column: 6, scope: !151)
!156 = !DILocation(line: 199, column: 6, scope: !151)
!157 = !DILocation(line: 199, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !151, file: !3, line: 199, column: 6)
!159 = !DILocation(line: 200, column: 3, scope: !158)
!160 = !DILocation(line: 202, column: 2, scope: !151)
!161 = !DILocation(line: 203, column: 8, scope: !151)
!162 = !DILocation(line: 203, column: 6, scope: !151)
!163 = !DILocation(line: 204, column: 6, scope: !164)
!164 = distinct !DILexicalBlock(scope: !151, file: !3, line: 204, column: 6)
!165 = !DILocation(line: 204, column: 6, scope: !151)
!166 = !DILocation(line: 205, column: 3, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !3, line: 204, column: 11)
!168 = !DILocation(line: 207, column: 3, scope: !167)
!169 = !DILabel(scope: !151, name: "out", file: !3, line: 209)
!170 = !DILocation(line: 209, column: 1, scope: !151)
!171 = !DILocation(line: 210, column: 9, scope: !151)
!172 = !DILocation(line: 210, column: 2, scope: !151)
!173 = !DILocation(line: 211, column: 1, scope: !151)
!174 = distinct !DISubprogram(name: "mod_exit", scope: !3, file: !3, line: 214, type: !48, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!175 = !DILocation(line: 216, column: 2, scope: !174)
!176 = !DILocation(line: 217, column: 1, scope: !174)
!177 = distinct !DISubprogram(name: "test_bit", scope: !178, file: !178, line: 132, type: !179, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!178 = !DIFile(filename: "./include/asm-generic/bitops/instrumented-non-atomic.h", directory: "/home/lizy2001/genbc/linux")
!179 = !DISubroutineType(types: !180)
!180 = !{!100, !181, !182}
!181 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!185 = !DILocalVariable(name: "nr", arg: 1, scope: !186, file: !187, line: 210, type: !181)
!186 = distinct !DISubprogram(name: "variable_test_bit", scope: !187, file: !187, line: 210, type: !179, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!187 = !DIFile(filename: "./arch/x86/include/asm/bitops.h", directory: "/home/lizy2001/genbc/linux")
!188 = !DILocation(line: 210, column: 52, scope: !186, inlinedAt: !189)
!189 = distinct !DILocation(line: 135, column: 9, scope: !177)
!190 = !DILocalVariable(name: "addr", arg: 2, scope: !186, file: !187, line: 210, type: !182)
!191 = !DILocation(line: 210, column: 86, scope: !186, inlinedAt: !189)
!192 = !DILocalVariable(name: "oldbit", scope: !186, file: !187, line: 212, type: !100)
!193 = !DILocation(line: 212, column: 7, scope: !186, inlinedAt: !189)
!194 = !DILocalVariable(name: "nr", arg: 1, scope: !195, file: !187, line: 204, type: !181)
!195 = distinct !DISubprogram(name: "constant_test_bit", scope: !187, file: !187, line: 204, type: !179, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!196 = !DILocation(line: 204, column: 52, scope: !195, inlinedAt: !197)
!197 = distinct !DILocation(line: 135, column: 9, scope: !177)
!198 = !DILocalVariable(name: "addr", arg: 2, scope: !195, file: !187, line: 204, type: !182)
!199 = !DILocation(line: 204, column: 86, scope: !195, inlinedAt: !197)
!200 = !DILocalVariable(name: "v", arg: 1, scope: !201, file: !202, line: 69, type: !205)
!201 = distinct !DISubprogram(name: "instrument_atomic_read", scope: !202, file: !202, line: 69, type: !203, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!202 = !DIFile(filename: "./include/linux/instrumented.h", directory: "/home/lizy2001/genbc/linux")
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !95}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!208 = !DILocation(line: 69, column: 73, scope: !201, inlinedAt: !209)
!209 = distinct !DILocation(line: 134, column: 2, scope: !177)
!210 = !DILocalVariable(name: "size", arg: 2, scope: !201, file: !202, line: 69, type: !95)
!211 = !DILocation(line: 69, column: 83, scope: !201, inlinedAt: !209)
!212 = !DILocalVariable(name: "nr", arg: 1, scope: !177, file: !178, line: 132, type: !181)
!213 = !DILocation(line: 132, column: 34, scope: !177)
!214 = !DILocalVariable(name: "addr", arg: 2, scope: !177, file: !178, line: 132, type: !182)
!215 = !DILocation(line: 132, column: 68, scope: !177)
!216 = !DILocation(line: 134, column: 25, scope: !177)
!217 = !DILocation(line: 134, column: 32, scope: !177)
!218 = !DILocation(line: 134, column: 30, scope: !177)
!219 = !DILocation(line: 71, column: 19, scope: !201, inlinedAt: !209)
!220 = !DILocation(line: 71, column: 22, scope: !201, inlinedAt: !209)
!221 = !DILocation(line: 71, column: 2, scope: !201, inlinedAt: !209)
!222 = !DILocation(line: 72, column: 2, scope: !201, inlinedAt: !209)
!223 = !DILocation(line: 135, column: 9, scope: !177)
!224 = !DILocation(line: 206, column: 19, scope: !195, inlinedAt: !197)
!225 = !DILocation(line: 206, column: 22, scope: !195, inlinedAt: !197)
!226 = !DILocation(line: 206, column: 15, scope: !195, inlinedAt: !197)
!227 = !DILocation(line: 207, column: 4, scope: !195, inlinedAt: !197)
!228 = !DILocation(line: 207, column: 9, scope: !195, inlinedAt: !197)
!229 = !DILocation(line: 207, column: 12, scope: !195, inlinedAt: !197)
!230 = !DILocation(line: 206, column: 44, scope: !195, inlinedAt: !197)
!231 = !DILocation(line: 207, column: 37, scope: !195, inlinedAt: !197)
!232 = !DILocation(line: 217, column: 33, scope: !186, inlinedAt: !189)
!233 = !DILocation(line: 217, column: 46, scope: !186, inlinedAt: !189)
!234 = !DILocation(line: 214, column: 2, scope: !186, inlinedAt: !189)
!235 = !{i32 -2147139812, i32 -2147139752}
!236 = !DILocation(line: 219, column: 9, scope: !186, inlinedAt: !189)
!237 = !DILocation(line: 135, column: 2, scope: !177)
!238 = distinct !DISubprogram(name: "kasan_check_read", scope: !239, file: !239, line: 34, type: !240, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!239 = !DIFile(filename: "./include/linux/kasan-checks.h", directory: "/home/lizy2001/genbc/linux")
!240 = !DISubroutineType(types: !241)
!241 = !{!100, !205, !7}
!242 = !DILocalVariable(name: "p", arg: 1, scope: !238, file: !239, line: 34, type: !205)
!243 = !DILocation(line: 34, column: 58, scope: !238)
!244 = !DILocalVariable(name: "size", arg: 2, scope: !238, file: !239, line: 34, type: !7)
!245 = !DILocation(line: 34, column: 74, scope: !238)
!246 = !DILocation(line: 36, column: 2, scope: !238)
!247 = distinct !DISubprogram(name: "kcsan_check_access", scope: !248, file: !248, line: 178, type: !249, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!248 = !DIFile(filename: "./include/linux/kcsan-checks.h", directory: "/home/lizy2001/genbc/linux")
!249 = !DISubroutineType(types: !250)
!250 = !{null, !205, !95, !29}
!251 = !DILocalVariable(name: "ptr", arg: 1, scope: !247, file: !248, line: 178, type: !205)
!252 = !DILocation(line: 178, column: 60, scope: !247)
!253 = !DILocalVariable(name: "size", arg: 2, scope: !247, file: !248, line: 178, type: !95)
!254 = !DILocation(line: 178, column: 72, scope: !247)
!255 = !DILocalVariable(name: "type", arg: 3, scope: !247, file: !248, line: 179, type: !29)
!256 = !DILocation(line: 179, column: 15, scope: !247)
!257 = !DILocation(line: 179, column: 23, scope: !247)
!258 = distinct !DISubprogram(name: "via_rng_init", scope: !3, file: !3, line: 129, type: !75, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !143)
!259 = !DILocalVariable(name: "rng", arg: 1, scope: !258, file: !3, line: 129, type: !77)
!260 = !DILocation(line: 129, column: 39, scope: !258)
!261 = !DILocalVariable(name: "c", scope: !258, file: !3, line: 131, type: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuinfo_x86", file: !264, line: 81, size: 2048, elements: !265)
!264 = !DIFile(filename: "./arch/x86/include/asm/processor.h", directory: "/home/lizy2001/genbc/linux")
!265 = !{!266, !269, !270, !271, !272, !273, !277, !278, !279, !280, !281, !282, !283, !289, !293, !297, !298, !299, !300, !301, !302, !303, !304, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !320}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "x86", scope: !263, file: !264, line: 82, baseType: !267, size: 8)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !35, line: 21, baseType: !268)
!268 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vendor", scope: !263, file: !264, line: 83, baseType: !267, size: 8, offset: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "x86_model", scope: !263, file: !264, line: 84, baseType: !267, size: 8, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "x86_stepping", scope: !263, file: !264, line: 85, baseType: !267, size: 8, offset: 24)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "x86_tlbsize", scope: !263, file: !264, line: 88, baseType: !29, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vmx_capability", scope: !263, file: !264, line: 91, baseType: !274, size: 96, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 96, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 3)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "x86_virt_bits", scope: !263, file: !264, line: 93, baseType: !267, size: 8, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "x86_phys_bits", scope: !263, file: !264, line: 94, baseType: !267, size: 8, offset: 168)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "x86_coreid_bits", scope: !263, file: !264, line: 96, baseType: !267, size: 8, offset: 176)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cu_id", scope: !263, file: !264, line: 97, baseType: !267, size: 8, offset: 184)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "extended_cpuid_level", scope: !263, file: !264, line: 99, baseType: !34, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid_level", scope: !263, file: !264, line: 101, baseType: !29, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !263, file: !264, line: 107, baseType: !284, size: 640, offset: 256)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !263, file: !264, line: 107, size: 640, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "x86_capability", scope: !284, file: !264, line: 108, baseType: !287, size: 640)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 640, elements: !64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "x86_capability_alignment", scope: !284, file: !264, line: 109, baseType: !31, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vendor_id", scope: !263, file: !264, line: 111, baseType: !290, size: 128, offset: 896)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "x86_model_id", scope: !263, file: !264, line: 112, baseType: !294, size: 512, offset: 1024)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_size", scope: !263, file: !264, line: 114, baseType: !7, size: 32, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_alignment", scope: !263, file: !264, line: 115, baseType: !29, size: 32, offset: 1568)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_max_rmid", scope: !263, file: !264, line: 117, baseType: !29, size: 32, offset: 1600)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_occ_scale", scope: !263, file: !264, line: 118, baseType: !29, size: 32, offset: 1632)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_mbm_width_offset", scope: !263, file: !264, line: 119, baseType: !29, size: 32, offset: 1664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "x86_power", scope: !263, file: !264, line: 120, baseType: !29, size: 32, offset: 1696)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "loops_per_jiffy", scope: !263, file: !264, line: 121, baseType: !31, size: 64, offset: 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "x86_max_cores", scope: !263, file: !264, line: 123, baseType: !305, size: 16, offset: 1792)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !33, line: 19, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !35, line: 24, baseType: !104)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "apicid", scope: !263, file: !264, line: 124, baseType: !305, size: 16, offset: 1808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "initial_apicid", scope: !263, file: !264, line: 125, baseType: !305, size: 16, offset: 1824)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "x86_clflush_size", scope: !263, file: !264, line: 126, baseType: !305, size: 16, offset: 1840)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "booted_cores", scope: !263, file: !264, line: 128, baseType: !305, size: 16, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "phys_proc_id", scope: !263, file: !264, line: 130, baseType: !305, size: 16, offset: 1872)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "logical_proc_id", scope: !263, file: !264, line: 132, baseType: !305, size: 16, offset: 1888)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_core_id", scope: !263, file: !264, line: 134, baseType: !305, size: 16, offset: 1904)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_die_id", scope: !263, file: !264, line: 135, baseType: !305, size: 16, offset: 1920)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "logical_die_id", scope: !263, file: !264, line: 136, baseType: !305, size: 16, offset: 1936)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_index", scope: !263, file: !264, line: 138, baseType: !305, size: 16, offset: 1952)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "microcode", scope: !263, file: !264, line: 139, baseType: !32, size: 32, offset: 1984)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_bits", scope: !263, file: !264, line: 141, baseType: !319, size: 8, offset: 2016)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !33, line: 17, baseType: !267)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !263, file: !264, line: 142, baseType: !7, size: 1, offset: 2024, flags: DIFlagBitField, extraData: i64 2024)
!321 = !DILocation(line: 131, column: 22, scope: !258)
!322 = !DILocalVariable(name: "lo", scope: !258, file: !3, line: 132, type: !32)
!323 = !DILocation(line: 132, column: 6, scope: !258)
!324 = !DILocalVariable(name: "hi", scope: !258, file: !3, line: 132, type: !32)
!325 = !DILocation(line: 132, column: 10, scope: !258)
!326 = !DILocalVariable(name: "old_lo", scope: !258, file: !3, line: 132, type: !32)
!327 = !DILocation(line: 132, column: 14, scope: !258)
!328 = !DILocation(line: 138, column: 8, scope: !329)
!329 = distinct !DILexicalBlock(scope: !258, file: !3, line: 138, column: 6)
!330 = !DILocation(line: 138, column: 11, scope: !329)
!331 = !DILocation(line: 138, column: 15, scope: !329)
!332 = !DILocation(line: 138, column: 21, scope: !329)
!333 = !DILocation(line: 138, column: 25, scope: !329)
!334 = !DILocation(line: 138, column: 28, scope: !329)
!335 = !DILocation(line: 138, column: 38, scope: !329)
!336 = !DILocation(line: 138, column: 49, scope: !329)
!337 = !DILocation(line: 138, column: 53, scope: !329)
!338 = !DILocation(line: 138, column: 56, scope: !329)
!339 = !DILocation(line: 138, column: 60, scope: !329)
!340 = !DILocation(line: 138, column: 6, scope: !258)
!341 = !DILocation(line: 139, column: 7, scope: !342)
!342 = distinct !DILexicalBlock(scope: !329, file: !3, line: 138, column: 65)
!343 = !DILocation(line: 139, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !342, file: !3, line: 139, column: 7)
!345 = !DILocation(line: 140, column: 4, scope: !346)
!346 = distinct !DILexicalBlock(scope: !344, file: !3, line: 139, column: 45)
!347 = !DILocation(line: 142, column: 4, scope: !346)
!348 = !DILocation(line: 144, column: 3, scope: !342)
!349 = !DILocation(line: 153, column: 2, scope: !258)
!350 = !DILocalVariable(name: "_l", scope: !351, file: !3, line: 153, type: !36)
!351 = distinct !DILexicalBlock(scope: !258, file: !3, line: 153, column: 2)
!352 = !DILocation(line: 153, column: 2, scope: !351)
!353 = !DILocation(line: 155, column: 11, scope: !258)
!354 = !DILocation(line: 155, column: 9, scope: !258)
!355 = !DILocation(line: 156, column: 5, scope: !258)
!356 = !DILocation(line: 157, column: 5, scope: !258)
!357 = !DILocation(line: 158, column: 5, scope: !258)
!358 = !DILocation(line: 159, column: 5, scope: !258)
!359 = !DILocation(line: 160, column: 5, scope: !258)
!360 = !DILocation(line: 165, column: 7, scope: !361)
!361 = distinct !DILexicalBlock(scope: !258, file: !3, line: 165, column: 6)
!362 = !DILocation(line: 165, column: 10, scope: !361)
!363 = !DILocation(line: 165, column: 20, scope: !361)
!364 = !DILocation(line: 165, column: 26, scope: !361)
!365 = !DILocation(line: 165, column: 30, scope: !361)
!366 = !DILocation(line: 165, column: 33, scope: !361)
!367 = !DILocation(line: 165, column: 46, scope: !361)
!368 = !DILocation(line: 165, column: 6, scope: !258)
!369 = !DILocation(line: 166, column: 6, scope: !361)
!370 = !DILocation(line: 166, column: 3, scope: !361)
!371 = !DILocation(line: 169, column: 6, scope: !372)
!372 = distinct !DILexicalBlock(scope: !258, file: !3, line: 169, column: 6)
!373 = !DILocation(line: 169, column: 9, scope: !372)
!374 = !DILocation(line: 169, column: 19, scope: !372)
!375 = !DILocation(line: 169, column: 6, scope: !258)
!376 = !DILocation(line: 170, column: 6, scope: !372)
!377 = !DILocation(line: 170, column: 3, scope: !372)
!378 = !DILocation(line: 172, column: 6, scope: !379)
!379 = distinct !DILexicalBlock(scope: !258, file: !3, line: 172, column: 6)
!380 = !DILocation(line: 172, column: 12, scope: !379)
!381 = !DILocation(line: 172, column: 9, scope: !379)
!382 = !DILocation(line: 172, column: 6, scope: !258)
!383 = !DILocation(line: 173, column: 3, scope: !379)
!384 = !DILocation(line: 173, column: 3, scope: !385)
