; ModuleID = '../bcout/drivers/xen/xenfs/xensyms.llvm.bc'
source_filename = "drivers/xen/xenfs/xensyms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.module = type opaque
%struct.file = type { %union.anon, %struct.path, %struct.inode*, %struct.file_operations*, %struct.spinlock, i32, %struct.atomic64_t, i32, i32, %struct.mutex, i64, %struct.fown_struct, %struct.cred*, %struct.file_ra_state, i64, i8*, %struct.list_head, %struct.list_head, %struct.address_space*, i32, i32 }
%union.anon = type { %struct.callback_head }
%struct.callback_head = type { %struct.callback_head*, void (%struct.callback_head*)* }
%struct.path = type { %struct.vfsmount*, %struct.dentry* }
%struct.vfsmount = type opaque
%struct.dentry = type { i32, %struct.seqcount_spinlock, %struct.hlist_bl_node, %struct.dentry*, %struct.qstr, %struct.inode*, [32 x i8], %struct.lockref, %struct.dentry_operations*, %struct.super_block*, i64, i8*, %union.anon.63, %struct.list_head, %struct.list_head, %union.anon.64 }
%struct.seqcount_spinlock = type { %struct.seqcount }
%struct.seqcount = type { i32 }
%struct.hlist_bl_node = type { %struct.hlist_bl_node*, %struct.hlist_bl_node** }
%struct.qstr = type { %union.anon.0, i8* }
%union.anon.0 = type { i64 }
%struct.lockref = type { %union.anon.61 }
%union.anon.61 = type { %struct.anon.62 }
%struct.anon.62 = type { %struct.spinlock, i32 }

!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "page_entry_size", file: !14, line: 546, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./include/linux/mm.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PE_SIZE_PTE", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "PE_SIZE_PMD", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "PE_SIZE_PUD", value: 2, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !20, line: 65, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !23}
!22 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !25, line: 16, baseType: !7, size: 32, elements: !26)
!25 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_type", file: !31, line: 59, baseType: !7, size: 32, elements: !32)
!31 = !DIFile(filename: "./include/linux/memremap.h", directory: "/home/lizy2001/genbc/linux")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "MEMORY_DEVICE_PRIVATE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "MEMORY_DEVICE_FS_DAX", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "MEMORY_DEVICE_GENERIC", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "MEMORY_DEVICE_PCI_P2PDMA", value: 4, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quota_type", file: !38, line: 54, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./include/linux/quota.h", directory: "/home/lizy2001/genbc/linux")
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "USRQUOTA", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "GRPQUOTA", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PRJQUOTA", value: 2, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !44, line: 26, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rw_hint", file: !50, line: 296, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./include/linux/fs.h", directory: "/home/lizy2001/genbc/linux")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "WRITE_LIFE_NOT_SET", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "WRITE_LIFE_NONE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "WRITE_LIFE_SHORT", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "WRITE_LIFE_MEDIUM", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "WRITE_LIFE_LONG", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "WRITE_LIFE_EXTREME", value: 5, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !59, line: 9, baseType: !7, size: 32, elements: !60)
!59 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIEnumerator(name: "PIDTYPE_PID", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "PIDTYPE_SID", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !67, line: 305, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!73 = !{!74, !436, !137, !115, !437}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xensyms", file: !3, line: 16, size: 1216, elements: !76)
!76 = !{!77, !434, !435}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !75, file: !3, line: 17, baseType: !78, size: 1088)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_platform_op", file: !79, line: 503, size: 1088, elements: !80)
!79 = !DIFile(filename: "./include/xen/interface/platform.h", directory: "/home/lizy2001/genbc/linux")
!80 = !{!81, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !78, file: !79, line: 504, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !83, line: 104, baseType: !84)
!83 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !85, line: 21, baseType: !86)
!85 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !87, line: 27, baseType: !7)
!87 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "interface_version", scope: !78, file: !79, line: 505, baseType: !82, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !78, file: !79, line: 527, baseType: !90, size: 1024, offset: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !79, line: 506, size: 1024, elements: !91)
!91 = !{!92, !102, !109, !120, !125, !132, !139, !143, !228, !282, !289, !295, !304, !389, !397, !401, !407, !414, !419, !430}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "settime32", scope: !90, file: !79, line: 507, baseType: !93, size: 128)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_settime32", file: !79, line: 39, size: 128, elements: !94)
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "secs", scope: !93, file: !79, line: 41, baseType: !82, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nsecs", scope: !93, file: !79, line: 42, baseType: !82, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "system_time", scope: !93, file: !79, line: 43, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !83, line: 107, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !85, line: 23, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !87, line: 31, baseType: !101)
!101 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "settime64", scope: !90, file: !79, line: 508, baseType: !103, size: 192)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_settime64", file: !79, line: 47, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "secs", scope: !103, file: !79, line: 49, baseType: !98, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nsecs", scope: !103, file: !79, line: 50, baseType: !82, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mbz", scope: !103, file: !79, line: 51, baseType: !82, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "system_time", scope: !103, file: !79, line: 52, baseType: !98, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "add_memtype", scope: !90, file: !79, line: 509, baseType: !110, size: 256)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_add_memtype", file: !79, line: 64, size: 256, elements: !111)
!111 = !{!112, !116, !117, !118, !119}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mfn", scope: !110, file: !79, line: 66, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "xen_pfn_t", file: !114, line: 79, baseType: !115)
!114 = !DIFile(filename: "./arch/x86/include/asm/xen/interface.h", directory: "/home/lizy2001/genbc/linux")
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nr_mfns", scope: !110, file: !79, line: 67, baseType: !98, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !79, line: 68, baseType: !82, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !110, file: !79, line: 70, baseType: !82, size: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !110, file: !79, line: 71, baseType: !82, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "del_memtype", scope: !90, file: !79, line: 510, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_del_memtype", file: !79, line: 83, size: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !121, file: !79, line: 85, baseType: !82, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !121, file: !79, line: 86, baseType: !82, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "read_memtype", scope: !90, file: !79, line: 511, baseType: !126, size: 256)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_read_memtype", file: !79, line: 92, size: 256, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !126, file: !79, line: 94, baseType: !82, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mfn", scope: !126, file: !79, line: 96, baseType: !113, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nr_mfns", scope: !126, file: !79, line: 97, baseType: !98, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !79, line: 98, baseType: !82, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "microcode", scope: !90, file: !79, line: 512, baseType: !133, size: 128)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_microcode_update", file: !79, line: 103, size: 128, elements: !134)
!134 = !{!135, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !79, line: 105, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_void", file: !114, line: 91, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !133, file: !79, line: 106, baseType: !82, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "platform_quirk", scope: !90, file: !79, line: 513, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_platform_quirk", file: !79, line: 114, size: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "quirk_id", scope: !140, file: !79, line: 116, baseType: !82, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "efi_runtime_call", scope: !90, file: !79, line: 514, baseType: !144, size: 448)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_efi_runtime_call", file: !79, line: 133, size: 448, elements: !145)
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !144, file: !79, line: 134, baseType: !82, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !144, file: !79, line: 140, baseType: !82, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !144, file: !79, line: 141, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "xen_ulong_t", file: !114, line: 81, baseType: !115)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !144, file: !79, line: 210, baseType: !151, size: 320, offset: 128)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !144, file: !79, line: 142, size: 320, elements: !152)
!152 = !{!153, !182, !183, !184, !185, !201, !202, !208, !215, !222}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !151, file: !79, line: 158, baseType: !154, size: 192)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !79, line: 144, size: 192, elements: !155)
!155 = !{!156, !180, !181}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !154, file: !79, line: 155, baseType: !157, size: 128)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_efi_time", file: !79, line: 145, size: 128, elements: !158)
!158 = !{!159, !164, !169, !170, !171, !172, !173, !174, !179}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !157, file: !79, line: 146, baseType: !160, size: 16)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !83, line: 103, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !85, line: 19, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !87, line: 24, baseType: !163)
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !157, file: !79, line: 147, baseType: !165, size: 8, offset: 16)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !83, line: 102, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !85, line: 17, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !87, line: 21, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !157, file: !79, line: 148, baseType: !165, size: 8, offset: 24)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !157, file: !79, line: 149, baseType: !165, size: 8, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !157, file: !79, line: 150, baseType: !165, size: 8, offset: 40)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !157, file: !79, line: 151, baseType: !165, size: 8, offset: 48)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !157, file: !79, line: 152, baseType: !82, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tz", scope: !157, file: !79, line: 153, baseType: !175, size: 16, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !83, line: 96, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !85, line: 18, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !87, line: 23, baseType: !178)
!178 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "daylight", scope: !157, file: !79, line: 154, baseType: !165, size: 8, offset: 112)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !154, file: !79, line: 156, baseType: !82, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !154, file: !79, line: 157, baseType: !82, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "set_time", scope: !151, file: !79, line: 160, baseType: !157, size: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "get_wakeup_time", scope: !151, file: !79, line: 164, baseType: !157, size: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "set_wakeup_time", scope: !151, file: !79, line: 168, baseType: !157, size: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "get_variable", scope: !151, file: !79, line: 183, baseType: !186, size: 320)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !79, line: 173, size: 320, elements: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !79, line: 174, baseType: !136, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !186, file: !79, line: 175, baseType: !149, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !79, line: 176, baseType: !136, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_guid", scope: !186, file: !79, line: 182, baseType: !192, size: 128, offset: 192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_efi_guid", file: !79, line: 177, size: 128, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data1", scope: !192, file: !79, line: 178, baseType: !82, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data2", scope: !192, file: !79, line: 179, baseType: !160, size: 16, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data3", scope: !192, file: !79, line: 180, baseType: !160, size: 16, offset: 48)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data4", scope: !192, file: !79, line: 181, baseType: !198, size: 64, offset: 64)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 64, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "set_variable", scope: !151, file: !79, line: 183, baseType: !186, size: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_variable_name", scope: !151, file: !79, line: 189, baseType: !203, size: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !79, line: 185, size: 256, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !79, line: 186, baseType: !149, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !79, line: 187, baseType: !136, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_guid", scope: !203, file: !79, line: 188, baseType: !192, size: 128, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "query_variable_info", scope: !151, file: !79, line: 196, baseType: !209, size: 256)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !79, line: 191, size: 256, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !209, file: !79, line: 192, baseType: !82, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "max_store_size", scope: !209, file: !79, line: 193, baseType: !98, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "remain_store_size", scope: !209, file: !79, line: 194, baseType: !98, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !209, file: !79, line: 195, baseType: !98, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "query_capsule_capabilities", scope: !151, file: !79, line: 203, baseType: !216, size: 256)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !79, line: 198, size: 256, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "capsule_header_array", scope: !216, file: !79, line: 199, baseType: !136, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "capsule_count", scope: !216, file: !79, line: 200, baseType: !149, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max_capsule_size", scope: !216, file: !79, line: 201, baseType: !98, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reset_type", scope: !216, file: !79, line: 202, baseType: !82, size: 32, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "update_capsule", scope: !151, file: !79, line: 209, baseType: !223, size: 192)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !79, line: 205, size: 192, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "capsule_header_array", scope: !223, file: !79, line: 206, baseType: !136, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "capsule_count", scope: !223, file: !79, line: 207, baseType: !149, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sg_list", scope: !223, file: !79, line: 208, baseType: !98, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "firmware_info", scope: !90, file: !79, line: 515, baseType: !229, size: 320)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_firmware_info", file: !79, line: 227, size: 320, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !79, line: 229, baseType: !82, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !229, file: !79, line: 230, baseType: !82, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !229, file: !79, line: 279, baseType: !234, size: 256, offset: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !79, line: 232, size: 256, elements: !235)
!235 = !{!236, !246, !251, !259, !281}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "disk_info", scope: !234, file: !79, line: 245, baseType: !237, size: 128)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !234, file: !79, line: 233, size: 128, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !237, file: !79, line: 235, baseType: !165, size: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !237, file: !79, line: 236, baseType: !165, size: 8, offset: 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "interface_support", scope: !237, file: !79, line: 237, baseType: !160, size: 16, offset: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_max_cylinder", scope: !237, file: !79, line: 239, baseType: !160, size: 16, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_max_head", scope: !237, file: !79, line: 240, baseType: !165, size: 8, offset: 48)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_sectors_per_track", scope: !237, file: !79, line: 241, baseType: !165, size: 8, offset: 56)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "edd_params", scope: !237, file: !79, line: 244, baseType: !136, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "disk_mbr_signature", scope: !234, file: !79, line: 249, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !234, file: !79, line: 246, size: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !247, file: !79, line: 247, baseType: !165, size: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mbr_signature", scope: !247, file: !79, line: 248, baseType: !82, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vbeddc_info", scope: !234, file: !79, line: 256, baseType: !252, size: 128)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !234, file: !79, line: 250, size: 128, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !252, file: !79, line: 252, baseType: !165, size: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "edid_transfer_time", scope: !252, file: !79, line: 253, baseType: !165, size: 8, offset: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "edid", scope: !252, file: !79, line: 255, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_uchar", file: !114, line: 87, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "efi_info", scope: !234, file: !79, line: 276, baseType: !260, size: 256)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "xenpf_efi_info", file: !79, line: 258, size: 256, elements: !261)
!261 = !{!262, !263, !268, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !260, file: !79, line: 259, baseType: !82, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !260, file: !79, line: 263, baseType: !264, size: 128)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !79, line: 260, size: 128, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !264, file: !79, line: 261, baseType: !98, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nent", scope: !264, file: !79, line: 262, baseType: !82, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !260, file: !79, line: 269, baseType: !269, size: 128)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !79, line: 264, size: 128, elements: !270)
!270 = !{!271, !272, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !269, file: !79, line: 265, baseType: !82, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bufsz", scope: !269, file: !79, line: 266, baseType: !82, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !79, line: 267, baseType: !136, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !260, file: !79, line: 275, baseType: !275, size: 256)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !79, line: 270, size: 256, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !275, file: !79, line: 271, baseType: !98, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !79, line: 272, baseType: !98, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !275, file: !79, line: 273, baseType: !98, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !79, line: 274, baseType: !82, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "kbd_shift_flags", scope: !234, file: !79, line: 278, baseType: !165, size: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "enter_acpi_sleep", scope: !90, file: !79, line: 516, baseType: !283, size: 96)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_enter_acpi_sleep", file: !79, line: 284, size: 96, elements: !284)
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "val_a", scope: !283, file: !79, line: 286, baseType: !160, size: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "val_b", scope: !283, file: !79, line: 287, baseType: !160, size: 16, offset: 16)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_state", scope: !283, file: !79, line: 288, baseType: !82, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !79, line: 290, baseType: !82, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "change_freq", scope: !90, file: !79, line: 517, baseType: !290, size: 128)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_change_freq", file: !79, line: 295, size: 128, elements: !291)
!291 = !{!292, !293, !294}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !79, line: 297, baseType: !82, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !290, file: !79, line: 298, baseType: !82, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !290, file: !79, line: 299, baseType: !98, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "getidletime", scope: !90, file: !79, line: 518, baseType: !296, size: 256)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_getidletime", file: !79, line: 312, size: 256, elements: !297)
!297 = !{!298, !299, !300, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cpumap_bitmap", scope: !296, file: !79, line: 315, baseType: !257, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cpumap_nr_cpus", scope: !296, file: !79, line: 318, baseType: !82, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idletime", scope: !296, file: !79, line: 320, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_uint64_t", file: !114, line: 92, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !296, file: !79, line: 323, baseType: !98, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set_pminfo", scope: !90, file: !79, line: 519, baseType: !305, size: 896)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_set_processor_pminfo", file: !79, line: 424, size: 896, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !79, line: 426, baseType: !82, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !79, line: 427, baseType: !82, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !305, file: !79, line: 428, baseType: !310, size: 832, offset: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !305, file: !79, line: 428, size: 832, elements: !311)
!311 = !{!312, !349, !386}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !310, file: !79, line: 429, baseType: !313, size: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_processor_power", file: !79, line: 378, size: 128, elements: !314)
!314 = !{!315, !316, !324}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !313, file: !79, line: 379, baseType: !82, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !79, line: 380, baseType: !317, size: 32, offset: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_processor_flags", file: !79, line: 370, size: 32, elements: !318)
!318 = !{!319, !320, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bm_control", scope: !317, file: !79, line: 371, baseType: !82, size: 1, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bm_check", scope: !317, file: !79, line: 372, baseType: !82, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "has_cst", scope: !317, file: !79, line: 373, baseType: !82, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "power_setup_done", scope: !317, file: !79, line: 374, baseType: !82, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bm_rld_set", scope: !317, file: !79, line: 375, baseType: !82, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !313, file: !79, line: 381, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_xen_processor_cx", file: !79, line: 368, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_processor_cx", file: !79, line: 360, size: 384, elements: !328)
!328 = !{!329, !337, !338, !339, !340, !341}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !327, file: !79, line: 361, baseType: !330, size: 192)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_power_register", file: !79, line: 345, size: 192, elements: !331)
!331 = !{!332, !333, !334, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !330, file: !79, line: 346, baseType: !82, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !330, file: !79, line: 347, baseType: !82, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !330, file: !79, line: 348, baseType: !82, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !330, file: !79, line: 349, baseType: !82, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !330, file: !79, line: 350, baseType: !98, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !327, file: !79, line: 362, baseType: !165, size: 8, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !327, file: !79, line: 363, baseType: !82, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !327, file: !79, line: 364, baseType: !82, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dpcnt", scope: !327, file: !79, line: 365, baseType: !82, size: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !327, file: !79, line: 366, baseType: !342, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_xen_processor_csd", file: !79, line: 358, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_processor_csd", file: !79, line: 353, size: 96, elements: !345)
!345 = !{!346, !347, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !344, file: !79, line: 354, baseType: !82, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "coord_type", scope: !344, file: !79, line: 355, baseType: !82, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !344, file: !79, line: 356, baseType: !82, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "perf", scope: !310, file: !79, line: 430, baseType: !350, size: 832)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_processor_performance", file: !79, line: 412, size: 832, elements: !351)
!351 = !{!352, !353, !354, !364, !365, !366, !377, !385}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !79, line: 413, baseType: !82, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "platform_limit", scope: !350, file: !79, line: 414, baseType: !82, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "control_register", scope: !350, file: !79, line: 415, baseType: !355, size: 128, offset: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_pct_register", file: !79, line: 384, size: 128, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !355, file: !79, line: 385, baseType: !165, size: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !355, file: !79, line: 386, baseType: !160, size: 16, offset: 16)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !355, file: !79, line: 387, baseType: !165, size: 8, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !355, file: !79, line: 388, baseType: !165, size: 8, offset: 40)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !355, file: !79, line: 389, baseType: !165, size: 8, offset: 48)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !355, file: !79, line: 390, baseType: !165, size: 8, offset: 56)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !355, file: !79, line: 391, baseType: !98, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "status_register", scope: !350, file: !79, line: 416, baseType: !355, size: 128, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !350, file: !79, line: 417, baseType: !82, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !350, file: !79, line: 418, baseType: !367, size: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_xen_processor_px", file: !79, line: 402, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_processor_px", file: !79, line: 394, size: 384, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "core_frequency", scope: !369, file: !79, line: 395, baseType: !98, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !369, file: !79, line: 396, baseType: !98, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "transition_latency", scope: !369, file: !79, line: 397, baseType: !98, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bus_master_latency", scope: !369, file: !79, line: 398, baseType: !98, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !369, file: !79, line: 399, baseType: !98, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !369, file: !79, line: 400, baseType: !98, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "domain_info", scope: !350, file: !79, line: 419, baseType: !378, size: 320, offset: 448)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xen_psd_package", file: !79, line: 404, size: 320, elements: !379)
!379 = !{!380, !381, !382, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !378, file: !79, line: 405, baseType: !98, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !378, file: !79, line: 406, baseType: !98, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !378, file: !79, line: 407, baseType: !98, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "coord_type", scope: !378, file: !79, line: 408, baseType: !98, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "num_processors", scope: !378, file: !79, line: 409, baseType: !98, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "shared_type", scope: !350, file: !79, line: 420, baseType: !82, size: 32, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pdc", scope: !310, file: !79, line: 431, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_uint32_t", file: !114, line: 93, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pcpu_info", scope: !90, file: !79, line: 520, baseType: !390, size: 160)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_pcpuinfo", file: !79, line: 437, size: 160, elements: !391)
!391 = !{!392, !393, !394, !395, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "xen_cpuid", scope: !390, file: !79, line: 439, baseType: !82, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "max_present", scope: !390, file: !79, line: 442, baseType: !82, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !79, line: 446, baseType: !82, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "apic_id", scope: !390, file: !79, line: 447, baseType: !82, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_id", scope: !390, file: !79, line: 448, baseType: !82, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_ol", scope: !90, file: !79, line: 521, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_cpu_ol", file: !79, line: 454, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid", scope: !398, file: !79, line: 455, baseType: !82, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_add", scope: !90, file: !79, line: 522, baseType: !402, size: 96)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_cpu_hotadd", file: !79, line: 460, size: 96, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "apic_id", scope: !402, file: !79, line: 461, baseType: !82, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_id", scope: !402, file: !79, line: 462, baseType: !82, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pxm", scope: !402, file: !79, line: 463, baseType: !82, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mem_add", scope: !90, file: !79, line: 523, baseType: !408, size: 192)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_mem_hotadd", file: !79, line: 467, size: 192, elements: !409)
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "spfn", scope: !408, file: !79, line: 468, baseType: !98, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "epfn", scope: !408, file: !79, line: 469, baseType: !98, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pxm", scope: !408, file: !79, line: 470, baseType: !82, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !79, line: 471, baseType: !82, size: 32, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "core_parking", scope: !90, file: !79, line: 524, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_core_parking", file: !79, line: 475, size: 64, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !79, line: 479, baseType: !82, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "idle_nums", scope: !415, file: !79, line: 482, baseType: !82, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "symdata", scope: !90, file: !79, line: 525, baseType: !420, size: 256)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenpf_symdata", file: !79, line: 487, size: 256, elements: !421)
!421 = !{!422, !423, !424, !428, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !420, file: !79, line: 489, baseType: !82, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "symnum", scope: !420, file: !79, line: 492, baseType: !82, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !79, line: 497, baseType: !425, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__guest_handle_char", file: !114, line: 89, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !420, file: !79, line: 498, baseType: !98, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !79, line: 499, baseType: !427, size: 8, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !90, file: !79, line: 526, baseType: !431, size: 1024)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 1024, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !3, line: 18, baseType: !426, size: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !75, file: !3, line: 19, baseType: !82, size: 32, offset: 1152)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !83, line: 148, baseType: !7)
!437 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!438 = !{!0, !439}
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "xensyms_seq_ops", scope: !2, file: !3, line: 104, type: !441, isLocal: true, isDefinition: true)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !443, line: 31, size: 256, elements: !444)
!443 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/home/lizy2001/genbc/linux")
!444 = !{!445, !3598, !3599, !3600}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !442, file: !443, line: 32, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!137, !449, !2984}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !443, line: 16, size: 896, elements: !451)
!451 = !{!452, !453, !458, !459, !460, !461, !465, !466, !501, !503, !504, !3597}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !450, file: !443, line: 17, baseType: !426, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !450, file: !443, line: 18, baseType: !454, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 55, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !456, line: 72, baseType: !457)
!456 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !456, line: 16, baseType: !115)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !450, file: !443, line: 19, baseType: !454, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !450, file: !443, line: 20, baseType: !454, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !450, file: !443, line: 21, baseType: !454, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !450, file: !443, line: 22, baseType: !462, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !83, line: 46, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !456, line: 88, baseType: !464)
!464 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !450, file: !443, line: 23, baseType: !462, size: 64, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !450, file: !443, line: 24, baseType: !467, size: 192, offset: 448)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !468, line: 53, size: 192, elements: !469)
!468 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!469 = !{!470, !479, !495}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !467, file: !468, line: 54, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !472, line: 13, baseType: !473)
!472 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !83, line: 175, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 173, size: 64, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !474, file: !83, line: 174, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !85, line: 22, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !87, line: 30, baseType: !464)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !467, file: !468, line: 55, baseType: !480, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !481, line: 83, baseType: !482)
!481 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !481, line: 71, elements: !483)
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !481, line: 72, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !481, line: 72, elements: !486)
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !485, file: !481, line: 73, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !481, line: 20, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !488, file: !481, line: 21, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !492, line: 25, baseType: !493)
!492 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 25, elements: !494)
!494 = !{}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !467, file: !468, line: 59, baseType: !496, size: 128, offset: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !83, line: 178, size: 128, elements: !497)
!497 = !{!498, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !83, line: 179, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !83, line: 179, baseType: !499, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !450, file: !443, line: 25, baseType: !502, size: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !450, file: !443, line: 26, baseType: !437, size: 32, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !450, file: !443, line: 27, baseType: !505, size: 64, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !50, line: 916, size: 1856, align: 32, elements: !508)
!508 = !{!509, !527, !3562, !3563, !3564, !3565, !3566, !3567, !3568, !3569, !3570, !3571, !3580, !3581, !3590, !3591, !3592, !3593, !3594, !3595, !3596}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !507, file: !50, line: 920, baseType: !510, size: 128)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !50, line: 917, size: 128, elements: !511)
!511 = !{!512, !518}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !510, file: !50, line: 918, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !514, line: 58, size: 64, elements: !515)
!514 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !513, file: !514, line: 59, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !510, file: !50, line: 919, baseType: !519, size: 128, align: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !83, line: 216, size: 128, align: 64, elements: !520)
!520 = !{!521, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !83, line: 217, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !519, file: !83, line: 218, baseType: !524, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !522}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !507, file: !50, line: 921, baseType: !528, size: 128, offset: 128)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !529, line: 8, size: 128, elements: !530)
!529 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!530 = !{!531, !535}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !528, file: !529, line: 9, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !534, line: 18, flags: DIFlagFwdDecl)
!534 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !528, file: !529, line: 10, baseType: !536, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !534, line: 89, size: 1536, elements: !538)
!538 = !{!539, !540, !550, !558, !559, !574, !3531, !3533, !3545, !3546, !3547, !3548, !3549, !3554, !3555, !3556}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !537, file: !534, line: 91, baseType: !7, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !537, file: !534, line: 92, baseType: !541, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !542, line: 277, baseType: !543)
!542 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !542, line: 277, size: 32, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !543, file: !542, line: 277, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !542, line: 70, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !542, line: 65, size: 32, elements: !548)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !547, file: !542, line: 66, baseType: !7, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !537, file: !534, line: 93, baseType: !551, size: 128, offset: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !552, line: 38, size: 128, elements: !553)
!552 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!553 = !{!554, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !552, line: 39, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !551, file: !552, line: 39, baseType: !557, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !537, file: !534, line: 94, baseType: !536, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !537, file: !534, line: 95, baseType: !560, size: 128, offset: 256)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !534, line: 47, size: 128, elements: !561)
!561 = !{!562, !571}
!562 = !DIDerivedType(tag: DW_TAG_member, scope: !560, file: !534, line: 48, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !534, line: 48, size: 64, elements: !564)
!564 = !{!565, !570}
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !563, file: !534, line: 49, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !534, line: 49, size: 64, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !566, file: !534, line: 50, baseType: !84, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !566, file: !534, line: 50, baseType: !84, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !563, file: !534, line: 52, baseType: !99, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !534, line: 54, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !537, file: !534, line: 96, baseType: !575, size: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !50, line: 610, size: 4224, elements: !577)
!577 = !{!578, !580, !581, !589, !596, !597, !747, !2929, !2930, !2931, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !3203, !3211, !3212, !3213, !3527, !3528, !3529, !3530}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !576, file: !50, line: 611, baseType: !579, size: 16)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !83, line: 19, baseType: !163)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !576, file: !50, line: 612, baseType: !163, size: 16, offset: 16)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !576, file: !50, line: 613, baseType: !582, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !583, line: 23, baseType: !584)
!583 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 21, size: 32, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !584, file: !583, line: 22, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !83, line: 32, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !456, line: 49, baseType: !7)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !576, file: !50, line: 614, baseType: !590, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !583, line: 28, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 26, size: 32, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !591, file: !583, line: 27, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !83, line: 33, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !456, line: 50, baseType: !7)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !576, file: !50, line: 615, baseType: !7, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !576, file: !50, line: 622, baseType: !598, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !50, line: 1864, size: 1536, align: 512, elements: !601)
!601 = !{!602, !606, !621, !625, !631, !635, !641, !645, !649, !653, !657, !658, !664, !668, !692, !720, !727, !733, !738, !742, !743}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !600, file: !50, line: 1865, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!536, !575, !536, !7}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !600, file: !50, line: 1866, baseType: !607, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !536, !575, !612}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !614, line: 10, size: 128, elements: !615)
!614 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!615 = !{!616, !620}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !613, file: !614, line: 11, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !137}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !613, file: !614, line: 12, baseType: !137, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !600, file: !50, line: 1867, baseType: !622, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!437, !575, !437}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !600, file: !50, line: 1868, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!629, !575, !437}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !50, line: 581, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !600, file: !50, line: 1870, baseType: !632, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!437, !536, !426, !437}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !600, file: !50, line: 1872, baseType: !636, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!437, !575, !536, !579, !639}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !83, line: 30, baseType: !640)
!640 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !600, file: !50, line: 1873, baseType: !642, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!437, !536, !575, !536}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !600, file: !50, line: 1874, baseType: !646, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!437, !575, !536}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !600, file: !50, line: 1875, baseType: !650, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!437, !575, !536, !610}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !600, file: !50, line: 1876, baseType: !654, size: 64, offset: 576)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!437, !575, !536, !579}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !600, file: !50, line: 1877, baseType: !646, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !600, file: !50, line: 1878, baseType: !659, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!437, !575, !536, !579, !662}
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !83, line: 16, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !83, line: 13, baseType: !84)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !600, file: !50, line: 1879, baseType: !665, size: 64, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!437, !575, !536, !575, !536, !7}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !600, file: !50, line: 1881, baseType: !669, size: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!437, !536, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !50, line: 219, size: 640, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !688, !689, !690}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !673, file: !50, line: 220, baseType: !7, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !673, file: !50, line: 221, baseType: !579, size: 16, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !673, file: !50, line: 222, baseType: !582, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !673, file: !50, line: 223, baseType: !590, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !673, file: !50, line: 224, baseType: !462, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !673, file: !50, line: 225, baseType: !681, size: 128, offset: 192)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !682, line: 13, size: 128, elements: !683)
!682 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!683 = !{!684, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !681, file: !682, line: 14, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !682, line: 8, baseType: !478)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !681, file: !682, line: 15, baseType: !687, size: 64, offset: 64)
!687 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !673, file: !50, line: 226, baseType: !681, size: 128, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !673, file: !50, line: 227, baseType: !681, size: 128, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !673, file: !50, line: 234, baseType: !691, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !600, file: !50, line: 1882, baseType: !693, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!437, !696, !698, !84, !7}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !700, line: 22, size: 1152, elements: !701)
!700 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !699, file: !700, line: 23, baseType: !84, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !699, file: !700, line: 24, baseType: !579, size: 16, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !699, file: !700, line: 25, baseType: !7, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !699, file: !700, line: 26, baseType: !82, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !699, file: !700, line: 27, baseType: !99, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !699, file: !700, line: 28, baseType: !99, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !699, file: !700, line: 37, baseType: !99, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !699, file: !700, line: 38, baseType: !662, size: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !699, file: !700, line: 39, baseType: !662, size: 32, offset: 352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !699, file: !700, line: 40, baseType: !582, size: 32, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !699, file: !700, line: 41, baseType: !590, size: 32, offset: 416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !699, file: !700, line: 42, baseType: !462, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !699, file: !700, line: 43, baseType: !681, size: 128, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !699, file: !700, line: 44, baseType: !681, size: 128, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !699, file: !700, line: 45, baseType: !681, size: 128, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !699, file: !700, line: 46, baseType: !681, size: 128, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !699, file: !700, line: 47, baseType: !99, size: 64, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !699, file: !700, line: 48, baseType: !99, size: 64, offset: 1088)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !600, file: !50, line: 1883, baseType: !721, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !536, !426, !454}
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 60, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !456, line: 73, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !456, line: 15, baseType: !687)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !600, file: !50, line: 1884, baseType: !728, size: 64, offset: 1024)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!437, !575, !731, !99, !99}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !50, line: 50, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !600, file: !50, line: 1886, baseType: !734, size: 64, offset: 1088)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!437, !575, !737, !437}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !600, file: !50, line: 1887, baseType: !739, size: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!437, !575, !536, !691, !7, !579}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !600, file: !50, line: 1890, baseType: !654, size: 64, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !600, file: !50, line: 1891, baseType: !744, size: 64, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!437, !575, !629, !437}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !576, file: !50, line: 623, baseType: !748, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !50, line: 1416, size: 9472, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !807, !2536, !2618, !2701, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2717, !2721, !2722, !2725, !2726, !2729, !2730, !2731, !2772, !2799, !2800, !2801, !2802, !2803, !2804, !2807, !2809, !2816, !2817, !2819, !2820, !2821, !2880, !2881, !2896, !2897, !2898, !2899, !2900, !2903, !2904, !2905, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !749, file: !50, line: 1417, baseType: !496, size: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !749, file: !50, line: 1418, baseType: !662, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !749, file: !50, line: 1419, baseType: !168, size: 8, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !749, file: !50, line: 1420, baseType: !115, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !749, file: !50, line: 1421, baseType: !462, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !749, file: !50, line: 1422, baseType: !757, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !50, line: 2228, size: 576, elements: !759)
!759 = !{!760, !761, !762, !768, !772, !776, !780, !784, !785, !795, !798, !799, !800, !804, !805, !806}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !50, line: 2229, baseType: !610, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !758, file: !50, line: 2230, baseType: !437, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !758, file: !50, line: 2238, baseType: !763, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!437, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !50, line: 69, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !758, file: !50, line: 2239, baseType: !769, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !50, line: 70, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !758, file: !50, line: 2240, baseType: !773, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!536, !757, !437, !610, !137}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !758, file: !50, line: 2242, baseType: !777, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !748}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !758, file: !50, line: 2243, baseType: !781, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !783, line: 189, flags: DIFlagFwdDecl)
!783 = !DIFile(filename: "./include/linux/jump_label.h", directory: "/home/lizy2001/genbc/linux")
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !50, line: 2244, baseType: !757, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !758, file: !50, line: 2245, baseType: !786, size: 64, offset: 512)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !83, line: 182, size: 64, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !786, file: !83, line: 183, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !83, line: 186, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !83, line: 187, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !790, file: !83, line: 187, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !758, file: !50, line: 2247, baseType: !796, offset: 576)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !797, line: 187, elements: !494)
!797 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!798 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !758, file: !50, line: 2248, baseType: !796, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !758, file: !50, line: 2249, baseType: !796, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !758, file: !50, line: 2250, baseType: !801, offset: 576)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 3)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !758, file: !50, line: 2252, baseType: !796, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !758, file: !50, line: 2253, baseType: !796, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !758, file: !50, line: 2254, baseType: !796, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !749, file: !50, line: 1423, baseType: !808, size: 64, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !50, line: 1935, size: 1472, elements: !811)
!811 = !{!812, !816, !820, !821, !825, !831, !835, !836, !837, !841, !845, !846, !847, !848, !854, !859, !860, !864, !865, !866, !867, !2520, !2535}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !810, file: !50, line: 1936, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!575, !748}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !810, file: !50, line: 1937, baseType: !817, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !575}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !810, file: !50, line: 1938, baseType: !817, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !810, file: !50, line: 1940, baseType: !822, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !575, !437}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !810, file: !50, line: 1941, baseType: !826, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!437, !575, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !50, line: 289, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !810, file: !50, line: 1942, baseType: !832, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!437, !575}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !810, file: !50, line: 1943, baseType: !817, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !810, file: !50, line: 1944, baseType: !777, size: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !810, file: !50, line: 1945, baseType: !838, size: 64, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!437, !748, !437}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !810, file: !50, line: 1946, baseType: !842, size: 64, offset: 576)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!437, !748}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !810, file: !50, line: 1947, baseType: !842, size: 64, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !810, file: !50, line: 1948, baseType: !842, size: 64, offset: 704)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !810, file: !50, line: 1949, baseType: !842, size: 64, offset: 768)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !810, file: !50, line: 1950, baseType: !849, size: 64, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!437, !536, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !50, line: 57, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !810, file: !50, line: 1951, baseType: !855, size: 64, offset: 896)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!437, !748, !858, !426}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !810, file: !50, line: 1952, baseType: !777, size: 64, offset: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !810, file: !50, line: 1954, baseType: !861, size: 64, offset: 1024)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!437, !449, !536}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !810, file: !50, line: 1955, baseType: !861, size: 64, offset: 1088)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !810, file: !50, line: 1956, baseType: !861, size: 64, offset: 1152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !810, file: !50, line: 1957, baseType: !861, size: 64, offset: 1216)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !810, file: !50, line: 1963, baseType: !868, size: 64, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!437, !748, !871, !436}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !873, line: 68, size: 512, align: 128, elements: !874)
!873 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!874 = !{!875, !876, !2512, !2519}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !873, line: 69, baseType: !115, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, scope: !872, file: !873, line: 77, baseType: !877, size: 320, offset: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !872, file: !873, line: 77, size: 320, elements: !878)
!878 = !{!879, !1057, !1062, !1090, !1098, !1104, !2443, !2511}
!879 = !DIDerivedType(tag: DW_TAG_member, scope: !877, file: !873, line: 78, baseType: !880, size: 320)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !877, file: !873, line: 78, size: 320, elements: !881)
!881 = !{!882, !883, !1055, !1056}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !880, file: !873, line: 84, baseType: !496, size: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !880, file: !873, line: 86, baseType: !884, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !50, line: 451, size: 1216, align: 64, elements: !886)
!886 = !{!887, !888, !895, !896, !901, !916, !925, !926, !927, !928, !1048, !1049, !1052, !1053, !1054}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !885, file: !50, line: 452, baseType: !575, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !885, file: !50, line: 453, baseType: !889, size: 128, offset: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !890, line: 292, size: 128, elements: !891)
!890 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !889, file: !890, line: 293, baseType: !480)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !889, file: !890, line: 295, baseType: !436, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !889, file: !890, line: 296, baseType: !137, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !885, file: !50, line: 454, baseType: !436, size: 32, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !885, file: !50, line: 455, baseType: !897, size: 32, offset: 224)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !83, line: 168, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 166, size: 32, elements: !899)
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !898, file: !83, line: 167, baseType: !437, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !885, file: !50, line: 460, baseType: !902, size: 128, offset: 256)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !903, line: 125, size: 128, elements: !904)
!903 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!904 = !{!905, !915}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !902, file: !903, line: 126, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !903, line: 31, size: 64, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !906, file: !903, line: 32, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !903, line: 24, size: 192, align: 64, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !910, file: !903, line: 25, baseType: !115, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !910, file: !903, line: 26, baseType: !909, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !910, file: !903, line: 27, baseType: !909, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !902, file: !903, line: 127, baseType: !909, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !885, file: !50, line: 461, baseType: !917, size: 256, offset: 384)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !918, line: 35, size: 256, elements: !919)
!918 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!919 = !{!920, !921, !922, !924}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !917, file: !918, line: 36, baseType: !471, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !917, file: !918, line: 42, baseType: !471, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !917, file: !918, line: 46, baseType: !923, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !481, line: 29, baseType: !488)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !917, file: !918, line: 47, baseType: !496, size: 128, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !885, file: !50, line: 462, baseType: !115, size: 64, offset: 640)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !885, file: !50, line: 463, baseType: !115, size: 64, offset: 704)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !885, file: !50, line: 464, baseType: !115, size: 64, offset: 768)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !885, file: !50, line: 465, baseType: !929, size: 64, offset: 832)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !50, line: 367, size: 1408, elements: !932)
!932 = !{!933, !937, !941, !945, !949, !953, !959, !965, !969, !974, !978, !982, !986, !1012, !1016, !1022, !1023, !1024, !1028, !1033, !1037, !1044}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !931, file: !50, line: 368, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!437, !871, !829}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !931, file: !50, line: 369, baseType: !938, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!437, !691, !871}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !931, file: !50, line: 372, baseType: !942, size: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!437, !884, !829}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !931, file: !50, line: 375, baseType: !946, size: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!437, !871}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !931, file: !50, line: 381, baseType: !950, size: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!437, !691, !884, !499, !7}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !931, file: !50, line: 383, baseType: !954, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !50, line: 290, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !931, file: !50, line: 385, baseType: !960, size: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!437, !691, !884, !462, !7, !7, !963, !964}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !931, file: !50, line: 388, baseType: !966, size: 64, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!437, !691, !884, !462, !7, !7, !871, !137}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !931, file: !50, line: 393, baseType: !970, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !884, !973}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !83, line: 125, baseType: !99)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !931, file: !50, line: 394, baseType: !975, size: 64, offset: 576)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !871, !7, !7}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !931, file: !50, line: 395, baseType: !979, size: 64, offset: 640)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!437, !871, !436}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !931, file: !50, line: 396, baseType: !983, size: 64, offset: 704)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !871}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !931, file: !50, line: 397, baseType: !987, size: 64, offset: 768)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!724, !990, !1010}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !50, line: 320, size: 384, elements: !992)
!992 = !{!993, !994, !995, !999, !1000, !1001, !1002, !1003}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !991, file: !50, line: 321, baseType: !691, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !991, file: !50, line: 326, baseType: !462, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !991, file: !50, line: 327, baseType: !996, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !990, !687, !687}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !991, file: !50, line: 328, baseType: !137, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !991, file: !50, line: 329, baseType: !437, size: 32, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !991, file: !50, line: 330, baseType: !161, size: 16, offset: 288)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !991, file: !50, line: 331, baseType: !161, size: 16, offset: 304)
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !991, file: !50, line: 332, baseType: !1004, size: 64, offset: 320)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !991, file: !50, line: 332, size: 64, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !1004, file: !50, line: 333, baseType: !7, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !1004, file: !50, line: 334, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !50, line: 334, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !50, line: 64, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !931, file: !50, line: 402, baseType: !1013, size: 64, offset: 832)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!437, !884, !871, !871, !5}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !931, file: !50, line: 404, baseType: !1017, size: 64, offset: 896)
