; ModuleID = '../bcout/drivers/net/ethernet/synopsys/dwc-xlgmac-hw.llvm.bc'
source_filename = "drivers/net/ethernet/synopsys/dwc-xlgmac-hw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.softnet_data = type { %struct.list_head, %struct.sk_buff_head, i32, i32, i32, %struct.Qdisc*, %struct.Qdisc**, %struct.sk_buff*, %struct.anon.131, i32, %struct.sk_buff_head, %struct.napi_struct }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.Qdisc = type opaque
%struct.sk_buff = type { %union.anon, %union.anon.2, %union.anon.3, [48 x i8], %union.anon.4, i32, i32, i16, i16, i16, [0 x i8], i8, [0 x i32], [0 x i8], i16, [0 x i8], i16, %union.anon.6, i32, i32, i32, i16, i16, %union.anon.8, %union.anon.9, %union.anon.10, i16, i16, i16, i16, i16, i16, i16, [0 x i32], i32, i32, i8*, i8*, i32, %struct.refcount_struct }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { %struct.sk_buff*, %struct.sk_buff*, %union.anon.1 }
%union.anon.1 = type { %struct.net_device* }

!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !237, line: 602, baseType: !11, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256}
!251 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!252 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!255 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!256 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !237, line: 615, baseType: !11, size: 32, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!260 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!261 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!262 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !237, line: 626, baseType: !11, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269}
!265 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!267 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!268 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!269 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !237, line: 638, baseType: !11, size: 32, elements: !271)
!271 = !{!272, !273}
!272 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !237, line: 647, baseType: !11, size: 32, elements: !275)
!275 = !{!276, !277}
!276 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !279, line: 54, baseType: !11, size: 32, elements: !280)
!279 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!280 = !{!281, !282, !283, !284}
!281 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !286, line: 26, baseType: !11, size: 32, elements: !287)
!286 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!287 = !{!288, !289, !290}
!288 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!290 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !4, line: 423, baseType: !11, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !298, file: !4, line: 2085, baseType: !11, size: 32, elements: !7386)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !4, line: 1858, size: 15808, elements: !299)
!299 = !{!300, !305, !328, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !362, !370, !371, !372, !373, !374, !375, !376, !377, !378, !404, !414, !415, !416, !421, !422, !426, !429, !5521, !6037, !6041, !6081, !6082, !6083, !6084, !6085, !6086, !6087, !6088, !6089, !6090, !6091, !6092, !6093, !6094, !6095, !6096, !6097, !6098, !6099, !6100, !6101, !6102, !6103, !6104, !6105, !6106, !6107, !6112, !6113, !6114, !6390, !6391, !6392, !6393, !6396, !6399, !6402, !6405, !6408, !6409, !6422, !6423, !6424, !6425, !6426, !6427, !6434, !6435, !6469, !6470, !6471, !6472, !6473, !6474, !6475, !6476, !6477, !6480, !6481, !6482, !6483, !6484, !6485, !6486, !6487, !6488, !6493, !6494, !6495, !6500, !6537, !6999, !7001, !7002, !7006, !7007, !7008, !7009, !7015, !7017, !7364, !7365, !7367, !7368, !7369, !7370, !7371, !7375, !7378}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !4, line: 1859, baseType: !301, size: 128)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !303)
!302 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!303 = !{!304}
!304 = !DISubrange(count: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !298, file: !4, line: 1860, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !4, line: 938, size: 384, elements: !308)
!308 = !{!309, !317, !323, !325}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !307, file: !4, line: 939, baseType: !310, size: 128)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !311, line: 186, size: 128, elements: !312)
!311 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !311, line: 187, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !310, file: !311, line: 187, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !4, line: 940, baseType: !318, size: 128, offset: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !311, line: 178, size: 128, elements: !319)
!319 = !{!320, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !311, line: 179, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !311, line: 179, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !307, file: !4, line: 941, baseType: !324, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !4, line: 942, baseType: !326, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !298, file: !4, line: 1861, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !4, line: 930, size: 128, elements: !331)
!331 = !{!332, !341}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !330, file: !4, line: 931, baseType: !333, size: 128, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !311, line: 216, size: 128, align: 64, elements: !334)
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !311, line: 217, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !333, file: !311, line: 218, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !336}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !330, file: !4, line: 932, baseType: !342, offset: 128)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: -1)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !298, file: !4, line: 1866, baseType: !346, size: 64, offset: 256)
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !298, file: !4, line: 1867, baseType: !346, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !298, file: !4, line: 1868, baseType: !346, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !298, file: !4, line: 1869, baseType: !5, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !298, file: !4, line: 1877, baseType: !346, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !298, file: !4, line: 1879, baseType: !318, size: 128, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !298, file: !4, line: 1880, baseType: !318, size: 128, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !298, file: !4, line: 1881, baseType: !318, size: 128, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !298, file: !4, line: 1882, baseType: !318, size: 128, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !298, file: !4, line: 1883, baseType: !318, size: 128, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !298, file: !4, line: 1884, baseType: !318, size: 128, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !298, file: !4, line: 1889, baseType: !358, size: 256, offset: 1344)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !298, file: !4, line: 1886, size: 256, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !358, file: !4, line: 1887, baseType: !318, size: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !358, file: !4, line: 1888, baseType: !318, size: 128, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !298, file: !4, line: 1891, baseType: !363, size: 64, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !364, line: 12, baseType: !365)
!364 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !366, line: 23, baseType: !367)
!366 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !368, line: 31, baseType: !369)
!368 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!369 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !298, file: !4, line: 1892, baseType: !363, size: 64, offset: 1664)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !298, file: !4, line: 1893, baseType: !363, size: 64, offset: 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !298, file: !4, line: 1894, baseType: !363, size: 64, offset: 1792)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !298, file: !4, line: 1895, baseType: !363, size: 64, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !298, file: !4, line: 1896, baseType: !363, size: 64, offset: 1920)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !298, file: !4, line: 1897, baseType: !363, size: 64, offset: 1984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !298, file: !4, line: 1899, baseType: !5, size: 32, offset: 2048)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !298, file: !4, line: 1900, baseType: !5, size: 32, offset: 2080)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !298, file: !4, line: 1902, baseType: !379, size: 1472, offset: 2112)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !4, line: 169, size: 1472, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !379, file: !4, line: 170, baseType: !346, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !379, file: !4, line: 171, baseType: !346, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !379, file: !4, line: 172, baseType: !346, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !379, file: !4, line: 173, baseType: !346, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !379, file: !4, line: 174, baseType: !346, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !379, file: !4, line: 175, baseType: !346, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !379, file: !4, line: 176, baseType: !346, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !379, file: !4, line: 177, baseType: !346, size: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !379, file: !4, line: 178, baseType: !346, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !379, file: !4, line: 179, baseType: !346, size: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !379, file: !4, line: 180, baseType: !346, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !379, file: !4, line: 181, baseType: !346, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !379, file: !4, line: 182, baseType: !346, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !379, file: !4, line: 183, baseType: !346, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !379, file: !4, line: 184, baseType: !346, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !379, file: !4, line: 185, baseType: !346, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !379, file: !4, line: 186, baseType: !346, size: 64, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !379, file: !4, line: 187, baseType: !346, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !379, file: !4, line: 188, baseType: !346, size: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !379, file: !4, line: 189, baseType: !346, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !379, file: !4, line: 190, baseType: !346, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !379, file: !4, line: 191, baseType: !346, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !379, file: !4, line: 192, baseType: !346, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !298, file: !4, line: 1904, baseType: !405, size: 64, offset: 3584)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !406, line: 13, baseType: !407)
!406 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !311, line: 175, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 173, size: 64, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !408, file: !311, line: 174, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !366, line: 22, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !368, line: 30, baseType: !413)
!413 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !298, file: !4, line: 1905, baseType: !405, size: 64, offset: 3648)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !298, file: !4, line: 1906, baseType: !405, size: 64, offset: 3712)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !298, file: !4, line: 1909, baseType: !417, size: 32, offset: 3776)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !311, line: 168, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 166, size: 32, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !418, file: !311, line: 167, baseType: !5, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !298, file: !4, line: 1910, baseType: !417, size: 32, offset: 3808)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !298, file: !4, line: 1913, baseType: !423, size: 64, offset: 3840)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !4, line: 1913, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !298, file: !4, line: 1914, baseType: !427, size: 64, offset: 3904)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !4, line: 1914, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !298, file: !4, line: 1916, baseType: !430, size: 64, offset: 3968)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !4, line: 1283, size: 4416, elements: !433)
!433 = !{!434, !438, !442, !443, !444, !607, !611, !616, !620, !621, !626, !627, !750, !755, !759, !765, !769, !801, !809, !813, !818, !822, !823, !829, !833, !837, !841, !842, !864, !868, !883, !894, !898, !907, !911, !912, !916, !937, !941, !945, !949, !953, !960, !964, !982, !986, !1036, !1040, !1045, !1049, !1053, !1057, !1067, !1068, !1077, !1083, !1084, !1088, !1092, !1096, !1100, !1101, !1105, !1106, !5481, !5501, !5505, !5511, !5517}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !432, file: !4, line: 1284, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!5, !324}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !432, file: !4, line: 1285, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !324}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !432, file: !4, line: 1286, baseType: !435, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !432, file: !4, line: 1287, baseType: !435, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !432, file: !4, line: 1288, baseType: !445, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !449, !324}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !4, line: 120, baseType: !3)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !451, line: 713, size: 1600, elements: !452)
!451 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!452 = !{!453, !475, !483, !490, !494, !506, !507, !508, !511, !512, !513, !519, !520, !521, !522, !523, !524, !525, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !565, !566, !567, !568, !570, !571, !576, !581, !586, !587, !588, !589, !590, !591, !592, !593, !594, !596, !597, !599, !600, !601}
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 714, baseType: !454, size: 192)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 714, size: 192, elements: !455)
!455 = !{!456, !466, !474}
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !454, file: !451, line: 715, baseType: !457, size: 192)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !454, file: !451, line: 715, size: 192, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !451, line: 717, baseType: !449, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !451, line: 718, baseType: !449, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !457, file: !451, line: 720, baseType: !462, size: 64, offset: 128)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !457, file: !451, line: 720, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !462, file: !451, line: 721, baseType: !324, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !462, file: !451, line: 726, baseType: !346, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !454, file: !451, line: 729, baseType: !467, size: 192, align: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !468, line: 24, size: 192, align: 64, elements: !469)
!468 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!469 = !{!470, !471, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !467, file: !468, line: 25, baseType: !346, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !467, file: !468, line: 26, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !467, file: !468, line: 27, baseType: !472, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !454, file: !451, line: 730, baseType: !318, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 733, baseType: !476, size: 64, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 733, size: 64, elements: !477)
!477 = !{!478, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !476, file: !451, line: 734, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !481, line: 124, flags: DIFlagFwdDecl)
!481 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !476, file: !451, line: 735, baseType: !5, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 738, baseType: !484, size: 64, offset: 256)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 738, size: 64, elements: !485)
!485 = !{!486, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !484, file: !451, line: 739, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !488, line: 29, baseType: !411)
!488 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!489 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !484, file: !451, line: 740, baseType: !365, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !450, file: !451, line: 748, baseType: !491, size: 384, align: 64, offset: 320)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 384, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 750, baseType: !495, size: 128, offset: 704)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 750, size: 128, elements: !496)
!496 = !{!497, !505}
!497 = !DIDerivedType(tag: DW_TAG_member, scope: !495, file: !451, line: 751, baseType: !498, size: 128)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !495, file: !451, line: 751, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !498, file: !451, line: 752, baseType: !346, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !498, file: !451, line: 753, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !449}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !495, file: !451, line: 755, baseType: !318, size: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !450, file: !451, line: 761, baseType: !11, size: 32, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !450, file: !451, line: 762, baseType: !11, size: 32, offset: 864)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !450, file: !451, line: 763, baseType: !509, size: 16, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !368, line: 24, baseType: !510)
!510 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !450, file: !451, line: 764, baseType: !509, size: 16, offset: 912)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !450, file: !451, line: 769, baseType: !509, size: 16, offset: 928)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !450, file: !451, line: 780, baseType: !514, offset: 944)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, elements: !517)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !368, line: 21, baseType: !516)
!516 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!517 = !{!518}
!518 = !DISubrange(count: 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !450, file: !451, line: 782, baseType: !515, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !450, file: !451, line: 783, baseType: !515, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !450, file: !451, line: 784, baseType: !515, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !450, file: !451, line: 785, baseType: !515, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !450, file: !451, line: 786, baseType: !515, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !450, file: !451, line: 787, baseType: !515, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !450, file: !451, line: 795, baseType: !526, offset: 960)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, elements: !517)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !368, line: 27, baseType: !11)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !450, file: !451, line: 807, baseType: !514, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !450, file: !451, line: 809, baseType: !515, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !450, file: !451, line: 810, baseType: !515, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !450, file: !451, line: 811, baseType: !515, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !450, file: !451, line: 812, baseType: !515, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !450, file: !451, line: 813, baseType: !515, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !450, file: !451, line: 815, baseType: !515, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !450, file: !451, line: 816, baseType: !515, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !450, file: !451, line: 817, baseType: !515, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !450, file: !451, line: 818, baseType: !515, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !450, file: !451, line: 819, baseType: !515, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !450, file: !451, line: 821, baseType: !515, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !450, file: !451, line: 822, baseType: !515, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !450, file: !451, line: 823, baseType: !515, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !450, file: !451, line: 832, baseType: !514, offset: 976)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !450, file: !451, line: 834, baseType: !515, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !450, file: !451, line: 835, baseType: !515, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !450, file: !451, line: 836, baseType: !515, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !450, file: !451, line: 837, baseType: !515, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !450, file: !451, line: 838, baseType: !515, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !450, file: !451, line: 840, baseType: !515, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !450, file: !451, line: 843, baseType: !515, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !450, file: !451, line: 844, baseType: !515, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !450, file: !451, line: 845, baseType: !515, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !450, file: !451, line: 847, baseType: !515, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !450, file: !451, line: 848, baseType: !515, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!554 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 866, baseType: !555, size: 32, offset: 992)
!555 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 866, size: 32, elements: !556)
!556 = !{!557, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !555, file: !451, line: 867, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !559, line: 37, baseType: !527)
!559 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!560 = !DIDerivedType(tag: DW_TAG_member, scope: !555, file: !451, line: 868, baseType: !561, size: 32)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !555, file: !451, line: 868, size: 32, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !561, file: !451, line: 869, baseType: !509, size: 16)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !561, file: !451, line: 870, baseType: !509, size: 16, offset: 16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !450, file: !451, line: 873, baseType: !527, size: 32, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !450, file: !451, line: 874, baseType: !5, size: 32, offset: 1056)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !450, file: !451, line: 875, baseType: !527, size: 32, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !450, file: !451, line: 876, baseType: !569, size: 16, offset: 1120)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !559, line: 30, baseType: !509)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !450, file: !451, line: 877, baseType: !509, size: 16, offset: 1136)
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 879, baseType: !572, size: 32, offset: 1152)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 879, size: 32, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !572, file: !451, line: 880, baseType: !11, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !572, file: !451, line: 881, baseType: !11, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 888, baseType: !577, size: 32, offset: 1184)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 888, size: 32, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !577, file: !451, line: 889, baseType: !527, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !577, file: !451, line: 890, baseType: !527, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !451, line: 893, baseType: !582, size: 16, offset: 1216)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !451, line: 893, size: 16, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !582, file: !451, line: 894, baseType: !569, size: 16)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !582, file: !451, line: 895, baseType: !515, size: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !450, file: !451, line: 898, baseType: !509, size: 16, offset: 1232)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !450, file: !451, line: 899, baseType: !509, size: 16, offset: 1248)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !450, file: !451, line: 900, baseType: !509, size: 16, offset: 1264)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !450, file: !451, line: 902, baseType: !569, size: 16, offset: 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !450, file: !451, line: 903, baseType: !509, size: 16, offset: 1296)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !450, file: !451, line: 904, baseType: !509, size: 16, offset: 1312)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !450, file: !451, line: 905, baseType: !509, size: 16, offset: 1328)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !450, file: !451, line: 908, baseType: !526, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !450, file: !451, line: 912, baseType: !595, size: 32, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !451, line: 606, baseType: !11)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !450, file: !451, line: 913, baseType: !595, size: 32, offset: 1376)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !450, file: !451, line: 914, baseType: !598, size: 64, offset: 1408)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !451, line: 915, baseType: !598, size: 64, offset: 1472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !450, file: !451, line: 916, baseType: !11, size: 32, offset: 1536)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !450, file: !451, line: 917, baseType: !602, size: 32, offset: 1568)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !603, line: 113, baseType: !604)
!603 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !603, line: 111, size: 32, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !604, file: !603, line: 112, baseType: !417, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !432, file: !4, line: 1290, baseType: !608, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!363, !449, !324, !363}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !432, file: !4, line: 1293, baseType: !612, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!615, !324, !449, !324}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !366, line: 19, baseType: !509)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !432, file: !4, line: 1296, baseType: !617, size: 64, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !324, !5}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !432, file: !4, line: 1298, baseType: !439, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !432, file: !4, line: 1299, baseType: !622, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!5, !324, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !432, file: !4, line: 1301, baseType: !435, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !432, file: !4, line: 1302, baseType: !628, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!5, !324, !631, !5}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !633, line: 234, size: 320, elements: !634)
!633 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!634 = !{!635, !639}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !632, file: !633, line: 239, baseType: !636, size: 128)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !633, line: 236, size: 128, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !636, file: !633, line: 238, baseType: !301, size: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !632, file: !633, line: 255, baseType: !640, size: 192, offset: 128)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !633, line: 241, size: 192, elements: !641)
!641 = !{!642, !654, !655, !656, !657, !658, !660, !661, !662, !671, !672, !673, !674}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !640, file: !633, line: 242, baseType: !643, size: 128)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !644, line: 32, size: 128, elements: !645)
!644 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!645 = !{!646, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !643, file: !644, line: 33, baseType: !647, size: 16)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !644, line: 26, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !649, line: 10, baseType: !510)
!649 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !643, file: !644, line: 34, baseType: !651, size: 112, offset: 16)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 112, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 14)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !640, file: !633, line: 243, baseType: !643, size: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !640, file: !633, line: 244, baseType: !643, size: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !640, file: !633, line: 245, baseType: !643, size: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !640, file: !633, line: 246, baseType: !643, size: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !640, file: !633, line: 247, baseType: !659, size: 16)
!659 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !640, file: !633, line: 248, baseType: !5, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !640, file: !633, line: 249, baseType: !5, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !640, file: !633, line: 250, baseType: !663, size: 192)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !633, line: 196, size: 192, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !663, file: !633, line: 197, baseType: !346, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !663, file: !633, line: 198, baseType: !346, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !663, file: !633, line: 199, baseType: !510, size: 16, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !663, file: !633, line: 200, baseType: !516, size: 8, offset: 144)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !663, file: !633, line: 201, baseType: !516, size: 8, offset: 152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !663, file: !633, line: 202, baseType: !516, size: 8, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !640, file: !633, line: 251, baseType: !301, size: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !640, file: !633, line: 252, baseType: !301, size: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !640, file: !633, line: 253, baseType: !625, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !640, file: !633, line: 254, baseType: !675, size: 128)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !633, line: 207, size: 128, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !633, line: 208, baseType: !11, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !675, file: !633, line: 209, baseType: !11, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !675, file: !633, line: 222, baseType: !680, size: 64, offset: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !675, file: !633, line: 210, size: 64, elements: !681)
!681 = !{!682, !690, !697, !709, !715, !722, !733, !741}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !680, file: !633, line: 212, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !685, line: 56, baseType: !686)
!685 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 53, size: 32, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !686, file: !685, line: 54, baseType: !510, size: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !686, file: !685, line: 55, baseType: !510, size: 16, offset: 16)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !680, file: !633, line: 213, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !685, line: 80, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 77, size: 64, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !693, file: !685, line: 78, baseType: !11, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !693, file: !685, line: 79, baseType: !11, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !680, file: !633, line: 214, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !685, line: 66, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 58, size: 192, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !700, file: !685, line: 59, baseType: !11, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !700, file: !685, line: 60, baseType: !11, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !700, file: !685, line: 61, baseType: !11, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !700, file: !685, line: 62, baseType: !11, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !700, file: !685, line: 63, baseType: !11, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !700, file: !685, line: 64, baseType: !510, size: 16, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !700, file: !685, line: 65, baseType: !510, size: 16, offset: 176)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !680, file: !633, line: 215, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !685, line: 70, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 68, size: 32, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !712, file: !685, line: 69, baseType: !11, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !680, file: !633, line: 216, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !685, line: 75, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 72, size: 160, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !718, file: !685, line: 73, baseType: !11, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !718, file: !685, line: 74, baseType: !301, size: 128, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !680, file: !633, line: 217, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !685, line: 89, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 82, size: 192, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !725, file: !685, line: 83, baseType: !510, size: 16)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !725, file: !685, line: 84, baseType: !11, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !725, file: !685, line: 85, baseType: !11, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !725, file: !685, line: 86, baseType: !11, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !725, file: !685, line: 87, baseType: !11, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !725, file: !685, line: 88, baseType: !11, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !680, file: !633, line: 220, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !685, line: 44, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 40, size: 96, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !736, file: !685, line: 41, baseType: !11, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !736, file: !685, line: 42, baseType: !11, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !736, file: !685, line: 43, baseType: !510, size: 16, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !680, file: !633, line: 221, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !685, line: 51, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 46, size: 128, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !744, file: !685, line: 47, baseType: !11, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !744, file: !685, line: 48, baseType: !11, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !744, file: !685, line: 49, baseType: !510, size: 16, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !744, file: !685, line: 50, baseType: !11, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !432, file: !4, line: 1304, baseType: !751, size: 64, offset: 768)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!5, !324, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !432, file: !4, line: 1306, baseType: !756, size: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!5, !324, !5}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !432, file: !4, line: 1308, baseType: !760, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!5, !324, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !4, line: 206, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !432, file: !4, line: 1310, baseType: !766, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !324, !11}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !432, file: !4, line: 1313, baseType: !770, size: 64, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !324, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !775, line: 214, size: 1536, elements: !776)
!775 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !774, file: !775, line: 215, baseType: !367, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !774, file: !775, line: 216, baseType: !367, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !774, file: !775, line: 217, baseType: !367, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !774, file: !775, line: 218, baseType: !367, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !774, file: !775, line: 219, baseType: !367, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !774, file: !775, line: 220, baseType: !367, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !774, file: !775, line: 221, baseType: !367, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !774, file: !775, line: 222, baseType: !367, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !774, file: !775, line: 223, baseType: !367, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !774, file: !775, line: 224, baseType: !367, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !774, file: !775, line: 227, baseType: !367, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !774, file: !775, line: 228, baseType: !367, size: 64, offset: 704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !774, file: !775, line: 229, baseType: !367, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !774, file: !775, line: 230, baseType: !367, size: 64, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !774, file: !775, line: 231, baseType: !367, size: 64, offset: 896)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !774, file: !775, line: 232, baseType: !367, size: 64, offset: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !774, file: !775, line: 235, baseType: !367, size: 64, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !774, file: !775, line: 236, baseType: !367, size: 64, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !774, file: !775, line: 237, baseType: !367, size: 64, offset: 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !774, file: !775, line: 238, baseType: !367, size: 64, offset: 1216)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !774, file: !775, line: 239, baseType: !367, size: 64, offset: 1280)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !774, file: !775, line: 242, baseType: !367, size: 64, offset: 1344)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !774, file: !775, line: 243, baseType: !367, size: 64, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !774, file: !775, line: 244, baseType: !367, size: 64, offset: 1472)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !432, file: !4, line: 1315, baseType: !802, size: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!805, !807, !5}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !311, line: 30, baseType: !806)
!806 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !432, file: !4, line: 1316, baseType: !810, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!5, !5, !807, !625}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !432, file: !4, line: 1319, baseType: !814, size: 64, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !324}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !432, file: !4, line: 1321, baseType: !819, size: 64, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!5, !324, !569, !615}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !432, file: !4, line: 1323, baseType: !819, size: 64, offset: 1344)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !432, file: !4, line: 1331, baseType: !824, size: 64, offset: 1408)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!5, !324, !5, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !366, line: 17, baseType: !515)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !432, file: !4, line: 1333, baseType: !830, size: 64, offset: 1472)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!5, !324, !5, !615, !828, !569}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !432, file: !4, line: 1336, baseType: !834, size: 64, offset: 1536)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!5, !324, !5, !5, !5}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !432, file: !4, line: 1339, baseType: !838, size: 64, offset: 1600)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!5, !324, !5, !805}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !432, file: !4, line: 1341, baseType: !838, size: 64, offset: 1664)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !432, file: !4, line: 1343, baseType: !843, size: 64, offset: 1728)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!5, !324, !5, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !848, line: 20, size: 576, elements: !849)
!848 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!849 = !{!850, !851, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !847, file: !848, line: 21, baseType: !527, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !847, file: !848, line: 22, baseType: !852, size: 256, offset: 32)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 256, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !847, file: !848, line: 23, baseType: !527, size: 32, offset: 288)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !847, file: !848, line: 24, baseType: !527, size: 32, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !847, file: !848, line: 25, baseType: !527, size: 32, offset: 352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !847, file: !848, line: 26, baseType: !527, size: 32, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !847, file: !848, line: 27, baseType: !527, size: 32, offset: 416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !847, file: !848, line: 28, baseType: !527, size: 32, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !847, file: !848, line: 29, baseType: !527, size: 32, offset: 480)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !847, file: !848, line: 30, baseType: !527, size: 32, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !847, file: !848, line: 31, baseType: !569, size: 16, offset: 544)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !432, file: !4, line: 1346, baseType: !865, size: 64, offset: 1792)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!5, !324, !5, !5}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !432, file: !4, line: 1348, baseType: !869, size: 64, offset: 1856)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!5, !324, !5, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !848, line: 9, size: 512, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !873, file: !848, line: 10, baseType: !367, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !873, file: !848, line: 11, baseType: !367, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !873, file: !848, line: 12, baseType: !367, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !873, file: !848, line: 13, baseType: !367, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !873, file: !848, line: 14, baseType: !367, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !873, file: !848, line: 15, baseType: !367, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !873, file: !848, line: 16, baseType: !367, size: 64, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !873, file: !848, line: 17, baseType: !367, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !432, file: !4, line: 1352, baseType: !884, size: 64, offset: 1920)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!5, !324, !5, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !890, line: 213, size: 32, elements: !891)
!890 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !889, file: !890, line: 214, baseType: !509, size: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !889, file: !890, line: 215, baseType: !509, size: 16, offset: 16)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !432, file: !4, line: 1355, baseType: !895, size: 64, offset: 1984)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!5, !324, !5, !449}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !432, file: !4, line: 1357, baseType: !899, size: 64, offset: 2048)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!5, !324, !5, !902, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !775, line: 956, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !903, file: !775, line: 957, baseType: !527, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !903, file: !775, line: 958, baseType: !367, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !432, file: !4, line: 1361, baseType: !908, size: 64, offset: 2112)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!5, !324, !5, !365, !5}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !432, file: !4, line: 1364, baseType: !838, size: 64, offset: 2176)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !432, file: !4, line: 1367, baseType: !913, size: 64, offset: 2240)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!5, !324, !10, !625}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !432, file: !4, line: 1400, baseType: !917, size: 64, offset: 2304)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!5, !324, !324, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !922, line: 75, size: 384, elements: !923)
!922 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!923 = !{!924, !925, !928, !932, !936}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !921, file: !922, line: 76, baseType: !326, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !921, file: !922, line: 77, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !921, file: !922, line: 78, baseType: !929, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !922, line: 78, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !921, file: !922, line: 79, baseType: !933, size: 160, offset: 192)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 160, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 20)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !921, file: !922, line: 80, baseType: !828, size: 8, offset: 352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !432, file: !4, line: 1403, baseType: !938, size: 64, offset: 2368)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!5, !324, !324}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !432, file: !4, line: 1405, baseType: !942, size: 64, offset: 2432)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!324, !324, !449, !805}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !432, file: !4, line: 1408, baseType: !946, size: 64, offset: 2496)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!363, !324, !363}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !432, file: !4, line: 1410, baseType: !950, size: 64, offset: 2560)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!5, !324, !363}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !432, file: !4, line: 1412, baseType: !954, size: 64, offset: 2624)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!5, !324, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !959, line: 35, flags: DIFlagFwdDecl)
!959 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !432, file: !4, line: 1414, baseType: !961, size: 64, offset: 2688)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !324, !957}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !432, file: !4, line: 1417, baseType: !965, size: 64, offset: 2752)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!5, !968, !887, !324, !980, !615, !615, !920}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !970, line: 8, size: 96, elements: !971)
!970 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!971 = !{!972, !973, !974, !975, !977, !978, !979}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !969, file: !970, line: 9, baseType: !515, size: 8)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !969, file: !970, line: 10, baseType: !515, size: 8, offset: 8)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !969, file: !970, line: 11, baseType: !509, size: 16, offset: 16)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !969, file: !970, line: 12, baseType: !976, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !368, line: 26, baseType: !5)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !969, file: !970, line: 13, baseType: !509, size: 16, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !969, file: !970, line: 14, baseType: !515, size: 8, offset: 80)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !969, file: !970, line: 15, baseType: !515, size: 8, offset: 88)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !432, file: !4, line: 1424, baseType: !983, size: 64, offset: 2816)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!5, !968, !887, !324, !980, !615}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !432, file: !4, line: 1429, baseType: !987, size: 64, offset: 2880)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!5, !449, !990, !324, !324, !1035}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !922, line: 203, size: 1024, elements: !992)
!992 = !{!993, !994, !1004, !1008, !1012, !1013, !1017, !1018, !1019, !1020, !1022, !1023, !1024, !1025}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !991, file: !922, line: 204, baseType: !449, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !991, file: !922, line: 205, baseType: !995, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !890, line: 44, size: 128, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !997, file: !890, line: 45, baseType: !527, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !997, file: !890, line: 46, baseType: !509, size: 16, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !997, file: !890, line: 47, baseType: !509, size: 16, offset: 48)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !997, file: !890, line: 48, baseType: !527, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !997, file: !890, line: 49, baseType: !527, size: 32, offset: 96)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !991, file: !922, line: 206, baseType: !1005, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!5, !449, !990}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !991, file: !922, line: 208, baseType: !1009, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!5, !990}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !991, file: !922, line: 209, baseType: !625, size: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !991, file: !922, line: 211, baseType: !1014, size: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1016, line: 76, flags: DIFlagFwdDecl)
!1016 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !991, file: !922, line: 212, baseType: !920, size: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !991, file: !922, line: 213, baseType: !615, size: 16, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !991, file: !922, line: 214, baseType: !615, size: 16, offset: 464)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !991, file: !922, line: 215, baseType: !1021, size: 32, offset: 480)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !366, line: 21, baseType: !527)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !991, file: !922, line: 216, baseType: !11, size: 32, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !991, file: !922, line: 216, baseType: !11, size: 32, offset: 544)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !991, file: !922, line: 217, baseType: !805, size: 8, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, scope: !991, file: !922, line: 218, baseType: !1026, size: 384, offset: 640)
!1026 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !991, file: !922, line: 218, size: 384, elements: !1027)
!1027 = !{!1028, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1026, file: !922, line: 219, baseType: !1029, size: 384)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 384, elements: !492)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1026, file: !922, line: 224, baseType: !1031, size: 384)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 384, elements: !1033)
!1032 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1033 = !{!1034}
!1034 = !DISubrange(count: 6)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !432, file: !4, line: 1434, baseType: !1037, size: 64, offset: 2944)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!5, !449, !887, !324, !980, !615, !1021, !1021, !920}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !432, file: !4, line: 1440, baseType: !1041, size: 64, offset: 3008)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!5, !324, !1044, !615, !920}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !432, file: !4, line: 1444, baseType: !1046, size: 64, offset: 3072)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!5, !449, !1021, !1021, !324, !1021, !5}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !432, file: !4, line: 1449, baseType: !1050, size: 64, offset: 3136)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!5, !324, !1044, !615}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !432, file: !4, line: 1452, baseType: !1054, size: 64, offset: 3200)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!5, !324, !805}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !432, file: !4, line: 1454, baseType: !1058, size: 64, offset: 3264)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!5, !324, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !4, line: 820, size: 264, elements: !1063)
!1063 = !{!1064, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1062, file: !4, line: 821, baseType: !1065, size: 256)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 256, elements: !853)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1062, file: !4, line: 822, baseType: !516, size: 8, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !432, file: !4, line: 1456, baseType: !1058, size: 64, offset: 3328)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !432, file: !4, line: 1458, baseType: !1069, size: 64, offset: 3392)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!5, !324, !1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !311, line: 55, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1075, line: 72, baseType: !1076)
!1075 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1075, line: 16, baseType: !346)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !432, file: !4, line: 1460, baseType: !1078, size: 64, offset: 3456)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{null, !324, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !4, line: 67, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !432, file: !4, line: 1462, baseType: !1078, size: 64, offset: 3520)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !432, file: !4, line: 1464, baseType: !1085, size: 64, offset: 3584)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!625, !324, !324}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !432, file: !4, line: 1466, baseType: !1089, size: 64, offset: 3648)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !324, !625}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !432, file: !4, line: 1469, baseType: !1093, size: 64, offset: 3712)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!5, !324, !5, !1021}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !432, file: !4, line: 1472, baseType: !1097, size: 64, offset: 3776)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!5, !807}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !432, file: !4, line: 1473, baseType: !1054, size: 64, offset: 3840)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !432, file: !4, line: 1475, baseType: !1102, size: 64, offset: 3904)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!5, !324, !449}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !432, file: !4, line: 1477, baseType: !617, size: 64, offset: 3968)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !432, file: !4, line: 1479, baseType: !1107, size: 64, offset: 4032)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!5, !324, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !4, line: 894, size: 256, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1111, file: !4, line: 895, baseType: !31, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, scope: !1111, file: !4, line: 896, baseType: !1115, size: 192, offset: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1111, file: !4, line: 896, size: 192, elements: !1116)
!1116 = !{!1117, !1126, !5474}
!1117 = !DIDerivedType(tag: DW_TAG_member, scope: !1115, file: !4, line: 898, baseType: !1118, size: 192)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1115, file: !4, line: 898, size: 192, elements: !1119)
!1119 = !{!1120, !1121, !1125}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !4, line: 899, baseType: !1021, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1118, file: !4, line: 900, baseType: !1122, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1124, line: 11, flags: DIFlagFwdDecl)
!1124 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1118, file: !4, line: 901, baseType: !920, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, scope: !1115, file: !4, line: 904, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1115, file: !4, line: 904, size: 64, elements: !1128)
!1128 = !{!1129}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1127, file: !4, line: 905, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !93, line: 222, size: 2560, elements: !1132)
!1132 = !{!1133, !5453, !5454, !5472, !5473}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1131, file: !93, line: 223, baseType: !1134, size: 2048)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !93, line: 141, size: 2048, elements: !1135)
!1135 = !{!1136, !5427, !5428, !5429, !5430, !5431, !5432, !5433, !5434, !5435, !5436, !5437, !5438, !5439, !5444, !5445, !5446, !5447, !5448, !5449, !5450, !5451, !5452}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1134, file: !93, line: 145, baseType: !1137, size: 64, align: 512)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !93, line: 54, size: 2368, elements: !1140)
!1140 = !{!1141, !1340, !1345, !5099, !5103, !5107, !5108, !5112, !5118, !5119, !5120, !5121, !5122, !5126, !5130, !5134, !5135, !5136, !5140, !5141, !5153, !5157, !5161, !5173, !5362, !5366, !5370, !5375, !5379, !5383, !5387, !5393, !5397, !5404, !5408, !5410, !5411}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1139, file: !93, line: 56, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!5, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !124, line: 483, size: 960, align: 64, elements: !1147)
!1147 = !{!1148, !1164, !1175, !1186, !1210, !1216, !1224, !1241, !1254, !1260, !1269, !1274, !1282, !1294, !1314, !1321, !1325, !1329, !1334}
!1148 = !DIDerivedType(tag: DW_TAG_member, scope: !1146, file: !124, line: 484, baseType: !1149, size: 512)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1146, file: !124, line: 484, size: 512, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1149, file: !124, line: 485, baseType: !527, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1149, file: !124, line: 486, baseType: !527, size: 32, offset: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1149, file: !124, line: 487, baseType: !527, size: 32, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1149, file: !124, line: 488, baseType: !527, size: 32, offset: 96)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1149, file: !124, line: 489, baseType: !527, size: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1149, file: !124, line: 492, baseType: !527, size: 32, offset: 160)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1149, file: !124, line: 493, baseType: !527, size: 32, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1149, file: !124, line: 496, baseType: !301, size: 128, offset: 224)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1149, file: !124, line: 497, baseType: !527, size: 32, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1149, file: !124, line: 498, baseType: !527, size: 32, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1149, file: !124, line: 499, baseType: !527, size: 32, offset: 416)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1149, file: !124, line: 500, baseType: !527, size: 32, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1149, file: !124, line: 501, baseType: !527, size: 32, offset: 480)
!1164 = !DIDerivedType(tag: DW_TAG_member, scope: !1146, file: !124, line: 507, baseType: !1165, size: 256)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1146, file: !124, line: 507, size: 256, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1174}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1165, file: !124, line: 508, baseType: !527, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1165, file: !124, line: 509, baseType: !367, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, scope: !1165, file: !124, line: 510, baseType: !1170, size: 64, offset: 128)
!1170 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1165, file: !124, line: 510, size: 64, elements: !1171)
!1171 = !{!1172, !1173}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1170, file: !124, line: 511, baseType: !367, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1170, file: !124, line: 512, baseType: !367, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1165, file: !124, line: 514, baseType: !367, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1146, file: !124, line: 532, baseType: !1176, size: 448)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1146, file: !124, line: 517, size: 448, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1176, file: !124, line: 518, baseType: !367, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1176, file: !124, line: 521, baseType: !367, size: 64, align: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1176, file: !124, line: 522, baseType: !367, size: 64, align: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1176, file: !124, line: 523, baseType: !367, size: 64, align: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1176, file: !124, line: 524, baseType: !527, size: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1176, file: !124, line: 529, baseType: !527, size: 32, offset: 288)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1176, file: !124, line: 530, baseType: !367, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1176, file: !124, line: 531, baseType: !367, size: 64, offset: 384)
!1186 = !DIDerivedType(tag: DW_TAG_member, scope: !1146, file: !124, line: 534, baseType: !1187, size: 960)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1146, file: !124, line: 534, size: 960, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1187, file: !124, line: 535, baseType: !527, size: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1187, file: !124, line: 536, baseType: !527, size: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1187, file: !124, line: 537, baseType: !367, size: 64, align: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1187, file: !124, line: 538, baseType: !367, size: 64, align: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1187, file: !124, line: 539, baseType: !527, size: 32, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1187, file: !124, line: 540, baseType: !527, size: 32, offset: 224)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1187, file: !124, line: 541, baseType: !367, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1187, file: !124, line: 542, baseType: !527, size: 32, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1187, file: !124, line: 543, baseType: !527, size: 32, offset: 352)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1187, file: !124, line: 544, baseType: !301, size: 128, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1187, file: !124, line: 545, baseType: !527, size: 32, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1187, file: !124, line: 550, baseType: !527, size: 32, offset: 544)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1187, file: !124, line: 551, baseType: !527, size: 32, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1187, file: !124, line: 552, baseType: !527, size: 32, offset: 608)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1187, file: !124, line: 553, baseType: !367, size: 64, align: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1187, file: !124, line: 554, baseType: !527, size: 32, offset: 704)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !1187, file: !124, line: 555, baseType: !527, size: 32, offset: 736)
