; ModuleID = '../bcout/drivers/input/joystick/iforce/iforce-packets.llvm.bc'
source_filename = "drivers/input/joystick/iforce/iforce-packets.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!35 = !DIEnumerator(name: "WRITE_LIFE_SHORT", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "WRITE_LIFE_MEDIUM", value: 3, isUnsigned: true)
!37 = !DIEnumerator(name: "WRITE_LIFE_LONG", value: 4, isUnsigned: true)
!38 = !DIEnumerator(name: "WRITE_LIFE_EXTREME", value: 5, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !40, line: 9, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "PIDTYPE_PID", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "PIDTYPE_SID", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !48, line: 26, baseType: !7, size: 32, elements: !49)
!48 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!49 = !{!50, !51, !52}
!50 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !54, line: 44, baseType: !7, size: 32, elements: !55)
!54 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !60, line: 343, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !67, line: 524, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !70, !71, !72, !73}
!69 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!73 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !67, line: 502, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 10, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!82 = !{!83, !84}
!83 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!85 = !{!86, !87, !90, !92, !93, !96, !98, !99, !102, !103}
!86 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !88, line: 23, baseType: !89)
!88 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!89 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !88, line: 20, baseType: !91)
!91 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !95, line: 29, baseType: !96)
!95 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !88, line: 24, baseType: !97)
!97 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !101)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !105)
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !{!0}
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1024, elements: !114)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 12, size: 64, elements: !109)
!109 = !{!110, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !108, file: !3, line: 13, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !88, line: 26, baseType: !112)
!112 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !108, file: !3, line: 14, baseType: !111, size: 32, offset: 32)
!114 = !{!115}
!115 = !DISubrange(count: 16)
!116 = !{!"rsp"}
!117 = !{i32 7, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{i32 1, !"wchar_size", i32 2}
!120 = !{i32 1, !"Code Model", i32 2}
!121 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!122 = distinct !DISubprogram(name: "iforce_dump_packet", scope: !3, file: !3, line: 18, type: !123, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !316)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125, !459, !277, !3837}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iforce", file: !127, line: 85, size: 38080, elements: !128)
!127 = !DIFile(filename: "drivers/input/joystick/iforce/iforce.h", directory: "/home/lizy2001/genbc/linux")
!128 = !{!129, !3769, !3780, !3800, !3801, !3808, !3812, !3813, !3814, !3829, !3836}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !126, file: !127, line: 86, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_dev", file: !132, line: 131, size: 10432, elements: !133)
!132 = !DIFile(filename: "./include/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!133 = !{!134, !137, !138, !139, !147, !151, !152, !156, !157, !158, !159, !160, !161, !165, !166, !167, !168, !169, !170, !189, !194, !2978, !2981, !2982, !2994, !2996, !2999, !3009, !3010, !3011, !3012, !3013, !3017, !3021, !3025, !3029, !3107, !3108, !3109, !3110, !3111, !3760, !3761, !3762, !3763, !3764, !3766, !3767}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 132, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !131, file: !132, line: 133, baseType: !135, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !131, file: !132, line: 134, baseType: !135, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !132, line: 135, baseType: !140, size: 64, offset: 192)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_id", file: !141, line: 59, size: 64, elements: !142)
!141 = !DIFile(filename: "./include/uapi/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bustype", scope: !140, file: !141, line: 60, baseType: !96, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !140, file: !141, line: 61, baseType: !96, size: 16, offset: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !140, file: !141, line: 62, baseType: !96, size: 16, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !140, file: !141, line: 63, baseType: !96, size: 16, offset: 48)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "propbit", scope: !131, file: !132, line: 137, baseType: !148, size: 64, offset: 256)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "evbit", scope: !131, file: !132, line: 139, baseType: !148, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "keybit", scope: !131, file: !132, line: 140, baseType: !153, size: 768, offset: 384)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 768, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 12)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "relbit", scope: !131, file: !132, line: 141, baseType: !148, size: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "absbit", scope: !131, file: !132, line: 142, baseType: !148, size: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mscbit", scope: !131, file: !132, line: 143, baseType: !148, size: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ledbit", scope: !131, file: !132, line: 144, baseType: !148, size: 64, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sndbit", scope: !131, file: !132, line: 145, baseType: !148, size: 64, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !131, file: !132, line: 146, baseType: !162, size: 128, offset: 1472)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 2)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "swbit", scope: !131, file: !132, line: 147, baseType: !148, size: 64, offset: 1600)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hint_events_per_packet", scope: !131, file: !132, line: 149, baseType: !7, size: 32, offset: 1664)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "keycodemax", scope: !131, file: !132, line: 151, baseType: !7, size: 32, offset: 1696)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "keycodesize", scope: !131, file: !132, line: 152, baseType: !7, size: 32, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !131, file: !132, line: 153, baseType: !102, size: 64, offset: 1792)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "setkeycode", scope: !131, file: !132, line: 155, baseType: !171, size: 64, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!112, !130, !174, !188}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_keymap_entry", file: !141, line: 114, size: 320, elements: !177)
!177 = !{!178, !180, !181, !182, !184}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !141, line: 116, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !88, line: 21, baseType: !86)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !176, file: !141, line: 117, baseType: !179, size: 8, offset: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !176, file: !141, line: 118, baseType: !96, size: 16, offset: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !176, file: !141, line: 119, baseType: !183, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !88, line: 27, baseType: !7)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scancode", scope: !176, file: !141, line: 120, baseType: !185, size: 256, offset: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 256, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "getkeycode", scope: !131, file: !132, line: 158, baseType: !190, size: 64, offset: 1920)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!112, !130, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !131, file: !132, line: 161, baseType: !195, size: 64, offset: 1984)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_device", file: !132, line: 534, size: 896, elements: !197)
!197 = !{!198, !265, !269, !273, !279, !280, !284, !285, !286, !323, !324, !325}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !196, file: !132, line: 535, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!112, !130, !202, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_effect", file: !141, line: 450, size: 384, elements: !204)
!204 = !{!205, !206, !207, !208, !213, !218}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !141, line: 451, baseType: !96, size: 16)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !203, file: !141, line: 452, baseType: !87, size: 16, offset: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !203, file: !141, line: 453, baseType: !96, size: 16, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !203, file: !141, line: 454, baseType: !209, size: 32, offset: 48)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_trigger", file: !141, line: 316, size: 32, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !209, file: !141, line: 317, baseType: !96, size: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !209, file: !141, line: 318, baseType: !96, size: 16, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !203, file: !141, line: 455, baseType: !214, size: 32, offset: 80)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_replay", file: !141, line: 306, size: 32, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !214, file: !141, line: 307, baseType: !96, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !214, file: !141, line: 308, baseType: !96, size: 16, offset: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !203, file: !141, line: 463, baseType: !219, size: 256, offset: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !141, line: 457, size: 256, elements: !220)
!220 = !{!221, !232, !238, !250, !260}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !219, file: !141, line: 458, baseType: !222, size: 80)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_constant_effect", file: !141, line: 345, size: 80, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !222, file: !141, line: 346, baseType: !87, size: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !222, file: !141, line: 347, baseType: !226, size: 64, offset: 16)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_envelope", file: !141, line: 333, size: 64, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "attack_length", scope: !226, file: !141, line: 334, baseType: !96, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "attack_level", scope: !226, file: !141, line: 335, baseType: !96, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fade_length", scope: !226, file: !141, line: 336, baseType: !96, size: 16, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fade_level", scope: !226, file: !141, line: 337, baseType: !96, size: 16, offset: 48)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ramp", scope: !219, file: !141, line: 459, baseType: !233, size: 96)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_ramp_effect", file: !141, line: 356, size: 96, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "start_level", scope: !233, file: !141, line: 357, baseType: !87, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "end_level", scope: !233, file: !141, line: 358, baseType: !87, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !233, file: !141, line: 359, baseType: !226, size: 64, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !219, file: !141, line: 460, baseType: !239, size: 256)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_periodic_effect", file: !141, line: 401, size: 256, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !239, file: !141, line: 402, baseType: !96, size: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !239, file: !141, line: 403, baseType: !96, size: 16, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !239, file: !141, line: 404, baseType: !87, size: 16, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !239, file: !141, line: 405, baseType: !87, size: 16, offset: 48)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !239, file: !141, line: 406, baseType: !96, size: 16, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !239, file: !141, line: 408, baseType: !226, size: 64, offset: 80)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "custom_len", scope: !239, file: !141, line: 410, baseType: !183, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !239, file: !141, line: 411, baseType: !249, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !219, file: !141, line: 461, baseType: !251, size: 192)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 192, elements: !163)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_condition_effect", file: !141, line: 372, size: 96, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "right_saturation", scope: !252, file: !141, line: 373, baseType: !96, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "left_saturation", scope: !252, file: !141, line: 374, baseType: !96, size: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "right_coeff", scope: !252, file: !141, line: 376, baseType: !87, size: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "left_coeff", scope: !252, file: !141, line: 377, baseType: !87, size: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "deadband", scope: !252, file: !141, line: 379, baseType: !96, size: 16, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !252, file: !141, line: 380, baseType: !87, size: 16, offset: 80)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rumble", scope: !219, file: !141, line: 462, baseType: !261, size: 32)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_rumble_effect", file: !141, line: 422, size: 32, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "strong_magnitude", scope: !261, file: !141, line: 423, baseType: !96, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "weak_magnitude", scope: !261, file: !141, line: 424, baseType: !96, size: 16, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !196, file: !132, line: 537, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!112, !130, !112}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "playback", scope: !196, file: !132, line: 539, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!112, !130, !112, !112}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "set_gain", scope: !196, file: !132, line: 540, baseType: !274, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !130, !277}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !278, line: 19, baseType: !96)
!278 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set_autocenter", scope: !196, file: !132, line: 541, baseType: !274, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !196, file: !132, line: 543, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !195}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !196, file: !132, line: 545, baseType: !102, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !196, file: !132, line: 547, baseType: !162, size: 128, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !196, file: !132, line: 549, baseType: !287, size: 192, offset: 576)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !288, line: 53, size: 192, elements: !289)
!288 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!289 = !{!290, !301, !317}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !287, file: !288, line: 54, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !292, line: 13, baseType: !293)
!292 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !294, line: 175, baseType: !295)
!294 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !294, line: 173, size: 64, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !295, file: !294, line: 174, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !278, line: 22, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !88, line: 30, baseType: !300)
!300 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !287, file: !288, line: 55, baseType: !302, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !303, line: 83, baseType: !304)
!303 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !303, line: 71, elements: !305)
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !304, file: !303, line: 72, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !304, file: !303, line: 72, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !307, file: !303, line: 73, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !303, line: 20, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !310, file: !303, line: 21, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !314, line: 25, baseType: !315)
!314 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 25, elements: !316)
!316 = !{}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !287, file: !288, line: 59, baseType: !318, size: 128, offset: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !294, line: 178, size: 128, elements: !319)
!319 = !{!320, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !294, line: 179, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !294, line: 179, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "max_effects", scope: !196, file: !132, line: 551, baseType: !112, size: 32, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "effects", scope: !196, file: !132, line: 552, baseType: !202, size: 64, offset: 832)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "effect_owners", scope: !196, file: !132, line: 553, baseType: !326, offset: 896)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, elements: !2195)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !31, line: 916, size: 1856, align: 32, elements: !329)
!329 = !{!330, !348, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2961, !2962, !2971, !2972, !2973, !2974, !2975, !2976, !2977}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !328, file: !31, line: 920, baseType: !331, size: 128)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !31, line: 917, size: 128, elements: !332)
!332 = !{!333, !339}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !331, file: !31, line: 918, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !335, line: 58, size: 64, elements: !336)
!335 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !335, line: 59, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !331, file: !31, line: 919, baseType: !340, size: 128, align: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !294, line: 216, size: 128, align: 64, elements: !341)
!341 = !{!342, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !294, line: 217, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !340, file: !294, line: 218, baseType: !345, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !343}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !328, file: !31, line: 921, baseType: !349, size: 128, offset: 128)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !350, line: 8, size: 128, elements: !351)
!350 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!351 = !{!352, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !349, file: !350, line: 9, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !355, line: 18, flags: DIFlagFwdDecl)
!355 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !349, file: !350, line: 10, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !355, line: 89, size: 1536, elements: !359)
!359 = !{!360, !361, !371, !379, !380, !399, !2911, !2913, !2925, !2926, !2927, !2928, !2929, !2935, !2936, !2937}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !358, file: !355, line: 91, baseType: !7, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !358, file: !355, line: 92, baseType: !362, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !363, line: 277, baseType: !364)
!363 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !363, line: 277, size: 32, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !364, file: !363, line: 277, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !363, line: 70, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !363, line: 65, size: 32, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !368, file: !363, line: 66, baseType: !7, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !358, file: !355, line: 93, baseType: !372, size: 128, offset: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !373, line: 38, size: 128, elements: !374)
!373 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!374 = !{!375, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !373, line: 39, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !372, file: !373, line: 39, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !358, file: !355, line: 94, baseType: !357, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !358, file: !355, line: 95, baseType: !381, size: 128, offset: 256)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !355, line: 47, size: 128, elements: !382)
!382 = !{!383, !396}
!383 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !355, line: 48, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !355, line: 48, size: 64, elements: !385)
!385 = !{!386, !392}
!386 = !DIDerivedType(tag: DW_TAG_member, scope: !384, file: !355, line: 49, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !384, file: !355, line: 49, size: 64, elements: !388)
!388 = !{!389, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !387, file: !355, line: 50, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !278, line: 21, baseType: !183)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !387, file: !355, line: 50, baseType: !390, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !384, file: !355, line: 52, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !278, line: 23, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !88, line: 31, baseType: !395)
!395 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !355, line: 54, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !358, file: !355, line: 96, baseType: !400, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !31, line: 610, size: 4224, elements: !402)
!402 = !{!403, !405, !406, !415, !422, !423, !576, !2623, !2624, !2625, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2887, !2895, !2896, !2897, !2907, !2908, !2909, !2910}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !401, file: !31, line: 611, baseType: !404, size: 16)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !294, line: 19, baseType: !97)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !401, file: !31, line: 612, baseType: !97, size: 16, offset: 16)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !401, file: !31, line: 613, baseType: !407, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !408, line: 23, baseType: !409)
!408 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 21, size: 32, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !409, file: !408, line: 22, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !294, line: 32, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !414, line: 49, baseType: !7)
!414 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !401, file: !31, line: 614, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !408, line: 28, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 26, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !417, file: !408, line: 27, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !294, line: 33, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !414, line: 50, baseType: !7)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !401, file: !31, line: 615, baseType: !7, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !401, file: !31, line: 622, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !31, line: 1864, size: 1536, align: 512, elements: !427)
!427 = !{!428, !432, !445, !449, !455, !460, !466, !470, !474, !478, !482, !483, !489, !493, !517, !546, !556, !562, !567, !571, !572}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !426, file: !31, line: 1865, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!357, !400, !357, !7}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !426, file: !31, line: 1866, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!135, !357, !400, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !438, line: 10, size: 128, elements: !439)
!438 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440, !444}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !437, file: !438, line: 11, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !102}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !437, file: !438, line: 12, baseType: !102, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !426, file: !31, line: 1867, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!112, !400, !112}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !426, file: !31, line: 1868, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!453, !400, !112}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !31, line: 581, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !426, file: !31, line: 1870, baseType: !456, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!112, !357, !459, !112}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !426, file: !31, line: 1872, baseType: !461, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!112, !400, !357, !404, !464}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !294, line: 30, baseType: !465)
!465 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !426, file: !31, line: 1873, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!112, !357, !400, !357}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !426, file: !31, line: 1874, baseType: !471, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!112, !400, !357}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !426, file: !31, line: 1875, baseType: !475, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!112, !400, !357, !135}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !426, file: !31, line: 1876, baseType: !479, size: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!112, !400, !357, !404}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !426, file: !31, line: 1877, baseType: !471, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !426, file: !31, line: 1878, baseType: !484, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!112, !400, !357, !404, !487}
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !294, line: 16, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !294, line: 13, baseType: !390)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !426, file: !31, line: 1879, baseType: !490, size: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!112, !400, !357, !400, !357, !7}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !426, file: !31, line: 1881, baseType: !494, size: 64, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!112, !357, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !31, line: 219, size: 640, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !507, !514, !515, !516}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !498, file: !31, line: 220, baseType: !7, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !498, file: !31, line: 221, baseType: !404, size: 16, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !498, file: !31, line: 222, baseType: !407, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !498, file: !31, line: 223, baseType: !416, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !498, file: !31, line: 224, baseType: !505, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !294, line: 46, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !414, line: 88, baseType: !300)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !498, file: !31, line: 225, baseType: !508, size: 128, offset: 192)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !509, line: 13, size: 128, elements: !510)
!509 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!510 = !{!511, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !508, file: !509, line: 14, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !509, line: 8, baseType: !299)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !508, file: !509, line: 15, baseType: !105, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !498, file: !31, line: 226, baseType: !508, size: 128, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !498, file: !31, line: 227, baseType: !508, size: 128, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !498, file: !31, line: 234, baseType: !327, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !426, file: !31, line: 1882, baseType: !518, size: 64, offset: 896)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!112, !521, !523, !390, !7}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !525, line: 22, size: 1152, elements: !526)
!525 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!526 = !{!527, !528, !529, !530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !524, file: !525, line: 23, baseType: !390, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !524, file: !525, line: 24, baseType: !404, size: 16, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !524, file: !525, line: 25, baseType: !7, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !524, file: !525, line: 26, baseType: !531, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !294, line: 104, baseType: !390)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !524, file: !525, line: 27, baseType: !393, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !524, file: !525, line: 28, baseType: !393, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !524, file: !525, line: 37, baseType: !393, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !524, file: !525, line: 38, baseType: !487, size: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !524, file: !525, line: 39, baseType: !487, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !524, file: !525, line: 40, baseType: !407, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !524, file: !525, line: 41, baseType: !416, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !524, file: !525, line: 42, baseType: !505, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !524, file: !525, line: 43, baseType: !508, size: 128, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !524, file: !525, line: 44, baseType: !508, size: 128, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !524, file: !525, line: 45, baseType: !508, size: 128, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !524, file: !525, line: 46, baseType: !508, size: 128, offset: 896)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !524, file: !525, line: 47, baseType: !393, size: 64, offset: 1024)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !524, file: !525, line: 48, baseType: !393, size: 64, offset: 1088)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !426, file: !31, line: 1883, baseType: !547, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !357, !459, !553}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !294, line: 60, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !414, line: 73, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !414, line: 15, baseType: !105)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !294, line: 55, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !414, line: 72, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !414, line: 16, baseType: !92)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !426, file: !31, line: 1884, baseType: !557, size: 64, offset: 1024)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!112, !400, !560, !393, !393}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !31, line: 50, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !426, file: !31, line: 1886, baseType: !563, size: 64, offset: 1088)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!112, !400, !566, !112}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !426, file: !31, line: 1887, baseType: !568, size: 64, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!112, !400, !357, !327, !7, !404}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !426, file: !31, line: 1890, baseType: !479, size: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !426, file: !31, line: 1891, baseType: !573, size: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!112, !400, !453, !112}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !401, file: !31, line: 623, baseType: !577, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !31, line: 1416, size: 9472, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !637, !2231, !2313, !2396, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2412, !2416, !2417, !2420, !2421, !2424, !2425, !2426, !2467, !2493, !2494, !2495, !2496, !2497, !2498, !2501, !2503, !2510, !2511, !2513, !2514, !2515, !2574, !2575, !2590, !2591, !2592, !2593, !2594, !2597, !2598, !2599, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !578, file: !31, line: 1417, baseType: !318, size: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !578, file: !31, line: 1418, baseType: !487, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !578, file: !31, line: 1419, baseType: !86, size: 8, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !578, file: !31, line: 1420, baseType: !92, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !578, file: !31, line: 1421, baseType: !505, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !578, file: !31, line: 1422, baseType: !586, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !31, line: 2228, size: 576, elements: !588)
!588 = !{!589, !590, !591, !598, !602, !606, !610, !614, !615, !625, !628, !629, !630, !634, !635, !636}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !31, line: 2229, baseType: !135, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !587, file: !31, line: 2230, baseType: !112, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !587, file: !31, line: 2238, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!112, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !597, line: 28, flags: DIFlagFwdDecl)
!597 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !587, file: !31, line: 2239, baseType: !599, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !31, line: 70, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !587, file: !31, line: 2240, baseType: !603, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!357, !586, !112, !135, !102}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !587, file: !31, line: 2242, baseType: !607, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !577}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !587, file: !31, line: 2243, baseType: !611, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !613, line: 76, flags: DIFlagFwdDecl)
!613 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !31, line: 2244, baseType: !586, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !587, file: !31, line: 2245, baseType: !616, size: 64, offset: 512)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !294, line: 182, size: 64, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !616, file: !294, line: 183, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !294, line: 186, size: 128, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !294, line: 187, baseType: !619, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !620, file: !294, line: 187, baseType: !624, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !587, file: !31, line: 2247, baseType: !626, offset: 576)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !627, line: 187, elements: !316)
!627 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!628 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !587, file: !31, line: 2248, baseType: !626, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !587, file: !31, line: 2249, baseType: !626, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !587, file: !31, line: 2250, baseType: !631, offset: 576)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 3)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !587, file: !31, line: 2252, baseType: !626, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !587, file: !31, line: 2253, baseType: !626, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !587, file: !31, line: 2254, baseType: !626, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !578, file: !31, line: 1423, baseType: !638, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !31, line: 1935, size: 1472, elements: !641)
!641 = !{!642, !646, !650, !651, !655, !661, !665, !666, !667, !671, !675, !676, !677, !678, !684, !689, !690, !697, !698, !699, !700, !2215, !2230}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !640, file: !31, line: 1936, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!400, !577}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !640, file: !31, line: 1937, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !400}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !640, file: !31, line: 1938, baseType: !647, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !640, file: !31, line: 1940, baseType: !652, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !400, !112}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !640, file: !31, line: 1941, baseType: !656, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!112, !400, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !31, line: 289, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !640, file: !31, line: 1942, baseType: !662, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!112, !400}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !640, file: !31, line: 1943, baseType: !647, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !640, file: !31, line: 1944, baseType: !607, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !640, file: !31, line: 1945, baseType: !668, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!112, !577, !112}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !640, file: !31, line: 1946, baseType: !672, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!112, !577}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !640, file: !31, line: 1947, baseType: !672, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !640, file: !31, line: 1948, baseType: !672, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !640, file: !31, line: 1949, baseType: !672, size: 64, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !640, file: !31, line: 1950, baseType: !679, size: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!112, !357, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !31, line: 57, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !640, file: !31, line: 1951, baseType: !685, size: 64, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!112, !577, !688, !459}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !640, file: !31, line: 1952, baseType: !607, size: 64, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !640, file: !31, line: 1954, baseType: !691, size: 64, offset: 1024)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!112, !694, !357}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !696, line: 539, flags: DIFlagFwdDecl)
!696 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!697 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !640, file: !31, line: 1955, baseType: !691, size: 64, offset: 1088)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !640, file: !31, line: 1956, baseType: !691, size: 64, offset: 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !640, file: !31, line: 1957, baseType: !691, size: 64, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !640, file: !31, line: 1963, baseType: !701, size: 64, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!112, !577, !704, !727}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !706, line: 68, size: 512, align: 128, elements: !707)
!706 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!707 = !{!708, !709, !2207, !2214}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !706, line: 69, baseType: !92, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !706, line: 77, baseType: !710, size: 320, offset: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !706, line: 77, size: 320, elements: !711)
!711 = !{!712, !891, !896, !924, !932, !938, !2199, !2206}
!712 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !706, line: 78, baseType: !713, size: 320)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !706, line: 78, size: 320, elements: !714)
!714 = !{!715, !716, !889, !890}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !713, file: !706, line: 84, baseType: !318, size: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !713, file: !706, line: 86, baseType: !717, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !31, line: 451, size: 1216, align: 64, elements: !719)
!719 = !{!720, !721, !729, !730, !735, !750, !759, !760, !761, !762, !882, !883, !886, !887, !888}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !718, file: !31, line: 452, baseType: !400, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !718, file: !31, line: 453, baseType: !722, size: 128, offset: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !723, line: 292, size: 128, elements: !724)
!723 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!724 = !{!725, !726, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !722, file: !723, line: 293, baseType: !302)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !722, file: !723, line: 295, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !294, line: 148, baseType: !7)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !722, file: !723, line: 296, baseType: !102, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !718, file: !31, line: 454, baseType: !727, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !718, file: !31, line: 455, baseType: !731, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !294, line: 168, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !294, line: 166, size: 32, elements: !733)
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !732, file: !294, line: 167, baseType: !112, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !718, file: !31, line: 460, baseType: !736, size: 128, offset: 256)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !737, line: 125, size: 128, elements: !738)
!737 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!738 = !{!739, !749}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !736, file: !737, line: 126, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !737, line: 31, size: 64, elements: !741)
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !740, file: !737, line: 32, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !737, line: 24, size: 192, align: 64, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !744, file: !737, line: 25, baseType: !92, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !744, file: !737, line: 26, baseType: !743, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !744, file: !737, line: 27, baseType: !743, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !736, file: !737, line: 127, baseType: !743, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !718, file: !31, line: 461, baseType: !751, size: 256, offset: 384)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !752, line: 35, size: 256, elements: !753)
!752 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!753 = !{!754, !755, !756, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !751, file: !752, line: 36, baseType: !291, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !751, file: !752, line: 42, baseType: !291, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !751, file: !752, line: 46, baseType: !757, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !303, line: 29, baseType: !310)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !751, file: !752, line: 47, baseType: !318, size: 128, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !718, file: !31, line: 462, baseType: !92, size: 64, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !718, file: !31, line: 463, baseType: !92, size: 64, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !718, file: !31, line: 464, baseType: !92, size: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !718, file: !31, line: 465, baseType: !763, size: 64, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !31, line: 367, size: 1408, elements: !766)
!766 = !{!767, !771, !775, !779, !783, !787, !793, !799, !803, !808, !812, !816, !820, !846, !850, !856, !857, !858, !862, !867, !871, !878}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !765, file: !31, line: 368, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!112, !704, !659}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !765, file: !31, line: 369, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!112, !327, !704}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !765, file: !31, line: 372, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!112, !717, !659}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !765, file: !31, line: 375, baseType: !780, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!112, !704}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !765, file: !31, line: 381, baseType: !784, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!112, !327, !717, !321, !7}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !765, file: !31, line: 383, baseType: !788, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !31, line: 290, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !765, file: !31, line: 385, baseType: !794, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!112, !327, !717, !505, !7, !7, !797, !798}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !765, file: !31, line: 388, baseType: !800, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!112, !327, !717, !505, !7, !7, !704, !102}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !765, file: !31, line: 393, baseType: !804, size: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !717, !807}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !294, line: 125, baseType: !393)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !765, file: !31, line: 394, baseType: !809, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !704, !7, !7}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !765, file: !31, line: 395, baseType: !813, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!112, !704, !727}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !765, file: !31, line: 396, baseType: !817, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !704}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !765, file: !31, line: 397, baseType: !821, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!550, !824, !844}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !31, line: 320, size: 384, elements: !826)
!826 = !{!827, !828, !829, !833, !834, !835, !836, !837}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !825, file: !31, line: 321, baseType: !327, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !825, file: !31, line: 326, baseType: !505, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !825, file: !31, line: 327, baseType: !830, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !824, !105, !105}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !825, file: !31, line: 328, baseType: !102, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !825, file: !31, line: 329, baseType: !112, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !825, file: !31, line: 330, baseType: !277, size: 16, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !825, file: !31, line: 331, baseType: !277, size: 16, offset: 304)
!837 = !DIDerivedType(tag: DW_TAG_member, scope: !825, file: !31, line: 332, baseType: !838, size: 64, offset: 320)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !825, file: !31, line: 332, size: 64, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !838, file: !31, line: 333, baseType: !7, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !838, file: !31, line: 334, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !31, line: 334, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !31, line: 64, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !765, file: !31, line: 402, baseType: !847, size: 64, offset: 832)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!112, !717, !704, !704, !5}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !765, file: !31, line: 404, baseType: !851, size: 64, offset: 896)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!464, !704, !854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !855, line: 305, baseType: !7)
!855 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!856 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !765, file: !31, line: 405, baseType: !817, size: 64, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !765, file: !31, line: 406, baseType: !780, size: 64, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !765, file: !31, line: 407, baseType: !859, size: 64, offset: 1088)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!112, !704, !92, !92}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "is_dirty_writeback", scope: !765, file: !31, line: 409, baseType: !863, size: 64, offset: 1152)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !704, !866, !866}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "error_remove_page", scope: !765, file: !31, line: 410, baseType: !868, size: 64, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!112, !717, !704}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "swap_activate", scope: !765, file: !31, line: 413, baseType: !872, size: 64, offset: 1280)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!112, !875, !327, !877}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "swap_info_struct", file: !31, line: 61, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "swap_deactivate", scope: !765, file: !31, line: 415, baseType: !879, size: 64, offset: 1344)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !327}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !718, file: !31, line: 466, baseType: !92, size: 64, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "wb_err", scope: !718, file: !31, line: 467, baseType: !884, size: 32, offset: 960)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "errseq_t", file: !885, line: 8, baseType: !390)
!885 = !DIFile(filename: "./include/linux/errseq.h", directory: "/home/lizy2001/genbc/linux")
!886 = !DIDerivedType(tag: DW_TAG_member, name: "private_lock", scope: !718, file: !31, line: 468, baseType: !302, offset: 992)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !718, file: !31, line: 469, baseType: !318, size: 128, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !718, file: !31, line: 470, baseType: !102, size: 64, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !713, file: !706, line: 87, baseType: !92, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !713, file: !706, line: 94, baseType: !92, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !706, line: 96, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !706, line: 96, size: 64, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dma_addr", scope: !892, file: !706, line: 101, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !294, line: 143, baseType: !393)
!896 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !706, line: 103, baseType: !897, size: 320)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !706, line: 103, size: 320, elements: !898)
!898 = !{!899, !909, !912, !913}
!899 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !706, line: 104, baseType: !900, size: 128)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !897, file: !706, line: 104, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "slab_list", scope: !900, file: !706, line: 105, baseType: !318, size: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, scope: !900, file: !706, line: 106, baseType: !904, size: 128)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !900, file: !706, line: 106, size: 128, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !904, file: !706, line: 107, baseType: !704, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !904, file: !706, line: 109, baseType: !112, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pobjects", scope: !904, file: !706, line: 110, baseType: !112, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "slab_cache", scope: !897, file: !706, line: 117, baseType: !910, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !706, line: 117, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !897, file: !706, line: 119, baseType: !102, size: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !706, line: 120, baseType: !914, size: 64, offset: 256)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !897, file: !706, line: 120, size: 64, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "s_mem", scope: !914, file: !706, line: 121, baseType: !102, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !914, file: !706, line: 122, baseType: !92, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, scope: !914, file: !706, line: 123, baseType: !919, size: 32)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !914, file: !706, line: 123, size: 32, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !919, file: !706, line: 124, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !919, file: !706, line: 125, baseType: !7, size: 15, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !919, file: !706, line: 126, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !706, line: 130, baseType: !925, size: 192)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !706, line: 130, size: 192, elements: !926)
!926 = !{!927, !928, !929, !930, !931}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "compound_head", scope: !925, file: !706, line: 131, baseType: !92, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "compound_dtor", scope: !925, file: !706, line: 134, baseType: !86, size: 8, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "compound_order", scope: !925, file: !706, line: 135, baseType: !86, size: 8, offset: 72)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "compound_mapcount", scope: !925, file: !706, line: 136, baseType: !731, size: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "compound_nr", scope: !925, file: !706, line: 137, baseType: !7, size: 32, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !706, line: 139, baseType: !933, size: 256)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !706, line: 139, size: 256, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_compound_pad_1", scope: !933, file: !706, line: 140, baseType: !92, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "hpage_pinned_refcount", scope: !933, file: !706, line: 141, baseType: !731, size: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_list", scope: !933, file: !706, line: 143, baseType: !318, size: 128, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !706, line: 145, baseType: !939, size: 256)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !706, line: 145, size: 256, elements: !940)
!940 = !{!941, !942, !944, !945, !2198}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_pt_pad_1", scope: !939, file: !706, line: 146, baseType: !92, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pmd_huge_pte", scope: !939, file: !706, line: 147, baseType: !943, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgtable_t", file: !696, line: 509, baseType: !704)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_pt_pad_2", scope: !939, file: !706, line: 148, baseType: !92, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, scope: !939, file: !706, line: 149, baseType: !946, size: 64, offset: 192)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !706, line: 149, size: 64, elements: !947)
!947 = !{!948, !2197}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pt_mm", scope: !946, file: !706, line: 150, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !706, line: 388, size: 7296, elements: !951)
!951 = !{!952, !2193}
!952 = !DIDerivedType(tag: DW_TAG_member, scope: !950, file: !706, line: 389, baseType: !953, size: 7296)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !950, file: !706, line: 389, size: 7296, elements: !954)
!954 = !{!955, !993, !994, !995, !999, !1000, !1001, !1002, !1003, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1044, !1052, !1055, !1093, !1094, !2177, !2178, !2181, !2182, !2183, !2186, !2187, !2188, !2191, !2192}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !953, file: !706, line: 390, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !706, line: 305, size: 1472, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !973, !974, !979, !980, !983, !987, !988, !989, !990, !991}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !957, file: !706, line: 308, baseType: !92, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !957, file: !706, line: 309, baseType: !92, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !957, file: !706, line: 313, baseType: !956, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !957, file: !706, line: 313, baseType: !956, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !957, file: !706, line: 315, baseType: !744, size: 192, align: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !957, file: !706, line: 323, baseType: !92, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !957, file: !706, line: 327, baseType: !949, size: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !957, file: !706, line: 333, baseType: !967, size: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !696, line: 284, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !696, line: 284, size: 64, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !968, file: !696, line: 284, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !972, line: 19, baseType: !92)
!972 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!973 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !957, file: !706, line: 334, baseType: !92, size: 64, offset: 640)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !957, file: !706, line: 343, baseType: !975, size: 256, offset: 704)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !957, file: !706, line: 340, size: 256, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !975, file: !706, line: 341, baseType: !744, size: 192, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !975, file: !706, line: 342, baseType: !92, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !957, file: !706, line: 351, baseType: !318, size: 128, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !957, file: !706, line: 353, baseType: !981, size: 64, offset: 1088)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !706, line: 353, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !957, file: !706, line: 356, baseType: !984, size: 64, offset: 1152)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !706, line: 356, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !957, file: !706, line: 359, baseType: !92, size: 64, offset: 1216)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !957, file: !706, line: 361, baseType: !327, size: 64, offset: 1280)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !957, file: !706, line: 362, baseType: !102, size: 64, offset: 1344)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !957, file: !706, line: 365, baseType: !291, size: 64, offset: 1408)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !957, file: !706, line: 373, baseType: !992, offset: 1472)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !706, line: 296, elements: !316)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !953, file: !706, line: 391, baseType: !740, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !953, file: !706, line: 392, baseType: !393, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !953, file: !706, line: 394, baseType: !996, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!92, !327, !92, !92, !92, !92}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !953, file: !706, line: 398, baseType: !92, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !953, file: !706, line: 399, baseType: !92, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !953, file: !706, line: 405, baseType: !92, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !953, file: !706, line: 406, baseType: !92, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !953, file: !706, line: 407, baseType: !1004, size: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !696, line: 286, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 286, size: 64, elements: !1007)
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !1006, file: !696, line: 286, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !972, line: 18, baseType: !92)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !953, file: !706, line: 416, baseType: !731, size: 32, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !953, file: !706, line: 428, baseType: !731, size: 32, offset: 608)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !953, file: !706, line: 437, baseType: !731, size: 32, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !953, file: !706, line: 447, baseType: !731, size: 32, offset: 672)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !953, file: !706, line: 450, baseType: !291, size: 64, offset: 704)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !953, file: !706, line: 452, baseType: !112, size: 32, offset: 768)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !953, file: !706, line: 454, baseType: !302, offset: 800)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !953, file: !706, line: 457, baseType: !751, size: 256, offset: 832)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !953, file: !706, line: 459, baseType: !318, size: 128, offset: 1088)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !953, file: !706, line: 466, baseType: !92, size: 64, offset: 1216)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !953, file: !706, line: 467, baseType: !92, size: 64, offset: 1280)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !953, file: !706, line: 469, baseType: !92, size: 64, offset: 1344)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !953, file: !706, line: 470, baseType: !92, size: 64, offset: 1408)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !953, file: !706, line: 471, baseType: !293, size: 64, offset: 1472)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !953, file: !706, line: 472, baseType: !92, size: 64, offset: 1536)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !953, file: !706, line: 473, baseType: !92, size: 64, offset: 1600)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !953, file: !706, line: 474, baseType: !92, size: 64, offset: 1664)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !953, file: !706, line: 475, baseType: !92, size: 64, offset: 1728)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !953, file: !706, line: 477, baseType: !302, offset: 1792)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !953, file: !706, line: 478, baseType: !92, size: 64, offset: 1792)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !953, file: !706, line: 478, baseType: !92, size: 64, offset: 1856)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !953, file: !706, line: 478, baseType: !92, size: 64, offset: 1920)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !953, file: !706, line: 478, baseType: !92, size: 64, offset: 1984)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !953, file: !706, line: 479, baseType: !92, size: 64, offset: 2048)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !953, file: !706, line: 479, baseType: !92, size: 64, offset: 2112)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !953, file: !706, line: 479, baseType: !92, size: 64, offset: 2176)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !953, file: !706, line: 480, baseType: !92, size: 64, offset: 2240)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !953, file: !706, line: 480, baseType: !92, size: 64, offset: 2304)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !953, file: !706, line: 480, baseType: !92, size: 64, offset: 2368)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !953, file: !706, line: 480, baseType: !92, size: 64, offset: 2432)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !953, file: !706, line: 482, baseType: !1041, size: 2816, offset: 2496)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2816, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 44)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !953, file: !706, line: 488, baseType: !1045, size: 256, offset: 5312)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !1046, line: 60, size: 256, elements: !1047)
!1046 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1045, file: !1046, line: 61, baseType: !1049, size: 256)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 256, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 4)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !953, file: !706, line: 490, baseType: !1053, size: 64, offset: 5568)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !706, line: 490, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !953, file: !706, line: 493, baseType: !1056, size: 896, offset: 5632)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !1057, line: 53, baseType: !1058)
!1057 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1057, line: 13, size: 896, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1066, !1067, !1068, !1069, !1089, !1090, !1091}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !1058, file: !1057, line: 18, baseType: !393, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !1058, file: !1057, line: 28, baseType: !293, size: 64, offset: 64)
