; ModuleID = '../bcout/drivers/thermal/hisi_thermal.llvm.bc'
source_filename = "drivers/thermal/hisi_thermal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_hisi_thermal_driver_init6:\09\09\09"
module asm ".long\09hisi_thermal_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!92 = !DIEnumerator(name: "THERMAL_DEVICE_DOWN", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "THERMAL_DEVICE_UP", value: 5, isUnsigned: true)
!94 = !DIEnumerator(name: "THERMAL_DEVICE_POWER_CAPABILITY_CHANGED", value: 6, isUnsigned: true)
!95 = !DIEnumerator(name: "THERMAL_TABLE_CHANGED", value: 7, isUnsigned: true)
!96 = !DIEnumerator(name: "THERMAL_EVENT_KEEP_ALIVE", value: 8, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 10, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!99 = !{!100, !101}
!100 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irqreturn", file: !103, line: 11, baseType: !7, size: 32, elements: !104)
!103 = !DIFile(filename: "./include/linux/irqreturn.h", directory: "/home/lizy2001/genbc/linux")
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "IRQ_NONE", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "IRQ_HANDLED", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "IRQ_WAKE_THREAD", value: 2, isUnsigned: true)
!108 = !{!109, !112, !114, !115, !116, !117}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !111, line: 76, flags: DIFlagFwdDecl)
!111 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !113, line: 148, baseType: !7)
!113 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!114 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!119 = !{!0, !120, !127, !134, !139, !144, !149, !154, !2262, !2285, !2288, !2511, !2513}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "__exitcall_hisi_thermal_driver_exit", scope: !2, file: !3, line: 671, type: !122, isLocal: true, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !123, line: 117, baseType: !124)
!123 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author160", scope: !2, file: !3, line: 673, type: !129, isLocal: true, isDefinition: true, align: 8)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 512, elements: !132)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!132 = !{!133}
!133 = !DISubrange(count: 64)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author161", scope: !2, file: !3, line: 674, type: !136, isLocal: true, isDefinition: true, align: 8)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 392, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 49)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description162", scope: !2, file: !3, line: 675, type: !141, isLocal: true, isDefinition: true, align: 8)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 400, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 50)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file163", scope: !2, file: !3, line: 676, type: !146, isLocal: true, isDefinition: true, align: 8)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 376, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 47)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license164", scope: !2, file: !3, line: 676, type: !151, isLocal: true, isDefinition: true, align: 8)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 224, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 28)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "hisi_thermal_driver", scope: !2, file: !3, line: 661, type: !156, isLocal: true, isDefinition: true)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "platform_driver", file: !157, line: 200, size: 1600, elements: !158)
!157 = !DIFile(filename: "./include/linux/platform_device.h", directory: "/home/lizy2001/genbc/linux")
!158 = !{!159, !2249, !2250, !2254, !2258, !2259, !2260, !2261}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !156, file: !157, line: 201, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !164}
!163 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "platform_device", file: !157, line: 22, size: 6208, elements: !166)
!166 = !{!167, !169, !170, !173, !2218, !2219, !2220, !2221, !2235, !2243, !2244, !2247}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !157, line: 23, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !157, line: 24, baseType: !163, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id_auto", scope: !165, file: !157, line: 25, baseType: !171, size: 8, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !113, line: 30, baseType: !172)
!172 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !165, file: !157, line: 26, baseType: !174, size: 5568, offset: 128)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !175)
!175 = !{!176, !1672, !1674, !1677, !1678, !1729, !1823, !1824, !1825, !1826, !1827, !1836, !2013, !2026, !2029, !2030, !2034, !2036, !2037, !2038, !2042, !2048, !2049, !2052, !2167, !2168, !2171, !2172, !2173, !2174, !2206, !2207, !2208, !2211, !2214, !2215, !2216, !2217}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !174, file: !30, line: 462, baseType: !177, size: 512)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !178, line: 64, size: 512, elements: !179)
!178 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!179 = !{!180, !181, !187, !189, !247, !1509, !1662, !1667, !1668, !1669, !1670, !1671}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !178, line: 65, baseType: !168, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !177, file: !178, line: 66, baseType: !182, size: 128, offset: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !113, line: 178, size: 128, elements: !183)
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !113, line: 179, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !113, line: 179, baseType: !185, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !177, file: !178, line: 67, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !177, file: !178, line: 68, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !178, line: 192, size: 704, elements: !192)
!192 = !{!193, !194, !210, !211}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !191, file: !178, line: 193, baseType: !182, size: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !191, file: !178, line: 194, baseType: !195, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !196, line: 83, baseType: !197)
!196 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !196, line: 71, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !196, line: 72, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !196, line: 72, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !200, file: !196, line: 73, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !196, line: 20, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !203, file: !196, line: 21, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !207, line: 25, baseType: !208)
!207 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 25, elements: !209)
!209 = !{}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !191, file: !178, line: 195, baseType: !177, size: 512, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !191, file: !178, line: 196, baseType: !212, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !178, line: 156, size: 192, elements: !215)
!215 = !{!216, !221, !226}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !214, file: !178, line: 157, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!163, !190, !188}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !178, line: 158, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!168, !190, !188}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !214, file: !178, line: 159, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!163, !190, !188, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !178, line: 148, size: 20736, elements: !233)
!233 = !{!234, !239, !241, !242, !246}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !232, file: !178, line: 149, baseType: !235, size: 192)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 192, elements: !237)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !232, file: !178, line: 150, baseType: !240, size: 4096, offset: 192)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 4096, elements: !132)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !232, file: !178, line: 151, baseType: !163, size: 32, offset: 4288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !232, file: !178, line: 152, baseType: !243, size: 16384, offset: 4320)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 16384, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 2048)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !232, file: !178, line: 153, baseType: !163, size: 32, offset: 20704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !177, file: !178, line: 69, baseType: !248, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !178, line: 138, size: 448, elements: !250)
!250 = !{!251, !255, !283, !285, !1456, !1487, !1491}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !249, file: !178, line: 139, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !188}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !249, file: !178, line: 140, baseType: !256, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !259, line: 230, size: 128, elements: !260)
!259 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!260 = !{!261, !276}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !258, file: !259, line: 231, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !188, !269, !236}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !113, line: 60, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !267, line: 73, baseType: !268)
!267 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !267, line: 15, baseType: !116)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !259, line: 30, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !259, line: 31, baseType: !168, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !270, file: !259, line: 32, baseType: !274, size: 16, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !113, line: 19, baseType: !275)
!275 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !258, file: !259, line: 232, baseType: !277, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!265, !188, !269, !168, !280}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 55, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !267, line: 72, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !267, line: 16, baseType: !114)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !249, file: !178, line: 141, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !249, file: !178, line: 142, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !259, line: 84, size: 320, elements: !290)
!290 = !{!291, !292, !296, !1453, !1454}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !259, line: 85, baseType: !168, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !289, file: !259, line: 86, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!274, !188, !269, !163}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !289, file: !259, line: 88, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!274, !188, !300, !163}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !259, line: 168, size: 448, elements: !302)
!302 = !{!303, !304, !305, !306, !316, !317}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !301, file: !259, line: 169, baseType: !270, size: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !301, file: !259, line: 170, baseType: !280, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !301, file: !259, line: 171, baseType: !115, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !301, file: !259, line: 172, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!265, !310, !188, !300, !236, !313, !280}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !312, line: 526, flags: DIFlagFwdDecl)
!312 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !113, line: 46, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !267, line: 88, baseType: !315)
!315 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !301, file: !259, line: 174, baseType: !307, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !301, file: !259, line: 176, baseType: !318, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!163, !310, !188, !300, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !323, line: 305, size: 1472, elements: !324)
!323 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!324 = !{!325, !326, !327, !328, !329, !337, !338, !1427, !1433, !1434, !1439, !1440, !1443, !1447, !1448, !1449, !1450, !1451}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !322, file: !323, line: 308, baseType: !114, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !322, file: !323, line: 309, baseType: !114, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !322, file: !323, line: 313, baseType: !321, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !322, file: !323, line: 313, baseType: !321, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !322, file: !323, line: 315, baseType: !330, size: 192, align: 64, offset: 256)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !331, line: 24, size: 192, align: 64, elements: !332)
!331 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!332 = !{!333, !334, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !330, file: !331, line: 25, baseType: !114, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !330, file: !331, line: 26, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !330, file: !331, line: 27, baseType: !335, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !322, file: !323, line: 323, baseType: !114, size: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !322, file: !323, line: 327, baseType: !339, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !323, line: 388, size: 7296, elements: !341)
!341 = !{!342, !1423}
!342 = !DIDerivedType(tag: DW_TAG_member, scope: !340, file: !323, line: 389, baseType: !343, size: 7296)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !323, line: 389, size: 7296, elements: !344)
!344 = !{!345, !346, !350, !356, !360, !361, !362, !363, !364, !372, !377, !378, !379, !380, !389, !390, !391, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !426, !434, !437, !485, !486, !1394, !1395, !1398, !1401, !1402, !1405, !1406, !1407, !1410, !1422}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !343, file: !323, line: 390, baseType: !321, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !343, file: !323, line: 391, baseType: !347, size: 64, offset: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !331, line: 31, size: 64, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !347, file: !331, line: 32, baseType: !335, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !343, file: !323, line: 392, baseType: !351, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !352, line: 23, baseType: !353)
!352 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !354, line: 31, baseType: !355)
!354 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!355 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !343, file: !323, line: 394, baseType: !357, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!114, !310, !114, !114, !114, !114}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !343, file: !323, line: 398, baseType: !114, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !343, file: !323, line: 399, baseType: !114, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !343, file: !323, line: 405, baseType: !114, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !343, file: !323, line: 406, baseType: !114, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !343, file: !323, line: 407, baseType: !365, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !312, line: 286, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 286, size: 64, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !367, file: !312, line: 286, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !371, line: 18, baseType: !114)
!371 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !343, file: !323, line: 416, baseType: !373, size: 32, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !113, line: 168, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 166, size: 32, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !374, file: !113, line: 167, baseType: !163, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !343, file: !323, line: 428, baseType: !373, size: 32, offset: 608)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !343, file: !323, line: 437, baseType: !373, size: 32, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !343, file: !323, line: 447, baseType: !373, size: 32, offset: 672)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !343, file: !323, line: 450, baseType: !381, size: 64, offset: 704)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !382, line: 13, baseType: !383)
!382 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !113, line: 175, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 173, size: 64, elements: !385)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !384, file: !113, line: 174, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !352, line: 22, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !354, line: 30, baseType: !315)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !343, file: !323, line: 452, baseType: !163, size: 32, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !343, file: !323, line: 454, baseType: !195, offset: 800)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !343, file: !323, line: 457, baseType: !392, size: 256, offset: 832)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !393, line: 35, size: 256, elements: !394)
!393 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!394 = !{!395, !396, !397, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !392, file: !393, line: 36, baseType: !381, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !392, file: !393, line: 42, baseType: !381, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !392, file: !393, line: 46, baseType: !398, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !196, line: 29, baseType: !203)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !392, file: !393, line: 47, baseType: !182, size: 128, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !343, file: !323, line: 459, baseType: !182, size: 128, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !343, file: !323, line: 466, baseType: !114, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !343, file: !323, line: 467, baseType: !114, size: 64, offset: 1280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !343, file: !323, line: 469, baseType: !114, size: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !343, file: !323, line: 470, baseType: !114, size: 64, offset: 1408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !343, file: !323, line: 471, baseType: !383, size: 64, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !343, file: !323, line: 472, baseType: !114, size: 64, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !343, file: !323, line: 473, baseType: !114, size: 64, offset: 1600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !343, file: !323, line: 474, baseType: !114, size: 64, offset: 1664)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !343, file: !323, line: 475, baseType: !114, size: 64, offset: 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !343, file: !323, line: 477, baseType: !195, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !343, file: !323, line: 478, baseType: !114, size: 64, offset: 1792)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !343, file: !323, line: 478, baseType: !114, size: 64, offset: 1856)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !343, file: !323, line: 478, baseType: !114, size: 64, offset: 1920)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !343, file: !323, line: 478, baseType: !114, size: 64, offset: 1984)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !343, file: !323, line: 479, baseType: !114, size: 64, offset: 2048)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !343, file: !323, line: 479, baseType: !114, size: 64, offset: 2112)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !343, file: !323, line: 479, baseType: !114, size: 64, offset: 2176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !343, file: !323, line: 480, baseType: !114, size: 64, offset: 2240)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !343, file: !323, line: 480, baseType: !114, size: 64, offset: 2304)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !343, file: !323, line: 480, baseType: !114, size: 64, offset: 2368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !343, file: !323, line: 480, baseType: !114, size: 64, offset: 2432)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !343, file: !323, line: 482, baseType: !423, size: 2816, offset: 2496)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2816, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 44)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !343, file: !323, line: 488, baseType: !427, size: 256, offset: 5312)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !428, line: 60, size: 256, elements: !429)
!428 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !427, file: !428, line: 61, baseType: !431, size: 256)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 256, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 4)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !343, file: !323, line: 490, baseType: !435, size: 64, offset: 5568)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !323, line: 490, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !343, file: !323, line: 493, baseType: !438, size: 896, offset: 5632)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !439, line: 53, baseType: !440)
!439 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 13, size: 896, elements: !441)
!441 = !{!442, !443, !444, !445, !448, !449, !456, !457, !477, !478, !481}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !440, file: !439, line: 18, baseType: !351, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !440, file: !439, line: 28, baseType: !383, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !440, file: !439, line: 31, baseType: !392, size: 256, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !440, file: !439, line: 32, baseType: !446, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !439, line: 32, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !440, file: !439, line: 37, baseType: !275, size: 16, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !440, file: !439, line: 40, baseType: !450, size: 192, offset: 512)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !451, line: 53, size: 192, elements: !452)
!451 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !450, file: !451, line: 54, baseType: !381, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !450, file: !451, line: 55, baseType: !195, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !450, file: !451, line: 59, baseType: !182, size: 128, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !440, file: !439, line: 41, baseType: !115, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !440, file: !439, line: 42, baseType: !458, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !461, line: 13, size: 896, elements: !462)
!461 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !461, line: 14, baseType: !115, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !461, line: 15, baseType: !114, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !460, file: !461, line: 17, baseType: !114, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !460, file: !461, line: 17, baseType: !114, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !460, file: !461, line: 19, baseType: !116, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !460, file: !461, line: 21, baseType: !116, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !460, file: !461, line: 22, baseType: !116, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !460, file: !461, line: 23, baseType: !116, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !460, file: !461, line: 24, baseType: !116, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !460, file: !461, line: 25, baseType: !116, size: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !460, file: !461, line: 26, baseType: !116, size: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !460, file: !461, line: 27, baseType: !116, size: 64, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !460, file: !461, line: 28, baseType: !116, size: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !460, file: !461, line: 29, baseType: !116, size: 64, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !440, file: !439, line: 44, baseType: !373, size: 32, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !440, file: !439, line: 50, baseType: !479, size: 16, offset: 864)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !352, line: 19, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !354, line: 24, baseType: !275)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !440, file: !439, line: 51, baseType: !482, size: 16, offset: 880)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !352, line: 18, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !354, line: 23, baseType: !484)
!484 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !343, file: !323, line: 495, baseType: !114, size: 64, offset: 6528)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !343, file: !323, line: 497, baseType: !487, size: 64, offset: 6592)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !323, line: 381, size: 384, elements: !489)
!489 = !{!490, !491, !1393}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !488, file: !323, line: 382, baseType: !373, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !488, file: !323, line: 383, baseType: !492, size: 128, offset: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !323, line: 376, size: 128, elements: !493)
!493 = !{!494, !1391}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !492, file: !323, line: 377, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !497, line: 640, size: 48640, elements: !498)
!497 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!498 = !{!499, !507, !509, !510, !516, !517, !518, !519, !520, !521, !522, !523, !527, !545, !556, !651, !652, !653, !664, !665, !667, !668, !669, !670, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !749, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !805, !807, !808, !809, !821, !823, !824, !825, !826, !827, !833, !834, !835, !836, !837, !838, !839, !851, !856, !860, !861, !862, !865, !869, !872, !875, !878, !881, !884, !887, !890, !896, !897, !898, !904, !905, !906, !907, !908, !917, !918, !919, !920, !921, !926, !927, !928, !931, !932, !935, !938, !941, !944, !947, !950, !951, !1031, !1034, !1037, !1038, !1041, !1042, !1043, !1049, !1050, !1051, !1064, !1065, !1066, !1076, !1081, !1084, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !496, file: !497, line: 646, baseType: !500, size: 128)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !501, line: 56, size: 128, elements: !502)
!501 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !501, line: 57, baseType: !114, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !500, file: !501, line: 58, baseType: !505, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !352, line: 21, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !354, line: 27, baseType: !7)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !496, file: !497, line: 649, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !496, file: !497, line: 657, baseType: !115, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !496, file: !497, line: 658, baseType: !511, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !512, line: 113, baseType: !513)
!512 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !512, line: 111, size: 32, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !513, file: !512, line: 112, baseType: !373, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !497, line: 660, baseType: !7, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !496, file: !497, line: 661, baseType: !7, size: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !496, file: !497, line: 684, baseType: !163, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !496, file: !497, line: 686, baseType: !163, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !496, file: !497, line: 687, baseType: !163, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !496, file: !497, line: 688, baseType: !163, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !496, file: !497, line: 689, baseType: !7, size: 32, offset: 480)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !496, file: !497, line: 691, baseType: !524, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !497, line: 691, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !496, file: !497, line: 692, baseType: !528, size: 832, offset: 576)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !497, line: 451, size: 832, elements: !529)
!529 = !{!530, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !528, file: !497, line: 453, baseType: !531, size: 128)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !497, line: 325, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !531, file: !497, line: 326, baseType: !114, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !531, file: !497, line: 327, baseType: !505, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !528, file: !497, line: 454, baseType: !330, size: 192, align: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !528, file: !497, line: 455, baseType: !182, size: 128, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !528, file: !497, line: 456, baseType: !7, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !528, file: !497, line: 458, baseType: !351, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !528, file: !497, line: 459, baseType: !351, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !528, file: !497, line: 460, baseType: !351, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !528, file: !497, line: 461, baseType: !351, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !528, file: !497, line: 463, baseType: !351, size: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !528, file: !497, line: 465, baseType: !544, offset: 832)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !497, line: 415, elements: !209)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !496, file: !497, line: 693, baseType: !546, size: 384, offset: 1408)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !497, line: 489, size: 384, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !546, file: !497, line: 490, baseType: !182, size: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !546, file: !497, line: 491, baseType: !114, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !546, file: !497, line: 492, baseType: !114, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !546, file: !497, line: 493, baseType: !7, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !546, file: !497, line: 494, baseType: !275, size: 16, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !546, file: !497, line: 495, baseType: !275, size: 16, offset: 304)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !546, file: !497, line: 497, baseType: !555, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !496, file: !497, line: 697, baseType: !557, size: 1792, offset: 1792)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !497, line: 507, size: 1792, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !648, !649}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !557, file: !497, line: 508, baseType: !330, size: 192, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !557, file: !497, line: 515, baseType: !351, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !557, file: !497, line: 516, baseType: !351, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !557, file: !497, line: 517, baseType: !351, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !557, file: !497, line: 518, baseType: !351, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !557, file: !497, line: 519, baseType: !351, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !557, file: !497, line: 526, baseType: !387, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !557, file: !497, line: 527, baseType: !351, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !557, file: !497, line: 528, baseType: !7, size: 32, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !557, file: !497, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !557, file: !497, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !557, file: !497, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !557, file: !497, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !557, file: !497, line: 563, baseType: !573, size: 512, offset: 704)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !574)
!574 = !{!575, !583, !584, !589, !641, !645, !646, !647}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !573, file: !6, line: 119, baseType: !576, size: 256)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !577, line: 9, size: 256, elements: !578)
!577 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !576, file: !577, line: 10, baseType: !330, size: 192, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !576, file: !577, line: 11, baseType: !581, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !582, line: 29, baseType: !387)
!582 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !573, file: !6, line: 120, baseType: !581, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !573, file: !6, line: 121, baseType: !585, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!5, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !573, file: !6, line: 122, baseType: !590, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !592)
!592 = !{!593, !613, !614, !617, !627, !628, !636, !640}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !591, file: !6, line: 160, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !595, file: !6, line: 215, baseType: !398)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !595, file: !6, line: 216, baseType: !7, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !595, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !595, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !595, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !595, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !595, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !595, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !595, file: !6, line: 233, baseType: !581, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !595, file: !6, line: 234, baseType: !588, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !595, file: !6, line: 235, baseType: !581, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !595, file: !6, line: 236, baseType: !588, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !595, file: !6, line: 237, baseType: !610, size: 4096, offset: 512)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 4096, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 8)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !591, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !591, file: !6, line: 162, baseType: !615, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !113, line: 27, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !267, line: 96, baseType: !163)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !591, file: !6, line: 163, baseType: !618, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !619, line: 276, baseType: !620)
!619 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !619, line: 276, size: 32, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !620, file: !619, line: 276, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !619, line: 70, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !619, line: 65, size: 32, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !624, file: !619, line: 66, baseType: !7, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !591, file: !6, line: 164, baseType: !588, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !591, file: !6, line: 165, baseType: !629, size: 128, offset: 256)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !577, line: 14, size: 128, elements: !630)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !629, file: !577, line: 15, baseType: !632, size: 128)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !331, line: 125, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !632, file: !331, line: 126, baseType: !347, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !632, file: !331, line: 127, baseType: !335, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !591, file: !6, line: 166, baseType: !637, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!581}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !591, file: !6, line: 167, baseType: !581, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !573, file: !6, line: 123, baseType: !642, size: 8, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !352, line: 17, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !354, line: 21, baseType: !644)
!644 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !573, file: !6, line: 124, baseType: !642, size: 8, offset: 456)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !573, file: !6, line: 125, baseType: !642, size: 8, offset: 464)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !573, file: !6, line: 126, baseType: !642, size: 8, offset: 472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !557, file: !497, line: 572, baseType: !573, size: 512, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !557, file: !497, line: 580, baseType: !650, size: 64, offset: 1728)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !496, file: !497, line: 721, baseType: !7, size: 32, offset: 3584)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !496, file: !497, line: 722, baseType: !163, size: 32, offset: 3616)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !496, file: !497, line: 723, baseType: !654, size: 64, offset: 3648)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !657, line: 17, baseType: !658)
!657 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !657, line: 17, size: 64, elements: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !658, file: !657, line: 17, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 1)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !496, file: !497, line: 724, baseType: !656, size: 64, offset: 3712)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !496, file: !497, line: 749, baseType: !666, offset: 3776)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !497, line: 290, elements: !209)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !496, file: !497, line: 751, baseType: !182, size: 128, offset: 3776)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !496, file: !497, line: 757, baseType: !339, size: 64, offset: 3904)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !496, file: !497, line: 758, baseType: !339, size: 64, offset: 3968)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !496, file: !497, line: 761, baseType: !671, size: 320, offset: 4032)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !428, line: 34, size: 320, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !671, file: !428, line: 35, baseType: !351, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !671, file: !428, line: 36, baseType: !675, size: 256, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 256, elements: !432)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !496, file: !497, line: 766, baseType: !163, size: 32, offset: 4352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !496, file: !497, line: 767, baseType: !163, size: 32, offset: 4384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !496, file: !497, line: 768, baseType: !163, size: 32, offset: 4416)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !496, file: !497, line: 770, baseType: !163, size: 32, offset: 4448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !496, file: !497, line: 772, baseType: !114, size: 64, offset: 4480)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !496, file: !497, line: 775, baseType: !7, size: 32, offset: 4544)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !496, file: !497, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !496, file: !497, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !496, file: !497, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !496, file: !497, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !496, file: !497, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !496, file: !497, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !496, file: !497, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !496, file: !497, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !496, file: !497, line: 831, baseType: !114, size: 64, offset: 4672)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !496, file: !497, line: 833, baseType: !692, size: 384, offset: 4736)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !693)
!693 = !{!694, !699}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !692, file: !12, line: 26, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!116, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !12, line: 27, baseType: !700, size: 320, offset: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !12, line: 27, size: 320, elements: !701)
!701 = !{!702, !712, !739}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !700, file: !12, line: 36, baseType: !703, size: 320)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !12, line: 29, size: 320, elements: !704)
!704 = !{!705, !707, !708, !709, !710, !711}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !703, file: !12, line: 30, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !703, file: !12, line: 31, baseType: !505, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !12, line: 32, baseType: !505, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !703, file: !12, line: 33, baseType: !505, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !703, file: !12, line: 34, baseType: !351, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !703, file: !12, line: 35, baseType: !706, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !700, file: !12, line: 46, baseType: !713, size: 192)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !12, line: 38, size: 192, elements: !714)
!714 = !{!715, !716, !717, !738}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !713, file: !12, line: 39, baseType: !615, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, scope: !713, file: !12, line: 41, baseType: !718, size: 64, offset: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !713, file: !12, line: 41, size: 64, elements: !719)
!719 = !{!720, !728}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !718, file: !12, line: 42, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !723, line: 7, size: 128, elements: !724)
!723 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!724 = !{!725, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !722, file: !723, line: 8, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !267, line: 93, baseType: !315)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !722, file: !723, line: 9, baseType: !315, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !718, file: !12, line: 43, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !731, line: 7, size: 64, elements: !732)
!731 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!732 = !{!733, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !730, file: !731, line: 8, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !731, line: 5, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !352, line: 20, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !354, line: 26, baseType: !163)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !730, file: !731, line: 9, baseType: !735, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !713, file: !12, line: 45, baseType: !351, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !700, file: !12, line: 54, baseType: !740, size: 256)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !12, line: 48, size: 256, elements: !741)
!741 = !{!742, !745, !746, !747, !748}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !740, file: !12, line: 49, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !740, file: !12, line: 50, baseType: !163, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !740, file: !12, line: 51, baseType: !163, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !740, file: !12, line: 52, baseType: !114, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !740, file: !12, line: 53, baseType: !114, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !496, file: !497, line: 835, baseType: !750, size: 32, offset: 5120)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !113, line: 22, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !267, line: 28, baseType: !163)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !496, file: !497, line: 836, baseType: !750, size: 32, offset: 5152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !496, file: !497, line: 840, baseType: !114, size: 64, offset: 5184)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !496, file: !497, line: 849, baseType: !495, size: 64, offset: 5248)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !496, file: !497, line: 852, baseType: !495, size: 64, offset: 5312)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !496, file: !497, line: 857, baseType: !182, size: 128, offset: 5376)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !496, file: !497, line: 858, baseType: !182, size: 128, offset: 5504)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !496, file: !497, line: 859, baseType: !495, size: 64, offset: 5632)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !496, file: !497, line: 867, baseType: !182, size: 128, offset: 5696)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !496, file: !497, line: 868, baseType: !182, size: 128, offset: 5824)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !496, file: !497, line: 871, baseType: !762, size: 64, offset: 5952)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !764, line: 59, size: 768, elements: !765)
!764 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!765 = !{!766, !767, !768, !769, !780, !781, !788, !797}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !763, file: !764, line: 61, baseType: !511, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !763, file: !764, line: 62, baseType: !7, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !763, file: !764, line: 63, baseType: !195, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !763, file: !764, line: 65, baseType: !770, size: 256, offset: 64)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 256, elements: !432)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !113, line: 182, size: 64, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !771, file: !113, line: 183, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !113, line: 186, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !113, line: 187, baseType: !774, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !775, file: !113, line: 187, baseType: !779, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !763, file: !764, line: 66, baseType: !771, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !763, file: !764, line: 68, baseType: !782, size: 128, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !783, line: 40, baseType: !784)
!783 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !783, line: 36, size: 128, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !784, file: !783, line: 37, baseType: !195)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !784, file: !783, line: 38, baseType: !182, size: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !763, file: !764, line: 69, baseType: !789, size: 128, align: 64, offset: 512)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !113, line: 216, size: 128, align: 64, elements: !790)
!790 = !{!791, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !113, line: 217, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !789, file: !113, line: 218, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !792}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !763, file: !764, line: 70, baseType: !798, size: 128, offset: 640)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 128, elements: !662)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !764, line: 54, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !799, file: !764, line: 55, baseType: !163, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !799, file: !764, line: 56, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !764, line: 56, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !496, file: !497, line: 872, baseType: !806, size: 512, offset: 6016)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 512, elements: !432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !496, file: !497, line: 873, baseType: !182, size: 128, offset: 6528)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !496, file: !497, line: 874, baseType: !182, size: 128, offset: 6656)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !496, file: !497, line: 876, baseType: !810, size: 64, offset: 6784)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !812, line: 26, size: 192, elements: !813)
!812 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !811, file: !812, line: 27, baseType: !7, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !811, file: !812, line: 28, baseType: !816, size: 128, offset: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !817, line: 43, size: 128, elements: !818)
!817 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !816, file: !817, line: 44, baseType: !398)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !816, file: !817, line: 45, baseType: !182, size: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !496, file: !497, line: 879, baseType: !822, size: 64, offset: 6848)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !496, file: !497, line: 882, baseType: !822, size: 64, offset: 6912)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !496, file: !497, line: 884, baseType: !351, size: 64, offset: 6976)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !496, file: !497, line: 885, baseType: !351, size: 64, offset: 7040)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !496, file: !497, line: 890, baseType: !351, size: 64, offset: 7104)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !496, file: !497, line: 891, baseType: !828, size: 128, offset: 7168)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !497, line: 242, size: 128, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !828, file: !497, line: 244, baseType: !351, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !828, file: !497, line: 245, baseType: !351, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !828, file: !497, line: 246, baseType: !398, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !496, file: !497, line: 900, baseType: !114, size: 64, offset: 7296)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !496, file: !497, line: 901, baseType: !114, size: 64, offset: 7360)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !496, file: !497, line: 904, baseType: !351, size: 64, offset: 7424)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !496, file: !497, line: 907, baseType: !351, size: 64, offset: 7488)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !496, file: !497, line: 910, baseType: !114, size: 64, offset: 7552)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !496, file: !497, line: 911, baseType: !114, size: 64, offset: 7616)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !496, file: !497, line: 914, baseType: !840, size: 640, offset: 7680)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !841, line: 123, size: 640, elements: !842)
!841 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!842 = !{!843, !849, !850}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !840, file: !841, line: 124, baseType: !844, size: 576)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 576, elements: !237)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !841, line: 108, size: 192, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !845, file: !841, line: 109, baseType: !351, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !845, file: !841, line: 110, baseType: !629, size: 128, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !840, file: !841, line: 125, baseType: !7, size: 32, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !840, file: !841, line: 126, baseType: !7, size: 32, offset: 608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !496, file: !497, line: 917, baseType: !852, size: 192, offset: 8320)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !841, line: 134, size: 192, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !852, file: !841, line: 135, baseType: !789, size: 128, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !852, file: !841, line: 136, baseType: !7, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !496, file: !497, line: 923, baseType: !857, size: 64, offset: 8512)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !497, line: 923, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !496, file: !497, line: 926, baseType: !857, size: 64, offset: 8576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !496, file: !497, line: 929, baseType: !857, size: 64, offset: 8640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !496, file: !497, line: 933, baseType: !863, size: 64, offset: 8704)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !497, line: 933, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !496, file: !497, line: 943, baseType: !866, size: 128, offset: 8768)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 16)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !496, file: !497, line: 945, baseType: !870, size: 64, offset: 8896)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !497, line: 49, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !496, file: !497, line: 956, baseType: !873, size: 64, offset: 8960)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !497, line: 45, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !496, file: !497, line: 959, baseType: !876, size: 64, offset: 9024)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !497, line: 959, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !496, file: !497, line: 962, baseType: !879, size: 64, offset: 9088)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !497, line: 66, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !496, file: !497, line: 966, baseType: !882, size: 64, offset: 9152)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !497, line: 50, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !496, file: !497, line: 969, baseType: !885, size: 64, offset: 9216)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !841, line: 223, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !496, file: !497, line: 970, baseType: !888, size: 64, offset: 9280)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !497, line: 62, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !496, file: !497, line: 971, baseType: !891, size: 64, offset: 9344)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !892, line: 25, baseType: !893)
!892 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !892, line: 23, size: 64, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !893, file: !892, line: 24, baseType: !661, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !496, file: !497, line: 972, baseType: !891, size: 64, offset: 9408)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !496, file: !497, line: 974, baseType: !891, size: 64, offset: 9472)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !496, file: !497, line: 975, baseType: !899, size: 192, offset: 9536)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !900, line: 30, size: 192, elements: !901)
!900 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !899, file: !900, line: 31, baseType: !182, size: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !899, file: !900, line: 32, baseType: !891, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !496, file: !497, line: 976, baseType: !114, size: 64, offset: 9728)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !496, file: !497, line: 977, baseType: !280, size: 64, offset: 9792)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !496, file: !497, line: 978, baseType: !7, size: 32, offset: 9856)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !496, file: !497, line: 980, baseType: !792, size: 64, offset: 9920)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !496, file: !497, line: 989, baseType: !909, size: 128, offset: 9984)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !910, line: 35, size: 128, elements: !911)
!910 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !909, file: !910, line: 36, baseType: !163, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !909, file: !910, line: 37, baseType: !373, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !909, file: !910, line: 38, baseType: !915, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !910, line: 23, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !496, file: !497, line: 992, baseType: !351, size: 64, offset: 10112)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !496, file: !497, line: 993, baseType: !351, size: 64, offset: 10176)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !496, file: !497, line: 996, baseType: !195, offset: 10240)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !496, file: !497, line: 999, baseType: !398, offset: 10240)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !496, file: !497, line: 1001, baseType: !922, size: 64, offset: 10240)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !497, line: 636, size: 64, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !497, line: 637, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !496, file: !497, line: 1005, baseType: !632, size: 128, offset: 10304)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !496, file: !497, line: 1007, baseType: !495, size: 64, offset: 10432)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !496, file: !497, line: 1009, baseType: !929, size: 64, offset: 10496)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !497, line: 1009, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !496, file: !497, line: 1043, baseType: !115, size: 64, offset: 10560)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !496, file: !497, line: 1046, baseType: !933, size: 64, offset: 10624)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !497, line: 41, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !496, file: !497, line: 1050, baseType: !936, size: 64, offset: 10688)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !497, line: 42, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !496, file: !497, line: 1054, baseType: !939, size: 64, offset: 10752)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !497, line: 55, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !496, file: !497, line: 1056, baseType: !942, size: 64, offset: 10816)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !497, line: 40, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !496, file: !497, line: 1058, baseType: !945, size: 64, offset: 10880)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !497, line: 47, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !496, file: !497, line: 1061, baseType: !948, size: 64, offset: 10944)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !497, line: 43, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !496, file: !497, line: 1064, baseType: !114, size: 64, offset: 11008)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !496, file: !497, line: 1065, baseType: !952, size: 64, offset: 11072)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !900, line: 14, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !900, line: 12, size: 384, elements: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, scope: !954, file: !900, line: 13, baseType: !957, size: 384)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !954, file: !900, line: 13, size: 384, elements: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !957, file: !900, line: 13, baseType: !163, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !957, file: !900, line: 13, baseType: !163, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !957, file: !900, line: 13, baseType: !163, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !957, file: !900, line: 13, baseType: !963, size: 256, offset: 128)
!963 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !964, line: 32, size: 256, elements: !965)
!964 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!965 = !{!966, !972, !985, !991, !1000, !1020, !1025}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !963, file: !964, line: 37, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 34, size: 64, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !967, file: !964, line: 35, baseType: !751, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !967, file: !964, line: 36, baseType: !971, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !267, line: 49, baseType: !7)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !963, file: !964, line: 45, baseType: !973, size: 192)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 40, size: 192, elements: !974)
!974 = !{!975, !977, !978, !984}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !973, file: !964, line: 41, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !267, line: 95, baseType: !163)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !973, file: !964, line: 42, baseType: !163, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !973, file: !964, line: 43, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !964, line: 11, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !964, line: 8, size: 64, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !980, file: !964, line: 9, baseType: !163, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !980, file: !964, line: 10, baseType: !115, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !973, file: !964, line: 44, baseType: !163, size: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !963, file: !964, line: 52, baseType: !986, size: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 48, size: 128, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !986, file: !964, line: 49, baseType: !751, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !986, file: !964, line: 50, baseType: !971, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !986, file: !964, line: 51, baseType: !979, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !963, file: !964, line: 61, baseType: !992, size: 256)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 55, size: 256, elements: !993)
!993 = !{!994, !995, !996, !997, !999}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !992, file: !964, line: 56, baseType: !751, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !992, file: !964, line: 57, baseType: !971, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !992, file: !964, line: 58, baseType: !163, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !992, file: !964, line: 59, baseType: !998, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !267, line: 94, baseType: !268)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !992, file: !964, line: 60, baseType: !998, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !963, file: !964, line: 95, baseType: !1001, size: 256)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 64, size: 256, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !1001, file: !964, line: 65, baseType: !115, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, scope: !1001, file: !964, line: 77, baseType: !1005, size: 192, offset: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1001, file: !964, line: 77, size: 192, elements: !1006)
!1006 = !{!1007, !1008, !1015}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !1005, file: !964, line: 82, baseType: !484, size: 16)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !1005, file: !964, line: 88, baseType: !1009, size: 192)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1005, file: !964, line: 84, size: 192, elements: !1010)
!1010 = !{!1011, !1013, !1014}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !1009, file: !964, line: 85, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, elements: !611)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !1009, file: !964, line: 86, baseType: !115, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !1009, file: !964, line: 87, baseType: !115, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !1005, file: !964, line: 93, baseType: !1016, size: 96)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1005, file: !964, line: 90, size: 96, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !1016, file: !964, line: 91, baseType: !1012, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !1016, file: !964, line: 92, baseType: !506, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !963, file: !964, line: 101, baseType: !1021, size: 128)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 98, size: 128, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !1021, file: !964, line: 99, baseType: !116, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !1021, file: !964, line: 100, baseType: !163, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !963, file: !964, line: 108, baseType: !1026, size: 128)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !964, line: 104, size: 128, elements: !1027)
!1027 = !{!1028, !1029, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1026, file: !964, line: 105, baseType: !115, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1026, file: !964, line: 106, baseType: !163, size: 32, offset: 64)
